[
    "<thinking>\nThe story is a reflective narrative about a woman who returns from the dead to deliver a final message. The plot revolves around her life, relationships, and the significance of being witnessed. The creativity lies in the unique perspective of a dead narrator and the philosophical exploration of life and death. The development of the main character is deep, with a focus on her internal struggles and realizations. The setting is established through vivid descriptions of her past life and the afterlife. The language use is poetic and introspective, with a consistent tone that aligns with the theme of existential reflection.\n</thinking>\n\n<user_writing_sheet>\n\n### **Plot**\n\n#### Story Beginning\nThe user begins the story with the protagonist's death and her reflections on dying alone. This sets a contemplative tone and introduces the theme of being witnessed.\n\n#### Story Ending\nThe user concludes the story with the protagonist's declaration of being witnessed and finding pride in it. This resolution ties back to the central theme and provides a sense of closure.\n\n#### Narrative Structure\nThe user structures the story with a clear beginning, middle, and end. The narrative flows smoothly from the protagonist's death to her reflections and final declaration.\n\n### **Creativity**\n\n#### Unique Elements\nThe user adds the imaginative element of a dead narrator returning to deliver a message. This perspective is unique and adds depth to the story.\n\n#### Engaging Themes and Imagery\nThe user creates engaging themes of life, death, and the need to be witnessed. The imagery of the afterlife and the protagonist's reflections draw the reader in.\n\n#### Use of Tropes or Clichés\nThe user subverts the trope of returning from the dead for revenge by focusing on a philosophical declaration. This adds originality to the story.\n\n### **Development (Character and Setting)**\n\n#### Main Character\nThe user develops the main character through her reflections on her life and relationships. Her role and arc are established through her internal struggles and realizations.\n\n#### Setting Establishment\nThe user establishes the setting with detailed descriptions of the protagonist's past life and the afterlife. These details make the setting immersive and relevant to the story.\n\n#### Supporting Characters and Interactions\nThe user incorporates additional characters through the protagonist's memories and reflections. These interactions advance the story by highlighting her internal conflicts and realizations.\n\n### **Language Use**\n\n#### Narrative Perspective\nThe user employs the first-person perspective, adding depth through the protagonist's monologue. This perspective enhances the introspective nature of the narrative.\n\n#### Stylistic Elements\nThe user utilizes poetic language, varied sentence structures, and rhetorical devices. These elements enhance the story's impact and tone.\n\n#### Tone and Mood Alignment\nThe tone and mood of the story align with the writing prompt's theme of existential reflection. The word choices and recurring phrases reinforce this alignment.\n\n</user_writing_sheet>"
]