[
    "<thinking>\nThe writing prompt suggests a chaotic family gathering where love and dysfunction collide, revealing deep truths about connection and belonging. This implies a narrative rich in emotional complexity, unexpected revelations, and a blend of humor and tension. The user profile indicates a preference for reflective beginnings, realistic and somewhat unresolved endings, and a clear narrative structure. The user also incorporates unique cultural elements, vivid imagery, and avoids clichés by presenting common themes in original ways. Characters are well-developed through reflections and interactions, and settings are immersive with detailed descriptions. The first-person perspective adds intimacy, and the language is descriptive and evocative, with a tone that aligns well with the narrative's themes.\n\nTo align the story with the user's style, the story should start with a reflective or descriptive scene that sets the tone of the chaotic family gathering. The narrative should flow smoothly, connecting events through the protagonist's journey and interactions. Unique cultural elements and vivid imagery should be incorporated to enhance originality. Characters should be well-developed, with clear roles and arcs, and the setting should be immersive. The first-person perspective should be used to add intimacy, and the language should be descriptive and evocative, maintaining a tone that aligns with the themes of love, dysfunction, and belonging.\n\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a reflective or descriptive scene that sets the tone of the chaotic family gathering. Consider starting with the protagonist's contemplation of a specific family tradition or a vivid description of the setting that hints at the impending chaos.\n\n#### Story Ending\n- Conclude with a sense of realism and ongoing struggle, leaving some elements open. Ensure the ending reflects the deeper truths about connection and belonging revealed during the gathering, while maintaining a sense of unresolved tension or hope.\n\n#### Narrative Structure\n- Create a clear and cohesive structure, connecting the beginning, middle, and end through the protagonist's journey and interactions. Ensure the narrative flows smoothly through memories and present moments, reflecting the chaos and emotional complexity of the family gathering.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique cultural elements and imaginative ideas that build upon the prompt. Consider incorporating specific family traditions, rituals, or cultural practices that add depth and originality to the narrative.\n\n#### Engaging Themes and Imagery\n- Use vivid imagery and engaging themes to capture the mood of the chaotic family gathering. Draw on personal and cultural significance to create a rich and immersive narrative, using imagery that reflects the themes of love, dysfunction, and belonging.\n\n#### Use of Tropes or Clichés\n- Avoid clichés by presenting common themes in original ways. Subvert or enhance common tropes related to family gatherings, ensuring originality while incorporating humor or irony when appropriate.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist with clear motivations and a connection to the family gathering. Ensure their arc is well-established through reflections and interactions, revealing their personality and background.\n\n#### Setting Establishment\n- Build an immersive setting with detailed descriptions that bring the chaotic family gathering to life. Ensure the setting feels relevant and vivid, reflecting the emotional complexity and cultural significance of the event.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters that complement the protagonist and contribute meaningfully to the plot. Use interactions to add emotional depth, advance the story, and reveal character traits.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a first-person perspective to add intimacy and immediacy. Ensure the protagonist's thoughts and dialogue provide depth and insight into the family dynamics and emotional undercurrents of the gathering.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Use descriptive and evocative language to maintain interest and create impact, incorporating rhetorical devices such as humor, irony, or vivid descriptions.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the themes of love, dysfunction, and belonging. Use specific word choices and recurring phrases to reinforce the narrative's atmosphere, balancing humor, tension, and heartfelt moments.\n\n</story_rules>"
]