[
    {
        "post_title": "[WP] Your friend, a shapeshifter (a secret you've kept since childhood) hasn't answered your texts in days, so you head to their home. Upon arriving, you find that they're in the middle of an existential crisis; they can't remember how to turn back into their original, human form.",
        "comment": "I practically kick the door down, scared my friend’s finally been captured by the government. I barely have time to breath a sigh of relief before the panic comes back at the sight of my friend having a panic attack on the floor, in the form of a parrot. Which might be comical in another circumstance.\n\nImmediately I’m by his side, picking him up and wrapping my hands around him, attempting to be comforting.\n\n“It’s ok,” I tell the parrot, “you’re ok. Just breath. With me, come on. In for 4, hold for 7, out for 8,” I instruct quickly. “Breath in 2 3 4. Hold your breath 2 3 4 5 6 7. Breath out 2 3 4 5 6 7 8. 1 2 3 4. 1 2 3 4 5 6 7. 1 2 3 4 5 6 7 8.” My friend starts to copy my breathing, getting control enough to start speaking.\n\n“I can’t… I can’t.”\n\n“Sshh, it’s ok. Let’s calm down first. Can you tell me 5 things you can see.”\n\n“You,” the squeaky parrot voice managed through gasps. “Window, wall,” he continued, “floor, roof.”\n\n“That’s good, that’s good,” I said, keeping my voice steady and calm, “now 4 things you can hear.”\n\n“You, me, car, radiator,” my friend responded, the breaths sounding more controlled.\n\n“Now 3 things you can feel.”\n\n“You. Feathers.”\n\n“2 things you can smell.”\n\n“You. Bleach.” I nod to him, smiling\n\n“And one thing you can taste.” I see something almost like mischief in the parrots eyes as it licks me. I let go quickly and the parrot flies onto my knee, laughing.\n\n“You.”\n\nI chuckle along with it. “Feeling better?” My friend nodded, so I continue. “So what’s up? What happened.”\n\n“I can’t remember me. I can’t remember how to turn back.”\n\nI frown. “Why not?”\n\n“I can’t remember who I am. Where I end and the animals begin.”\n\nI lift my friend up close to me. “You need a picture?”\n\nMy friend shakes his head. “Didn’t work. I can’t connect with my human form. What if… I’m just not human enough anymore?”\n\n“You can’t connect with who you are?”\n\n“So much has changed. New house, new job, my… mother. What if I’m not the same?”\n\n“One minute.” I run up his stairs, running back down a couple minutes later with a photo album.\n\n“I said that didn’t help.”\n\n“Bear with me,” I tell him before opening at the first page, him in his mother’s arms for the first time a week after his birth. “You remember your birth story? Your mother had to walk 2 hours from her hike to the nearest hospital. You were dangerously premature so were immediately c-sectioned. Your mum didn’t even get to see you ‘till the next day and couldn’t hold you a week after that. They didn’t take picture of you until that point because they said they’d remember every second of that well enough that they wouldn’t need a photo.”\n\n“I know that story, it’s my own birth.”\n\nI ignored him and kept talking, flipping a couple pages to him right after learning to walk at his dad’s funeral. “And your father died before you knew him. Killed in a hit and run. You were too young to understand, they had to close the casket because you kept trying to climb in with him. You then complained, worried he would be unhappy when he woke up as they buried them.”\n\n“Thanks for the reminder.”\n\nI turned to when he was four, the first photo of the two of us. “When we first met you were pretending to be a snake in the sand pit and we started playing. My mother was horrified, so you turned back to comfort her. Did not work. Took her 2 years to finally become comfortable around you. And you got grounded for revealing your secret so easily.” I look to another photo on the same page of my friend in a tuxedo. “And your mum got married to Dave. Wonderful guy. Took you a while to accept him. You finally when he played with you unknowingly while you were a dog.”\n\n“I know all this. You’re just telling me my life.”\n\n“Our first day at school was crazy. We were sat on opposite sides of the class so you’d ’go to the toilet’ then sneak back in as a bug to spend time with me. The teachers had your parents take you to the doctors to get your bowels checked.”\n\n“Thanks for bringing up that embarrassing memory.”\n\n“Your 6th birthday remains the best birthday party ever. Dave tried to bake a cake. It ended up the ugliest thing in the world but best tasting cake. We went to a water park with everyone in our class. You turned into a fish to scare and gaslight the other kids. We tricked Adam into thinking you were a mermaid,” I chuckled at the memory and so did my friend.\n\n“You in high school was so cringy. You were trying to be edgy so hard and failed.” I turned to a photo of him with a black wig that was worn very badly and rather hideous black clothes with 2 badges on and that’s all. “While you did that I became the teachers’ favourite student and everyone was so surprised we were friends, but I got you out of so much trouble by vouching for you.”\n\n“We tried to start a board games club together. Only one other guy showed up and he turned out to be an incel. So it was just us, playing board games every Monday. I always looked forward to that day. Everyone thought I was weird for loving Monday, but it was because I got to play with you. Then we immediately joined the board games club in college. And that was a disaster. We were both the worst in the club, competed for not getting last place. Remember that time we teamed up against one guy in risk and we still lost?” My friend nods.\n\n“What’s the point of all this?”\n\n“The point is to remind you. You were not the same person throughout all that, you were mischievous as a child, wannabe edgy in high school and we were both finally discovering ourselves in college. And then Uni we were apart except for the holidays but you did change, became more confident and sure of yourself. But every time, despite changing, you were still able to shapeshift. It’s not about if you’d changed, because you’ve always been changing. You forgot who you are but let me remind you. You are kind and mischievous and silly. You often present a false appearance to the outside world in more than just your shapeshifting, especially with strangers, but in company you are the most genuine and confident person I know. You are who you are now, but if you don’t know who that is, you are also the result of everything you were. Remember who you were, everything you were and keep moving forward through the years and you’ll remember who you are.”\n\nMy friend takes a deep breath and starts to change. I quickly put him down and back away as my friend is standing in front of me agajn",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1guyk16/wp_your_friend_a_shapeshifter_a_secret_youve_kept/lxxwq9q/",
        "score": 540,
        "date_posted": "2024-11-19 10:44:42",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] The prophecy foretold that The Great Evil would awaken 1000 years after his original defeat. As it turns out, the people took this very seriously, so when he awakened, he was met with an army of blessed knights, an evil containment system, and two dozen automated holy turrets aimed at him.",
        "comment": "Now, you may think this is weird, right? I mean, humans taking a threat in the far future seriously enough to not only keep the story alive for the entire thousand years, but to also temporarily unite under a single banner to amass a military capable of stopping the Great Evil’s rise? That’s practically unheard of. But there was one major factor here. That prophecy wasn’t the only one. It was part of a book of a thousand prophecies. One prophecy every year until the Great Evil rose. So naturally, when the kingdoms realised the 100% accuracy of the prophecies, which took an embarrassingly long time, they started preparing for each prophecy as they came, hoping to use each on to their full advantage, or suffer as little as possible from each prophecy. And then over the thousand years it just became tradition, preparing for each prophecy. So preparing for this prophecy was just par for the course.\n\nI joined the military when most people did, as my kingdom started the draft in preparation. We were some of the first to start preparing, so the other kingdoms had to catch up. Then it became a race to get the magic, technology and resources to defeat the great evil. It didn’t much effect me, I just trained with my lance and shield all day, every day, for about 3 years. When the day came, we marched on the mountain. Almost 100,000 men, mages and engineers. Fortresses, trenched and siege equipment were prepped and we stood in lines, side by side with soldiers who, on any other day, would be our enemy.\n\nAnd now here I am, looking at the huge metal door that, over the thousand years, had been slowly rusting away. Despite our preparations, nervousness is still apparent in the entire line. With each bang of the thing trying to get out, the line shifts and nobles call out to keep us in formation. Large cracks start to form across the door as I hear the holy turrets charge up. The holy knights in reserve and on our flanks make clanking noises as they stretch and warm up.\n\nFinally, with one last crash, the doors come tumbling down and the Great Evil emerges.\n\nIt is difficult to describe the look on its face, as the beast is more of a huge shadowy cloud rather than possessing any recognisable features. But if I were to name it, I’d have to say it’s surprise.\nThe holy turrets open fire on the beast, drawing its attention as the armies of evil pour out of the door and through its legs.\n\nThe nobles and knights around us shout commands.\n\n“PRESENT ARMS! ADVANCE!” I repeat the commands, sending it down the line as I move to meet the horde.\n\nThe horde charges with no semblance of order, resulting in the first wave practically impaling themselves upon our lances and spears and the following waves being vulnerable from the sides. Blood splatters across my shield as I stab forward again and again, leaving a pile of bodies in front of us. We try to keep advancing, but the Great Evil has other plans. Between volleys from the holy turrets, catapults and ballistas, it swings at our lines, carving large holes in them. Holy knights move in to plug the gaps as the horde attempts to break through.\n\nThe more of the horde we kill, the more bodies pile up, making me stumble as we attempt to fight our way forwards.\nBefore I even know what’s happened, a huge black cloud crashes through our ranks, sending me stumbling to the floor. The Great Evil’s foot was right where I had once been, blocking the Holy knights from plugging the gap and leaving us scattered soldiers alone with the horde. I ditch my lance for the more manoeuvrable club and start fighting for my life. I battle my way through the horde, meeting up with a few spearmen and others like me, using shields and clubs. Together we form our own mini line, facing the horde as one. Despite being surrounded, we fight off the disorganised horde, backing up to rejoin the battle line on either side of the Great Evil’s foot.\n\nA series of loud explosions ring out and a dark cloud passes over us. Just in time we dive out the way, though not all of us made it. The Great Evil stumbles back as holy knights rush to fill the gap in the line and assist those like us, trapped in front. A huge knight, like almost 7 foot and biceps as big as my head, runs up to us. She picks us up and straightens us out shouting over the din of the battle. “WITH ME!” We move with her, back towards the lines of holy knights as other scattered soldiers rally to us, by the time we rejoin the line, almost a hundred of us had rallied and the holy knights expertly rearrange their formation to fit us in.\n\nThen a call comes down the line. “ADVANCE!” I repeat the call and start moving with my comrades, cutting down thousands of evil forces as we move forward, the Great Evil struggling under the pummelling of the holy turrets, catapults etc.\n\nFinally, the beast falls to the ground. The 5 mages destined to finally slay the Great Evil run forward and we move to cover them.\n\nOne particularly huge soldier charges towards our line. The archers attempt to fell the beast, but to know avail as it crashes straight into our line, impaling itself on our spears and lances but not falling. It throws me across the battlefield and I fall unconscious.\n\n\nI shoot up, looking around me for danger. I’m in a large white tent, beds lining each side full of other people. Many are wearing bandages, like one I realise I have around my head. I teach up and touch to side of my head, hissing in pain. A nurse walks in and smiles.\n“Ah, you’re awake. How’re you feeling?”\n\nI shrug. “Fine, I think. What happened?”\n\n“You got thrown by a troll. Most people that happens to are unconscious at least a week, you wear only a couple days.”\n\n“Lucky me,” I mutter. “What about the battle?”\n\n“Oh, we won that. As you might be able to tell from the fact we aren’t dead. The chosen 5 killed the evil and the united armies slaughtered the army of the damned. Now everything can go back to as it was before.”\n\nI slump back in my bed. ‘As it was before.’\n\n“Does that mean the kingdoms are still rivals?”\n\nThe nurse shrugs as she walks out.\nThe army starts moving out a few days later and, by the time we make it home a few days after that, I’ve been discharged by the medics. I immediately return home to my farm, thanking the stars that I am alive and embracing my wife and child.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gejm6t/wp_the_prophecy_foretold_that_the_great_evil/lucosnn/",
        "score": 10,
        "date_posted": "2024-10-29 10:16:56",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] Years ago, you donated your “genetic material” to a secret organization in exchange for $30 million. Now, years later, there’s a knock on your door, and you find yourself face-to-face with a group of superpowered teenagers claiming you’re their father.",
        "comment": "$30 million for my DNA? Of course I took that deal. I could put just $2 million in the bank and live off the interest, $30 million would set me up for life, and my children, and my children’s children and, if we invested smartly, they’re children too. You may think that was crazy and really shady, which was my thought too, but it was all legit. The doctor was genuine, the contract official and the government agent who greeted me too. They said I appeared to be the “ideal subject” for their experiments. So a blood donation, cheek swab and… ahem other donation later and I was $30 million richer, well actually they gave me quite a bit more. Went back to Britain and lived my life normally, well I did once I explained to the fraud investigators where I’d got the money from and paid my taxes for the massive income, putting me down to exactly $30 million or £23,653,350.\n\nI hired a financial advisor and invested the money smartly. I paid off the mortgage, my student debt and the huge list of other debts I had to pay, barely made a dent. Then I got the teaching job I’d always wanted. Money was no longer an issue, I simply took some of the interest of my investments and used it to supplement my income. Life was good, didn’t really tell anyone about my good fortune, but close friends and family always got good gifts on birthdays and Christmas. I found a wife, got a couple of children, biological and adopted. I’d say I almost forgot the incident, but it’s hard to forgot the thing that is funding your lifestyle.\n\nAbout 20 years passed before the consequences showed up at my front door, literally and figuratively. I was home sick with a bug I’m pretty sure my daughters brought home and waiting for the microwave to finish with my soup when a knock on the door sounded through the house. Despite having no reason to, I had a bad feeling about it, so bad I ended up picking up one of the kitchen knives as I made my way to the door, opening the door just a crack, bracing it against my foot and peaking through.\n\nA small gaggle of teenagers stood on the doorstep. They looked normal enough, wearing your standard teenage clothes. The youngest, maybe 12, wore a pink top with those sequins that made a different image depending if the sequins were pushed up and down. She was looking at it in awe and wonder as she cycled between the pony and castle. Then there was a maybe 14 year old who wore a tracksuit and joggers, looking like your typical chav. A 15 year old with a flowery dress and a jacket over the top and mismatched socks with her sandals and finally an 18 year old with smart trousers and a standard blue striped T-shirt with waistcoat stood at the front, smiling at me. Their clothes were a tad mismatched at times but they looked normal enough. I started to feel a little silly about bringing a knife before I noticed the tags and security tags still on their clothes. They were clearly thieves, so what were they doing here? My intrusive thoughts took over as I scanned for weapons, but found none as the 18 year old spoke.\n\n“H-hello,” he said nervously, “this is going to sound crazy, but in your son.”\n\nI raised my eyebrow at him. “No you aren’t. I haven’t had sex with anyone except my wife. And I definitely haven’t donated…” I froze, remembering when I donated my DNA. I looked at them closely and recognised a lot of my features in them, the blonde slightly curly hair, except for the 12 year old who’s hair was blue and pink, the blue eyes and the oh so recognisable bump on the bridge of their nose that my mother had given me.\n\nThe 18 year old nodded. “Yes, we’re your children.”\n\n“You get my ADHD?”\n\nThe kid shook his head. “No, we got autism.”\n\n“Correct,” I had needed to test them, in case they were lying, “come on in.” I opened the door wider and beckoned them in.\n\n\n\n\\n\\nThey followed me to the kitchen where I kept microwaving my soup and collapsed into the chair, even the small exertion of standing in the doorway wiping me out with my illness.\n\n“So, why would the American government want to make children with my DNA?”\n\nThe kids all moved awkwardly to take different spaces in the kitchen. The 14 year old hopped up on the worktop while the 15 year old started rooting through the cupboards.\n\n“Uh, not exactly.” The 18 year old said. “They wanted to make soldiers.”\n\n“Soldiers?” My blood ran cold at the thought. “And why would I be the ‘perfect candidate?”\n\n“No physical conditions of any kind, you were a ‘blank slate’.” I wasn’t sure how to feel about that, was it a compliment? But that wasn’t important at the moment.\n\nI scowled. “And you’re their ‘soldiers’. Children.”\n\nThe 18 year old nodded, holding out his hand a conjuring a small flame in it. I almost fell out of my chair in shock as the flame appeared. The 15 year old slapped the 18 year old, who looked sheepish.\n\n“Way to ease him into it,” she told him off.\n\nI pointed to the flame. “How the Heck did you do that?!”\n\nThe flame vanished as the 18 year old held his hands up placatingly. “The government wanted more than soldier, they wanted super soldiers. So the experimented with your DNA. I was their first success. My body naturally produces several flammable substances, liquid and gas, and I can release and ignite them. My skin is also naturally more fireproof.”\n\nI was still staring in shock at his hands where the flame had been. I nodded slowly. “Ok,” is all I can manage.\n\nThe 18 year old points to the 15 year old. “This is Bonnie. Biologically augmented nano n___ intervention environment. Or Bonnie for short. A bunch of nanobots in her body can alter her body physically to overcome most challenges. Increased strength, intelligence, seeing in various spectrums, water breathing anything.”\n\n“Augmented doesn’t start with an O.”\n\nBonnie gives a shrug. “I didn’t know that when I chose the name, I thought it did, due to the ‘or’ sound.”\n\nThe 14 year old steps forward. “The names Ex, my brain is quantumly linked with a quantum computer. If we were in a film, I’d be the tech guy. Super smart, super fast thinking, can use the computer to hack any device.”\n\nI nod. You’d expect me to be even more surprised, but there’s only so much surprise one man can have, and then it just reaches blind acceptance. “And how’d you get the name Ex?”\n\n“The scientists always said that I was simply a part of the computer, an extension of it, so they,” he pointed to the other kids, “started calling me Ex.” Finally I turn to the 12 year old girl. “And you sweetie?”\n\nShe looked to the other kids before standing straight and saying “I’m violet and I can change what I look like.” Her hair then changed from pink and blue to bright red and then to blond, looking just like my own. She smiled at me with crooked teeth and I smiled back.\n\n“Oh that was wonderful. And how’d you get your name?”\n\n“My favourite colour is violet.” Her skin then changed to match that colour.\n\nTurning towards the 18 year old I asked, “didn’t catch your name, what is it?”\n\n“Blaze,” he answered.\n\nI nodded, the reason seemed obvious.\n\nI made them a simple lunch, cooking up the rest of the soup before giving them juice and brownies for pudding.\n\n“If you’re running from the government, you can’t stay here long.” They nodded solemnly, except for violet who just looked disappointed. “I can get you food, clothes that’ll stick out less and transport. I can also give you some money to keep you going.\n\n“We couldn’t ask you to do that, that would be so much.”\n\n“I got £24 million from donating my DNA. Money that I planned to pass down to my kids and their kids. Far as I’m concerned, that money’s just as much yours as it is mine.”\n\nAnd so, without giving them room to refuse, I bought a second hand car that someone was selling on the street, a couple months worth of imperishable food, new clothes and then gave them £10,000 and the best tips and tricks to save money I know. And with that they hugged me goodbye and left.\n\nBarely two days later, two black trucks appeared outside my door and a team of troops emerged. The almost pounded my door down before I answered, as my wife kept our children back.\n\n“What do you want?” I asked.\n\n“Your children, where are they?!”\n\n“What do you want with my children? What’ve they done? They’re good kids! Go to school!-“\n\n“Not those kids!”\n\nI furrowed my eyebrows. “I don’t have any other kids.”\n\n“We know they visited you! Where did they go?!”\n\n“I don’t know what you’re talking about! I don’t have any other kids! I haven’t even had another partner!”\n\nA woman in a black suit walked up to the door, commanding the soldiers to stand down. “We know you know, we tracked them here.”\n\n“What kids are you talking about?” I repeated, playing my best furiously confused civilian.\n\n“Answer our questions or we’ll take these kids instead.”\n\nI growled and glared at them with the fury I’d never felt before. “Do not touch my kids. Any of them. I don’t know where they went, I wasn’t stupid enough to ask. There’s nothing I can tell you that can help.” The woman held my gaze for a moment before nodding.\n\n“He’s telling the truth.”\n\n“And before you attempt to arrest me to lure those children you experimented on to turn into soldiers, this is being recorded and, if I don’t stop it, it will automatically be uploaded to the internet.” I warned. We held each others’ gaze for half a minute at least before she backed down.\n\n“Move out. They aren’t here.” I slammed the front door and collapsed to the ground, shaking from the adrenaline.My family ran up to me and we embraced.\n\nMy kids will be fine, I have confidence in them. That’s what I tell myself every night before I go to sleep.\n\n\n\n",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1grbj1w/wp_years_ago_you_donated_your_genetic_material_to/lx8mk6f/",
        "score": 13,
        "date_posted": "2024-11-15 04:45:17",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You squealed as the heroes unmasked and kissed in front of the roaring crowds. Wait…you recognize their faces…that’s YOUR best friend and YOUR girlfriend/boyfriend.",
        "comment": "My face instantly becomes blank. I push away the hand of the paramedic who had been tending to the injury on my forehead before simply standing and walking away. I can’t really describe what I’m feeling.\nIt’s not… apathy. I feel something. But it’s not rage or grief either. I might just still be processing and the feelings will come later, but if I were to describe it, it would be the calm before the storm. It feels calm, but there’s something else that means you can’t quite relax. Something moving out of sight.\nMy home is on the other side of the city, my car was destroyed in the battle and public transport is down, but I don’t care. I walk home, still not really feeling a whole lot. Nobody stops me, they can all tell now would be a bad time. They can all tell that interrupting my stupor could result in violent repercussions.\nWhen I arrive home I see that half of it is destroyed. I don’t care. I step through the hole in the living room wall that my boyfriend had made and sit down on my couch. My phone buzzes, but I ignore it, gazing out the hole at the destroyed street. It buzzes gain and again. The recognisable ping of a message from Sally’s, or I guess Lightning’s, number.\nCalm as anything I pick up the phone and throw it against the wall as hard as I can, shattering it on the exposed bricks.\nThe landline rings. I sit back down. It keeps ringing. I pick up a piece of rubble. It goes to voicemail and my boyf- Sunbeam’s voice comes through.\n“Charlie! Are you ok? Don’t turn on the news! I’m com-“ the piece of rubble smashes into the phone, destroying it.\nI sit waiting for who knows how long. I am about to go make myself a cup of tea  when the super duo arrive. Sally hadn’t even got out of costume, clearly driving so that Sam could get changed.\nI don’t stand. I cross my arms and watch silently as he walks up to my destroyed house. As he steps through the hole in the wall he starts talking, a rush of words coming out.\n“I’m so sorry about what you saw! It was spur of the moment thing. It meant nothing. For the crowds. We were high on the victory and adrenaline. We weren’t thinking. She’s been my partner for so long. You get it, right?”\n“No.” Is all I say.\nHis face drops. “It didn’t mean anything. You’re still the one I love.”\n“No.” I say again.\nSally has now got changed and joined us in the house, spurting her own spiel of apologies.\n“I didn’t mean to. We’ve been partners for so long. Our life in each other’s hands. It’s only natural we develop feelings. I didn’t want to take him from you. I didn’t mean it to go so far, but the crowds, and the victory. We got carried away.”\n“No.” They look at me dismayed and confused.\n“What do you mean no?” Sally asks me.\n“No,” I repeat, not looking either in the eyes.\n“Say something other than no, please,” Sam begs. “I apologised, I’m sorry. That’s where you say something. Forgive me, get mad, something!”\nIf I could get mad, I would. But no feeling a come, just a blank calm and acceptance. “What do you want me to say? That I forgive you? That it’s all ok. That it’s ok you kept a secret life from me? That I don’t mind you fell in love with my best friend? That I don’t mind that I have seen you grow closer and exclude me more?”\n“It didn’t mean anything,” Sam says. Sally looks down sadly at hearing that.\n“You know where your stuff is, if our room’s still intact. I’m sure you have a secret lair or something you can live in. Or maybe Sally will let you live with her.”\nSam’s face is one of shock. “What?”\nI don’t answer, simply staring at him. He begrudgingly starts to trudge up the delicate stairs.\nSally’s face has started to look furious as she marches after him, shouting about ‘the past 6 months meant nothing?!’ I don’t waste time listening, walking to the kitchen and putting the kettle on. I take my tea next door and use my neighbours phone to call up damage control for resettlement. The blank feeling I have doesn’t go as I walk back into my house to see Sam walking out with his stuff. By now people have found where he lives and are starting to arrive, taking pictures. The tabloids will have a field day, but I’m not interested in that. I walk upstairs to my bedroom, picking up a ring he had gifted me. In hindsight, he’d obviously taken it from a supervillain. The few times I’d worn it, the ring had granted strange abilities, but the life had never enticed me so I’d left it in my drawer, wearing it a couple of times to not seem rude to Sam. But now, I have a new reason to wear it. This city deserves a true hero. And for it to get that true hero, the old fakes must go.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1eb9o1b/wp_you_squealed_as_the_heroes_unmasked_and_kissed/ls1v4j0/",
        "score": 2,
        "date_posted": "2024-10-15 11:26:51",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You're a dimension-hopper, who can walk through parallel worlds like turning a corner. The increasing number of apocalyptic Earths is really starting to bother you, though",
        "comment": "“Have you ever heard of the Fermi Paradox?” I ask my companion, Jesse, as we leave yet another desolate word. Yes, I have a companion. If I didn’t I’d lose myself if the infinite number of realities out there. Without something to connect me to my home I’d be lost. They shake their head. “It’s the question as to why humans haven’t met aliens yet. One answer is the Great Filter, which posits that the reason we haven’t met intelligent life yet is because there is some mass extinction event that befalls every single intelligent species.” Jesse looks at me, confused. “How is this relevant?” “I don’t travel through time, only across dimensions. Which means what is happening to these Earths, whatever Great Filter this is, is happening in the present day. The same present day our Earth is in. Which means the Great Filter is now. Which means that…” “That what happened to these Earths could happen to ours,” Jesse finishes. I nod to them. “If we don’t find out what it is and stop it.” I hold out my hand and they take it. Then the world around me stretches. It stretches more and more until it tears around me and I fall through the hole as it closes behind me. Well fall probably isn’t the right word. Falling implies there’s gravity, but there is no gravity in the void. There is no gravity, no time or space or air, light, sound or even consciousness. Whatever I experience in the void I never remember once out of it. For a few short seconds I see nothing, smell and hear nothing. I feel nothing except Jesse’s hand in mine. The lack of oxygen might bother me if I needed to breath, but without time that isn’t even necessary. I exist outside of time, in between two heart beats, between one breath and the next, in the middle of two ticks of a clock. After an infinite amount of time and no time at all I emerge into a bright light. I see and hear and feel again. I forget the experience in the void and all I feel is burning pain. Screams fill my ears and toxic gas invades my nostrils. I open my eyes to see a city harbour in flames. Right ahead of me, the Statue of Liberty melts into nothing. The sky is burning and the streets are a river of molten rock. Buildings around us crumble and people are screaming and panicking as the burn away. Some quickly, others slowly as the blacken and crumble to ash. We are only there for a few seconds before I drop us out of the universe, but the images I see are burned into my brain. We land face first into bright green grass. I gasp deeply, relishing the fresh air flushing the toxic air out of my lungs. My skin burns all over but it is already calming down as the air cools it. Next to me Jesse is coughing up sick, phlegm and blood as they gasp with me. “Wh… what… what was that?” They choke. “The Filter,” is I can say in answer. We breath deeply for a couple more minutes, during which I remember what I had seen. Not the people or the burning, but the shapes that moved. The shapes in the smoke and the gas. The movement of the flames, molten rock and the shadows. I speak again. “We need to go back.” “What?! We almost choked to death after being there for a couple of seconds! You saw what was happening there! We wouldn’t survive!” “I can project a protective shield around us. But did you see the shapes there. It looked almost sentient. Almost alive and malevolent. If we want to protect Earth from this, we need to know what’s going on, which means we need to go back and see what’s happening.” Jesse sighs and nods, taking my hand. “Ok.” We dip back into the dark voice for a few seconds or years. I look around and see nothing. Just blank wasteland as far as the eye could see. Next thing I notice is the black sky. The sun shines as bright as day but the sky is dark. There is no atmosphere, the only thing keeping us alive is the small bubble of air I established around us before we left. Jesse looks around, confused. “Where are we? Did we end up in the wrong universe.” “No,” I answer, “we’re in the same place we left. This is New York.” “But… it’s nothing. We were only gone a couple minutes at most. Where’s the buildings? And the sky? Where’s the Atlantic gone?” “I don’t know,” is all I can say. I bend down and feel the sand between my fingers. I see it start to twinkle in the sunlight. “Metal.” Jesse looks at me? Confused. “There’s metal in the sand. From the disintegrated buildings.” Looking up at the sky I keep talking “we need to go soon, without an atmosphere there’s nothing to protect us from the sun’s harmful radiation.” Jesse nods and together we return to the world we just left.\n\n\n\n\\n\\nI open my eyes and find… nothing. The green rolling hills we’d just left are replaced with deserted wasteland and black sky. Jesse looks around in horror. “We were just here! It was ok! What happened?!” Again, all I can say is “I don’t know.” We slip back into darkness. But, this time it isn’t dark. There is light. Light in the void. There is something in nothing. For the first time ever I feel and see. And I feel time moving. And I feel my need to breath. Desperately I do the single most stupidest thing I could have done. I change our direction mid travel and follow the light. I feel time passing. I’ve never known how long it would actually take to travel dimensions if time actually existed in the void. Well now I am about to find out. And suffocate while I do. Hooray for me. Minutes pass. I start to pass out. I try to breath in but nothing happens. My vision becomes fuzzy and darkness creeps in. Then in one bright flash of light I can breath again. My lungs welcome the rushing fresh air and I collapse to the floor, gasping for air. I feel Jesse collapse next to me. I quickly look around to get my bearings and see a tall, metal tower. There is an arch towering above me. We are in Paris. I stand to see we’ve attracted a small crowd. Travelling dimensions tends to do that. Quickly I give a small bow. “Thank you audience for watching the Great Reappearing Magician.” “But you didn’t disappear.” “Not yet,” I answer with a wink before helping Jesse to their feet. “Did you see that?” I whisper. They nod, a panicked look on their face. “What was it? I though the void didn’t have light.” “I don’t know, but whatever it is, it’s coming here.” “We should get everyone out of here.” “How? By yelling that an apocalypse is coming through the void. Besides, if this has anything to do with the Filter then there’s nowhere for these people to run. Best to leave them in peace. A ridiculously short man with a fabulous moustache and enormous top hat walks up to us and speaks in a German accent. “Excuse me Monsieur, what are you talking about?” I look at him weirdly. “You speak French words in a German accent. Who are you?” The man chuckles and fiddles with his moustache. “The question isn’t who am I, it’s how are you going to protect this world.” I look at him with my mouth slightly open. “How the hell am I supposed to save the world? Whatever this is has destroyed planets in minutes. I’m just a guy who can travel dimensions.” “And can take people with you. Allow me to guide you and this apocalypse will not stand a chance in the universe we choose.” I look at the strange man.\n\n“Who are you?” “No time!” He yells as a ball of light appears in the middle of the crowd of tourists. It starts to grow scarily quickly, engulfing the crowd. I try to ignore the screams coming from inside as I take the strange man’s hand. “Whatever you’ve got planned, I hope it works.” Jesse takes my other hand. “No!” I yell, “you could die here. You don’t need to risk your life for this. I’ll come back for you!” “Unless you die in the process in which case I’ll be stranded, having lost my best friend in the world. I’m coming with you. Either we die together or not at all!” I try to shake their hand off, but they refuse to let go. The growing ball of light gets closer and closer to us. I feel the heat emanating off it and smell the burning of unfortunate civilians. As soon as the ball touches me, my skin feels like it’s on fire. But I concentrate and fall back into nothing. But it’s not nothing this time as my skin burns and light fills the darkness. I see Jesse to my left and the strange man to my right and I feel the lack of air in my lungs. Time passes. You could convince me it was hours if it wasn’t for me surviving the suffocation. The man’s hand pulls me along and I relax into the journey. Then I feel something new, emotions. Feelings that aren’t mine. It’s like the ball is speaking to me. I feel pain and rage. I feel it’s boiling frustration at humanity. I see the worst humankind has to offer flying through its mind: war, famine, violence and crime. I see selfishness, corruption and lies as well as foolishness and climate change and a billion other crimes across a billion other worlds. The extent of it all, the horror and the hatred is almost enough for me to turn against humanity and let the ball go. But then I feel Jesse’s hand tighten in mine and I remember. I remember all the good they have done, how kind and helpful they’ve been across dimensions. I remember seeing other people: seeing someone help another across the road, seeing people say hi to random people and rush to the aid of an injured stranger; I see the apocalypses and I see hundreds of people helping each other up as they ran, dying to help others. I project these thoughts into the deadly ball and a million more good things humans have done. The heat from the ball isn’t so bad anymore and I feel time slow down, the suffocation isn’t so bad. Finally we land in a strange word. There is no one in it, a pure grassland with one old hut. I look down at my feet and see a small orange ball glowing warmly. “Is that?” Jesse asks from the floor where they had collapsed. “I think it is,” I answer, crouching down to look at the ball. “This thing destroyed planets?” “This thing destroyed universes, “the strange man responds and I whip around, having forgotten he is there. He lifts the ball. “Well done, I knew I’d picked the right people to ask for help.” He throws the ball into the air and my eyes follow it upward. In the air I see billions of stars lighting the sky like it’s day. Then I see them moving and realise that these are all balls like this one. Great Filters or apocalypses. I look at the man incredulously. “What do you mean? The right people to ask for help.” “I mean someone with an unshakeable faith in humanity because they have someone to hold onto. Most travellers like us don’t have someone with us. We always end up so lonely. Some get bitter, only seeing the worst of humans and not having anyone to point out the good. Some end up like those,” he points to the sky, “bitter and angry.” “There’s more than just me? And we can become those?!” I yell in surprise. Jesse pats my shoulder hard. “Like I said, moral support. Everyone needs it.” I smile it then and hit them back. “How many more are there?” The strange man raises his eyebrow at me, “how many Universe are there?”\n\n",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1bnz1p6/wp_youre_a_dimensionhopper_who_can_walk_through/kwogy3d/",
        "score": 3,
        "date_posted": "2024-03-26 14:29:03",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] The war has ended, and all governments have collapsed.  Now the world is so devastated that recovery is but a pipe dream.  Now, in a cruel twist of fate, a massive alien fleet arrives, demanding to speak to the leaders.  You are chosen at random to address them.",
        "comment": "“Woah! Why me? I’m… like… the worst person to choose.” I knew why. There were only 5 of us left in the bunker and none of us were exactly the people you’d choose to represent humanity. A convicted rapist, the leader of a major American business, a person who had been in a cult right up until the start of the apocalypse, a child and me. Until the apocalypse the most I had accomplished in life was almost die due to a drug overdose. I had been on the streets and had done nothing with my life. So we drew straws to decide who would approach the aliens. Obviously I had drawn the short straw.\n“You agreed to this now get out there,” the capitalist, Fred, said to me before pushing me to the door. I sighed and pressed the button to open it before walking into the wasteland. The door slammed shut behind me, almost as loud as the beating heart in my ear.\nThe world was silent for a beat. For two beats. I started to wonder if this was some sick joke but the ships came into view. Hundreds of the bristling with… something. Probably guns, I thought. The lead one did a flyby so close I was knocked to the ground. My heart was in my mouth as two more ships flew by. Finally, an hour after ‘first contact’, a ship landed and I faced these… beings for the first time.the approaching creature was twice the size of me and looked more like a snake than anything. Except this snake and six arms and 8 beady eyes looking straight at me. Next to it was what looked like a robot which was identical in form to the alien, except it was my size.\nThe creature and the robot approached before the creature spoke in a low voice that rattled my eyes. I had no hope of understanding it, so I just stood there dumly as silence passed for a couple of seconds. Then the robot spoke in almost perfect English\n“Hello human of America. I am [untranslatable] of the [untranslatable] empire. This robot will translate for us. Do you represent your race.”\nI shrugged at the giant creature. “I mean, I guess. There’s nobody else here.”\nThe robot translated and the creature spoke again.\n“In that case we will discuss the terms of your surrender”\nMy eyes went wide and I gasped.\n“Surrender? What are you talking about? You just got here.”\nThe alien looked confused.\n“You have no military force. Your population is scattered and on its knees. Why wouldn’t you surrender?”\n“It’s in our nature,” I shrugged, “We’re stubborn like that. Wait, why would you want Earth? The ground has been scorched by solar flares, a deadly virus controls half the planet and all its natural resources have been plundered or polluted by us. What could Earth possibly have to offer?”\n“Space,” the robot translated, “our population continues to grow and we must spread across the stars. Your natural resources can be purified and recycled. And the virus is merely an inconvenience, a clean up effort. Now will you surrender and kneel before me or will you fight a war you cannot win?”\nI shrugged. “Us humans aren’t really the kneeling type. But you’ll lose any war you fight against us.”\n“[laughter]” the robot translated. The alien’s version of laughter was almost humorous, it’s arms span round in rapid circles and it’s eyes all blinked rhythmically. “Our force outnumbered your military at its strongest, but now your entire population numbers less than a million. Our technology makes your most advanced weapons look like sharpened rocks. How could you win? Where is our disadvantage?”\nI gave my own laugh in return at the absurdity of the question. “Win?! I never said we’d win. We could never win that’s hopeless.”\n“Then how will we lose?”\n“Well you see,” I explain, “humans are incredibly vindictive and spiteful. We know this is the end. We knew the end was coming before you even showed your slimy scales in this solar system. But that makes us something very dangerous.”\n“What?”\n“It makes us hopeless. And a hopeless person has nothing left to lose. Do you know what’s buried across this planet in the thousands?”\nThe alien gave a gesture that was translated and the equivalent shaking its head.\n“Nukes. Nuclear weapons. Thousands of them and thousands of spiteful, angry and trigger happy humans. You see we can’t win this war, but we’ll make dam well sure you won’t either. How many forces will you lose? How many ships destroyed? And what will you have to gain? A radioactive rock.”\nThis was the wrong thing to say as the alien raised a blaster at my face.\n“You wouldn’t dare destroy your own world.”\n“We already did.”\nI answered simply and the alien pulled the trigger, blowing my brains out.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1b7bdle/wp_the_war_has_ended_and_all_governments_have/ktn9ns2/",
        "score": 4,
        "date_posted": "2024-03-06 13:36:38",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You have been Isekai-ed! Isn't that great? Except when you look around you, you see those who summoned you are horrified. Apparently they are the  \"subhuman\" resistance group of Elves, Dwarves, and Beastkins who tried to summon a hero from another world to defeat the evil tyrant human Emperor. ",
        "comment": "The… beings? surrounding me looked down in shock. I looked around back at them, the burger in my hands forgotten. “Uhhh… where am I?”\n\nSomeone who looked like the leader, a tall woman resembling a wolf mixed with a human walked up.\n“Where did you come from?”\n\n“London,” I answered. At their blank looks I continued, “Britain? Earth? Heard of it?”\n\nThe leader shook her head. “You are not from this world?”\n\n“I’ll take your word for it.”\n\n“You are on the world of Systria. We cast a spell to summon a hero to protect us.”\n\n“And your spell chose me? Are you sure you cast it right?” From the looks of the surrounding people, I could tell many weren’t. Many were also looking at me with hatred.\n\nThe leader nodded though, “I’m not sure why it chose a human to defend us.”\n\n“Wait, first of, you know what a human is? Second, why is the ‘human’ part the bit you have a problem with?”\n\n“Because the humans are what we need protection from,” she answered dramatically.\n\nI nodded, somewhat speechless for a second. The hateful glances suddenly made sense. “Ah… right. You’re probably gonna need to catch me up.”\n\nThe leader took me into a room, introducing herself as ‘Lydea’ and started to explain.\nSo, apparently, long ago all the different races lived separately. Humans stuck to their cities, dwarves to their caves, elves to the cloud forests and the beastkin for the wildlands between.\nHumanity had always been warring among themselves and the other races had ignored this. That had been their mistake. Their second mistake was assuming the end of hostilities meant the humans had risen to a higher level of sophistication. They had instead stopped because someone had finally won, the Nameless Emperor. The Nameless Emperor had conquered all of humanity in a matter of years, yet he wasn’t satisfied. He started his war against the beastkin residing in the wildlands surrounding the human cities. Being only hunter-gatherers mostly, the beastkin were incapable of holding back the human advance so fell quickly. They were quickly followed by the elves, yet the dwarves held out a little longer in their stone fortresses, though with no other enemies, the humans could dedicate their entire forces to sieging the dwarves and under that pressure, even the strongest fortresses fell. And now a resistance movement is fighting against the empire, working to regain their freedom.\n\nAt least, that’s what they told me. I was always skeptical of stories that painted one side as entirely the good guys.\n\n“So the human empire conquered you guys. And you expect summoning a single hero can save you?”\n\n“A true hero can change the world.” I raised my eyebrows at that.\n\n“They’d have to be one hell of a hero.”\n\n“The spell was supposed to summon a true hero, one with the power to change our world. That’s what the resistance was expecting, that’s what we need.”\n\n“Sorry to disappoint you,” I muttered, looking around the cold grey room she had taken me to. If I had to guess, I’d say we were in some underground cave. The damp stone walls showing scratches of being mined.\nI thought hard for a second. If these people were telling the truth, that would mean that they needed my help and I couldn’t turn them away like that. And if there was something they were lying about, well there was only one way to find out. I take a dee breath and speak. “So what do you need me to do?”\n\nShe looked at me, surprised. “What are you talking about?”\n\n“Well you said it, you need help taking out a tyrannical leader. I hate tyrants, and I can’t exactly say no when someone needs help. So what do I do?”\n\n\n(This story is becoming bigger than I expected, gonna post a link to the rest of the story as I work on it)",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gaxooo/wp_you_have_been_isekaied_isnt_that_great_except/ltir57q/",
        "score": 106,
        "date_posted": "2024-10-24 10:50:31",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] Today you just found out your roommate with strange hobbies, like knowing how to pick a lock, knows how every puzzle and cipher by heart, or how to commit tax fraud, and so many other things, wasn't a guy with ADHD, he was an ex-assassin and now you have a gun pointed at your face",
        "comment": "“Look, I don’t know what you’re talking about,” I told the man desperately. “My roommate is just a normal guy, you know?”\n“I don’t care if you don’t believe me! Just tell me where he is!” The strange man shouted, sending spit flying at my face as he did.\n“Fine. He’s at work, the local Lidl,” I answered, hoping he’ll believe me.\n“Are you stupid?! If I can track down his house I can track down his work. And he’s not there!”\n“Well that’s where he said he’d. If he’s not there, then I don’t know!”\n\nThe man narrowed his eyes at me before lowering his gun. “He must’ve known I was coming, made a break for it.” As he left, he put his finger to his ear and spoke into what I assumed was a radio. As soon as the door closed, I ran into my roommates bedroom to dig out he secret stash. I’d already found it while cleaning a couple months ago, but hadn’t opened it, figuring it was a disaster survival pack or something, but with the new revelations, I had other ideas. I went to the floorboards and lifted them up to find a puzzle box that I already solved the first time I found it, so quickly solved again to pull out a bag.\n\nAnd viola, money, fake identities and, most importantly, a burner phone. I dialled my friend’s number and waited. Once he answered I didn’t give him time for his usual greetings.\n\n“Some guy is looking for you. I don’t know who, but I know it’s something to do with your assassin days.” I hear a curse and then he starts to talk to justify but I cut him off. “You don’t need to explain yourself, I know who you are now, I don’t care who you were. What do you need?”\n\n“That grab bag, take it to where I had my first birthday party.” With that, he hung up. I furrowed my eyebrows. He’d always told me he hadn’t had a birthday party. So if it hadn’t happened, it didn’t happen anywhere, it happened nowhere. Ohhhh, I got it.\n\n30 minutes later, I found myself outside a pub a few miles outside of town. Normally you could get there in half the time, but I had to make sure I wasn’t being followed. The pub was called Nowhere, people said it was because you could say to your spouse you were going ‘nowhere’ when they asked and not technically be lying.\n\nI handed my friend the bag, filled with some chocolate as an added treat before saying goodbye.\n\n“I’ll miss you. Don’t think the next roommate could replace you.” But instead of agreeing, he shook his head.\n\n“You won’t be having another roommate. As long as they’re coming after me, you’re in danger. Go to this address,” he handed me a small slip of paper, “it’s a safe house, you’ll be safe there.”\n\nNormally I’d be disagreeing, I had a life and a job and family here, but being held at gunpoint still had me shaken, so I just nodded and we parted ways.\n\nI drove straight home, packing up quickly what I could and talking with the landlord. I told him I’d recently inherited a house that came ready furnished, so I’d be willing to sell him the furniture so he could rent the room as pre furnished. We came to a deal quickly and I walked away with some extra money in my account, that I immediately drained before driving.\n\nI didn’t stop driving for almost 6 hours, not even for a toilet break, until I finally reached the address, somewhere in the middle of Scotland.\n\nIt wasn’t a modest house. 3 stories, as wide as my block of flats and a huge garden that I’d have to measure in acres rather than metres.\n\nThe cupboards were wet stocked with non-perishables and a large amount of money, so I knew food wouldn’t be an issue for a while. So I unpacked and settled into my new home, looking at the landline, wondering when the call would come in that I could go home.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gt2x79/wp_today_you_just_found_out_your_roommate_with/lxkg2kc/",
        "score": 88,
        "date_posted": "2024-11-17 03:43:29",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] The Princess is cursed, and only the kiss of her true love can wake her up. Many princes have been summoned, but as her closest servant and best friend, you are the only one who knows she does not even like men.",
        "comment": "It was hard for both of us. She hated men and you hated seeing her unhappy. You also both hated the curse. That goddamned curse. Until she got a kiss from her true love her kingdom would not prosper. Now the kingdom wasn’t failing by any means, but it was far from doing well. ‘Just scraping by’ as the advisors had put it. Unfortunately, ‘just scraping by’ was not enough to protect us from war. So the king and queen had called out for dam near every prince in the land to kiss her. They called for single kings and polyamorous ones. The summoned nobles from all over but still nothing. She must have been kissing a hundred men a day at one point. Her lips were chapped and her mood was lower than ever. And most of these men weren’t even gracious enough to make the kiss small. A simple peck would do by the wording of the curse, but no. They had to make it a full make out session. They had to get handsy and they just had to go to far. Almost every time I would have to pull them off and send them running. The king and queen were getting so desperate they had started calling on the lower class. But I knew all this would be in vain, you see, she didn’t like men. The princess was into women yet we all knew how that would end up. Enough princesses had been abandoned and rejected to tell us that revealing that secret would be a bad idea. But I couldn’t watch my kingdom suffer in fear of the war to come. Other kingdoms were becoming emboldened and our allies were becoming distant. If we couldn’t help them, why should they help us. It was only a matter of time, so I put out my own call. Albeit quieter than the other one. I put out a call to all the lost princesses. Together, the princess and I would sneak out of the castle every night to meet one of them. They would talk, get to know one another and if there was a spark, they would kiss. The curse had still not been lifted, but the princess’ mood had already lifted. She had hope, we both did. And we were making life long friendships along the way. She was also very happy to be kissing a tonne of beautiful, respectful women instead of hideous men. But where the true love’s kiss came from was a shock to us all.\nIt was another evening. We had ten more men from the army lined up to shoot their shot, but the princess was nowhere to be found. We all went searching together, looking in her room, in bathrooms and eventually in servants quarters. \nWhen we did find her, she was locked in a broom closet with a maid. The king opened the door and gasped in shock and horror. I saw the two of them Break from what had obviously been a very passionate kiss, gasping. But then, before anyone could say anything, a bright light bathed us all. The princess started floating and we all had to turn away. When the light died down we all turned back to the princess and the maid looking nervously at the king. He too a while to speak.\n“The words of a spell can never be false,” he said carefully, “if this is your true love then so be it.” The relief that spread across our faces overpowered any horror the suitors showed. The king took the maids hands.\n“You have saved my kingdom from this dreaded curse. Please do us the honour of joining our family.”\nThe maid gave a curtsy, “I would be honoured my lord.”\nThe princess took her hand and together they left the closet.\n(That finishing pun was a complete accident but is too perfect to change)",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1b9puh7/wp_the_princess_is_cursed_and_only_the_kiss_of/ku3qoev/",
        "score": 9,
        "date_posted": "2024-03-09 13:13:10",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] Once, there were Seven of you. But humanity has changed. Evolved. Grown. One by one the others have gone, no longer needed. Two in a single afternoon, once. Now you are the last. The final Deadly Sin.",
        "comment": "I gave a long hard sigh as I stood above 6 lonely graves on the hill. Fools the lot of them. To think they could live forever. Sloth was the first to go. It was a revolution. The education and employment system reborn. The golden age they called it. No one was lazy because they could do whatever work they enjoyed the most. And they had the opportunity throughout and beyond education to try anything they wanted. No one was lazy because they enjoyed working and wanted to, so Sloth died in their bed, refusing to fight their fate. Might have actually been wise looking back on it. Everyone worked, everyone had a job and got enough money. Everyone had whatever they wished for so there was no reason for envy. You wanted what someone else had and you got it. So Envy passed on wishing for my fate. Any time people got greedy for more they learned that greed makes everything seem better than it is. So people stopped wanting and became satisfied. Two of the triplet died only a few short decades after sloth. Greed and Gluttony, so similar they became nigh inseparable. But that doomed them to die together. Or blessed, I’m not really sure anymore. Greed passed in a lavish bed begging for just one more pillow. Gluttony choked to death, which would have been impossible had he still had power over people. Pride died with the last tyrant. His oppressed populace, taught in secret by other nations, rose up and ousted him from power, executing him where he stood. Pride died standing tall, refusing help from us or the Heavenly virtue of forgiveness and grace. Wrath died in the aftermath. No more tyrants or monster to fight, only other normal people. People felt no pride or arrogance over others. They no longer needed Wrath, they learned to forgive. Wrath died fighting. Not valiantly or with grace, but kicking and screaming as he attacked a random person to incur their wrath. To keep going. And that left only me, the most primal of all the sins. Animals evolved to mate, it’s how nature created humans and it’s how life kept going. How could life go on without Lust? And that’s what I thought, stood on that graveyard hill. But I didn’t realise then what I now know. The reason why I finish the triplet with Greed and Gluttony. Lust isn’t just sexual desire, it’s Greed for it. It’s an arrogant desire for sex disregarding other people’s needs and wants. And without Pride or Greed or even Envy, there was nothing stopping me from fading too. So here I stand, watching the last Lustfull person on Earth dying of an STI. Ironic really, killed by the one thing sustaining me, reckless Greedy Lust. I’ll be joining my family soon. Wherever dead ideas go. You probably won’t remember. I wouldn’t be surprised. You’ll forget me, leave me in the past as one of your many mistakes. Just please, grant me this dying wish, live on. May humanity live on so we may one day have a chance to return. In the hopes that one day you may make a mistake and resurrect us.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1brnz7r/wp_once_there_were_seven_of_you_but_humanity_has/kxe1f4g/",
        "score": 5,
        "date_posted": "2024-03-31 08:42:11",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] The hero, normally jovial and humorous in their interactions, steps into a watering hole for villains, shaking with rage, tears running down their face, and with as much patience and calm as they can muster, simply asks \"Who did it?\"",
        "comment": "I was relatively new to the supervillain business, a villain with the power to control water called La Siene. Now don’t go judging me, villainy pays well. Well it does as long as you aren’t in Paris. The Hero Ghost has built a whole network of heroes and informants to protect Paris from the Legion. Even the birds fought for him. But it wasn’t like Ghost was ruthless. He was famous for his care for those he defeated, many of the people on his team were villains that he’d reformed. He even married one.\nLong story short, Ghost was famously kind and friendly, despite his serious demeanour, but he was also impossible to cross with that network of his.\nOne night the legion was having a social at a bar when the door was smashed open. Ghost stood there, furious. His entire body is concealed by his costume, yet the tenseness all over and the way he carried himself, nobody dared speak as he walked in.\n“Who. Did. It.” He demanded.\n“You’ll have to be more specific,” one of the more smug villains said as he recovered.\n“The orphanage. You’ll tell me who did it,” he pulled out his pistol, “or I’ll kill all of you to make sure they die.”\n“You seriously think you can intimidate us like that? We know you. You don’t-“\nThe gunshot went off before I realised he’d raised the gun. There was a hole in the man’s head as a look of shock passed over his face and he crumpled to the floor. There was a deathly silence.\n“Don’t make me have to ask a second time.”\n“What makes you think you can beat all of us.”\nA loud thud rang out as Ghost dropped his backpack and brought out a power core. We all stared in shock. This core allowed him to channel a stars energy through him, but it also gave him severe cancer. He hasn’t used it since he got married.\n“My family lived in that orphanage. It wasn’t blood but who cares. I became a hero to protect my family and that’s also why I stuck to my morals. Without them, what’s the point in being heroic.” He glared at every terrified face in the crowd.\nWe all looked at each other, waiting for the one responsible to step forward. No one did.\n“I guess it’s partly my fault. I gave you too much space. Too much freedom. Not anymore.”\nI was the only one to escape that bar alive. I had 3rd degree burns across my entire body, 4th degree on my hands (completely burnt down to the bone) I spent a month in a coma before waking up. When I did, I found out that not only was I convicted for all my crimes, but Ghost had taken down the entire legion, dismantling until it was a bunch of fractured pieces clinging onto life. Many villains went to jail, many more died.\nIf I could go back, I would. Not to the day Ghost entered the tavern to stop him, that would have been impossible, but to the day before, so I could stop myself from destroying that damned orphanage.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1g5kua3/wp_the_hero_normally_jovial_and_humorous_in_their/lsd1agu/",
        "score": 91,
        "date_posted": "2024-10-17 09:40:07",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You are a gladiator that can win fight after fight against even the most powerful wizards. Your secret? You were cursed as a kid to nullify any magic that came close to you.",
        "comment": "(This is an idea I’ve already played with)\nGlumly I raised my sword against this new foe who thought he had what it takes to defeat me: the mage slayer.\nThis isn’t what I wanted. I didn’t ask to become this. But for the mageless (the minority non-magic people) I had become a folk hero, capable of slaying any wizard.\n“You don’t want to do this,” I warned. The mage just snarled.\n“No one is a match for my magic. You’ve been fighting gladiators and weak, pathetic Sorcerors looking for notoriety, you haven’t yet met a true wizard like me!” He declared arrogantly\nI sighed and got into my battle stance, waiting for his move. Times were hard for the mageless, being imprisoned was a common occurrence as we had no magic to escape with. I had been forced into this arena from a young age and made to fight, so my movements were familiar and practised.\nThe wizard prepared his first spell, aiming a finger towards me and shooting a beam of light. It hit my chest like the beam of light from a magnifying glass to light fires, except this time he didn’t even get a spark.\nI walked forward slowly as his brow furrowed. I wasn’t truly a mageless, as a toddler I’d been blowing up my parents garden willy nilly, but then *he* arrived.\nThe wizard started charge a fireball, building it up above his head. Some people might assume I was playing with my food, drawing it out for the crowd or for entertainment. But the truth was, I had done this three other times today and hundreds of times in my life and I was just tired. Physically yes, but also I was just sick of killing people and in no rush to do it again.\nWhen I was just a toddler, playing in my back garden, a powerful True Mage (immortal magic users from whom all magic originated) came to our house. He said I was destined to slaughter hundreds of magic users and to prevent this he would take my magic. My parents begged and pleaded but to no avail, as he placed a curse upon me to nullify all magic around me. My life was downhill from there.\nThe wizard launched his fireball at my feet. I covered my face to protect it from the flying rocks, but walked out of the smoke unharmed, much to the wizards dismay. He scowled and started to try and and conjure some other attack, but he didn’t get to as I drove my sword deep into his gut.\n“Surrender,” I told him, “and I’ll leave the sword in, you may have a chance to survive.”\nThe sheer terror in his eyes answered my question before his nod.\nI gently lowered him down onto the ground and into his own pool of blood as his healers rushed onto the battleground.\nI trudged off to my quarters, picking a large rock out of my arm from the explosion and bandaging my arm",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gdtoop/wp_you_are_a_gladiator_that_can_win_fight_after/lu5m6h5/",
        "score": 7,
        "date_posted": "2024-10-28 06:49:05",
        "subreddit": "WritingPrompts"
    }
]