[
    {
        "post_title": "[WP] You are a tavern keeper who’s been in business for 15 years. A local crime lord is trying to extort you, sadly for them you know tons of adventurers who owe you favors, and even have mimics for chairs. ",
        "comment": "\\[Justine Jibs\\]\n\nClyde identified her as trouble as soon as she walked in. He'd never seen her before, but she had a certain confident bearing as she headed to the bar. Clyde discreetly alerted his hired guards by running his hand over a magical talisman under the counter as the purple-haired woman sat on one of the stools. Her hair was a purple fauxhawk and she wore a black leather duster that likely hid an assortment of weapons. \n\n\"Evening, Miss, what can I get for you?\" Clyde asked her with a practiced smile. \n\n\"The strongest and strangest thing you've got,\" the woman smirked at him as she set a small golden cube, the size of a sugarcube, on the counter. \n\n\"That's a shiny trinket; but, I'm afraid I'm going to have to ask for something I can put in the bank,\" he said politely without moving. \n\n\"I was afraid of that...,\" the woman nodded with a sigh. It was the smoothest move that Clyde had ever seen. She raised her hand as if to reach for the cube; but, he didn't actually see her pick it up. Her hand covered it for a moment; but, she pulled it away again instead of gripping anything with her fingers. She had to be a professional thief at the very least with that kind of skill. It lasted less than a second and she appeared to simply wave her hand over the cube once; but, when her hand was out of the way again the cube had been replaced with a trio of thick gold coins that hadn't made a sound.  \"...better?\" she asked. \n\n\"Indeed, strong surprise coming up...,\" he nodded as he collected the coins. He shook them in his palm just to be sure they jingled appropriately, then he went to work preparing her drink. A few patrons left in the few minutes since the woman arrived and while Clyde made the drink. The group as a whole tried to be delicate; they ushered out innocents that weren't involved, and sat down closer to the woman half-attempting to surround her discreetly.  By the time Clyde set the small glowing glass in front of her, the only people left were high level adventurers there to support the bar's owner. \n\n\"What is it?\" she asked as she lifted the drink for a closer look. The liquid shimmered and clung to the sides of the glass; but, the entire thing glowed with a faint, sickly green aura. \n\n\"Fairy's bite; arachnid toxin and absinthe,\" he chuckled. \n\n\"Spider? What kind of spider?\" the woman perked up and even leaned over the bar with a fair bit of interest. \"What does the toxin do?\" \n\n\"It's called the Fairy Widow spider,\" Clyde still considered her a danger; but, he was always willing to talk shop to anyone interested. He reached under the counter and brought out a jar with a spider inside. It had a lime-sized body and long, green spindly legs; it's coloring looked iridescent green that seemed to shimmer gold under the right light. \"Too much of the stuff will knock you out for a few days; a direct bite will kill you. But, I only put enough in the drink to give you a good time tonight and a headache tomorrow.\"\n\n\"Can I touch it!?\" she asked.\n\n\"You want to touch one of the most dangerous spiders in the world?\" Clyde asked with a chuckle. \n\n\"Oh definitely, I haven't seen that one before,\" she nodded. \"I'll tell you what, I'll even make it worth your while,\" she said. She discreetly raised both hands in the air and made a point to look around the bar at the few adventurers that were waiting for something to happen. \"I don't want any trouble, I haven't started any yet.... but, I am here to do just that,\" she said as she met Clyde's eyes again. \n\n\"So, Boss Wyatt did send you?\" he asked, the woman nodded.\n\n\"Since I'm trying to cut a deal, you can call me, J.J.,\" she said. \n\n\"And, you think that man is going to go along with whatever deal a henchman brokers?\" Clyde asked. If nothing else, he was intrigued by her idea. \n\n\"Eeehhhh, it's a tad more complicated,\" J.J. shrugged. \"He didn't send me, I'm a hired enforcer, same as these guys,\" she made a dismissive gesture at the group around her. \"Technically, he engaged the services of my boss, and my boss put me on the job to come and accomplish a certain outcome. How I get it done is up to me, and if we can work out a deal over that spider, it doesn't have to be violent.\"\n\n\"Violence?\" Clyde chuckled. \"You do realize you're notably outnumbered?\" he asked. \"Everyone one else here is a high level adventurer. I feel kind of sad for Boss Wyatt. I had 15 years to cultivate the trust and earn several favors from experienced adventurers before showed up. I'm afraid he doesn't have any idea what he's dragged you into.\" \n\n\"Look, I'd really like to take a better look at the spider...,\" J.J. said. \"So, I'll make this quick and easy,\" she snapped her fingers.  Nothing happened at first, but, after a few moments, a mass ruckus was heard as ever adventurer toppled over unconscious. \n\n\"You say you've had 15 years to culivate trust... he's still a crime lord. He exists in your world too, you think he's not paying for overpowered adventurers, like me? You think he doesn't know about mimics?\" J.J. kicked the stool next to her to make a point, it yelped, then moved down the bar to huddle with some other stools. His whole deal is twisting the systems in place to work for him.\" \n\n\"What do you want...?\" Clyde asked. He honestly hadn't considered those details. He was confident in his power; but, it never occurred to him Boss Wyatt would have access to everything he had access too. \n\n\"That's where things get tricky. I WANT to touch your spider. I'm here because I HAVE to do a job. I'm supposed to get you to leave, whatever it takes,\" she said. \"So, here's my plan. I set you up on a new Earth, as similar or different to this one as you want. You get to keep your bar, or make it even nicer, or do whatever you want on your new world. And, with you gone, I get to go tell my boss the job is done.\"\n\n\"A .. new Earth?\" Clyde asked with a tilt of his head. J.J. nodded.\n\n\"There's a multiverse out there and Boss Wyatt doesn't even know it yet. You can go on and live the life of your dreams while he is just happy to have this little slice of nothing.\"   If she hadn't put everyone else to sleep with a snap of her fingers, Clyde might have had more doubts. But, he was ready to believe her on the basis that his entire night had been weirder than expected. \n\n\"And all you want to do is touch this spider?\" Clyde asked. \"And you'll put me on a new Earth? Why??\" \n\n\"Well, first of all, I think you're making it a bigger deal than it is. You'll see how easy it is in practice and realize going to another universe isn't that special at all. But, I have something of unique talent,\" she said. J.J. place her hand on the bar with the palm facing up. \n\n\"I can summon more of any spider I've touched from other universes,\" she said. As she spoke dozens of small spiders crawled out of the pores in her palm in various colors. \"I've been to millions of universes, it's kind of a big deal for me to find a spider I haven't seen yet.\"",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1fpz6rd/wp_you_are_a_tavern_keeper_whos_been_in_business/lp1w9e7/",
        "score": 139,
        "date_posted": "2024-09-26 13:33:36",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] Your clairvoyant abilities have made you a famous fortune teller. People line up outside your door to ask questions about their future. One day for the first time you see someone who has no future.",
        "comment": "\\[Time for Privacy\\]\n\nFrancine was normal as far as anyone else knew.  It was her alter ego, Lucinda the Seer, that everyone lined up to see when she was working. Thanks in part to her gift itself, she successfully crafted a persona that no one would have ever associated with the mousey, quiet woman. Even emerging from 'Lucinda's Drawing Room', no one ever considered her more than another patron hopeful to learn her fate. And, she'd built the business with an intrinsic air of mystery so that she could walk out even if people suspected Lucinda was the only one in the room. \n\nThere was only one entrance that also served as the only exit, and there were carefully marked lines woven between a maze of curtains so that no one knew who was ahead or behind them. Any visitor to Lucinda the Seer could only stand in line and wait their turn without any other external indicators. When Lucinda closed for the day, people were turned away with no sense of how close or far away they were. It'd taken years for her patrons to fall in line; but, she always knew they would. By now, everyone accepted the system with the understanding that a woman who could see the future was allowed her quirks. \n\nIt was as simple as waiting a few minutes after her last guest, then putting a closed sign on the door and walking out, without the wardrobe encumbrance that was 'Lucinda'. \n\nHowever, it wasn't solely to keep her identity hidden. The way she structured the line so that she couldn't see anyone unless they were before her was a necessary part of using her gift. Francine was clairvoyant from a young age, and over the years of use, it seemed like her ability landed in a 'stuck on' position. She considered herself fortunate that she didn't actually 'SEE' anyone's future in the way she marketed it. \n\nFrancine could foresee the patterns of a person just by looking at them. There were no visuals, but it was more of a knowing. In the same way someone might see a cat playing with a balloon and knowing the most likely outcome, Francine extrapolated someone's future at a glance. She never sold it as anything more than possibility, and that was what made her business so successful. People didn't come to her just to know their future, they came to her to learn how to pick a better one.\n\nShe set up shop in a centralized location and she preferred to go out only late at night, and after a day's work. It was more likely that she'd see people she'd seen already, and the rush of sudden 'knowings' was more manageable that way. After closing, she walked out as Francine and headed to the market. Driving was a chore that wasn't worth it to her, and it was one more reason that she chose a centralized home downtown. She walked the two blocks to the grocery store happy to see only a few futures on the way.  But, as she reached the store, someone crossed the path ahead of her, and Francine froze. \n\nShe was a teenage girl with orange-highlighted white hair just casually skating by on rollerblades; but, Francine's mind went blank. She was used to knowing an uncomfortable amount of things about strangers that she never asked for and tried not to think about. But, she knew how to manage all that information, and she'd gotten better at ignoring things that didn't affect her. And, out of the dozens of futures she saw each day, it was nice to know that almost none of them affected her.\n\nThis was different. It wasn't that she didn't know the girl's future, it was like there was a complete lack of future altogether. The empty knowledge was so consuming, she felt like she'd forgotten her own name for a moment. It was like a black hole of time somehow that her clairvoyance couldn't seem to get a handle on. As if she was trying to actively think of 'nothing'. It was too powerful to ignore and she didn't hesitate to change course. Francine had to pick up speed to try and catch up to the girl on skates, and she even called out to her. \n\n\"Hello, excuse me!\" It was late and there weren't many people around. The girl seemed to know she was being called and spun into a stop as she turned to face Francine rushing up to her. \n\n\"Hi, can I help you?\" the girl asked. \n\n\"Hello,\" Francine smiled at her as she took a moment to let her breathing settle. She hadn't exerted herself for very long, but it was an exertion nonetheless. While her lungs caught up she took a glance around the block to make sure no one was in earshot at least.  \"I'm Lucinda the Seer...,\" she said. It was a big gamble to reveal her secret self after years of careful building; but, she needed to get the teen to understand as soon as possible. And, she hoped the years she spent building 'Lucinda' would work in her favor instead of giving away her identity. Lucinda had a worthy reputation, but the girl smiled. \n\n\"Hi Lucinda, I'm Quinn. What's up?\" she asked. \n\n\"You don't know who I am?\" Lucinda asked in Lucinda's voice. \n\n\"I'm just passing through,\" Quinn shrugged. \"I'm not from here.\" \n\n\"Oh,\" Francine was surprised and mildly disappointed. That would only make her revelation harder; but, she had to know more about Quinn.  \"Well, I guess that's not important, but I can see the future...,\" she said. And, again, she was surprised. She was already trying to determine how she could prove it if she couldn't see Quinn's future, but the girl smiled. \n\n\"Neat. So...  what can I help with?\" she asked.\n\n\"You don't believe me?\" It was a question because Francine honestly couldn't tell. \n\n\"I'm sorry,\" Quinn shook her head. \"It's not often I get to have a night to myself and do nothing. Does it matter if I believe you? What do you need?\" she asked. Her tone was dry and she made it clear she was ready to leave if Francine didn't need help. \n\n\"It kind of does...,\" Francine nodded. \"... I can see the future, but I can't see yours and I want to know why.\"\n\n\"Oh, Well, I believe you now,\" Quinn smirked. \"Why were you looking at my future?\" she asked. She accepted Francine's explanation and even engaged her with another question. She was willing to take a turn answering. \n\n\"I can't help it.. it's a gift... and a curse,\" Francine sighed.  \n\n\"Oh, bummer,\" Quinn nodded with a sincere tone. \"But, I guess that also answers your question,\" she said. \n\n\"Huh?\" Francine asked.  \"How?\" \n\n\"Well, you're not the only clairvoyant/psychic/fortune teller in existence, right? Some people can control it better than others, but there are plenty that still get nosy even with that control.\" \n\n\"You're... like me?\" Francine asked. But, Quinn shook her head.\n\n\"No, I'm just saying there are plenty of people like you,\" she said. \n\n\"I don't understand...,\" She was still feeling the effects of Quinn's unseen future and her mind was kind of clouded. \n\n\"Well, I mean, people are people...,\" Quinn shrugged. \"I'm not comfortable with strangers trying to pry into my future, so, I just keep my timestream on 'Private'.\".",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1fkst72/wp_your_clairvoyant_abilities_have_made_you_a/lnyjbj2/",
        "score": 2,
        "date_posted": "2024-09-19 18:06:17",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] \"This was really stupid of you.\" You said to your captors, \"you shouldn't have done this because,\" A loud crash could be heard as the security cams went down, \"my wife is here now\".",
        "comment": "\\[Georgia. Girded.\\]\n\nJoseph was in the dark. He woke up tied to a chair and heard movement as soon as he was conscious. \n\n\n\n\"Oh good, you're awake; this little show can start now,\" an almost friendly voice said. The only light in the space came from a set of four camera monitors ahead of him. He had a thick metal collar preventing him from looking too much in either direction and could only stare forward. Other than the faint light, the rest of the room was pitch black and he had no idea where he was, nor how large the space was. A young woman, maybe in her late 20s, walked closer to where Joseph could see her. She was short with a purple fauxhawk and a long black leather duster. As far as threatening supervillains went she was more of a common, edgy street punk than the usual walls of muscle that often gave Joseph trouble. She wouldn't stand a chance.\n\n\n\n\"This was really stupid of you..,\" he chuckled. \"You shouldn't have done this because,\"  as if on cue, a loud crash was heard in the distance, and Joseph smiled as all the security cameras suddenly turned to static. Joseph's wife, Georgia, was the planner in their marriage; he usually preferred to fly by the seat of his pants. But, it was funny to him. Even she couldn't have planned that moment better. \"... my wife is here now.\" \n\n\n\n\"Your wife?\" his captor asked the question with a smile in her voice, then she knelt down in front of his chair. \"You mean, The Glass Spider herself has come to rescue you the way she always comes to rescue you?\" \n\n\n\n\"You planned this?\" Joseph looked down and laughed harder at that. \"You're stupider than I thought!\" No one understood his wife's powers really, even if they knew her superhero persona. People tended to think she was just another spider-themed hero. They assumed wall-crawling was the extent of it, and her 'glass webbing' was the gimmick that made her dangerous. But, her true power was stronger and somewhat creepier. Even he had trouble coming to terms with it at first. \n\n\n\nHis wife, Georgia Glass, could summon spiders from within herself. She never fully explained it and he never wanted to know more. Georgia could summon spiders, massive swarms, and control them completely. \n\n\n\n\"I didn't plan anything, I'm just a hired hand,\" his captor shrugged. \"But...,\" she smiled and held both her palms out to him. \"...I think I'll be okay;I do have a way with spiders after all,\" she said. As she finished the statement, a dozen tiny white spiders crawled out of her empty palm, exactly the same way Georgia could do it. He'd even seen those white spiders before and he realized that was probably what was keeping him tied up. The small white ones had incredibly strong webbing. He was suddenly less sure about his wife's safety. But it was too late. \n\n\n\n\"I really wish you'd stop looking for trouble...,\" a new, familiar voice spoke up. \n\n\n\n\"Sorry dear!\" Joseph did actually regret it that time. Ever since Georgia became 'The Glass Spider', he'd been extra reckless. It was honestly entertaining watching her take down a squad of Super thugs to save him. He enjoyed seeing bullies get their due.\n\n\n\n\"Have you out in a sec,\" she said at the same moment he felt tickling legs crawling all over his hands. Meanwhile, his captor stood upright again and turned to face Georgia as she approached. Despite the darkness, Joseph could see the reflective outline of 'The Glass Spider's' costume catching the snowy static from the monitors as she came closer. \n\n\n\n\"He can go, it's you I'm after,\" the woman with the fauxhawk said.\n\n\n\n\"Then, come and get me!\" Georgia replied as an orange glow radiated out from her feet. Joseph watched with impressed awe as he realized they were flaming spiders. A whole swarm of ignited spiders rushed across the floor toward his captor almost like a lava flow. The villain in the black coat laughed and shook her head. \n\n\n\n\"I've had time to set up; I've already got you,\" she said. The woman snapped her fingers and light filled the room. It was as big as an airplane hanger with three giant pitch-black spiders already approaching Georgia. Each one was bigger than a minivan.\n\n\n\n\"NO!\" Georgia leaped up and launched a web to get to the roof, but her webline didn't stick to anything. Joseph had to lean back to look up and the ceiling was covered with smaller, shinier black spiders. He'd never seen them before, but it was obviously the reason why Georgia didn't get anywhere and landed back on the floor in time to be attacked. \n\n\n\n\"GEORGIA!\" Joseph felt his wrist bindings break and hopped to his feet to get to his wife; but, his feet were still bound and he landed face first on the ground. \n\n\n\n\"I said you could leave, you should,\" the woman told him. \"You can't save her...,\" \n\n\n\nEven as she spoke he heard his wife scream. He frantically tried to roll his body around to get a look at her because he couldn't lift his head and needed to be lying sideways to see her. Her screaming stopped by the time he found an angle that worked and all he could see was fragments of her costume and lots and lots of red. \n\n\n\n\"Georgia! GEORGIA!!!!\" he wriggled himself closer to the body while the giant spiders seemed to be done with their job, they all turned and walked toward the woman in black. \n\n\n\n\"Well, that's done,\" the woman said. His neck brace sprung open and the webbing on his legs dissolved. Joseph got up to run the rest of the way to his wife; but, there was almost nothing left except a wedding ring and some unidentifiable matter. \"I'd say see you around; but, I kind of doubt it,\" she giggled. \n\n\n\n\"I'll hunt you down!\" Joseph turned to yell at the woman. He realized he couldn't do anything then and there as he watched the giant spiders seemingly crawl into her black jacket from behind and disappear. \n\n\n\n\"You can try, I'm not even from this Earth,\" she waved at him as her jacket disintegrated into a swarm of black spiders to envelop her. The spiders took her to a different universe where she found Georgia waiting. \n\n\n\n\"Poor guy...,\" she shook her head as she sat down next to Georgia. \"I get that you wanted to fake your own death; but, did it have to be so traumatizing? That felt kind of crappy to him.\" \n\n\n\n\"It needed to be,\" Georgia nodded. \"Joseph's a nice guy; but, he's kind of dense sometimes. It was important for him to see it. And.. I'd be lying if I said I wasn't a little bit bitter,\" she shrugged. \n\n\n\n\"Once I became a Superhero, he thought he was untouchable and he went out of his way to find trouble so I could save him. If he thought I was still alive, he might keep doing it expecting me to come to his rescue even if we got divorced or separated. It'd be more dangerous for him,” she shrugged. “I know him, and he won't feel that bad for too long. And, now that I'm with the Court of Spiders again, I'm never going back to that Earth anyway.”.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1fv9bfb/wp_this_was_really_stupid_of_you_you_said_to_your/lq7orhk/",
        "score": 10,
        "date_posted": "2024-10-03 18:44:23",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You finally find the mythical lamp containing the All knowing genie who can answer any one question. Well prepared, you ask the one question you spent years on, “What answer would you give had I asked the perfect question if you had to restate the question in your answer?” ",
        "comment": "[Barley Answered]\n\nIt was perfect, obsessively so. Nadia wrestled with the wording for years after learning of the genie's existence. Wish granting genies were found as often as someone won the lottery; but, an 'All-knowing' genie who can answer any one question was a different situation entirely. She had already been trying to formulate the perfect wish as a 'just in case', hoping one day she might be that lucky. She changed her focus to try and come up with a flawless, informative question that would give her insight into the universe itself. \n\nAfter endless weeks and months, she'd finally crafted what she considered to be the ultimate question. She moved phrases around, changed the words and considered the meaning hundreds of thousands of times so that it couldn't be misinterpreted. Genie Lawyers were a common enough business, but she did not want to give away her idea, and she couldn't afford any of them anyway. Most of the time they required a cut of the wish; but, this genie didn't grant wishes, only knowledge. Still, even without their assistance, the wish was finally planned to perfection. And, as if the universe itself knew she was ready, Nadia finally found the mythical lamp containing the genie who could answer any one question. \n\nAlthough 'found' wasn't the best description. Nadia lucked into inheriting the lamp on a cool Wednesday morning. She had a regular habit of jogging along the beach at dawn before she got ready and headed to work, and she was never the only one there that early. There was a regular crowd of familiar faces every week, even if she didn't see them every day. That morning she saw one of those friendly strangers holding a very familiar lamp. The lamp of the All-Knowing genie wasn't the same golden oil lamp that the wish-granting genies usually had. \n\nA portly, young blonde woman in overalls was standing by the water holding something that looked like a tiny watering pail made of blue crystalline metal. And, she was winding her hand back about to launch it back into the ocean. \n\n\"WAIT!!\" Nadia dashed forward, and thanked her lucky stars it was someone she'd shared a smile in passing with most mornings. \n\n\"Hi,\" the younger woman did indeed wait and she relaxed her posture as Nadia rushed to her. \"Everything okay?\" she asked. \n\n\"Is that...,\" Nadia huffed to catch her breath. She wasn't out of shape by any definition, but it had been a sudden strain at top speed, and her body wasn't warmed up for that yet. \"... That's the All-Knowing genie!?\" she asked. \n\n\"Uhuh,\" the blonde nodded. \"I've seen you, my name's Barley,\" she smiled and shifted the lamp to one hand to offer Nadia a handshake.\n\n\"Nadia,\" she accepted the greeting. \n\n\"I'm done and I was just gonna throw it back; but, do you want it?\" she asked and offered the lamp. \n\n\"Really!?\" Nadia was shocked enough to ask the question even as she accepted it and took it out of Barley's hand.\n\n\"Sure, you're nice,\" Barley smiled. \n\n\"Thank you! Please don't think I'm rude, but I've been waiting a long time for this!\" she rubbed the lamp and blue smoke poured out of the end like water. It fell straight down without rising, yet it seemed to fill a solid shape like revealing an invisible glass. \n\n\"Sure,\" Barley giggled and stepped back, but only slightly. She was a curious person by nature. The smoke took the shape of scholarly gentleman standing upright on the sand. He wore a golden and blue graduation gown with spectacles that went well with his bushy silver beard. \n\n\"I am the -,\" he began, but Nadia interrupted him.\n\n\"I'm ready!\" she said. \n\n\"You see?\" The genie looked over at Barley, and the woman giggled with a nod. But, then, the genie sighed and set his gaze on Nadia. \n\n\"Speak your question.\"  Nadia had her phone ready. Sure, she memorized it, but there were to be no mistakes. Everything was perfect already and she needed to stick the landing. She'd put too much deliberation into each and every word to misspeak now out of pure nerves. She didn't risk wasting any preamble either.\n\n\"What answer would you give had I asked the perfect question if you had to restate the question in your answer?\" she asked. He smiled at her, and she heard Barley laugh a little bit more, but she was focused. \n\n\"This one matters most of all,\" the genie said. Then, he dissolved into smoke again and flowed back into the blue lamp. \n\n\"HEY!\" Something went wrong. \"THAT WASN'T A COMPLETE ANSWER!\" she yelled at it. \n\n\"It wasn't a complete question,\" Barley offered. \n\n\"YES IT -,\" Nadia was a nice person by nature. Sometimes she was easily distracted; but, in general she preferred to be pleasant. And, she was yelling at someone that had nothing to do with why she was angry. \"I'm sorry... but, it was,\" Nadia said with a softer tone. \"I put a lot of planning into that wish! It was complete!\"\n\n\"I'm not sure...,\" Barley shook her head. \"... but, you have given it a lot more thought than I have. Can you walk me through it?\" she asked. Nadia was still regretful about lashing out, and even more so when she realized Barley seemed to be on the 'simple' end of the spectrum. \n\n\"Okay,\" she nodded with a sigh. The frustration at her missed opportunity would return later; but, right now she could spare a moment for a friendly conversation. \"So, the genie knows everything right? And if he knows the answer to a question, he should also know the question that asks for that answer, with me so far?\" Nadia asked. There was a long enough silence for Nadia to listen to waves before Barley processed the information and nodded. \n\n\"The genie knows the answer and he knows the question, and so I thought up a way to ask the genie for both using a whole different question. And, that's the wish, 'what answer would you give had I asked the perfect question', gets the answer. And the part about, ' ...if you had to restate the question in your answer...,\" covers getting the question. Does that make sense?\" \n\n\"But, what's the question?\" Barley asked. \n\n\"The perfect one. The ultimate one, the answer to everything,\" Nadia answered. \n\n\"No such thing,\" Barley shook her head, then she shrugged. \"Perfect for what?\" \n\n\"What do you mean?\" Nadia asked. \"The genie knows perfect for what, he knows everything!\" She hadn't meant to raise her voice, and fortunately she realized it in time to calm down again. It was still a fresh nerve. \n\n\"Maybe, but I don't think that's how it works...,\" Barley shook her head. \"'Perfect' is subjective, your idea of it is different from everyone else's. And even then, there are infinity number of topics. You could have a perfect question about how to make good eggs, or you might have a perfect question about how to find meaning in your life,\" she said. \"There's no one universal perfection.\"\n\n\\n\\n\"But, he still gave me an answer...?\" Nadia asked. She could kind of make sense of Barley's points; but, the fact was her wish for knowledge was wasted as far as she could tell. \".. a useless answer I guess..?\" \n\n\"You said the genie should know what you meant by 'Perfect'.  Maybe he did? What question would you have asked him if you weren't trying to ask him the perfect one?\"\n\nNadia was glad for the conversation. Barley had given her an unexpected insight and it wasn't until that moment she realized it. She did have a perfect question in mind that she hoped was the one that got answered. She wanted the answer so badly that she lost sight of it to focus on getting all the words just right. But, Barley had accidentally brought it up. \n\n\"I want to find meaning...,\" Nadia said. She wanted the answers; she wanted to know the meaning of the universe, and more importantly, she wanted to know how, when, or where to find it. \n\n\"Well, that's not a question,\" Barley giggled. \n\n\"I know!\" Nadia raised her voice again, but it was more playful this time. \"That's the problem I had!\" she giggled along with Barley. And, the amusement somehow lined things up in her mind. She'd been going over the wish and her wants and even Barley's advice and the question just fell into place.\n\n\"What moments matter throughout my life, past present, and future...,\" she said idly as her mind worked. \"Which ones are important!\" the thought clicked. \"THAT'S WHAT I WOULD HAVE ASKED!\"\n\n\"Told'ya!\" Barley giggled. \"He totally answered your question.\" \n\n\"Damnit...,\" Nadia sighed. It was clear now. The genie knew she was making a mistake and that was the moment that mattered the most. Arguably, the perfect moment where everything could have gone differently.  \"But... he only answered part of it!\" \n\n\"The part you asked,\" Barley nodded with a smirk. \n\n\"But, that's not the whole context...,\" Nadia was arguing to make peace. The moment was gone, but she was still trying to let go and having Barley poke holes in her complaints was helping. \n\n\"You focused so much on the question you didn't say a thing about context. But, he gave you a great answer anyway,\" she said. \n\n\"I guess...,\" Nadia sighed. \"... but, it doesn't do me any good to know I messed up the most important moment in my life...\"\n\n\"When?\" Barley asked. \n\n\"Just now!\" Nadia said. She decided she was done and made a heaving effort to launch the lamp back into the sea as Barley was going to do. \"And, maybe he was right. But, there's nothing else I can do about that moment anymore,\" she said. \n\n\"Oh, I think you're still missing it a little bit,\" Barley giggled and shook her head. \"He wasn't talking about that moment that passed. He was talking about this one, right now,\" she smiled. \n\n",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1ga8cuy/wp_you_finally_find_the_mythical_lamp_containing/lte0vbp/",
        "score": 20,
        "date_posted": "2024-10-23 15:11:42",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] Lately you're family moved to a small town the countryside and made friends with a girl in your school who's very buff and she can be a bit weird at some points but you didn't really care until one night on a full moon you head to her farm and instead of seeing her you see a weird cow creature.",
        "comment": "\\[Noble. Effort.\\]\n\nMary chose to walk along the dirt road instead of getting a ride. It wasn't that she enjoyed taking the more difficult path; but, in this case, the positives outweighed the effort. It was a lovely autumn evening with a cool breeze and a full moon, and the straightforward path gave her time to think. Her new home was just up the road from her new friend's home. It was almost two miles away; but, by farming standards they were neighbors. \n\n\n\nMary never would have considered walking two miles in the city at night; but, this was a freeing experience for her. The whole move had been a pleasant surprise, and now, after the fact, she was glad she didn't have much of a choice in the matter. She made it known that she didn't want to move; but, she didn't have anything to keep her in the city. She didn't leave any friends behind, and in fact, after 14 years of life, she only recently connected with someone she would consider a 'friend'. \n\n\n\nShe met Bonnie within 10 minutes of stepping on campus for the first time, and the two were instant friends. Mary never had a friend before, and she initially worried about being too 'needy'. But, by Wednesday, she was realizing that Bonnie either seemed to be as needy or was just always happy to spend time with a friend. It was easier to believe the second reason, Bonnie seemed to always have friends around. It was off-putting to Mary's temperament to have so many people around; but, Bonnie always made sure to include her in the conversation.  By Friday, at the end of her first week, Mary was invited to join the others at Bonnie's for what they called their 'weekly meeting'. \n\n\n\nThey seemed to have a lot of strange 'in-jokes' that Mary didn't have any context for yet. Often times, there was a joke made in conversation that she understood, and thought it was funny; but, she felt like she was missing something. The rest of the group seemed to laugh harder than she did. And then, there were the more vague comments. Random discussions about other people or places that Mary wasn't familiar with, yet, her new friends would focus on her as if monitoring her reaction. Coming from her lonely, insecure background, it was almost easy to assume the worst. And, still, somehow, Bonnie made it even easier to trust her and the new friend group just by being herself.  \n\n\n\nMary enjoyed the walk, and thinking about her new friends as she approached Bonnie's farm. She was excited about her first ever sleepover; then, she saw movement. The excitement she'd never felt before gave way to a terror just as foreign and overwhelming to her. \n\n\n\nA tall, massive cow creature was charging at her, which was cause to be alarmed in its own right; the beast was running upright on two legs and swinging muscular arms forward and back for extra momentum as it stared at Mary with a determined gaze. But, there was more, and it was too much for the sheltered girl.  She saw the beast and her first thought was to try and escape; but, then it called her name. \n\n\n\n\"MARY!\"  that was when Mary fainted. \n\n\n\n\"I'm SOOOOOOOO SORRY!\"  the apology came as soon as Mary opened her eyes again, even before she got her bearings. \n\n\n\n\"What happened...?\" Mary realized she was on her back and she sat up to look around. She was inside a barn lying on a pile of hay with Bonnie sitting nearby. The door was open and she could see the rest of the group outside by a bonfire. \n\n\n\n\"I think I scared the crap out of you...,\" Bonnie giggled; but, she shook her head. \"I'm really sorry, I thought you were expecting it.\" \n\n\n\n\"Huh?\" Mary tilted her head at Bonnie with genuine confusion. \"Why would I be expecting to see a weird cow creature??\" she asked. \n\n\n\n\"Cow creature?\" Bonnie shrugged with a smirk. \"I mean,... I guess that fits for a minotaur.\" Mary could tell she was being playful and that helped to put her at ease. \n\n\n\n\"Excuse me for being too terrified to analyze the charging beast about to trample me,\" she replied and both girls got a giggle. \n\n\n\n\"Yeah, that's fair,\" Bonnie nodded. \"And, I'm sorry again. I never would've rushed to meet you in character if I knew you didn't have one.\" \n\n\n\n\"Is that an insult?\" Mary found it easy to be in Bonnie's company and ask questions she normally would've kept to herself. She trusted her new friend to be honest regardless of feelings. \"You're saying I don't have character?\"\n\n\n\n\"No, that's not it,\" Bonnie shook her head. \"We don't really discuss it at school; but, there's a game called 'The Alternet', have you heard of it?\" she asked. \n\n\n\n\"No, I don't even have a computer....,\" Mary answered. \n\n\n\n\"You won't need one,\" Bonnie grinned. She stepped forward and reached a hand out to help Mary to her feet. Once the girl was up again, Bonnie presented a clear glass card. \"This is called a node, and it's all you need to join the AlterNet,\" she said as she pushed it into Mary's hands. \n\n\n\n\"It's an MMO...,\" Bonnie started her explanation; but, Mary's eyes glazed over almost immediately. She had no idea about games at all. \"...well, never mind the details. Just jump in, do the tutorial and make a character. You'll have 30 races and 30 classes to choose from, then we'll show you some awesome sights,\" she gestured at the rest of the group still waiting outside. \n\n\n\n\"Wait...,\" Mary didn't know much about games; but, she was quick. \"You're saying this game is why you were a minotaur? How did it come to real life..?\" she asked. \n\n\n\n\"Okay, I think I can explain this for a non-gamer...,\" Bonnie nodded. \"I asked you about games and your response was, 'I don't even have a computer'. So, you understand the concept of 'platforms' right? Games that run on PC, or Console, or Mobile...?\" she asked and Mary nodded. \n\n\n\n\"Yeah...,\"\n\n\n\n\"The AlterNet consists of alternate Earths networked together by nanos; and, nanos are basically programmable atoms. So, it's not that the game 'came to life', the way to think about it would be, 'The AlterNet is a game, and reality is the platform.' \n\n\n\n\"Wait...,\" That was too much for a girl who was just unconscious a few moments ago. \"...alternate Earths...?\" she was trying to parse everything together and that was the biggest piece that didn't fit. \n\n\n\n\"Yeah,\" Bonnie grinned. \"I told you we'd show you some awesome sights. We'll take you to visit any Earth you can imagine.\" \n\n\n\n\"Then, go away and let me do the tutorial!\" Mary made an exaggerated, dismissive gesture at Bonnie. She trusted Bonnie, even if she had no idea what she was getting herself into. Whatever she was about to go through, she was sure of at least one thing. It seemed like the biggest lesson she'd learned ever since meeting Bonnie. She was about to tread the unknown again; but, she knew it would be worth the effort.\n\n.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1faiffz/wp_lately_youre_family_moved_to_a_small_town_the/llucvtg/",
        "score": 2,
        "date_posted": "2024-09-06 15:26:28",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You are a Fae working in a callcenter, \"Can I have your name please?\"",
        "comment": "\\[Power in Kind\\]\n\nOtis was 59 years old and he still had yet to learn to mind his own business. There wasn't any malice behind his old green eyes; but, he was of the mind that if he could help someone he should. And the idea that some people didn't need or want his help was another lesson he'd never registered. However, it helped that most people warmed up to him and welcomed his help once he got to know them.\n\nTwo years ago some very private neighbors moved in next to him, and he wasted no time in welcoming them to the neighborhood. The husband and wife couple were pleasant and courteous to the old man; but, tried to make it clear how much they valued their personal space. Old Otis didn't even notice and he went on to turn them into close friends over those two years. At some point, they revealed their true fae nature and Otis barely flinched. He didn't ask a lot of questions; he was intrusively helpful, not nosy, and the neighbors grew even closer. Then, they were moving away.\n\n\"We never asked you to keep our secret; but, you have just the same,\" John Farlane shook Otis' hand as they said goodbye.\n\n\"Well, you lovely folks chose when to share it with me, I can't make that decision for someone else,\" Otis smiled.\n\n\"You've been the absolute perfect neighbor, and as a thank you, the Missus and I got you a little something,\" he smiled as he handed Otis a platinum envelope with a dragon logo on it in the shape of a 'C'. He wasn't expecting a gift; but, he'd already hidden theirs with the luggage he helped load up. He didn't know if he should reveal it there, or let them find it by surprise as he intended. Luckily, John kept talking with the assumption that Otis wasn't giving them anything.\n\n\"Now, we weren't expecting anything in return, so just be the good neighbor you've been and accept our gift.\"\n\n\"You won't hear me argue,\" Otis smiled.\n\n\"But, just so you're not going in blind, I'll tell you. It's a Favor from Chroma Corp., like a gift card you can use for anything.\"\n\n\"Oh, wow...,\" Otis' smile dimmed slightly. He knew it wasn't a competition; but, his gift $500 gift certificate to the hardware store might as well have been a crumpled sheet of paper compared to what they gave him. He'd never done any business with Chroma Corp. himself, but John and his wife Jane, talked endlessly about how wonderful the company was for people in the Fae community. And if he understood everything they'd told him over the years, a 'Favor' from Chroma Corp. was a very big deal indeed. When John reminded him it could be used for 'anything', he meant it quite literally. Otis was essentially given a free wish and he had no idea what to say. \"... thank you!\"\n\n\"You're welcome. Take care, old man, maybe we'll see you around again,\" John and his wife Jane waved, then got in the car and drove away. Otis was old and the couple were long-lived, they understood the passing of time and the changing of relationships. Neither one of them felt like they were losing a friend, even if they never saw each other again. Otis went back inside his house and opened the envelope.\n\nHe expected a voucher and was surprised to see a transparent glass node slide out. John used his node often in front of Otis, and he even showed it off more in-depth once; but, Otis didn't have much interest in technology. It was as thin as a card and clear as air until he touched it, and then the time lit up. \n\nHe had a smartphone and John had said on several occasions that a node was just as simple. He ran his finger up along the surface and the screen changed. Once unlocked he found a platinum screen with a gold button that said, ‘Request Favor’. He pressed it and the display changed again. This time it said, “calling Chroma Corp.” He brought the node up to his ear and heard the tail end of a ring, then someone answered. \n\n“Thank you for calling Chroma Corp. customer service. My name is Eury Argyris, representing Chroma Corp. Can I have your name, please?”\n\n“Is O-,” Otis caught himself before he gave it away. John and Jane did warn him often about giving his name too freely to any Fae. They were sticklers for wording and loved to enforce a good contract. \n\n“I'm afraid that's not bringing anything up, could the account be under another name?” Eury asked. \n\n“I don't have an account, this is my first time calling,” Otis said. \n\n“Ah! I see, you're not a regular client. Are you calling in to redeem a favor?” Eury asked. \n\n“Maybe,” Otis replied. “I was just calling for info. I'm not ready to cash out yet, but I wanted to find out what I could get when I do.”\n\n“I understand,” Eury said. “If you received a favor, then you are already in the system. Many new callers unfamiliar with Chroma Corp. are hesitant to give their names due to popular stories about Fae stealing them to gain power. Let me assure you that we at Chroma Corp. do not engage in those sorts of activities. We are a modern corporation with modern practices and standards. We value all our clients regardless of their background. We only use your name for organization and business purposes and, if you like, I can forward the service agreement to your node for your own research. But, I will say a Favor from Chroma Corp. isn't given lightly. Without giving away too much, I can say that if you trust the person you received it from, that should also apply to the company.”\n\n“No, I don't need the agreement, thank you,” Otis replied. “My name is Otis Granger,” he held his breath as he gave it. \n\n“Got it right here,” Eury replied after a few key strokes. “You're entitled to one  ‘Celestial Favor’, that's basically anything you want,” she said. \n\n“Anything like what?” he asked. It was too broad, he needed some guidelines. \n\n“Literally almost anything,” she giggled. “You can ask for a personal, in-person wake up call for the rest of your life or if you want up move to a completely new Earth, we'll arrange that for you. The ‘almost’ is for anything regarding aliens, they don't exist. But, anything else is yours to ask. This is a high-level favor, you must've been really nice,” she added with an apparent smile in her voice. \n\n“I don't think so, but I try,” Otis normally wouldn't have accepted the compliment so easily, but he was mildly distracted. “Did you say different Earth?” he asked. \n\n“Chroma Corp. serves millions of parallel Earths, and you're welcome to move to any of them.”\n\n“Millions?” he asked. It was almost impossible to comprehend. \n\n“Hundreds of millions if you want to be more precise,” Eury replied. “Hundreds of millions of Earths with a version of you on almost every one. If we were interested in trading names, there's a decent chance we'd already have yours.”.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1fcp1bj/wp_you_are_a_fae_working_in_a_callcenter_can_i/lmcua8k/",
        "score": 10,
        "date_posted": "2024-09-09 19:24:59",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] The final battle between you and the Demon Lord has come... And it's a dance battle! Can your skills match your sworn enemy? Will the music be epic? Fulfill your destiny, oh Chosen One of the Dance Floor!",
        "comment": "\\[Stellar Moves\\]\n\n\"...and according to the archive, the secret door is right here...,\" Geonara held the borrowed book out toward the solid stone wall, and it shimmered before revealing a large iron door. She and her teammate, Pavette, were there to take down the Demon Lord. They were behind the castle at Geonara's advice. It wasn't particularly challenging and Pavette thought she could have made it solo. But, bringing Geonara along helped her skip all the patrols and go straight to the throne room. Even while still outside the main walls, the door would lead them straight there. Geonara's abilities as a Librarian allowed her to fudge some details of the quest. She couldn't assign an easier target; but, she could manipulate where they found the entrance. \n\n\n\n\"Thanks,\" Pavette nodded at Geonara, then pushed the large door open. \"After yesterday's disaster, I'm not up to dealing with all the trash on the way,\" she added as she stepped into the throne room just beyond the entrance with Geonara close behind. \n\n\n\n\"You don't need to do this one today..,\" Geonara offered. \"If you wait, we can come back during the week with the whole team and do it right.\" \n\n\n\n\"If I wait, Eph might sign us up for another challenge,\" Pavette grumbled.  She'd come to a stop a few feet away from the Demon Lord's throne so that she wouldn't engage the encounter yet. \n\n\n\n\"Well, still,\" Geonara giggled. \"It's not like we can lose last place at this point.\" Despite her mood, that made Pavette smile too. That was the real reason she'd brought Geonara along. There was another girl on their team too, but Pavette felt she and Geonara were more on the same wavelength. And, Eph, the team leader, made it difficult to make friends outside the group. \n\n\n\n\"Eh, we're already here,\" Pavette shrugged. \"Can you do anything about the drop so we only have to do it once?\" \n\n\n\n\"Not without the quest, and not without killing him at least once,\" Geonara shook her head. \n\n\n\n\"Oh, well, maybe we'll get lucky,\" she nodded and drew the neon blue crystalline gun holstered on her hip. \n\n\n\n\"Oh wait!\" Geonara interrupted as Pavette took a step toward the Demon Lord. \n\n\n\n\"I can change the battle. Want to try that?\"\n\n\n\n\"Change it how?\" Pavette asked. Geonara shrugged.\n\n\n\n\"The story prompt for the party just says: 'An unexpected Battle takes place'.\"\n\n\n\n\"Sure,\" Pavette nodded, but she kept her gun ready. \"Let's find out.\" \n\n\n\n\"The party eventually found their way into the Demon Lord's throne room to find him waiting patiently. He had been ready all along...,\" Geonara began reading the story, and she motioned Pavette forward. \"...as the brave intruder approached, the Demon Lord jumped to his feet.\"  The Demon Lord did exactly as she said and glared down at Pavette.  \n\n\n\n\"And then...,\" Geonara tilted her head as she continued reading. \"... the music started.\" Pumping music filled the throne room and spotlights came on as the main lights dimmed. Geonara giggled. \"... it was a Dance Battle.\"\n\n\n\n\"DANCE BATTLE!!!\" The Demon Lord yelled raising his arms in challenge. \n\n\n\n\"I don't know how to dance!\" Pavette yelled. She holstered her gun and looked at Geonara for advice. Meanwhile, the Demon Lord was shimmying and gyrating his way down the steps for his first volley of fresh moves. \n\n\n\n\"Uhh,\" Geonara nodded and read through the details. \"Oh, you don't have to, it's based on the Dancer class,\" she said. \"That's what we're here for, right?\" She asked. \n\n\n\n\"Oh, I think we got lucky!\" Pavette nodded with a giggle. She was a Spellslinger; but, her Specialization allowed her to use certain skills from other classes, and she was after one from the Dancer class. Now that she knew what to expect, she waited her turn as the Demon Lord flailed in front of her. \n\n\n\nTechnically his kinetic assault was inflicting damage; but, it wasn't a lot and there was nothing she could do until her turn anyway. If things went well, the Demon Lord wouldn't get another turn. The music continued to pulse and after a supernatural spin, the Demon Lord pointed at Pavette with a long bony finger. \n\n\n\nOn cue, purple stars took shape in Pavette's vision. At first, they appeared far away almost on the other side of the throne room; but, each beat drew them closer and closer in a staggered fashion. With her ability to equip skills from other Classes she researched plenty of them, and the Dancer intrigued her most of all. She was curious enough to learn how they play on the track and to her surprise they didn't have to dance at all. To keep Auras active on the track all a Dancer had to do was touch certain targets that only she could see. Of course, the challenge was to touch them in time with the beat. If she missed the timing it would ruin her combo progress.\n\n\n\nPavette tapped her foot to keep up and as the first set of stars reached her she moved her hands to make contact. She didn't have to move her body too much, for the most part the stars were heading right to her. \n\n\n\n\"Augh, Ugh, Ouch,\" The Demon Lord complained with each successful move that Pavette completed. As she made flawless progress two glowing stars appeared at the back and moved toward her. One was glowing gold and the other red. They were both the last move and she would have to choose one to finish her turn. \n\n\n\n\"Oh! Do the attack!\" Geonara spoke up as soon as she noticed the option in her book. \n\n\n\n\"'Kay,\" Pavette nodded. Geonara started to read. \n\n\n\n\"The Chosen One's travels were arduous and only strengthened the warrior. The Demon Lord was no match for the Hero's funky flow. On her very first showcase, the Chosen One left the villain razzled and dazzled; and, after a perfect set, she finished with fiery flair!\" Geonara read it as Pavette his the red star to trigger the attack. \n\n\n\n\"NOOOOOO!\"  The Demon Lord cowered as a giant burst of flame erupted around him. The flames grew brighter and hotter for a moment, then faded away completely leaving nothing but ash. Pavette glanced down and a golden skill gem was buried in the pile.\n\n\n\n\"Got it!\" she giggled. \"Thanks a ton!\" she smiled at Geonara after she collected the loot. \"I was kind 'meh' coming in, and I didn't think it'd be over this soon. But, we're done and I'm feeling better,\" she smiled. \"You got anything you want to do?\" \n\n\n\n\"Well...,\" Geonara nodded. \"I don't think it would help the team all that much; but,... after this quest I kind of want to try Dancer too,\" she nodded. \"But... first I need to unlock the Princess specialization; will you help me with that?\" \n\n\n\n\"Sure,\" Pavette nodded. \"I don't know how, cause I chose it when I made my character; but, let's go find out,\" she smiled.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gd7afu/wp_the_final_battle_between_you_and_the_demon/lu2qguk/",
        "score": 1,
        "date_posted": "2024-10-27 17:26:37",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] When you are rescued by known to be malicious entity, but, for the benefit of both. Well, the best way to put it is, life really knows how to change it up.",
        "comment": "\\[Ride. Wild.\\]\n\nNorton was suddenly awake with the sound of a buzzer. It wasn't an alarm clock, and he was, unfortunately, not in a bed. It had a long, drawn-out call as if signaling the start of something; and, it came from a distance. From somewhere further than Norton could see from his cage in the middle of a forest. It didn't take long to get his bearings in the unfamiliar cramped space and he instead focused on seeing what he could learn about what was outside.\n\nIt was day; but, he had no sense of time. Plenty of light came in; but, his confinement, and the dense trees prevented him from getting a clear look at the sky. The forest seemed unusually quiet as far as he could tell. There was no sign of stray critters or even a hint of a breeze. Everything was perfectly still, and he decided that he at least had time to think. \n\nHis mind was foggy, and he had no idea how he ended up there. Had it been a night of drinking? Did he even drink? He was so clouded he couldn't even assess the type of person he was. Fortunately, before his mind began spiraling into an existential crisis, something happened. And, he was too terrified to worry about that.\n\nHe heard movement approaching. Norton turned with hope and immediately pressed himself against the back of his cage. A towering beastly werewolf was running toward him, which would have been a shock on its own to anyone. This particular werewolf was wearing a white leather duster with a white cowboy hat and he was wielding a shotgun. His mind was having trouble processing it. Was it real? Was he? Maybe he was dreaming. As his panic threatened to overwhelm him, something new happened again. A horde of zombies ran past Norton's cage from behind him and engaged the werewolf. The last he saw of it were colorful puffs of what seemed to be magical smoke as dozens of zombies, and a couple of larger abominations took on the werewolf. \n\n\"Hey, you okay?\" Norton had just enough shock left in him for one more gasp of surprised terror. He spun around, and again tried to retreat in the small space when he saw the speaker. Norton didn't know his name; but, the blue-haired necromancer was known somehow. Like a distant memory of a passing conversation, he knew the stranger was a necromancer, and a malicious entity. He was so befuddled by the recent happenings and his lack of memory, that he registered the man as a threat even before realizing the zombie horde was likely his.   \"ARE. YOU. OKAY?\"  The necromancer asked again. Was the necromancer helping him? \n\n\"Yes,\" Norton nodded. \n\n\"Great,\" the caster smiled. A genuine, surprisingly warm smile. \"You want to get out?\" \n\n\"How do I know you won't turn me into one of your horde?\" Sure, maybe it was a genuine smile, but Norton knew better than to trust a stranger's smile. \n\n\"I don't need to let you out for that,\" the necromancer chuckled. He didn't seem the least bit offended at the insinuation. \"I'm asking you if you want to get out. Do you want to wait and see if the werewolf will give you the same chance?\" \n\n\"No, please.  Let me out,\" Norton said. \n\n\"Okay,\" the blue-haired teen nodded. Did he always look that young, or was it that Norton wasn't scared of him anymore? \"Come on then,\" he said. He didn't do anything other than give Norton permission.  For the first time since he woke up, Norton tried pushing the cage open and it glided open as easily as a swing mid-flight. \"Let's go,\" he moved back to encourage Norton to step out; but, he didn't. \n\n\"Why are you helping me?\" he asked. He realized he was missing information and no idea what to do with that knowledge. This couldn't have all been happenstance. He woke up in a  forest and being fought over within minutes. It all felt so random from his perspective; but, there had to be reasons. And, he was determined to find at least one of them. \n\n\"I like helping people?\" the necromancer shrugged as he asked the question. He wasn't being coy about it, Norton felt like he was deliberately being asked if that was the right answer. \n\n\"That can't be all...,\" Norton shook his head. It felt like the right answer; but, even if these were going to be his last minutes, they were going to be on his terms. He would stand there and ask questions until the werewolf broke through if he had to, in order to get a satisfactory answer. \n\n\"Well, it helps me too, obviously,\" the necromancer chuckled. \"I'm not going to turn you into a zombie or anything. But, you could say I get 'points' for rescuing you. Secret necromancer stuff that I can't explain; but, the main idea is this deed earns me a bit of recognition with the right people.\"\n\n\"And, I have to be delivered alive?\" Norton asked.  He glanced back at the commotion he'd been desperately ignoring.  The werewolf was closer now; but, still struggling through a shrinking crowd of bodies. \n\n\"You're alive,\" the necromancer gestured at him. That made sense to Norton. If dead delivery was an option, the necromancer could have just killed him and made him walk. \n\n\"Okay, let's go,\" Norton nodded. He found an answer he was comfortable accepting and stepped forward out of the cave. He set one foot down; but, his ankle gave out as he shifted his weight for the next step. \n\n\"Ow!\" He tumbled down but managed to soften the impact with his hands so as not to land face-first. He rolled over to look for help from the necromancer he once knew to be malicious; but, he was walking away, with his zombies. \n\n\"No! Wait!\" He turned back in a panic expecting the werewolf to be ready to leap, only to see a blonde-haired teenager in a white duster and hat walking away. Norton was forced to fall upon his back again as he lost core strength. He was growing weaker, and it never occurred to him to wonder why. He was left with nothing to do but face up at the green leafy dome that was his sky. And, part of him felt at peace with that. He had no idea what just happened. He couldn't remember any of his life from before; but, objectively, he couldn't complain. Maybe he would only have the few minutes to remember; at least it was a wild few minutes. He chuckled to himself, mentally, as he wondered what it all meant. And, he could only come to one conclusion. \n\n\"*Life really knows how to change it up*...,\" he thought about smiling. He wasn't sure his mouth was there anymore. And, as his vision began to fade, it felt like he got a glimpse of something. He knew it answered his questions; but, he also knew he didn't have time to piece it together. So, he just stared up at the treetops, and the floating golden text that appeared as he faded away.  \n\n\\[+1 pt - Sharp Riders\\].",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1f9ofkp/wp_when_you_are_rescued_by_known_to_be_malicious/llnislc/",
        "score": 2,
        "date_posted": "2024-09-05 12:43:12",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] \"Beware, although powerful, this cursed artifact will devour riches in accordance of it's effects whenever you use it.\" Well, if it doesn't state MY riches...",
        "comment": "[Rich Interpretation]\n\nFerris was only there out of curiosity. He had no way to quantify it; but, he was convinced he had the absolute worst luck in the world. For some reason, nearly everyone he met was rude, if not outright antagonistic. His financial situation wasn't ideal, and rude strangers meant he didn't have anyone he could really depend on as a friend. It was only 8:30 in the morning, and he was already thoroughly bitter at the world. Although, given his luck, it was hard not to be. But, as he stood there waiting to cross and continue his walk to work, a small shop materialized in the empty lot next to him. He felt lucky for the first time in his life. And, it was about time too, the universe certainly owed him. \n\n'Accursed Consignment' wasn't a normal store, and they capitalized on that. Any minute now, a post would go out on social media to tell everyone where they were located for the day. Ferris was there when it arrived and he hurried in to try and beat the rush. It appeared in his city pretty regularly; but, he'd never been a position to visit. And, the few times he considered it, he always assumed it would've been packed with people out to get their own magical items. But, this time was different. He was the first one there and he went in without hesitation. \n\nHe knew he was risking his job; but, it didn't matter. His boss was always on him about something anyway. Ferris had only been late a dozen or so times over the course of months. And, he quickly learned to keep his thoughts in his head; he only had to visit HR twice. The timing was too perfect. He knew his luck was about to turn around and he'd find just the thing in the shop so that he never had to work again. \n\nThe bell jingled against the door as he walked in, and he was pleasantly surprised by the shop's interior. He expected a pawn shop environment with glass cases and display racks and that was what he found. Yet, it was all so much more elegant than he expected. The white tile on the floor was spotless and it almost seemed to be glowing. The walls were decorated with deep red wallpaper and all the display cases were formed out of black wrought iron to keep the items contained. A slender, pale gentleman was seated behind the main counter reading a thick book, and he looked up at the sound of the bell with slight confusion. Then, he jumped to his feet when he noticed Ferris. \n\n\"Guess you weren't expecting anyone this early, huh?\" Ferris chuckled at the man being caught relaxing on the job. It identified the hapless clerk as either lazy or new, and he was already planning how to take advantage of that come negotiation time. Of course, Ferris did sit down at his job, but he was doing hard work, usually, and not just playing with magic trinkets. \n\n\"No...,\" the clerk chuckled gently with a shake of his head. \"I was not. You're the first customer,\" he said. \n\n\"Darn right I am,\" Ferris chuckled. \"I want to pick out the best thing you've got quickly before the rush gets here; what can you show me that'll get me rich?\" he asked as he reached the counter. \n\n\"I have quite a few items...,\" he nodded. \"...however, I must ask. You do know everything here is cursed, correct?\" \n\n\"I'm not an idiot,\" Ferris chuckled with a shake of his head. \"it's in the very uncreative name, I know they're 'cursed',\" he gestured with air quotes. \"That stuff only works if you believe in it, so show me what you've got.\" \n\n\"I don't mean to question your intelligence...,\" the clerk shook his head. \"It is merely a formality of the job. It's important to establish you're aware of the danger. You can't only believe in part of a curse; if you think it'll make you rich then the negative components work too..,\" he said. Curses were more complicated than that, but by now he knew Ferris was determined. So, he only said the things that needed to be said. \n\n\"I think I'm smart enough to tell the difference,\" Ferris nodded. \"I want to be rich today, by lunchtime would be great.\"\n\n\"Well, if you want something quick and easy...,\" the clerk reached into the display to pick up a red poker chip with a decidedly demon figure etched on the front. The clerk showed it to Ferris, and flipped it over to show the pitchfork and tail on the other side. \"... I call this one the 'Blood Token', he said. \"It's the ultimate rabbit's foot, if they were really lucky. Use this and you'll win any game of chance from a simple coin flip to scratching lottery tickets.\" \n\n\"Alright,\" Ferris nodded. It was time to put his negotiation plan into effect. \"So, your shop can appear magically out of nowhere; but, that doesn't mean I'm going to believe everything you tell me. Can I try it out first? Get some proof or something? Do you allow returns when it doesn't work?\" \n\n\"I haven't even told you how it works yet,\" the clerk chuckled and nodded. \"I've only told you what it does. However, I've got a good feeling about you. We don't normally accept returns once you leave the shop. But, I'd be glad to let you test it out before walking out the door. If it doesn't work to your satisfaction, I'll return your money.\" \n\n\"Yes! Oh wait, hold it for me!\" Ferris had a new plan all of a sudden. \"I forgot my wallet, be back in two seconds!\" he added as he dashed out the door. It was a lie; but, he bought himself enough time to dash into the convenience store next door before coming back. \n\n\"I'll take it, how much do I owe you?\" He made a show of opening his wallet to show off several hundred dollar bills. It was the majority of his savings; but, he kept it in his wallet just so anyone that sees him opening it gets an eyeful. He hoped he had enough for the token, he didn't have much more. \n\n\"$5.00 please,\" the clerk said. \n\n\"Five... hundred??\"Ferris asked. He couldn't have heard the clerk properly.\n\n\"No, just five dollars. If you have singles, that'd be great,\" the clerk said. \n\n\"You're kidding...,\" Ferris handed him a $5 bill, and he received the red token in exchange. \"It can't be this cheap, why is it so cheap?\" \n\n\"They're cursed...,\" the clerk laughed. \"If I could give them away, I would. However, they can only change owners via a transaction. $5 is just enough to not be nothing. Now, before you go testing it, I have to tell you how it works. Sorry, this part's also a little formal, curses are weird,\" he chuckled, then cleared his throat. \n\n\"Beware, although powerful, this cursed artifact will devour riches in accordance of its effects whenever you use it,\" the clerk said. \n\n\\n\\n\"Hey, you gave me the wrong thing!\" Ferris held the Blood Token in one hand as he dug into his pocket for a quarter. But, it was no longer red and instead became clean, soft white. \n\n\"It has a new owner,\" the clerk nodded. \"I feel like it won't be obvious to you, it'll change color back to red the more you use it,\" he added. \n\n\"I need to try it out,\" he said. He held his palm out to show the clerk a quarter. \"Call it in the air,\" he flipped it up, and the clerk chuckled. \n\n\"Heads,\" he said with a smile. \n\n\"Tails!\" Ferris was more ecstatic than he anticipated when he revealed the tails side up. It was a simple 50/50 chance, but he was confident the token did its thing. Still, he had to be sure. \n\n\"Again!\" he said and flipped it upward when the clerk nodded.\n\n\"Tails,\" the clerk replied. \n\n\"HEADS!\" Ferris cheered. \n\n\"ONE MORE!\" He didn't wait for the agreement and flipped the coin. \n\n\"Tails,\" the clerk repeated his previous guess. \n\n\"HEADS!\" He literally jumped for joy, like a school girl. He was excited he'd been right three times in a row; but, there was more to it than that. He had a guess about the rules of the artifact, and he looked at it to be sure. There, in the center of the perfect white token was a tiny red speck. It had worked. It was doing something, and he still had his quarter. \n\n\"I was right!\" he said with joyous glee. \"You're right though, curses are weird,\" he chuckled. \"You read the rules so formally, I knew there had to be a loophole! And, I thought to myself...,\" he was interrupted by an unexpected sigh, followed by a yawn. The excitement, and the jump especially, must have tired him out. He wasn't a young man anymore, that was for sure. But, his life would be easy from now on. \"...Well, if it doesn't state MY riches...,\" he let the thought trail off as he yawned again. \n\n\"That's a very clever interpretation,\" the clerk nodded. \"I take it you're satisfied with your purchase?\" \n\n\"Not yet! I .. uh, I just happen to have a scratch ticket on me, I've gotta try it out!\" Ferris answered as he dug the ticket out of his pocket. \n\n\"Since you're still in the store, I am required to advise you against doing that. You don't realize what you're doing,\" the clerk said. \"And, now I've advised you against it,\" he smiled. \n\n\"I like you,\" Ferris chuckled. \"When I get rich, maybe I'll buy you hot date,\" he said as he gripped the token and began rubbing off the silvery mess that was hiding his fortune. \n\n\"Two '7's' isn't much, plenty of tickets like to fake people out. But, if I get this third '7', I'm an instant millionaire!\" He paused to take in the moment that would change things forever. He scratched with his eyes closed, and then when he thought it was clear enough he opened and looked down. His knees instantly went weak and he lost his balance to collapse on the floor. \n\n\"Infinity.....wildcard????\" He couldn't even be bothered to feel embarrassed about being on the floor. He stared at the ticket just to be sure. He was so focused on getting three sevens, that he completely forgot about the higher prizes, and he found the top one. Any two numbers with an infinity wildcard paid the jackpot 1000 times. Along with the two sevens he already uncovered, he was now a billionaire. \n\n\"It's amazing!\" Ferris brought the token up to his lips to give it a kiss; but, it had changed. And, it was still changing. The red speck had bloomed to be about the size of his pinky nail, and the red seemed to be spreading out even as he watched it. \n\n\"Whoa... someone's losing a lot of money...,\" he chuckled weakly. The excitement had left him winded, and, he was now rich enough that he didn't care what anyone else thought about him being on the floor. He could nap there if he wanted to. He considered it. But, he wasn't quite that far gone into his ego yet. He didn't want to inconvenience the wonderful clerk at least. \n\n\"Hey, man. You got a couch or an office I can lay on for a few minutes? I'll give you a million bucks when I cash this in,\" he asked as he looked up at nothing. He heard footsteps as the friendly clerk walked around the counter and loomed over him. \n\n\"I apologize, my office isn't big enough for a desk, much less a couch. Although...,\" he nodded. \"...I know where you can rest. Before that, though, I'm curious about how you imagined that loophole so quickly. These are ancient objects created with magic and spite; what made you think it was limited to your riches?\" \n\n\"Heh, that's the secret. I NEVER thought it was limited to my riches. I was thinking outside the box from the very beginning,\" he said. It was a lot of talking. He paused to catch his breath, and he blinked a few times to try and clear the spots that started appearing. He'd never been this excited in his life. \"And, I proved it when I kept using the same quarter; it never took my money.\" \n\n\"Yes, forgive me. I could've asked that better. What I meant was, what made you think it was limited to your definition of riches?\" he asked. \n\n\"Huh?\" That question was harder than it should've been. Ferris' mind grew hazy. He couldn't remember why he was on the floor; but, that was okay. He was really excited about something. Everything was great. \n\n\"It is amusing though,\" The clerk chuckled as he looked down on Ferris. \"It didn't state your riches; and, it has no interest in whatever it is you think constitutes 'riches'. It's a cursed item, it knows what it wants,\" he reached down and plucked the red token out of Ferris' hand before it got cold. \"You never even asked why it's called the Blood Token,\" he chuckled as he turned to walk back to his seat behind the counter. Someone was already on the way to clean up the mess Ferris left behind.\n\n",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gsxvzz/wp_beware_although_powerful_this_cursed_artifact/lxiorj7/",
        "score": 10,
        "date_posted": "2024-11-16 19:32:23",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You, a powerful superhero, stand trial for very horrific crimes that has shocked the nation. Nearly the entire public and your fellow superheroes support you believing you are innocent and the charges are false. But, you are in fact guilty of all of them. ",
        "comment": "\\[Time In. Time Out.\\]\n\n\n\n“I got away with it…,” Steel Bullet laughed to himself as he said it out loud. There was no one around to hear him. Not on the windy, frigid mountain peak. After the trial was dismissed, he asked for some time alone and everyone thought they understood. It was a reasonable request after the constant attention. What none of them knew was that he wanted to celebrate because everything had gone his way. \n\n\n\nSteel Bullet the hero had murdered literally thousands of people by now, and that only amounted to a few charges out of the dozens brought against him. He had plenty of vocal support in the league, and a strong case in the court of public opinion. There were cheers in the streets when the judge dismissed the case on the grounds that he was a certified hero doing his job, and he couldn't be expected to control collateral damage from villain attacks. No one could prove he watched and intentionally let buildings fall on people. No matter how often it seemed to happen.\n\n\n\n“I should change it up a bit though…, “ he realized there would still be some scrutiny on him in the short term at least.  “...maybe take a break altogether.” He knew he wouldn't, but it was the thought that counted. For a brief instant, he considered changing his ways even if only temporarily. He might have gotten away with it, but could he really keep pushing his luck like that? After the short thought experiment, he decided that yes. He was after all, invincible. And now that included the figurative sense too. \n\n\n\nThen, as soon as his commitment to violence was renewed, he blinked. Something about that particular time felt different than the dozens of other tones he'd already blinked just facing down the cold, biting wind. He couldn't put his finger on why it was different other than the fact that he noticed the action. And, of course, the teenage girl with white and orange hair that stood in front of him when he opened his eyes. She wasn't there when started the blink. She introduced herself before Steel Bullet could ask anything; but, not before he realized he couldn't. \n\n\n\n“Hi, I'm Quinn, and I don't want to be here, so we're going somewhere warmer,” she made a dismissive gesture at him, then he blinked again. This time, he opened his eyes to see a golden sunset taking place behind Quinn. The sun was resting on the ocean horizon, and he could hear the gentle waves. “This is much better…,” she nodded.  “So, you probably have questions, and you've noticed you can't ask them.” He tried, unsuccessfully, to nod at least. His body refused to follow his instructions. \n\n\n\n“Chroma Corp. sent me to deal with you. I haven't decided how to do that yet. I know, I know, you've never heard of Chroma Corp., right?“ she asked rhetorically. \n\n\n\n“The short answer is they are the corporation that paid off the judge to dismiss your case. The reason they did that is because you're stupid guilty and basically a horrible person,” she giggled at him with a smile. It was the first time she'd shown any warmth toward him and it was an insult. \n\n\n\n“So, the issue is Chroma Corp. is about to buy up the Super League on your Earth, and your demented hobbies are nothing but bad press. I'm gonna let you talk now, if you're willing to be calm and civil about it. You with me so far?” she asked. \n\n\n\nSteel Bullet felt like he had his voice again. He could wiggle his fingers and even feel the warm breeze on his skin. He hadn't noticed it until that moment, and he didn't waste any time. As soon as he was sure he could move, he flew forward at top speed determined to put a fist through her head. He chose his name because instant acceleration was the main aspect of his super power. The super strength and steel-tough skin were more like bonuses. But, despite how fast he moved, somehow he still had time to blink in mid-flight. \n\n\n\nWhen he opened his eyes his fist was a half inch away from Quinn's sparkling orange eyes. \n\n\n\n“Well, I guess that makes things simpler for me,” She shrugged. “Thanks for helping me choose the best way to deal with you. But, uh…,”  she glanced around the beach. “Not here.”. \n\n\n\nSteel Bullet blinked again and they were somewhere else. A dank, dim cave. It would have been pitch black if it wasn't for the digital clock affixed to the cave wall directly in his view with glowing orange numbers. Though. It was only four zeroes on the far right on the long clock, completely off center on the display. \n\n\n\n“So, you probably haven't figured it out yet, but I can control time. Right now, I've time-locked your entire body. You don't even have to breathe, but I'm letting your mind, eyes and ears still work so we can have this conversation. Every time you blink, like so…, “ he blinked as she made the comment. “...this timer will show you how much time you missed.”  she pointed at it and the time now read ‘00:14’.  “That's fourteen seconds. Or, we can go longer. \n\n\n\nThis time he opened his eyes and the timer said, '02:39’. \n\n\n\n“Got it? Good,” Quinn giggled.  “So, here's the punishment, I'm gonna give you time to think about what you've done. I'm going to leave you here for a little while, no idea how long,” she shrugged. “Don't worry you won't die or anything.  But, I want you to really take it slow and THINK about the things you've done. So, I'm going to force slow thinking… like this.”\n\n\n\nSteel Bullet blinked and opened his eyes 10 minutes later according to the clock. \n\n\n\n“Randomly. Every now and then, your time will stop fully. And a random amount of time will pass before it starts again. I think that's all the effort on want to put onto this, so I'm leaving now. I've given you the basics on how it works. Good luck! “ Quinn waved with a smile.\n\n\n\n“Oh, by the way, don't worry about a thing. None of your friends will worry about you. We already have another version of you lined up from an alternate universe ready to step in as ‘Steel Bullet’, but nicer. You've already built an amazing reputation. From a business perspective, it's a shame to let that go to waste. Bye!” she disappeared as easily as Steel Bullet was teleported to different locations. \n\n\n\nIt was a lot to take in but he wished he had a chance to ask questions. All he was left with were his own thoughts. \n\n\n\n“Did she say alternate universe?” he asked himself, then blinked. He opened his eyes three hours later. \n\n\n\n“What the fu-,” he blinked.  48 hours went by before he opened his eyes again. \n\n  \n\n\n“Uccckkkkkkkkkk.”.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1fuhm3k/wp_you_a_powerful_superhero_stand_trial_for_very/lq2im21/",
        "score": 10,
        "date_posted": "2024-10-02 21:16:16",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] Your friend is the gamemaster of your local roleplaying group. He found an old book and for fun read a passage from it.  Everyone was surprised when an actual demon showed up. They were even more surprised when the demon wanted to join your gaming session...",
        "comment": "\\[Sunny Summon\\] \n\n\"...and thusly I invoke the power of Aurelio's Sun and call to the Void. Hear me speak your name and request an audience, Ballisea the Demon Queen,\" Justin was too busy enjoying the moment to notice the collective eye-roll from the rest of the group. Three of the five members were eager to start the game and the fourth, Justin's closest friend, was understanding enough. But, the passage sounded more like the high-minded journal entry of an edgy 14-year-old with no world experience than ancient words of power. Wade didn't know where Justin found the book, and he suspected the entire passage might have been written by his friend, but they were all there for entertainment and this was Justin's. \n\n\n\n\"... and, the Demon Queen did appear before the mortal king...,\" Justin sat down with a grin and began explaining the lore of their newest campaign. But, before he continued, a soft, gentle, female voice whispered as if directly in his ear. \n\n\n\n\"And then what happened?\" she asked.  As soon as the question was complete, all five friends jumped to their feet and disrupted the table in the process.\n\n\n\n\"AAAUGH!\" Justin was up at the same time as everyone else and the table shifted.\n\n\n\n\"YEEOOO!\" Shane stood up so fast his chair fell over backwards as he spun around looking for the voice. \n\n\n\n\"WHAT THE FU-\" Wade felt a chill travel down his spine as the whisper gently caressed his eardrums. He knocked over the still open 3-liter bottle of soda all over the game board. \n\n\n\n\"AAEEIIUgh!\" Debbie slammed her hands down on the table for leverage as she rushed to her feet. She moved to the side as she stood and her hand pushed the pizza box off the table so the pie and box fell on the floor face down. It was still open too and only one slice was missing. \n\n\n\n\"GAAHHH!\" Devin, Debbie's twin, subconsciously moved closer t her as she moved closer to him and he glanced around the room like Shane for the mysterious voice. \n\n\n\nIt was a sudden ruckus. Each one was surprised as a whispered voice spoke to each one of them individually. Her voice didn't fill the room, it didn't need to. \n\n\n\n\"It's difficult to feel welcome after such a spectacle, and yet, you did summon me here; why?\" Her voice spoke again; but, this time it came from a central point and they all looked. It was late in the evening, though the sun hadn't set yet. Justin lived alone in a modest single family home that was in a pretty solid neighborhood. They were playing in the living room with a sturdy card table unfolded just for the occasion. The blinds were open enough to let the setting sunlight filter through and there was still enough light to not need any indoor lights on yet. But, that also meant that as part of Justin's spartan decor, one small corner of the living room was covered in black shadow. This is where her voice came from, and then a tall pale woman with bone-white ram horns stepped out of shadow, as if through a bead curtain. The five friends watched the shadows bulge, then simply fall away as her imposing form emerged.\n\n\n\nThere was a thud as Shane fainted. \n\n\n\n\"You're real? Really Ballisea?\" Wade asked. She looked at him, then giggled. \n\n\n\n\"You tried summoning me without knowing I'm real?\" As she spoke, two skeletons walked out of the shadowed corner to stand on either side of her. \"Allow me to make it absolutely clear how real I am,\" she giggled some more as the skeletons moved forward. Debbie screamed as Devin put himself in front of her, and Wade was surprised to see Justin step in front of him.\n\n\n\n\"I didn't know! It's my fault! It was just for a game! Take me, don't hurt them!\" he said. \n\n\n\n\"A game?\" Ballisea asked. She only tilted her head slightly, but the ram horns were large enough to make it an almost comical expression. She looked around the room and saw the table in disarray. \"Ahhh, a tabletop game...,\" she giggled and the skeletons disintegrated into white powder. \"A game where you create a new version of yourself to go on adventures in a fantasy world?\"\n\n\n\n\"That's right!\" Justin nodded eagerly. He didn't know where the conversation would lead, but it was a good sign that she dismissed her enforcers. \"We're just starting a brand new campaign using this book I found your summoning ritual in! I didn't know it was real!\" he said as he rushed to the table and picked up the soda-soaked sourcebook. Then, he put himself in front of Wade again to offer it to her\n\n\n\n\"Wade's a Paladin, Devin is a Lancer, Debbie is a Cyber Icon, and Shane is a Card Mage! We all used the new classes from this book too,\" he said. It was a gamble, but if she was really as powerful as portrayed in the book, the fact that she was still entertaining his explanations left him hopeful. \"Do you... maybe want to play with us?\" By this time, Wade, Debbie, and Devin had all managed to get Shane up off the floor, but he wasn't conscious yet. Ballisea smiled and shook her head. \n\n\n\n\"Dear child, the game you speak of existed long before this Earth, and the tabletop experience isn't remotely the same thing, nor as entertaining as the AlterNet itself.\"\n\n\n\n\"It's real!??\" Justin asked. He had been too focused on the living breathing demon queen in front of him to consider anything else. But, if she was real, then maybe the rest of the book was too. \n\n\n\n\"I think I will play with your group,\" Ballisea said. It happened so fast that Justin had time to wonder why everything was so bright all of a sudden, before he even looked around. He was already squinting when he realized he was on a hilltop overlooking a vast field of golden wheat. He spun around to make sure, and the rest of his friends were there too, along with Ballisea. \n\n\n\n\"IT'S REAL!\" Justin screamed. Even without any game trappings, he knew he was on another Earth. That alone convinced him. \n\n\n\n\"Uh, does that mean they are too..?\" Wade asked. He pointed to a legion in military formation in the distance. They were marching straight toward the hill he stood on, and they were all skeletons. \n\n\n\n\"Over here too..,\" Devin added as he pointed out a couple more battalions moving toward them from different angles. \n\n\n\n\"Oh, this is promising to be quite entertaining already,\" Ballisea smiled. \"I think I'll watch you from somewhere else,\" she said as a black portal opened next to her. \"Welcome to the AlterNet,\" she said and stepped through. \"If your group survives long enough to entertain me, maybe I'll let you.\".",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1g8vo55/wp_your_friend_is_the_gamemaster_of_your_local/lt1xr4o/",
        "score": 26,
        "date_posted": "2024-10-21 15:19:29",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] the magical ability tests results got leaked... what nobody expected was some rando to be the most powerful mage at the academy",
        "comment": "\\[Friendly Advice\\]\n\n\"DARA!\" Phantae rushed through the door calling the name of one of her roommates while holding the door open for Shayla rolling in behind her. Dara was relaxing on the bed and looked up.\n\n\n\n\"Yeah?\" she asked. \n\n\n\n\"Do you know how magical you are!?\" The two that just came in rushed to the bedside.\n\n\n\n\"Everyone's talking about it! You're about to be super popular!\" Shayla added. Dara's face took on a somber expression as she sat up and gave them all her attention. \n\n\n\n\"What are you talking about?\" \n\n\n\n\"The magical ability test results got leaked! You're more powerful than most of the staff here, everyone's wondering who 'Dara Sharp' is.\"\n\n\n\n\"She's our roommate,\" Shayla giggled. \"But, don't worry! I didn't tell anyone yet. It's only a matter of time before everyone finds out though.\" \n\n\n\n\"Oh...,\" Dara sighed. \"Well, I don't feel like dealing with any of that, so I'm gonna leave,\" she shrugged.\n\n\n\n\"I told you she would...,\" Phantae made the comment to Shayla, then focused on Dara again. \"Do you really have to?\" \n\n\n\n\"I mean, if we're talking about whether I have to..., I don't have to be here,\" Dara said. \"The whole reason I got to new schools is to avoid standing out anywhere.\" \n\n\n\n\"We were getting to know you...,\" Shayla said. \n\n\n\n\"That's another thing I don't have to be here for,\" Dara gave Shayla a friendly smile as she reached behind herself. She picked up a card-sized pane of thin, crystal clear glass and held it up. \n\n\n\n\"I hadn't shown you guys this yet; this is called a node,\" she said. She tapped it and the transparent screen came to life with a brilliant white background and red numbers showing the time. \n\n\n\n\"It's a magic academy.. but, we have smartphones, remember?\" Phantae dug hers out to show it off. It was the latest model, thin and light with a bright screen; from the front, it looked almost like Dara's node. but, from the side, the node was as thin as a sheet of paper while Phantae's phone was several millimeters thick.\n\n\n\n\"I know, but a node is a little more advanced,\" Dara said. She turned it into landscape orientation and grabbed it on both ends; then, she started to pull. The glass stretched like taffy until it doubled in length and she snapped it in half. \"It's made from nanos,\" she said as she handed one of the nodes to Shayla, then she pulled on it again to make one for Phantae. \n\n\n\n\"Whoooa.. you had this... were you going to tell us?\" Shayla asked as she navigated through the screens. \n\n\n\n\"At some point,\" Dara nodded. \"But, I was waiting for the right conversation. There's more to it...,\" She paused for a moment and took in a deep breath as if building her courage. \"You guys were nice... I don't usually make friends when I go to a new school, so I never really get to explain this part. Remember when I told you about my mom and said she could get me into any school?\" \n\n\n\n\"Yeah,\" Phantae nodded.\n\n\n\n\"You said there were all kinds of special schools,\" Shayla added what she remembered too. \n\n\n\n\"Well, the thing about that is... there are. Those schools exist.. but, they're not all on the same Earth.. not on this Earth either.\" There was a quiet moment as the two girls processed the information. \n\n\n\n\"You're saying... you're from another universe..?\" Phantae asked. \n\n\n\n\"I am, and these nodes will let us keep in touch,\" Dara said. \n\n\n\n\"This can talk to other realities?\" Shayla asked with wide eyes. \n\n\n\n\"More than that, it can take you to them too; you'll learn how if you do the tutorial.\" \n\n\n\n\"And.. you're just gonna leave?\" Phantae asked. She wasn't as interested in the technology as Shayla was. And, she knew she'd have time to explore it later. Right now, she wasn't sure when her new friend was going to disappear. \n\n\n\n\"Yeah,\" Dara shrugged. \"It's not like I'm going to burn any bridges in the school. There's no one to report me to, I don't have any family on this Earth. Technically, I only exist in their records.\"\n\n\n\n\"Are you going to another magic school?\" Shayla asked. \n\n\n\n\"I dunno yet. I was actually getting comfortable here, so I hadn't considered my next step.\"\n\n\n\n\"How do you have so much magic? Did your mother give you that too?\" Phantae asked. \n\n\n\n\"Yeah, but not in the same way she gave me the power to copy abilities. The magic is because I'm something called a Unique Soul.\" \n\n\n\n\"You said you were human...,\" Shayla said. \n\n\n\n\"I am,\" Dara nodded. \"This body is human, it just has an upgraded soul. You're a half-mermaid,\" Dara pointed at Shayla, then she pointed at Phantae. \"And, you're a fairy dragon hybrid; but, both of you have normal souls. There are versions of each of you in other universes that might or might not be in the same fae bodies. My soul is the only one like it in all universes, there are no other versions of me; that's what a Unique Soul is.\"\n\n\n\n\"I hadn't even considered that!\" Shayla was excited. \"Can I talk to other versions of me!??\" \n\n\n\n\"If any of them have nodes too,\" Dara nodded.\n\n\n\n\"You know... it felt like we were getting to know you...,\" Phantae giggled with a kind of defeated sigh. \"And here I thought you being born on Mars was going to be the biggest secret I learned about you. It turns out, that was apparently the easiest thing to share...,\" she said. \"And it wasn't even Mars in this universe...,\" she added with a shake of her head. \n\n\n\n\"I'm sorry, I wasn't trying to lie. It's not stuff I'm open about; you can probably understand why.\" \n\n\n\n\"No, I get it,\" Phantae nodded. \"But, honestly, I'm a little less sad to see you go now. I want to get to know you,\" she added as she gestured with the node. \"But, right now it kind of feels more like you're some rando than our roommate.\" \n\n\n\n\"That's totally fair,\" Dara answered with a smile. \"But, I will say, now that this is out, it'll be easier to get to know each other.\"\n\n\n\n\"Any other big secrets you want to share while we're at it?\" Phantae asked. \n\n\n\n\"I haven't decided where I'm going next; but, once I do I'll let you guys know. If any of you want to transfer schools, we can make it happen. It doesn't even have to be the new school I go to; but, I feel like I want to recommend you don't stay here.\" \n\n\n\n\"What? Why not?\" Phantae asked. \n\n\n\n\"It's only been two weeks since the school year started and they already had a major security breach to leak those test results. I don't have a whole lot of confidence in their ability to keep it from happening again, or with more personal information.\".",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1f5ue9x/wp_the_magical_ability_tests_results_got_leaked/lkvw6a6/",
        "score": 8,
        "date_posted": "2024-08-31 16:25:42",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] “So mermaids and sirens are two different species?” “Just so. My people, what you call mermaids or merfolk, share a common ancestor to you humans, making us distant cousins. What you call sirens, however, are fish that evolved to look and sound like humans to attract their favorite prey.”",
        "comment": "\\[Sunny Rage\\]\n\nMolly yawned as the merman host continued his presentation. It had already gone on longer than she thought and thus far, she hadn't learned a single useful thing.  She was in a sunny classroom designed for a merfolk teacher, although she wasn't actually in a class and he wasn't a teacher. The classroom was staggered with stadium seating, and at the bottom in front was a ground-level pool with enough space for an instructor to move in and out of the water freely. Molly was the only one there for the presentation, it was exclusively organized for her. \n\n\n\n\"...which of course brings us to common mistakes made when identifying mermaids...,\" the presenter continued. But, Molly's attention was drawn to another student walking in. Her friend and teammate, Emily, had long silver hair and it shined on and off as Emily walked through sunrays to get to where Molly was and sat next to her. \n\n\n\n\"Hey, almost done?\" Emily asked. \n\n\n\n\"Yeah, I think so,\" Molly nodded. \"What's up?\"\n\n\n\n\"Ehh...,\" Emily took a moment to shrug and put on an embarrassed expression. \"... Kirk kind of accepted a challenge from Eph... sorry,\" she apologized to one friend for the actions of another. \n\n\n\n\"On the other hand, Sirens are completely different...,\" the presenter was undeterred by the interruption as if he didn't notice the extra visitor or their conversation at all. \n\n\n\n\"That's fine,\" Molly giggled with a nod. \"We're not in first place right now anyway, we can lose a few points, if he loses.\" But, Emily shook her head.\n\n\n\n\"Kirk accepted for the whole team...,\" she said. \n\n\n\n\"Oh,\" Molly nodded again, this time with a sigh instead of a smile. \"Okay, that's fine too. It's good practice, either way, I guess. But, I'm definitely going to have to revoke his challenge privileges to avoid this happening again.\" \n\n\n\n\"Totally, and I already gave him a lecture about it too,\" Emily agreed. \n\n\n\n\"When?\" Molly asked. \n\n\n\n\"That's why I came to talk in person,\" Emily said. \"So, it wouldn't be a surprise. Kirk and Eph agreed on Saturday; but, it'll probably pop up as a notification when you're done with this,\" she gestured at the speaker still giving his monotone explanation. \"Team Captain can still veto it.. but don't, please?\" Emily asked. \"And, don't tell him I asked you not to cancel it.\"\n\n\n\n\"Well, we're not in first place, but if we lose as a team we might get dropped to last... why not?\" Molly asked. \n\n\n\n\"You weren't there..,\" Emily replied. \"Eph was giving him a hard time, and he was really trying not to rise to the bait. Then, he started insulting me, you, and the rest of the team and that's when Kirk got mad. It's still only the Second Six Weeks, we have time to come back from last place. But, he was extra fired up, and he was trying to be better before... I dunno, I kind of wanna give him this, you know? Even if it doesn't work out, I want the team to have his back. I mean, it's not like we don't stand a chance. The AlterNet Crew only has five members, and they're all pretty average. Eph and Pavette are their strongest players and we can handle them pretty easily. \n\n\n\n\"Okay, I won't cancel it then,\" Molly nodded. \"Oh wait, I'm about to finish,\" she said.  Then, she stood from her seat with her hand in the air. \n\n\n\n\"Yes, you have a question?\" the merman asked. \n\n\n\n“So mermaids and sirens are two different species?” Molly asked. \n\n\n\n“Just so,\" he nodded. \"My people, what you call mermaids or merfolk, share a common ancestor to you humans, making us distant cousins. What you call sirens, however, are fish that evolved to look and sound like humans to attract their favorite prey.”\n\n\n\n\"Thank you,\" Molly nodded at him, then turned back to Emily. \"Done,\" she said. A message popped up in her view. \"And... there's the notification. Challenge accepted,\" she said. \n\n\n\n\"Was that it? You just had to ask a question?\" Emily stood and followed Emily out of the classroom. \n\n\n\n\"The hard part is sitting through the lecture, it won't let me skip the quest text. Then, I had to ask a question at the end to show some sort of engagement.\"\n\n\n\n\"Oh, what was the quest?\" Emily asked. \"Mermaid only?\"\n\n\n\n\"Yeah,\" Molly nodded. \"I'm happy with my loadout for tanking, but, I'm still missing some basic mermaid racial Abilities that I never bothered to get. Since completing quests on school grounds gets me Spirit Points too, I figured it was a good time to get them.\"\n\n\n\n\"Smart,\" Emily giggled. \"Is it true? What he explained about mermaids and sirens?\" They were now walking through the mostly empty halls. It was after school and most of the students were out challenging the world and each other. \n\n\n\n\"Maybe on some Earths, but not really. The parts I heard were actually kind of nonsensical, but, procedurally generated does that text I guess,\" she giggled. \"And, that last part you heard was just useless filler.\" \n\n\n\n\"How so? I know mermaids and sirens get conflated with each other on most Earths I've been to, but they are two different species, right?\"\n\n\n\n\"Oh yes, absolutely,\" Molly nodded. \"I'm very much a mermaid and not a siren. That part was true, but the parts about 'what you call mermaids' and 'what you call sirens' was just NPC rambling.\" \n\n\n\n\"I don't get it..,\" Emily shrugged. \"I know he was a Quest NPC, but, it sounds reasonable?  I'm sure on some Earths sirens evolved the way he said.. it's possible, right?\"\n\n\n\n\"It is..,\" Molly nodded. \"Maybe it's just me, I get a little defensive about fake 'mermaid facts' because of what I am. But, it makes absolutely no sense to me. I asked him flat out if they're two different species,\" she said.\n\n\n\n\"And he agreed...?\" Emily nodded. \n\n\n\n\"Yeah, I know. It's just a little annoying that it's obvious I don't know the difference between a mermaid and a siren. And then his answer goes on to explain the differences pretending to use my language. 'What you call mermaids, what you call sirens...,\" Molly shook her head. \"The question automatically implies I don't know there's a difference and used the words interchangeably. Theoretically, I called the same creature both things. And that NPC has the gall to define the words in a way that puts himself in the camp of Mermaids? It really twists my tide pools, my people would NEVER call him a merfolk!\"\n\n\n\n\"Hey...,\" Emily shook her head. \"He's just an NPC...,\" she reminded her friend.\n\n\n\n\"Yeah...,\" Molly nodded with a sigh. \"I'm really mad at Kirk by the way.\".",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gb5hdu/wp_so_mermaids_and_sirens_are_two_different/ltjsc6p/",
        "score": 23,
        "date_posted": "2024-10-24 13:55:44",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] \"Three wishes? Okay, my first one is I wish I knew what to wish for that would have no negative or unintended consequences\".",
        "comment": "\\[Ownership. Inconsequential.\\]\n\n\"... I wish I knew what to wish for that would have no negative or unintended consequences,\" Nick spoke his first wish out loud at the ethereal torso hovering in front of him. He and the genie were on the beach with the sun resting on the horizon and a cool breeze in the air. It was a nice evening and quite a few others spaced out up and down the beach. Nick felt lucky that he'd finally found a genie; but, he didn't feel the need to keep it hidden. He always hoped he'd stumble across one on some random day. Plenty of other people did, and even businesses sprung up around the concept of developing the 'perfect wish'. But, Nick had his own plan. He'd had time to perfect his first wish with the intent that it would make his second and third ones easier. \n\n\n\n\"Granted...,\" the genie spoke with a pleasant yet gravelly voice. They'd already had some interaction before Nick made his first wish and he was surprised to learn that behind the being's sinister voice was a helpful, warm genie. As soon as the genie spoke, Nick had his answer. The knowledge popped into his head as if it were a long-forgotten memory. It was clear as day, something he'd always known, but rarely thought of. There was only one appropriate reaction. He burst out laughing. \n\n\n\n'HAahahaaha...,\" it was a true, boisterous belly laugh, enough to draw some curious attention from others on the beach. \"hhaaaa...,\" he calmed down but the broad grin that came along with the knowledge didn't disappear. \n\n\n\n\"For my second wish, I'm kind of hungry. I wish for a healthy snack. Something I can eat without too much trouble or mess, like an apple or something,\" he said as he held out his hand. \n\n\n\n\"Granted...,\" the genie replied with a sinister voice and friendly smile. A large red apple appeared on his hand with a small puff of smoke. \n\n\n\n\"Hi, hello! I couldn't help but notice that you've already made two wishes!\" a new voice spoke up. It started at a distance but grew louder as a young man with muscles and a glowing tan approached. \"I'm not trying to rush you; but, if you're gonna make your third wish, can I have the lamp after?\" he asked. \n\n\n\n\"Sure,\" Nick nodded. \"I'm about to finish up anyway,\" he turned back to the genie. \"I'm ready for my third wish. I'm gonna need some water to wash this down, can I get a cold bottle of water?\" He held out his hand and the beverage appeared in his hand. \"Thanks, Genie. I appreciate it,\" Nick smiled and raised the water to the genie in a mock toast, then he turned. \"All yours,\" he said to the stranger and began to walk away. \n\n\n\n\"Wait!\" the stranger stopped him. \n\n\n\n\"I saw you laughing.. then you got an apple... I didn't think you wasted your wishes on that; but now you wished for a bottle of water? There's a vending machine right over there!\" he pointed to a shaded picnic area. \n\n\n\n\"I didn't bring any money,\" Nick shrugged. \"it was easier to just wish for what I wanted.\"\n\n\n\n\"YOU COULD HAVE WISHED FOR MONEY!\" the stranger didn't mind raising his voice at another stranger. \n\n\n\n\"Yeah,\" Nick shrugged. \"But, I didn't. Have a great evening,\" Nick nodded and tried to move on again. \n\n\n\n\"Hold on, you have two things, what was your first wish?\"  the muscleman seemed offended at the wasted possibilities. \"Did you wish for a joke?\" he asked. \n\n\n\n\"No,\" Nick shrugged with a grin. \"My first wish was to know what to wish for that would have no negative or unintended consequences,\" he said. \"The answer was just kind of funny to me.\"\n\n\n\n\"You know that...and you still wasted your wishes?\" \n\n\n\n\"Yeah,\" Nick nodded. \"I mean, that's all you can do really. The secret is, there's no such thing. There's nothing that can be wished for that won't have unintended consequences; the multiverse is too big and too intertwined. This apple...,\" he held it up for effect. \"It came from somewhere in some universe. Maybe this one, maybe not; but, the point is, someone somewhere is missing an apple they think they have. Will it be a big deal? Probably not; but, it will definitely have unintended consequences.\"\n\n\n\n\"Wait... other universes exist?\" the stranger had a new interest to focus on.\n\n\n\n\"Oh wow, they totally do!\" Nick nodded as his eyes widened, then he chuckled again. \"I hadn't even registered that. Oh man, I could've wished to tour the multiverse. Ah well,\" he sighed and took a bite of his apple. \"Good luck,\" he waved at the stranger and walked away. \n\n\n\n\"Genie, I get three wishes, right?\" the stranger asked as he picked up the lamp from the beach. \n\n\n\n\"Correct,\" the genie nodded. He looked back to see Nick far enough away and getting further. \n\n\n\n\"Okay, I want the same first wish as him; I wish I knew what to wish for that would have no negative or unintended consequences!\" he said. \n\n\n\n\"Granted...,\" the genie replied and the muscular athlete was overcome with laughter too. He laughed a little harder and a little longer than Nick; but, finally he calmed down enough to smile at the genie. \n\n\n\n\"Wow, he was right. There's nothing I can wish for that won't have unintended consequences....,\" he said. And, now that he knew about the multiverse, he was ready to register that knowledge when it came too. \"So, consequences be damned,\" he shrugged. \"I'm ready for my second wish, I want to own my own alternate Earth and be in control of it!\" he said. \n\n\n\n\"Granted...,\" the genie said. Instead of being whisked away to another universe, they remained on the same beach and a clear glass card appeared in the new Master's hand. \n\n\n\n\"What the hell? We're on the same Earth? What's this?\" he looked at the card but ignored the details because it wasn't what he asked for. \n\n\n\n\"Your deed and control to your Earth,\" the genie replied. \n\n\n\n\"I DON'T NEED A DEED! I WISH TO BE ON ANOTHER EARTH AND I WANT TO OWN THAT EARTH!\" he yelled. For the first time since Nick left, the genie smiled with his sinister voice. \n\n\n\n\"Granted...,\" the genie said as the man disappeared, leaving the glass card to fall to the sand. The genie's job was done and he retreated back into the lamp. \n\n\n\nOn a different Earth somewhere in the multiverse, a muscular man with a glowing tan appeared on a beach in a puff of smoke. He knew it was a different location because it was dark. Except, as he turned around, he noticed a towering wall of water that was obscuring the sun as it approached the beach. .",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1f2i91n/wp_three_wishes_okay_my_first_one_is_i_wish_i/lk8s07v/",
        "score": 13,
        "date_posted": "2024-08-27 17:45:20",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] In a world where everyone is assigned a specific color at birth, determining their role in society, you're born with no color at all",
        "comment": "\\[Coloring Determination\\]\n\nAgnes fiddled with the golden band around her wrist as she waited. It was a nervous habit that was easy to develop as she grew up. The ever-present band had been with her as far as she could remember. And, the soft material had somehow always kept its sparkling golden color throughout her childhood and even as she became an adult. Not even mud could hide the fact that she was meant to be a ‘Supporter’. \n\nThat didn't mean the path she was destined for was guaranteed to be easy. She still had to work hard to get the position she had now. Theoretically, Supporters could work at any hospital or clinic, but her dream was to work with newborns. And, she'd finally made it. She was waiting to start her very first shift in the nursery. \n\nShe was already clocked in and ready to go, but the few babies already there were sleeping, and she hadn't been given any larger directives yet, her boss was supposed to come in and talk to her about it at some point. But, until then, she was perfectly happy to be where she was. \n\nThe nursery was laid out like a hexagon with her desk in the center. She was surrounded by six distinct sections defined by their colors. Green, gold, black, blue, purple, and red. Each bassinet was also color-coded to the appropriate sections, and each child had the same band around their wrist that she did. \n\nShe could have been seated while waiting, but she preferred to stand ready. And, it allowed her to check on any of the babies with a glance. Then, a nurse rushed in with a new, white bassinet she was unfamiliar with. It was bright, clean white with a barely visible red scissor logo on each corner. \n\n“Mundo said not to do anything with this one yet, she'll be right in to talk to you,” the unknown nurse nodded at Agnes as she left the Bassinet. \n\n“Thank you,” Agnes nodded. She appreciated being surrounded by gold-banded supporters. They didn’t waste time with pleasantries when there were people to take care of. Once she was alone again she decided to peek in on her new charge. \n\n“Let's see what you'll be doing for society…,” she giggled as she reached down to free the infant's wrist. Then, she gasped and clapped her hand over her mouth to keep herself quiet. \n\n“That… shouldn't happen. Who are you?” she whispered at the barely conscious child. She realized it explained the white bassinet, but that didn't actually answer any of her questions. \n\n“Good to see you, Agnes,” the woman jumped in surprise as she looked up. Mundo walked in. She was a heavyset woman with green hair and wearing a white lab coat. \n\n“Dr. Mundo!” Agnes felt like she was caught doing something, but Mundo only tilted her head with amusement. \n\n“Doctor?” she giggled. “Just because I'm officially your boss now doesn't mean you have to get all formal on me. Just stick with ‘Mundo’,” she said. \n\n“Right, yes, of course. How can I help you?“ Agnes tried to position herself between Mundo and the unknown child in the vague hope that the doctor was there for something else. She didn't know a thing about the baby, but, she knew it wouldn't have an easy, or lengthy life if people discovered it was born without a color. Her Supporter instincts were kicking in and she wanted to keep it safe. \n\n“Well, there's a last bit of training that we do here once you're actually on the job. This isn't included in the school curriculum. The training is dead simple; but, the instruments are prohibitively expensive. It’s easier to just skip it until a candidate actually makes it to this level,” she said. \n\n“Let's start with this little bundle of joy here.” She tried to move past Agnes, and the younger nurse held firm. “Is there a problem?” She asked. The question made Agnes realize she didn't have a plan. What was she going to do? Run out of there pushing the baby? \n\n“No, sorry. Just kind of… Excited!” she said with an exaggerated giggle. “Don't know what to do with myself,” she moved out of the way\n\n“I can understand that,” Mundo smiled. “So, this little guy was just born not too long ago,” she said as she reached down to pick up the child. “And if we check his color…,” she brought his tiny arm out of the blanket and Agnes watched Mundo intently for her reaction. “... We see he doesn't have one yet,” she said. \n\n“WHAT!?” Agnes’ first instinct was to pretend. But, that was before she realized Mundo didn't seem the least bit surprised.\n\n“Yeah, that surprises a lot of people,” she chuckled. \n\n“Wait! Why doesn't he have one? What's going to be his role in society?” \n\n“Well, he was just born,” Mundo shrugged playfully. “We’re still at the hospital.” \n\n“But…,” Agnew glanced at her own golden band, then at Mundo's. “Everyone in the world is assigned a specific color at birth!  He was born without a color, what's going to happen to him?”\n\n“We give him one,” Mundo answered. Of course. Agnes should have known better, Mundo was a Supporter like her. And she'd worked in the hospital a long time. It only made sense that occasionally a child was born without a color, and the most obvious answer was that Mundo covered for them. \n\n“Oh, I see,” Agnes nodded. “At least that way he has a chance for a normal life.”\n\n“How so?” Mundo asked. The comment seemed to genuinely confuse her. \n\n“Well, if word got out he was born without a color, who knows what he might go through? Bullying at the very least, I imagine.” \n\n“Why?” Mundo asked. Subconsciously, she pulled the baby boy closer, as if Agnes might start bullying him then and there, though neither one of them noticed the subtle action. \n\n“Because he was born without a color assigned…,” Agnes answered softly, unsure why Mundo didn't see the possible troubles. \n\n“Uhuh,” Mundo nodded. “So were you, and everyone else born on Earth,” she said. \n\n“But..,” Agnes had to pause and check her thoughts to be sure. “It's accepted common knowledge, isn't it? Everyone is assigned a specific color at birth, determining their role in society…. Right?”. Had her whole career been a lie? She did like helping people. Had she been conditioned to help people? Or to like it?\n\n“That's right,” Mundo nodded. “That's our job.” \n\n“Wait…  we do that?”\n\n“Yeah,” Mundo nodded. “This little guy was just born on your shift, and I’m going to teach you how we assign him a color… if we can get to it.”.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1f8uny1/wp_in_a_world_where_everyone_is_assigned_a/llhyerz/",
        "score": 3,
        "date_posted": "2024-09-04 13:34:27",
        "subreddit": "WritingPrompts"
    }
]