[
    {
        "post_title": "[WP] When a group of friends holidaying in a foreign land disrespect an old woman on a hot sunny day, she casts a hex on them so that they will melt when exposed to the heat of the burning sun. They must find the hag before they become puddles of melted flesh and bone.",
        "comment": "The sun shone brightly. The heat visible in the air even at midday. The temperature heading toward a local record.\n\n\nAn average summer day in such a place really.\n\n\nSo, of course, people are confused by the people walking around in coats, jeans, and heavy shoes. The hoods pulled tightly around their heads.\n\n\nNobody seemed to notice the slight moisture pooling with each step.\n\n\n\"They're all dead.\" One sighed softly. \"They're all deadd...\"\n\n\n\"Stop saying that.\"\n\n\nThe pair entered the small path towards the house. The walls closing in as they avoided the small piles of trash scattered on either side. The smell reminding them not of disgust. But the idea they still had time left.\n\n\n\n\"We're next.\"\n\n\n\"Kayla. Stop saying that.\"\n\n\nShe stopped moving entirely. Jeff stopped to check on her. He noticed the blood slightly gathering next to her legs. He made her look at him. Some of the skin above an eye had rubbed away. The raw underside a pink hue that flecked with red drips.\n\n\n\"Listen. I... We can fix this.\"\n\n\n\"Uh huh.\" She slowly answered. \"Right.\"\n\n\n\"Trust me.\" Jeff offered. Something seemed to land on his head. He brushed it thinking it to be a bug.\n\n\nSomething wet fell out of his hood and hit the pavement with a slight slap. The pair of them numbly stared at it longer than they thought.\n\n\nIt was his ear.\n\n\nHe gingerly leaned down and picked it up. Rubbing it on his sleeve to get the dirt off, he ignored the smear of red and put it in a pocket.\n\n\n\"Come on.\" He sighed. \"Not much farther.\"\n\n\nThe pair slowly climbed the stairs. The skin of their hands wanting to rip every time they had to touch a railing for support.\n\n\nThe woman in question supposedly lived at the top of the hill. The top of this dilapidated neighborhood. At the top of the hill. The hill may as well have been a mountain. They could see the whole beach from this place. And the city that stretched beyond the curve of the land. The ocean the cut off point of some great construction.\n\n\nJeff stopped. His hands aching. Kayla bumped into him and staggered herself.\n\n\n\"What?\" She asked. Wiping blood with her sleeve.\n\n\n\"I always wanted to come here.\" He breathed. \"Get some sun. Get away from it all.\"\n\n\n\"Careful what you wish for.\" She uttered.\n\n\nHe turned to look at her and gasped as part of his palm slid off. The flesh dangling on a slight peel in the paint on the rail. He reached to retrieve it, but winced and withdrew as he realized it was the same hand he tried to grab it with.\n\n\n\"Hurry.\" Kayla motioned. \"Hurry.\"\n\n\nThe small house sat in a dip on the slope. The treeline above it making it seem like the jungle had given it just enough room to be set there.\n\n\nAnd there the old woman sat.\n\n\n\"Ah. You finally found me.\" She greeted in a half hearted tone. \"Have you enjoyed your stay?\"\n\n\nShe waved a fan in front of herself. As if she was simply enjoying a breeze all to herself.\n\n\n\"I'd offer you a seat. But I imagine it wouldn't be wise.\"\n\n\n\"You have the cure for this?\" Jeff led with.\n\n\n\"Ay, I may.\" She smiled. \"But, I want to hear it first.\"\n\n\n\"...Hear what?\" Jeff asked her after several seconds of silence.\n\n\nThe birds sang in the trees. Audible even over the drone of civilization.\n\n\n\"An apology.\" The woman reminded them.\n\n\n\"We're sorry.\" Kayla spoke first. \"I don't know. What the others did.\"\n\n\nHer legs shook as she tried to step closer. The woman watched from her chair in interest.\n\n\n\"I don't know what they did.\" Kayla regrouped. \"But it... Wasn't worth...\"\n\n\nShe hit the dirt face first. Jeff tried his best to lean down and rouse her.\n\n\n\"Kayla?\" He whispered. \"Kayla??\"\n\n\nHe pushed her the best he could. Ignoring the skin further sliding on his hands. The bones poking through. The hit had taken some more off her face. She blinked with one eye and tried to breathe.\n\n\n\"Help her.\" Jeff ordered finally. \"Please.\"\n\n\n\"I've lived here. All my life.\" The old woman sat back. \"Watched people like you. Get off the boat. Get off the plane.\"\n\n\nOne passed overhead, the engines droning then fading into a rumble as it disappeared in the light.\n\n\n\"Take everything people offer. And leave a mess behind.\"\n\n\n\"Please.\" Jeff interrupted. \"She's going to  die.\"\n\n\n\"-Where are the rest of you now?\"\n\n\nJeff simply hefted Kayla's body a little. He looked at her then at the witch.\n\n\n\"Do you love her?\"\n\n\nThe question took him aback. But he shook his head eventually side to side.\n\n\n\"You don't.\"\n\n\n\"I don't want her to die.\"\n\n\nThe woman walked over. And lifted the hood off his head. She could see the raw scalp and skull poking through matted hair. The hole where an ear used to be.\n\n\nThe woman. Well, she might be dead. She sure looked it. A smaller person would have less time. It was impressive she made it that far really.\n\n\n\n\"...Perhaps I overreacted.\" The witch admitted.\n\n\nJeff's face sagged a little. Blood trickled through his eyes. He thought wise of not touching them. Something dripped over Kayla, a clear liquid from a glass. The little drops stopped. The glass was offered to him next.\n\n\n\"Drink.\"\n\n\nHe carefully did. Considering the unknown as he did so. As raw as his tongue was, it felt like a mild relief.\n\n\nThe old woman explained. \"It may not save you. But it is the best thing I can do.\"\n\n\nJeff tried to speak again. But all the skin and fat dangling simply made him unable to.\n\n\n\"Perhaps one of you get another chance.\" The old woman promised.\n\n\n---\n\n\nKayla woke up. She couldn't really move. The sun poked through the blinds. The machines trying to keep her alive.\n\n\nThe doctors explained she'd been in an accident of some sort. An acid spill, apparently.\n\n\nShe had no clue why she was here. Apparently she'd been on a vacation alone. And she didn't know why she came there.\n\n\nWhen she finally recovered enough to use a wheelchair, she was taken aback by all the random people whose pictures she kept on her phone. Using a few fingers that remained to sweep through them just raised more questions.\n\n\n\nIt was almost like they were friends of hers or something.\n\n\n\"You need to rest.\" One of the orderlies offered.\n\n\nShe glanced up at the older woman as she smiled back. \"You've had a long journey.\"\n\n\nShe found it odd how familiar she was. But she guessed it was due to the time she spent in this place. Such a warm smile gave her comfort.\n\n\n\n\"...I guess so.\"",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gs1ly8/wp_when_a_group_of_friends_holidaying_in_a/lxb9wab/",
        "score": 1,
        "date_posted": "2024-11-15 14:19:10",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] “I just finished the autopsy of your stab victim that you found in the street. He wasn’t just stabbed multiple times, we have over 100 wounds from at least a dozen different edged weapons. He got the Julius Caesar or somebody really malicious. Just be careful canvasing  the area.”",
        "comment": "*“I just finished the autopsy of your stab victim that you found in the street. He wasn’t just stabbed multiple times, we have over 100 wounds from at least a dozen different edged weapons. He got the Julius Caesar or somebody really malicious. Just be careful canvasing the area.”*\n\n\nBoth of them glanced at each other, then at their surroundings. Topher grabbed the phone up before Hamilton could.\n\n\n\n\"I'm sorry. Can you repeat that?\"\n\n\n*\"Unless their killer had a lot of time on their hands. Multiple attackers stabbed him to death. Again, be careful.\"*\n\n\n\"Understood. Contact Bellamy. Tell him to send an extra unit down here. We'll get started.\"\n\n\n\n*\"Sure thing.\"*\n\n\nBoth of them began looking around in earnest. There were still signs of the first responders that cordoned off the scene. The big question was how no one else noticed what had happened.\n\n\nThe body was laying in the street next to a vacant lot. But behind that sat a refinery practically on top of the fence at the back of it.\n\n\nAcross the road, several businesses that closed earlier in the evening. Down the block, an apartment building that had balconies that overlooked the road. All of the street lights worked.\n\n\n\"Did they dump the body here?\" Topher asked as he circled where the body had laid at.\n\n\n\"I can't rule it out.\" Hamilton agreed. \"But if they did, where'd they kill him at in the first place?\"\n\n\n\"Maybe a house. Maybe an apartment.\" Topher took a glance at the nearest one. The same one overlooking the street.\n\n\nBoth of them walked around the car and shined flashlights on the lot. The grass was shin high. And there were a few pieces of junk and trash strewn around.\n\n\n\n\"Odd thing is.\" Hamilton reconsidered. \"Report came back that he'd been killed recently. Considering the photos.\"\n\n\n\"Yeah, they killed him right here. Or really close by.\" Topher confirmed. The pair of them kept looking at the dirt.\n\n\n\n\"Hey. Look at this here.\"\n\n\n\nHamilton careful walked through the weeds towards Topher's position. He held the light up at shoulder height and waved it a little.\n\n\nThe lot was full of glass. Shattered glass that scattered a few feet before a small pile of it. Near it some grooves in the dirt, the weeds crushed and ripped away as they went back towards the sidewalk.\n\n\n\n\"Did somebody run a car up here?\" Topher asked him.\n\n\n\"Or they drove one away.\" Hamilton agreed.\n\n\n\"Think a camera caught anything?\"\n\n\n\"Good chance. It's not like we're out in the sticks exactly.\"\n\n\n\"Guy gets stabbed to death in the middle of the street. By a dozen people.\" Topher summarized again.\n\n\nHamilton was busy squinting past him. He raised his flashlight and Topher turned to look. Somebody in a light colored jacket was looking at their patrol car. Hamilton tapped his arm, and the pair began to walk through the weeds towards them.\n\n\n\"Lights off.\" Topher muttered.\n\n\n\nAs they came closer to the sidewalk, Hamilton decided to speak first.\n\n\n\"Hey, you. Police. Show me your hands.\"\n\n\n\nThe figure turned away from the car and began walking. The hood over their head unmoving as they strolled across the road and between the buildings that lined that side. The pair of them picked up their pace to catch up to the figure.\n\n\n\n\"Hey. Stop. I said stop.\"\n\n\n\nThe figure met the tiny gap between the buildings. No wider than a foot at most. Turned sideways misstep. And slid into the dark like it was a normal thing to do.\n\n\n\"Grab him!\"\n\n\nTopher tried and put his light up to the gap as he reached to do so.\n\n\nOnly for his hand to hit a small chain link fence across the gap. The person was nowhere to be seen.\n\n\n\"Where'd he go?\" Topher asked him. Hamilton was speechless himself. He walked over and checked the fence and kicked it just to be sure.\n\n\n\"The hell?\"\n\n\n\nBoth of them went back to the squad car. Nothing was out of place. They got back in and began to circle the block.\n\n\n\"How'd they do that?\"\n\n\n\"I don't know.\"\n\n\n\"They have to come out somewhere.\" He snatched the radio up as they both watched the sides of the roads as Hamilton reached the corner and turned left.\n\n\n\n\"Call it in?\" Topher asked him next.\n\n\n\n\"Wait, wait...\"\n\n\nThey both glanced at the low buildings on this side of the block. To their concern, nobody came out of the gaps between them.\n\n\nHamilton didn't touch the gas. He just let the car roll as they kept the windows down and listened.\n\n\n\"Look.\" Topher flinched. \"Look!\"\n\n\n\"What? What?\"\n\n\nHamilton stopped the car at the next intersection, and then flicked the brights on. Just off the road, laid over the curb was a body.\n\n\nThe same light colored jacket that they saw moments earlier. Even under the streetlights, they could see the dark pattern spreading outward. Both exited the car, weapons drawn and slowly advanced.\n\n\n\"Hey... Hey, can you hear us? Sir?\"\n\n\nThe man was dead already. A series of punctures had turned the jacket from an off-white to a deep red color. The same hue staining the concrete underneath. Under the light they both spotted the awful gash crossing the body's neck. Topher almost sunk his fingers into the wound going for a pulse.\n\n\n\nThe first question was 'how?' The second was 'when?' The third was 'who?'\n\n\n\"334, dispatch.\" Hamilton radioed. \"We have a body on the 1100 block of... Walker Street. And 15th.\"\n\n\n*\"Roger, 334, units on the way.\"*\n\n\n\"What do make of that?\" Topher asked next.\n\n\n\"I called it in.\"\n\n\n\"No.\" Topher pointed in concern. \"That.\"\n\n\nOn the sidewalk, next to the body, was an arrow. It pointed down the road. It was made of the same blood pooling on the pavement.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gpt3vl/wp_i_just_finished_the_autopsy_of_your_stab/lwts5qc/",
        "score": 15,
        "date_posted": "2024-11-12 17:59:16",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] The first moment you laid eyes on him, you knew that something was terribly wrong with your son. It might've been the fact that his eyes were all-black when he was born or that his first words were, \"This human form is limiting\". You're not entirely sure. ",
        "comment": "She sat at the island in the kitchen. A can of Dr. Pepper and a cigarette she'd freshly lit off the nearby candle the only real sign of trouble.\\n\\n\\\"Honey?\\\" He asked as he walked into the room. \\\"I think there's something wrong with Zane.\\\"\\n\\n\\\"Really?\\\" She exhaled softly as she flicked ashes into the nearby sink. \\\"What was your first clue?\\\"\\n\\n\\\"So after three years you're ready to talk about it, huh?\\\"\\n\\nHolly watched Matt ease himself into the chair on the other side of the island. He looked at both doorways before he settled fully down. At least they were on the same page. Finally, she guessed.\\n\\n\\\"Am I?\\\" She paused. \\\"Am I a bad parent?\\\"\\n\\n\\\"No?\\\" Matt's eyes widened. \\\"Why, would you say that though?\\\"\\n\\n\\\"I just, I dunno'.\\\" She ashed the cigarette again. \\\"It's mainly the whole thing Zane keeps mentioning. This human-\\\"\\n\\n\\\"-Form is limiting.\\\" Matt finished for her.\\n\\nHolly frowned a little deeper as she took another drag. \\\"Mm hmm.\\\"\\n\\nThe pair of them seemed to be locked in place. A quick glance around the house from the both of them. The only noise the soft combustion of tobacco and paper.\\n\\n\\\"I thought you quit.\\\"\\n\\n\\\"My son is some otherworldly entity. I think this is an okay time to start.\\\"\\n\\n\\\"Fair.\\\"\\n\\nHolly studied him now. Bags under his eyes, his hair mussed and slowly graying on the edges.\\n\\n\\\"How about you? Did you find anything?\\\"\\n\\n\\\"He's just.\\\" Matt shook his head in numb acceptance \\\"He's not of this world.\\\"\\n\\n\\\"Is he like a demon?\\\" She pondered. \\\"Or an alien?\\\"\\n\\n\\\"Cthulu or something? Maybe, he's not a demon? An angel?\\\"\\n\\nHolly thumped her can back on the table at this.\\n\\n\\\"When have you ever heard of angels with black eyes?\\\"\\n\\n\\\"When have you ever heard a description of anything normal involving angels?\\\" Matt countered. \\\"They're said to basically make us half catatonic in all the stuff I've read.\\\"\\n\\n\\\"Your childhood knowledge from bible camp doesn't count.\\\" She dismissed.\\n\\nThe pair both stopped to listen to the house. A slight creak somewhere led them both to look. It didn't matter that it was daylight. It was the fact they knew he was taking a nap in his room. Or at least he should be.\\n\\n\\\"Zane is inhuman. Sure.\\\" Matt offered. \\\"But we should give him a chance. You did.\\\"\\n\\nShe finished her cigarette. Running the butt under the faucet. \\\"That was before I heard him speak like that.\\\"\\n\\nNow it was Matt's turn to palm the table. \\\"I told you last year-\\\"\\n\\nThe little figure standing in the nearest door caught their attention. Zane rubbing his little eyes with a hand.\\n\\n\\\"Hi sweetie.\\\" Holly said with a large smile.\\n\\n\\\"Mother. I know. I heard you.\\\" Zane shrugged. \\\"It's okay.\\\"\\n\\nThe pair of them looked at him as he wandered around the kitchen for a moment before he finally held up his arms at Matt's side.\\n\\n\\\"Um, what is it?\\\" Matt finally asked him.\\n\\n\\\"I'm a little too short to get up there.\\\" Zane outlined. His lack of frustration palpable even with the dead eyes.\\n\\nMatt did as expected and sat their child at the counter in an open chair.\\n\\n\\\"Thank you.\\\" He said as he adjusted himself slightly in the seat.\\n\\nHe noted their expressions at his arrival. \\\"Yes?\\\"\\n\\n\\\"It's the whole 'my son being inhuman' part.\\\" Holly explained to him, an arm under her chin. Zane glanced at Matt for confirmation. He was only met with an equally perplexed look.\\n\\n\\\"You must understand.\\\" He said in a solid tone. \\\"This is more complicated than you think.\\\"\\n\\n\\\"Take your time. We have all day.\\\"\\n\\n\\\"I was wondering when he'd kill us in our sleep actually.\\\"\\n\\n\\\"Matt.\\\"\\n\\n\\\"Honest statement since we're all being honest...\\\" Matt confirmed as he raised his hands in defeat.\\n\\n\\\"Father, I would never.\\\" Zane raised an eyebrow. \\\"Mother, I had no clue you imbibed such. It isn't healthy.\\\"\\n\\n\\\"I get that. But that's beside the point.\\\"\\n\\nShe shuffled the pack away from him. Not that he seemed interested. But still, the general gesture imprinted on her mind.\\n\\n\\\"This human form is in fact limiting.\\\" He frowned a little. \\\"But that's to be expected.\\\"\\n\\n\\\"As opposed to what?\\\" Holly asked him sternly. \\\"What is so limiting?\\\"\\n\\n\\\"I have another question,\\\" Matt added. \\\"Are we really your parents? Because we're both human.\\\"\\n\\nZane opened his mouth to speak. Then closed it. Then looked at Holly. Before side eyeing Matt. He looked back at Holly, then harder at Matt. Holly seemed to follow him and then began staring at Matt too.\\n\\n\\\"...Right?\\\" Matt reacted. \\\"Right??\\\"\\n\\n\\\"What are you?\\\" She asked first.\\n\\nZane raised a small hand. \\\"It's more of a question of what he did.\\\"\\n\\nMatt dropped his shoulders at this.\\n\\n\\\"Matt, what did you do?\\\"\\n\\n\\\"I don't know. Is he saying I'm not human?\\\"\\n\\nZane simply took a deep breath which seemed to almost inflate his little figure. \\\"So you don't know?\\\"\\n\\n\\\"That I was a normal person. I grew up and went to school like everyone else. Got married and got a job. Then had a baby.\\\" He rattled off. \\\"Yeah. I remember all of that.\\\"\\n\\n\\\"It's worse than I thought.\\\" Zane glanced.\\n\\n---\\n\\nHave to take a break here.\\n\\n\"Alright. None of this makes any sense.\" Holly said as she took another sip of her soda.\n\n\"Good.\" Zane admitted. \"It won't.\"\n\n\"What? What won't?\" Matt asked.\n\nZane reached over to his dad's arm. And crawled up it like a bug. Holly went to say something, but he already leaned into his father's ear. He said something, at least she thought it was. But it became clear he'd actually latched onto the ear. Her 3 year old child was gnawing on Matt's ear.\n\nAnd then it was over. Matt laid across the countertop, spasming, a trickle of blood leaving his ear canal. Zane standing over him. His face carrying a look as though he was more worried about his mother's frozen expression than the fact he'd apparently sent his father into a seizure.\n\n\"Matt?\" She began to move. \"Matt??\"\n\nMatt sat up.\n\nHolly stood up. The chair banging against the floor as she considered whether to run towards him, or away from both of them.\n\nHis eyes were black too now. Endless pits to seemingly nowhere.\n\nHolly, hands fumbling, snatched a cleaver from a drawer on her side. \"What'd you do to him?!\"\n\nShe danced on her toes slightly, gathering a better grip on the handle of the knife as she watched him finish some deep breaths.\n\nMatt spoke something to Zane. The pair conversing some impossible language to each other for a brief. Before he turned to face her.\n\n\"It's alright Holly.\" He finally explained. \"I'm just fine.\"\n\nHolly didn't believe him, she scooted to the far corner of the island. Pointing at the pair of them with the cleaver as if she could chop her way out of whatever nightmare she woke up to this morning.\n\n\"What'd you do to him?\" She repeated.\n\nShe realized she'd left her phone on their side of the table.\n\nZane slowly spoke, \"I gave him his body back.\"\n\n\"His body back.\" She followed carefully.\n\n\"Yes. My body back.\" Matt explained. \"It's... a bit uncomfortable. It always is.\"\n\n\"What are you?\"\n\nShe shook after asking that. The air in the room seemingly filled with static charge that made her hairs stand on edge.\n\n\"I'm still your husband. He's still your son.\"\n\nThere was movement as he swept the cleaver from her and let it clatter into the water and ashes at the bottom of the sink. The move so deliberate, it actually caused her to let it go on instinct. He hadn't left a mark, yet the power behind it made her shrink back.\n\n\"Are you familiar with the concept that there's a world beyond this one?\" He asked her.\n\nHe'd walked the few feet to her so quickly it took her a moment to catch up and register that he'd closed in.\n\n\"Like an, an afterlife?\" She blinked.\n\n\"Not for the dead.\" He answered. \"For the living.\"\n\n\"...I don't really understand.\"\n\n\"I told you it wouldn't make sense.\" Zane chided from over Matt's shoulder.\n\n\"The hell are you people?\" She fretted. \"Am I one of you?\"\n\n\"No. And that's another matter.\" Matt promised. \"But that's not the problem.\"\n\nShe sensed danger again.\n\n\"What's the problem then?\"\n\n\"Well, in due time, all becomes clear.\" He alluded. \"What'd that storybook say? 'Be not afraid'.\"\n\nThe fact he smiled at this chilled her to the bone. But with that, he blinked and his eyes were normal. Zane's eyes were also normal now, as he sat on the edge of the counter.\n\n\"But, worry about that later.\" Matt smiled.\n\nHe promptly walked over and one armed Zane to his shoulder without a care in the world. \"Wanna' go get ice cream?\"\n\nHolly stayed in place longer than they hoped. But eventually she gradually came over to the pair of them.\n\n\"Okay?\" She decided. \"Does ice cream help with your human form. Or something?\"\n\n\"No?\" Matt balked. \"I just really want some right now.\" The pair smirking as though all was right with the world.\n\n\"...Alright. Let's go get something to eat.\" She stopped. \"You might want to. Wipe the blood off.\"\n\n\"I did.\" He answered.\n\nAnd to her alarm, it was already gone.\n\n",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1erzxux/wp_the_first_moment_you_laid_eyes_on_him_you_knew/li3wm5d/",
        "score": 54,
        "date_posted": "2024-08-14 13:50:05",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] “Let me get this straight. I, a Fae, have spent LITERAL CENTURIES studying the subtle arts of deception, glamour, deceit, and misdirection, and you, a mere human, can just stand there and say things that are untrue?!” “Yeah, that’s about right.”",
        "comment": "“Let me get this straight. I, a Fae, have spent LITERAL CENTURIES studying the subtle arts of deception, glamour, deceit, and misdirection, and you, a mere human, can just stand there and say things that are untrue?!”\n\n“Yeah, that’s about right.”\n\nVoss paused as he went back to reading the small glass case he kept in his pocket. Words and images scrolling by blindly as he went. She reached at the thing to smash it and regain her control.\n\nBut Shay simply pulled his hands out of reach and kept reading. A slight turn to put her at angle to his hip and not straight on.\n\n\"Surely you jest.\" Voss said as she hovered over now. Her wings vibrating the air similar to a hummingbird.\n\n\"Nope. Lying is easy.\" Shay flatly reacted. \"It's the truest truth that's ever been told about people that's true. We lie all the time.\"\n\nHe realized the woman was hovered several inches from his temple and absently swatted as her so she'd make some room. She landed and stomped her foot a little at the gesture, the wings giving off an iridescent shine as they readjusted.\n\n\"But why?\" She asked next.\n\nShay stopped texting and glanced up. \"Because fuck you, that's why.\"\n\n\"That's not an answer!\"\n\n\"Yes it is. That's my point.\"\n\nThe woman angrily glared at him. Then at the gorgon seated nearby. \"You. Lizard. Surely you know a good reason for his insolence.\"\n\nAmal pushed her sunglasses back on the bridge of her nose. \"Shay? He's always like this.\"\n\nThere it was. A name. A sharp grin crossed Voss' face. She would make this puny man's life a living hell.\n\n\"My dearest Shay is it not? I gift thee with-\"\n\n\"-That is not my real name. That's my nickname.\"\n\n\"Your *what?*\"\n\n\"Yeah?\" He looked up again, first at Amal, then at her.\n\n\"A nickname?\"\n\n\"They don't have pet names in Middle Earth?\" Shay asked her. \"You don't shorten anything, or give people  names after random shit in life?\"\n\n\"No.\"\n\n\"Sounds complicated.\"\n\n\"She lied to me.\" Voss pointed. Amal's hair wrap moved, and hissing could be heard.\n\n\"No, that's what I've always known him as. That's what everybody calls him.\"\n\n\"You lie about your own name?\" Voss turned to Shay now.\n\nShay finally put the phone away. \"Duh! Like I'mma sit here and let someone put a curse on me like it's just something to do. I got more sense than that.\"\n\nVoss quickly hovered around to be in front of him again. Wriggling her fingers in his face like she was scolding a dog.\n\n\"You are scared of my power.\"\n\n\"I'm scared of violating my probation.\"\n\n\"You're still doing that?\" Amal interrupted.\n\n\"Like two and a half years.\" He noted.\n\nAmal took a sip of her thermos. \"The kingdoms don't mess around these days.\"\n\n\"Hello?\" Voss redirected, knocking on his forehead with a fist. \"Are you in there?\"\n\nShay swatted her away again. \"Yes.\"\n\n\"Lie to me.\" Voss leaned back in. \"Lie to me. Let's hear it.\"\n\nShay looked around the room. Then at Amal. She simply shrugged and continued drinking coffee. He glanced at the fae as she continued staring at him, and quietly considering the quickest way to perhaps remove his heart. And so, he took a deep breath, palmed his forehead and began.\n\n\"The moon is made of cheese. Magic isn't real. Gravity is a myth. You can use aluminium foil in the microwave. Water is inherently poisonous. Fentanyl is a great part of a balanced breakfast. This place is Venezuela on steroids. I'm white.\"\n\nAmal choked for a second nearby.\n\n\"Radiation is great for your skin. Dogs can't look up. The Moon landing was fake.\"\n\n\"...Didn't you just say the moon was cheese?\"\n\n\"We landed on that muthafucka' though... The Brooklyn Bridge is for sale. Milk and Orange Juice go great together. I cannot believe it's not butter. Birds aren't real. This handgun is fake.\"\n\n\"You're on probation.\" The gorgon spoke.\n\nHe wrapped his hands around her shoulders and gently shook her. \"Is this working yet? Have I gotten through to you?\"\n\n\"It's not fair.\" Voss stammered.\n\n\"Fair only works in weather and maidens, and there aren't enough maidens to go around.\"\n\nAmal slapped the table at this one. \"Oh my God.\"\n\nVoss finally shrank down after he let go. She seemed satisfied, yet disappointed. Shay was still staring her in the face as if she'd ruined his entire day. Which, knowing Shay, she actually might have.\n\n\"Is that enough? Are you happy?\"\n\nShe threw her arms over his shoulders. \"...Marry me?\"\n\n\"Huh?\"\n\nShe fluttered her wings and hiked herself up to wrap him with her legs. Amal stood up in case she needed to free him from her grasp.\n\n\"Uhhhh, time for some truth.\" Shay reacted. He held up one of hands to show a ring \"I'm taken.\"\n\n\"...Wow that's kinky.\" Amal frowned.\n\n---\n\nSo you successfully seduced a fae? Roll for Charisma?",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1fed8ku/wp_let_me_get_this_straight_i_a_fae_have_spent/lmn916p/",
        "score": 557,
        "date_posted": "2024-09-11 14:39:35",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] A vampire hunter is forced out of their home for whatever reason. They're taken in by an unlikely host - a vampire they tried to kill in the past.",
        "comment": "Go figure the entire building would burn down. Not just one apartment. No. The whole building.\\n\\n\\nBut all things considered, it could have been worse. He saved the wife. He saved the kids. He saved the dog. Job well done. And on top of that, everyone else in the building was also accounted for.\\n\\n\\nIt was a tragedy. But it wasn't a complete disaster.\\n\\n\\nAnd so, Hesher found himself taking calls out of a local hotel room. It wasn't the best place to have an office. But it was discreet and he had enough spare cash to rent out two rooms.\\n\\n\\nOne for the family. One for business.\\n\\n\\nExplaining why you came home covered in injuries and somebody's else blood isn't exactly a good way to kick off the holiday season. The fact that half his Intel from leads went up with the complex didn't help either.\\n\\n\\n\\nSo when a knock came at the door, for once, he assumed the mundane. Insurance had been in touch, along with several other legal entities after things like this occur.\\n\\n\\n\\\"Hello?\\\" He asked as he opened the door.\\n\\n\\nNobody was in the hall.\\n\\n\\nHe reached at the back of his pants, hand at the ready. No one to the left. No one to the right. Normally, there was at least somebody walking around.\\n\\n\\nThe idea came to quickly check the door of the room across the hall. His wife's. It was locked.\\n\\n\\n\\nSomething grabbed his arm. And something else wrapped his head. And then something breathed near his neck.\\n\\n\\nHe was seated in a chair now. It was soft at least. His mind however went immediately to his family.\\n\\n\\n\\\"Hesher.\\\" A familiar voice rose. \\\"I'm sorry. Let's begin from the top. Hesham Saeed. Born in 1990. Morocco. Casablanca, no less! Blood type, B+...\\\"\\n\\n\\nSomeone ran a cold hand lightly across his neck. \\\"Here's looking at you kid.\\\"\\n\\n\\nHe heard someone snap their fingers. \\\"Right, where are my manners? Someone take that off him?\\\"\\n\\n\\nHe was greeted to a rather ornate office. A large and dark desk panned out. And behind it stood a rather familiar woman in a rather expensive dress.\\n\\n\\n\\\"Salome.\\\" Hesham adjusted. \\\"Queen of the West.\\\"\\n\\n\\n\\\"Not the full title. She toothily corrected. But, close enough.\\\"\\n\\n\\nHe was all to familiar with her inner circle. They'd each battled back and forth with Hesher and many friends of his for the better part of his life. Not all of them made it out alive. And so the never ending feud continued.\\n\\n\\n\\n\\\"You can untie him.\\\" She directed. Her\\u00a0accent giving the words a rather light tone.\\n\\n\\n\\\"I'm still alive. Why?\\\" He asked first.\\n\\n\\n\\\"I already ate.\\\" She said.\\n\\n\\nHe watched her retrieve a glass of wine. At least he assumed it was wine. A quick observation of the texture on the glass told him it definitely wasn't.\\n\\n\\n\\\"Though, I do love a good A Negative from time to time. It reminds me of someone near and dear to my heart.\\\"\\n\\n\\n\\\"You kidnapped me for a blood tasting?\\\"\\n\\n\\n\\\"No, Hesher.\\\" Salome cleaned her teeth. \\\"I hear you're currently, what's the word mortals use for it? Homeless.\\\"\\n\\n\\n\\\"And?\\\" Hesher urged on carefully.\\n\\n\\n\\\"The world is very different from when I left it.\\\" She admitted. \\\"I understand exactly how harsh it can still be. Your family is in the room across the hall at that hotel, no?\\\"\\n\\n\\n\\\"If you do anything-\\\" He spat.\\n\\n\\n\\\"Fique tranquilo.\\\" She said, now at his right. A finger resting on his lips. He didn't know when she moved.\\n\\n\\n\\\"If I wanted them dead. We'd be having a much more, personal talk, right now.\\\" She promised warmly. \\\"No. I want to gift you a home.\\\"\\n\\n\\n\\\"What?\\\"\\n\\n\\n\\\"A house. A domicile. A place to.\\\" She narrowed her eyes. \\\"Okay, you guys can bring them in.\\\"\\n\\n\\n\\\"Wait! Wait...\\\" Hesher shouted.\\n\\n\\n\\\"I kid. I kid.\\\" She assured. \\\"They are safe. You inadvertently helped my flock at one point. And you weren't the first of your lineage to do so for me.\\\"\\n\\n\\nHis eyes were still locked on hers in fear of the obvious.\\n\\n\\n\\\"So I'm offering your family a house. We have several properties in this city's limits alone. You get your pick.\\\"\\n\\n\\nShe returned to her chair. \\\"But, you have to do some work for me in turn.\\\"\\n\\n\\nHe glanced at her entourage of guards. One of them simply nodded his head towards his boss with an equally sharp grin.\\n\\n\\n\\\"Such as?\\\"\\n\\n\\n\\\"There's been some trouble with some of my latest investments.\\\" Salome explained. \\\"And we figured we needed the human touch. What do you say? Care to learn more?\\\"\\n\\n\\nIt wasn't like they were going to let him walk out of here. He knew better than that.\\\"\\n\\n\\n\\\"...I'm listening.\\n\\n\"You're a useful man, Hesh. Remember that. This envelope has the address, and should cover your usual down payment. Yeah?\"\n\nThe building didn't exactly look like much. A relatively blank strip mall, sitting off the edge of one of the freeways that cut through town. One end contained a long dead box store. The other an equally boarded up restaurant.\n\n\"After all, despite our conflicts, we both go back much farther than you think.\"\n\nThere were a few stores in the middle. But he focused on the relatively empty vape store just off center. No sense in being on offense immediately. It seemed like the place was empty.\n\nThe door chime went off and he wandered near the displays while he expected someone to show up.\n\n\"Hello?\" He finally asked. \"I'm wanting to buy something?\"\n\nNobody answered. He walked up to the main booth surrounding the register. He didn't spot it the first time. However, the blood trailing off the keys of the register and the puddle on the floor below.\n\nHesham did the right thing and checked his gloves. Then locked the door and switched the sign over to 'Closed'.\n\nThings started off odd. The puddle turned into a drip pattern. It was a bit old, but it was still drying. It led behind the booth towards another door. The stock room, was a different story. A bigger smear on a wall gradually fading orange on its way to brown.\n\nAnd more drip pattern. He followed it down the shelves. Until it disappeared. He walked towards the rear exit. Then went back and cleared the store again.\n\nThen he noted the small trace on the edge of the box. Moving that, he noticed how the shelving loosened. He moved the two next to that one and saw more blood on the plywood.\n\nUnderneath the lowest shelf was a door. They said there was one. It was what that number pattern was for. Turn the key, ten seconds to type the pattern, turn the key again.\n\nHe turned the key and the keypad lit up. It took him some concentration. But he turned the key the second time. And the door released. It folded up to the second shelf. And he drew aim at whatever was downstairs.\n\nThe drips were thinner. But the temperature was dropping. Fast.\n\nBelow the shop was some sort of lab. In it were several beds. Hospital beds. Opposite that, were several commercial fridges. The other medical equipment meant a few things.\n\nBlood bank? Or does that include organs?\n\nThe question came as someone rushed from another room. The figure hissing sharply as Hesham spun and staked their arm to a bed.\n\nHe dodged a swipe, a bite, another swipe, a talon. And staked the man again.\n\nHesham drew to finish him off. But someone else behind the attacker did that for him.\n\nThere was a brief moment of suspense as the vampire's head rolled across the floor before burning away\n\n\"...You move fast.\" This one spoke.\n\nHe kept his gun on her. She wasn't exactly as forward as her friend was.\n\n\"My boss sent you?\" She stepped back from the skeleton on the floor. \"Right?\"\n\nConsidering her apparel was more fitting for something casual like a vape shop. And less for attacking a well armed hunter up close and personal.\n\n\"You work here?\"\n\n\"Well, I did. But it seems like I'm all out of refills.\" She lamented. \"They took them all. The bags too.\"\n\n\"How do I know you're not lying?\"\n\nThe phone rang. Her phone. She answered.\n\n\"Yes, miss... Yes, he's here... Looks and smells like the guy.\" She winked.\n\nHe didn't lower the gun yet. She tapped the screen and waited.\n\n\"So they took the stock we had? Hesher?\"\n\n\"I'd say so.\"\n\n\"Okay, new plan. Escort Camille here to a safe location. Camille? Are any of the others still around?\"\n\n\"No?\" She sighed. \"They didn't make it.\"\n\n\"Accompany our new hire here. Meet up with our mutual friend. I'll send you the coordinates.\"\n\nCamille let the call end, and she watched the man conceal the silver stakes he'd used.\n\n\"We shouldn't stay Hesher.\" She finally stated.\n\n\"No, we shouldn't.\" Hesham agreed.\n\n",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gi7qjw/wp_a_vampire_hunter_is_forced_out_of_their_home/lv3omnt/",
        "score": 11,
        "date_posted": "2024-11-02 20:07:00",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] \"MIMICS CAN TALK!?\" \"Of course we can, you idiot, we're not mindless monsters.\" \"Then why do you guys always attack adventurers?\" \"You'd attack a stranger too if they opened your mouth and stuck their hands in it unwarranted.\"",
        "comment": "\"MIMICS CAN TALK!?\"\n\n\nRakiya looked at Tamari. She simply shrugged at the question. Per their reunion with Verana, its dearest friend. It did make a bit of sense how shocking this could be to people who didn't know better.\n\n\nAlthough, now that the secret was out, it was getting a bit old.\n\n\n\n\"Of course we can, you idiot,\" Raki shifted. \"We're not mindless monsters.\"\n\n\nTamari herself raised a hand to ask. \"Then why do you guys always attack adventurers?\"\n\n\nThe knight seemed to mimic a sigh of disappointment. The black and red steel suddenly disappeared into Raki's body as the figure molded into a giant mass of goop and teeth.\n\n\nTamari and their friend took a step back. Equal parts shocked and disturbed as Raki turned from a large knight in dark armor into a simple chest. Which opened to reveal it was full of gold.\n\n\nThe shopkeeper almost reached out to touch it. To lift a coin. Before Tamari grabbed his hand.\n\n\n\"Giosi, are you crazy??\" She asked.\n\n\nThe chest quickly grew razor sharp teeth, and a tongue that flailed wildly.\n\n\n\"You'd attack a stranger too if they opened your mouth and stuck their hands in it unwarranted.\" Raki snarled angrily.\n\n\nGiosi stared at the large maw. \"That makes sense.\"\n\n\n\"Do you at least tell them?\" Tamari said as she walked around the case.\n\n\n\"Why?\" Raki proposed.\n\n\nThey returned back to their form of a knight larger than she was. \"I have to eat.\"\n\n\n\"Ambushing people for food.\" Giosi muttered.\n\n\n\"And anything else willing to investigate.\" Raki admitted. They walked towards the table the keeper stood at.\n\n\n\"Unless. I choose to ambush them. *Myself.*\"\n\n\nThe last word really insisted upon itself. If this mimic could walk and talk, and armor itself against attackers. What could he, a lowly shop owner do? Giosi wondered how many times he cheated death in his younger years. And how close it was without his knowing.\n\n\nOne of these things could smile in his face. And he might not know until it took a bite.\n\n\n\"What brought you here?\" Giosi quietly asked.\n\n\nThe armor clinked realistically. \"You have some herbs and potions. We're collecting them for her mother.\"\n\n\nTamari simply ran a hand through her hair and nodded at him.\n\n\n\"...27 silver.\" He winced.\n\n\nTo his confusion, the mimic placed a hand on the table. And the coins appeared from nowhere.\n\n\n\"Thank you Giosi.\" Rakiya complimented. \"Good evening.\"\n\n\nAs they walked, Tamari finally spotted their tail. Namely Ren's tail as she dropped from the roof of the store into a tree. She landed on Rakiya's shoulders in a lazy hug before dropping to her feet. Not that the mimic had a reaction to the hit.\n\n\n\n\"You could at least warn him.\" Tamari advised.\n\n\n\"Meh.\" Ren yawned. \"Raki loves it. I was falling asleep up there. The sun's so warm here. It's comfy.\"\n\n\nRaki sat the bag down and stopped to look at them both.\n\n\n\"What?\" Tamari asked. \"...What's wrong?\"\n\n\nRaki leaned in a little. She quietly looked up at the helmet.\n\n\n\"I wonder if I can-\"\n\n\nThe knight turned to that fanged mass again, before shaping itself to look like the woman in front of him. Now she had a twin. It had her figure. Her height. Her facial structure.\n\n\nBut it was all black. A brackish color that made her sweat in anticipation. That snarling building again. A sound she could feel. And then, Raki returned to the suit of armor.\n\n\n\"Hmm...\" They spoke. \"Not yet. I still haven't gotten it right.\"\n\n\nThey picked up the bag and began walking again. Tamari softly sheathing the sword she kept. She was unnerved by the breath in an ear.\n\n\n\"Pretty good right? Raki must really like you.\" Ren whispered as she clawed at some fruit she brought along.\n\n\n\n\"If you say so.\" Tamari lowly spoke.\n\n\n---\n\n\nRaki returns again. For groceries.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gjudqg/wp_mimics_can_talk_of_course_we_can_you_idiot/lvgk0cv/",
        "score": 30,
        "date_posted": "2024-11-04 21:41:01",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] Mystical creatures from across mythology have been studying humanity for centuries. They desire to integrate and start trade in the 21st century.",
        "comment": "\"I just... Don't understand where to start.\"\n\n\nThe dwarf shifted in his chair awkwardly at this. Dip, as his mortal friends called him, rubbed his stubble absently.\n\n\n\"It's really not that bad.\" He presented. \"Actually, it's even better than where we came from.\"\n\n\nVoss summoned a pear and took a sharp bite out of it. \"How so?\"\n\n\n\"Well, you could.\" He hesitated. \"Find new work.\" She took another bite, glared at him further then, yet another.\n\n\n\"You doubt the work of the Fae. And you suggest we are weaker than we appear. What does a man of rock and stone know of what we do?\"\n\n\n\"Not much?\" Dip propped a foot on the table's edge and leaned his chair up on two legs. \"Well, other than trickery, wanton slaughter, and otherwise making the lives of non magick users a living hell.\" He added. \n\n\nVoss frowned at this answer. \"Even most of them know better. They even named a whole genre of children's stories around being careful around people like you. You know, Fairy tales?\"\n\n\n\"That's enough out of you!\" She slammed the table. A peculiar thing happened. She didn't expect the others to react the way they did.\n\n\nAll of those present treated her like a threat.\n\n\nShe had always left the elves to their work. The gorgons and weres to their land. The humans to their own hubris. But the whole room still turned on her at the drop of a hat. Even she knew when it was a bad play. \n\n\nShe might get some of them. But the ones that she didn't would more than likely get her.\n\n\n\"You work together here? Why?\"\n\n\nDip sat his chair back up and sat back down to prop himself up with a leg again. \"Isn't it obvious? It pays to be kind.\" \n\n\n\"Quite well, I might add.\" The elf that ran the clinic added.\n\n\n\"You amassed an army yet again, Grey.\"\n\n\n\"The more I think on it.\" He shrugged. \"I guess I did.\"\n\n\nShe simply fluttered closer. \"Was it all because of me?\"\n\n\nThe elf snapped his fingers in recollection. \"Because of people like you. Yes.\"\n\n\nHe brushed his hand by her face and a gust blew her backwards into her chair. \"You can do the whole supreme dictator thing here again if you like.\"\n\n\nGrey took over Dip's place in his chair.\n\n\n\"People here try it all the same. But at the end of the day. Eventually, you have to live your life. How long do you think it'll last with everybody plotting against you? You can't be on top forever.\"\n\n\nHe pointed at the few humans sitting nearby. \"They've reminded me of that. And you can fight, you can run, you can try to hide. But believe me, they're much better at hunting here than they ever were back home.\"\n\n\nVoss considered her words wisely. \"Just because our worlds have merged, does not mean such things are true.\"\n\n\n\"You'll just have to see for yourself.\"\n\n\n\"For what it's worth, she could be a lawyer.\" One of the humans added.\n\n\n\"Ooh, or a talk show host.\" Another added.\n\n\n\"Nah, that's fucked up. She'd try to kill up the whole tri-state area.\" Her latest crush noted.\n\n\n\"Shay's right, that's too OP.\" \"A magician? I got a ex that works down at the amusement park over by the water.\"\n\n\n\"Ah, no, that. JohnBoy, that actually sounds worse. Because when you think about it, people would give her their names.\"\n\n\n\"And then she kills up the tri-state area- What I said.\" Shay counted.\n\n\nVoss wrapped her arms around his neck. \"Mmmh, I knew I could count on you.\"\n\n\nHe started shaking in his seat like a misbehaving child.  \"I told you before I'm married. Get off me!\"\n\n\n\"Only if you give me your name.\"\n\n\n\"No.\" He shook. \"Yo, help me.\"\n\n\n\n\"You got a Fatal Attraction.\"",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1ga0frd/wp_mystical_creatures_from_across_mythology_have/ltajbge/",
        "score": 2,
        "date_posted": "2024-10-23 00:20:40",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] Because Wood Elves strive to live in harmony with Nature, they are often thought to be peaceful, harmless even. However, those who think so have no idea what Nature truly is.",
        "comment": "\"You fight the land. Why?\"\n\n\nHe asked the traveler. A despondent look across his face. \"Why?\"\n\n\nThe younger man simply pushed himself a bit off the bed to look at him. The wraps covering his wounds stretching at the effort.\n\n\n\"Have to.\" He grimaced. \"Have to survive somehow.\"\n\n\nThe ears twitched at this. The elf running a hand over his beard.\n\n\n\"I'll never understand it.\" He remarked. \"Mortals. You can't comprehend magick like us. You can only use your might and your mind.\"\n\n\nHe stood and took stock of the odd items littering the table nearby. A leather pouch full of odd paper and some odd bendy cards. The strangest playing cards Aristeinn had ever seen.\n\n\nA headpiece similar to what a paladin or knight would wear. But it was smooth. Light. Like no metal he'd expect. A colorful design circling the edges. A ring of keys, of which he couldn't begin to guess unlocked.\n\n\n\nTwo small handheld devices. Some tome of some sort? Aristeinn ran his hand over the odd symbols dotting raised lumps.\n\n\n\"No-ki-a?\" He asked over his shoulder. \"Is that your name?\"\n\n\n\"...No.\"\n\n\nAnd the last item, it was a handle, seemingly for a knife. But there was no blade. Until he poked the small latch he found and a blade sprang free from the handle.\n\n\n\"Interesting!\" Aristeinn remarked. \"I must say. You are a troubled lot. Always attacking our realm. But I must say, the craftsmanship is quite impressive.\"\n\n\nHe approached with the knife. The traveler wary of it for some reason. But he sat it in an open palm of theirs. Waiting until the young man worked the action and slowly closed the knife against a thigh.\n\n\n\"Why have you cut such paths that separate our worlds apart? How?\"\n\n\n\"Paths?\" The traveler spoke. \"What paths?\"\n\n\n\"Our land, our home. It shrinks by the day, it seems. To you, it might be a lifetime.\" Aristeinn explained. \"But to me. It was like last night. This forest. The land. It stretched forever.\"\n\n\nMarco eyed the pair of men outside the door. Swords at their sides. A lack of emotion in their faces.\n\n\n\"But, I've seen glimpse of the next world.\" Aristeinn carried on. \"The world linked to ours. How much you've claimed. How much you've uprooted.\"\n\n\n\"And?\" Marco urged carefully.\n\n\n\"What does defeating nature so harshly serve such men?\"\n\n\nThe elf seemed disturbed in his findings. Another kingdom so populated, yet so hauntingly distorted.\n\n\n\n\"...Well, I guess that's an age old question isn't it?\" Marco answered. His ribs still ached. \"I never thought of it. You see it as something new. It's been there forever to me.\"\n\n\n\nHe gave life to the idea. \"I'm used to it.\"\n\n\n\"Was it always like this?\"\n\n\n\"No. But that's how it is.\"\n\n\n\"You may serve your king as you wish.\" Aristeinn warned. \"But here, we rule with impunity. It'd be wise to show our woods respect. Or else.\"\n\n\n\"I can barely move.\" Marco muttered. \"It's not like I'm going anywhere anytime soon.\"\n\n\nWith that the elf stood and went back to the door. A weary look on his face.\n\n\n\n\"Very well.\" He sneered. \"Nirmala, you can keep this guest until he heals. But he is to be removed as soon as able.\"\n\n\n\"Yes, your majesty.\"\n\n\n---\n\n\nThe pair of them stared at the trees as they walked.\n\n\n\"...Shay, maybe he's dead up in here.\"\n\n\n\"He's not dead. I'm telling you.\"\n\n\nA tug on his shoulder caused him to look at the face in the dimming sunlight.\n\n\n\n\"You saw the wreck.\" Aurelio remarked as he messed with his bag. \"It looks like-\"\n\n\n\"If he's dead. Rillo?\" Shay waved the light like a fist, \"Where's the body?\"",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gr6w17/wp_because_wood_elves_strive_to_live_in_harmony/lx4fnx0/",
        "score": 10,
        "date_posted": "2024-11-14 13:07:41",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You’re a professional matchbreaker. Opposite to a matchmaker, you’re hired by concerned friends, jealous exes, desperate simps and everyone else in between to end an existing relationship from behind the scenes.",
        "comment": "\"That's all there is to it.\" Max smiled. \"You make up, I break up.\"\n\n\nPaula considered the concept further as they walked.\n\n\n\"So you can get them to breakup?\"\n\n\n\"For a fee.\" He reminded her. \"And just to be clear. This isn't because of jealousy is it?\"\n\n\n\"Huh?\"\n\n\n\"I may be a textbook villain. But I'm not a homewrecker.\"\n\n\nShe thought he might be joking. But the look on his face said otherwise.\n\n\n\"Okay.\" She exhaled. \"No it's not because I want him for myself.\"\n\n\nHe continued glaring. The only reaction a raised eyebrow.\n\n\n\"I don't want to date her either.\"\n\n\n\"Alright then.\" Max smiled again. \"Let's proceed.\"\n\n\nThe date was a simple one. Coffee at the local cafe. The modern day classic if there was one.\n\n\nThe marks, Dora and Paul, at first glance seemed happy enough. If Max was certain, they were really hitting it off. Per information given, this was their 3rd or 4th date. They were smart. They were taking things slow.\n\n\n\"So what's the plan?\" Paula asked from their vantage point.\n\n\n\"Well, they're being careful it seems like.\" Max said as he observed. \"That's healthy. You said they haven't slept together yet?\"\n\n\n\"No. Dora's careful about that.\"\n\n\n\"Good. That's good.\" Max thought aloud. \"They're still in ghost territory.\"\n\n\n\"Ghost territory.\"\n\n\n\"Here, give me Dora's number.\"\n\n\n---\n\n\n\n\"So, I got up and left.\" Paul finished explaining.\n\n\nDora half sipped on her drink and broke into laughter at the story. Paul tried to make himself smaller, because it felt a bit too early to laugh too much.\n\n\n\"That's, that's great.\" Dora grinned.\n\n\nHer phone vibrated on the table and she picked it up. Paula texted her.\n\n\n\"*Girl.*\" it read.\n\n\nBelow that was a video. She hit play.\n\n\nPaul was at a party. Paul was drinking. Paul was smoking. Paul got kissed by another woman. On the lips. Paul had the same lady's head in his lap.\n\n\nShe locked the phone and sat it down.\n\n\nPaul drank his coffee as he stared at his own phone, before he realized that she was watching him.\n\n\n\"Yes, sorry,\" he apologized. \"I just had to check my emails.\"\n\n\n\"Emails?\" She repeated.\n\n\n\"Yeah.\" He confirmed.\n\n\n\"...Emails?\" Dora insisted.\n\n\n\"Yeah?\"\n\n\nThe vibes were off. Paula looked at the phone he held and the expression his face carried. It was blank yet peaceful.\n\n\n\"I,\" Dora debated. \"I have to go.\"\n\n\n\"Really?\" Paul frowned. \"But we just got here.\"\n\n\n\"I have to go!\" Dora insisted loudly.\n\n\n\"Okay, you rode here with me. I'll drive you-\"\n\n\n\"I have Uber!\"\n\n\n\"Okay.\"\n\n\nPaula watched her storm off around the opposite side of the strip mall. Then at Max, who happily rolled his fist backward like he was reeling in a fish.\n\n\n\"Hook, Line, and Sinker.\" He jeered. \"That'll be $600 little lady.\"\n\n\n\"But I paid you $250 already.\"\n\n\n\"That's the non refundable deposit.\" He promised. \"Now, cash, credit, or Cash App?\"\n\n\n\"I guess, Cash App?\" She realized. \"Do you do Venmo?\"\n\n\n\"That can be arranged.\"\n\n\n---\n\n\nI'll break here. He's a busy man. Should I go farther?",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gf7bq7/wp_youre_a_professional_matchbreaker_opposite_to/lug50i8/",
        "score": 16,
        "date_posted": "2024-10-29 21:01:02",
        "subreddit": "WritingPrompts"
    }
]