[
    {
        "post_title": "[WP] \"Just because a lab accident turned me into a monster doesn't mean I'm just going to stop my experiments. Hell, my tranformation has given me a whole new avenue of research for me to investigate.\"",
        "comment": "\"Hello, and welcome to, stop screaming, welcome to Energize Astro Inc. I am, security 3 from the main door coming out, I am DOCTOR Amon Patterson and I'll be your supervisor for your residencies. As you can currently see, I no longer retain the typical human form, but it is still myself here. If you can not stomach working with me, you may follow your peers out the front door.\"\n\n\"Okay, you ten... more than usual, huh, follow me. And don't forget your eye protection. I know more than most how important it can be, hahah! Oh, Kyle was it? Kylain, apologies. Kylain, would you be so kind as to carry this bag with you? No judgement, some judgement, but I think you'll need it.\"\n\n\"Here we have, Kylain in the bag please, here we have our mutagenic application division. The properties of Unidentified Substance #15-9C, colloquially referred to as 'Goo' by the more lax, is what actually gave me my most current form. As you can see here, here, here, and here, each of these four specimens were from the same brood. Originally, Rats! Notice, the eyes and how the hair has collected around the tails. The new appendages, not quite as dexterous as mine, are actually a recent development. Yes, Miss... Valorie? No, they all received the same amount of 15-9C, down to the mole. Isolating the variants has been a pain, but we are able to determine the new growths with SOME specificity.\n\n\"Moving on! Mind the slime boy. The janitorial staff hate me, I have to clean out my own waste basket, imagine that. The old university never would have treated me that poorly. I assume most of you are from referral? Dominik? Knew I'd get one. No, Dominik, so many tend to run out I don't read your resumes. Sadly, my time is not infinite. At least, to my current knowledge. I do appear to be generating quite a few more cells these days. No, I will not be answering on how I eat. Hands down.\"\n\n\"Over here, you'll see the larger... Kylain, if you do that again, I'm going to have security escort you out. The larger specimen are much more varied. Abilit OH! ... don't... haha.. don't... don't worry the walls are... they're reinforced daily. It used to be a... oh, I'm so sorry about the spikes I can't quite control those yet. Did I stick anyone? oh thank god. One moment.... Ah....\"\n\n\"It... it used to be a bull, caught in the same reaction as myself. Though, hmm? No, um... help me here... Ishaan, no Ishaan the current status of the initial reaction is considered classified. And also... embarrassing. I'm not at liberty to discuss anything further... though if you can figure out how to sedate that thing I'll break silence. Consider that an incentive, eh? It includes quite a few gallons of whiskey and... several microwave ramen.\"\n\n\"Over here is Subject #15.  Miss Maria... OH, apologies, Doctor Maria, I'd forget my own brain if it wasn't attached to my rear. You had your hand raised? Yes, it is isolated and we can confirm the wormhole is stable. Unfortunately the process is... yes, classified. You'll be working with Doctor Porter later if you obtain level 2 clearance.\"\n\n\"Mess hall is on the left, no I will not be eating with you, our beneficiaries have kindly allowed me my own space for such needs.\"\n\n\"Oh, that's not a good sound. Quickly young ones, into the mess hall. Quickly. Everyone on the tables. MISTER DOMINIK ON THE TABLE NOW!\"\n\n\"MISTER-\"\n\n\"Dominik... okay, containment breach. Idiots at maintenance must not have...\"\n\n\"WHAT IS IT? Sorry. Sorry. I'll.... please be mindful of the spikes. They contain a hallucinogenic.\"\n\n\"I'm sorry, but we'll have to stay here for a few moments. Security is well-trained in these matters and... NO I WILL NOT FIGHT THAT THING!?!? I may no longer appear human, but I am in no manner a trained combatant! Do you think these tentacles are strong enough to hold subject 15-2 back? NO? Yes? No!\"\n\n\"We just need to wait for the.... ah, the all clear.\"\n\n\"Hold on to the tables and careful of the sides.\"\n\n\"Okay, so this is an ion field bubble. Expensive.... very expensive to run. Our beneficiaries may be wealthy but.... no touching Kylain! that you're interested in... no, we do not have infinite resources, so we must be sparing with this containment method. One of the reasons we... I'm so sorry dear, but... the security detail knew what they were signing up for. It's... it's best not to pay them any mind. It makes it easier.\"\n\n\"I do apologize, but... we'll resume the orientation tomorrow. Your sleeping quarters are across the hall. If you wish to leave... I understand. I'll inform management and we can ensure this is erased.\"\n\n\"Thank you for your honesty.\"\n\n\"Miss Kylain... Dominik, he's... oh. I... I'm sorry. If you'll permit me, would you like to talk more? The rest of your cohort chose, peace of mind. You don't seem the type of person who would enjoy work here. If he was your only...\"\n\n\"Oh, your idea?\"\n\n\"I... I think I can understand. I do hope you feel better Miss Kylain. I'll... We'll confer more tomorrow. I'll let you get settled. I have... there's stuff I need to document when...\"\n\n\"Until tomorrow then.... and... for what it's worth, welcome to Energize Astro.\"",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1aonrjl/wp_just_because_a_lab_accident_turned_me_into_a/kq1khzv/",
        "score": 66,
        "date_posted": "2024-02-12 00:00:45",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] For a vampire, the zombies are just an annoyance. The real issue is finding an edible meal.",
        "comment": "I climbed the steps of my tower and cursed at my twice broken ankle. Lightning was storming outside, just the right natural conduit I needed to perform. The townspeople were gathered below as I stood above them. A flash of light illuminated the barren fields, the miles of stumps and, far in the distance, a castle.\n\n\"Many of you have lost!\" I scream above the tempest. \"Loved ones! Homes!\" Rain crashed so violently I gripped the parapets of the tower. Already the torrent soaked past cloak and into bone. \"We have lost our way of life!\" I feel a tingle on my neck. \"BUT NOT OUR DEAD!\" I screech into the night. Blinding pain and draconic roars fill my body and shatter my bones. I cry to the night as I hold the energy within.\n\n\"WITH THIS MIGHT!\" I scream towards the people.\n\nAnother strike finds my body. A guttural animal plea escapes my throat.\n\n\"WITH THIS PAIN!\" I scream at the castle.\n\nA final strike. My body convulses and I fall, the energy is too much. TOO MUCH! I only see blinding white and agony. My throat raw from screaming but I need to hold on. I need to do it.\n\n\"I SUMMON THE DEAD!\" I beseech the storm, and outstretch my hand.\n\nLightning connects my fingertips into the heavens and for just a moment the whole world is silent. I feel an ache. I can't stand. I feel death's approach.\n\nLightning strikes nearby and I register the thunder, as I attempt to roll onto my side. Screams sound another has found the Earth. I cry out in pain as my hand slips on the rain-slicked stones and I tumble back into a clump. I feel footsteps and my darling Yvette hauls me to stand under her shoulder. She had stayed below, despite my warnings. As always.\n\nWithout word nor motion, she brings me to the ledge and allows me to view the fields and chaos.\n\nMore bodies are standing, but oddly, while others are running.\n\nI raise my hand partway.\n\n\"My army of the dead.\" I whisper, clinging to my darling Yvette. She grips my hand and holds it out straight. She never learned my arts, but she understands what I attempt. I repeat myself after her help. \"My... army... of the dead.\"\n\nHalf of the remaining townspeople below stand at rapt attention, despite the typhoon, unbothered by the weather or their own decay. They hear me whether I whisper or shout.\n\n\"Kill the vampire.\"\n\nThey stay still. Staring at me and Yvette. No, no, they should have marched off. Marched to his doom. Why...?\n\nA lightning flash turns to horror in my heart and I raise my eyes to see a face of fury and disgust above me. Skin as pale as silk with a cloak of pitch black twisting in the chaotic winds. His clothes befitting the noble birth he has seized. \n\n\"You have made a *grave* error.\" A furious whisper seemed to chill all the blood in our veins. \"Did you think these creatures could end me? Did you think I would fear their mindless attempts?\" I clung to Yvette who stood gripping me as my body attempted to join the dead.\n\nAs if to prove his point, the fanged man swung low and reappeared above us all holding the skeleton of a young man. Decay having stolen his skin, the vampire his chance to grow tall. In death, and by my magic, he clawed at the monster holding him. Attempting to reclaim an ounce of the life that had been ripped from his veins. And in an instant, his skull was crushed. With each hand, the vampire crushed the spine, the collar, the shoulders, the arms, on and on until nothing but dust remained. \n\n\"You will *suffer*, mage. You could have served and lived a good life. An eternal life.\" \n\n\"It would not have been a good life.\" I hear Yvette answer in my stead. I feel the wind and I collapse, Yvette is gone and floating above me, her neck held in the vampire's hands. \"Look at me, fool. Beg her forgiveness for your folly.\"\n\n\"It... it is okay, my love.\" Yvette struggles to say, holding onto the iron arm of the undead king. \"You... always tried to do things on your own.\"\n\n\"I'm... I'm so... I...\" tears are in my eyes, stolen by the falling rain. \"YVETTE!\" I scream as I struggle to lift my head to see her.\n\n\"My flaw... is to rely on others.\" I hear her.\n\nSuddenly she falls and the vampire king turns to catch clouds of wooden stakes. I hear Yvette cry out and I see her bleeding near me. I try to crawl to her, but she is already standing. Rushing to me. I see. My darling Yvette. While I toiled with the dead. You toiled with the living. She grabs my cloak and flings us both off the tower into the crushing arms of the dead. The living hide between, holding weapons and firing, disappearing into the horde. \n\nI see the vampire above shudder as a single bolt pierces his leg, but he can not see its source in the rain and through my horde. My Yvette's army. Our war is far from over.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gs8pgh/wp_for_a_vampire_the_zombies_are_just_an/lxe08gs/",
        "score": 3,
        "date_posted": "2024-11-16 00:06:54",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You are stranded in the middle of the forest in winter, and your only company is a stranger on the other side of a handheld radio. They are very far away.",
        "comment": "The mountain pass here collects the snow durong Winter. We essentially get cut off from the world for 6 months out of the year, sometimes more if it's one of those weather pattern years.  \nThis year... it's bad.  \nPretty much everyone in town left once the almanac was released back in August. It was a mad dash to make sure everything was locked down.  \nI... didn't really have anywhere to go. Family, friends, romance... it all just sorta faded away through the years.  \nA nice young woman came by and gave me an old radio, for emergencies, she said. She's a nice one, but I said I'd be fine.  \nIt occurs to me that I should have left with them. Asked for a ride. I think as I stab at what I assume is the last deer in these woods. I'd gotten pretty decent at hunting. But you can't hunt what doesn't exist.  \nIt's August again and the roads still aren't open. I've already broken open half the homes. I should have enough food with this deer... assuming the thaw doesn't skip again.  \nWhat's killing me the most is the boredom.  \nI've lived up here for 9 years, not much happens. But you can't even watch the squirrels anymore. Especially since I already made soup outta them.  \nI look over at the radio again...  \nIt's not like I need help. But hearing a voice might be alright.  \nIt's battery operated, which is good since I've never needed much electricity to keep going. It's just a metal box. Got an old condensor microphone disc on it. It sputters a bit when I turn it on.  \nThe first sounds I try to make are... almost inhuman. I'm not one to talk to myself, so it'd been a while since I'd said a word.  \nThe machine crackles, like it's judging my lack of words.  \n\"Hello?\" I manage to scrape out from under my beard.  \nThe black box seems to sit patiently. Waiting for me, or someone else to respond.  \nI consider saying it again, and decide against it, listening to the light hum. It... was nice to hear something besides the wind. It must have been about 15, 20 minutes later when I'm shaken from my reverie.   \nA crackle, the sound of rustling. \"Hell... hello? Can... can you hear me? Who is this?\"  \nIt sounded like a woman's voice. Mousy. I could almost picture her.  \n\"... just an old man. I'm\" what was I doing here? Asking for help? Looking for rescue?   \n\"I'm... checking in on the weather. Some of my neighbors took off after the frost. I've been fine here on my own. I am. But, they might be mad I took some of their canned goods. I figure I should do some repairs , pay them back. August is normally when the almanac is published. I was... \" normally someone had cut me off or interrupted me by now... she was a good listener.  \n\"I was wondering... if you knew if the frost was going to keep going. Let me know how long I have to fix things up for them.\"  \nBuzzing.  \nAnd.  \nStatic.  \nShe must have gone to get her copy. I sit and listen to the hum. It drones and fills the cabin. Beating out the silence, piercing it and overtaking the wind. Peaceful. Calm. Steady.  \nA good while later I hear a quick pop.  \n\"I... I can't really tell. If... um... if you.. oh gosh. Um... I mean, if you could give me your coordinates. Maybe? I don't really know what almanac you're talking about.\"  \nCoordinates. Not knowing the almanac.  \nI'd lived in the city before, that was a city girl. Probably never touched dirt in her life. I chuckle a little at myself. The radio was going a long way out. Too bad I never really learned them.  \n\"The Farmer's Almanac. Tells us what to expect for the weather. I ain't got good coordinates on my mind. This ain't the best little hut for that kind of stuff.\"  \n\"My name's Marcy... I forgot... it's Marcy.\"\n\n\"My name is Harold.\"\n\n...silence.\n\nI figure she's... all done talking. That's okay. But it was nice to know.\n\nOver the next few days, I talk to her some more. She's a thoughtful girl. Interested in astronomy. Though she always waits and considers her words... even if she stumbles over them. I figure she has a recording machine or something on her end. Makes it a voice mail. She seems smart enough for that.\n\nEventually, she lays out how I can cut down the box. Make it a little more portable.\n\n\"You'll need it eventually. I mean... just... it's going to get colder.\"\n\n\"I'm fine.\" I try to interrupt, but she keeps going like I never said a word.\n\n\"If I'm right about your location, a big storm's coming. You won't be able to get through on your own.\"\n\n\"Marcy I-\"\n\n\"You need to reach the next town over. Please Harold... it'll... it'll be difficult, but... but... I don't want you to die.\"\n\nAh... that's just cheating. I admire that though. She might seem soft, but she never let's you interrupt her.\n\nIf I'd had a daughter...",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1apjz0z/wp_you_are_stranded_in_the_middle_of_the_forest/kqaezy7/",
        "score": 3,
        "date_posted": "2024-02-13 16:01:32",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] Time travel exists, but is dangerous and unreliable. Museums turn to people like you, black market \"jumpers\" willing to risk it all.",
        "comment": "\"It was after my wife left.\"\n\n\"I was so green back then, and it took me a while to realize that some of the filing clerks make a little cash on the side with selling off lists of 'potentials'. I'd hate them, but it's not even worth the effort.\"\n\n\"I was... well, most of you probably know how I felt. You don't really sign the papers to jump if you have a life. A good life.\"\n\nThe man paused his story. His scarred peachy left hand seemed to flex, searching for the cigarette it was so used to holding.\n\n\"My first jump, they stripped me down, hooked me up and told me to watch my step. My objective was a... well the Library. You all know the one.\"\n\nA few of the others chuckled at that.\n\n\"Yeah, I swear the place was probably empty by the fire.\" He laughed, a hoarse but light chuckle.\n\n\"Anyway, they didn't really tell me much of what to expect. It's pretty much roulette to see if you're capable, right? Why waste the breath?\"\n\n\"I... I heard it hurts.\" A young voice piped up. The young woman couldn't have been more than 20, barely an adult. Her hair cut short enough you could see the light copper skin of her scalp.\n\nThe older man nodded. \"Hurts more than you think. You're not just dying, you're reviving. Experiencing fire, drowning... every one of your ancestors and their deaths.\"\n\n\"It's... unpleasant.\" He said, picking up a log and tossing it onto the campfire. \"And unless it's particularly unpleasant, you end up getting lost in the stream. Probably why short jumps are wors.\"\n\nThe young woman nodded and tightened her arms around herself. The man wasn't sure if it had made her more or less sure.\n\n\"I wake up next to my great great great grandpapa.\" A round of laughter seemed to go around the campfire. The young woman smiled nervously, unsure about the joke.\n\n\"Well, I dodn't know how to split right. And I was tired, so... I stayed in bed.\" The laughter seemed to grow worse followed by a few scattered \"NO\"s mixed in.\n\n\"I didn't know!\" The man raised his hands defensively. \"So soon, I feel my stomach to rumble... and \" he smacks his hands. \"VOOOOT, I split forward and fall all the way back on old mam-ma.\"\n\n\"YEAH, LAUGH, ya degenrates.\" He said with a smile. \"I know I'm not the worst first split here.\"\n\n\"Don't you fucking dare.\" Said a dark-skinned man, half-jovial, half-threatening.\n\n\"I scramble out, avoid getting the shit kicked out of me,  and realize, I'm naked, don't know the language, and my pap-pap did not give up easily.\"\n\n\"So, I'm running in Egypt, look like this. Things aren't exactly going well. But I have to tell you, I don't think I ever laughed more. God, it felt... weird to laugh.\" The man seemed to smile at the memory.\n\n\"I got away, and managed to mime my way into the library after a day or so. The museum jerks may not have told me about much, but they made sure I knew what to grab. Soon as I touched it, I could feel the rumble in the gut. Popped back up home.\"\n\nEveryone laughed and cheered a little lazily at the end of the story, a few side conversations never quite ending. The young woman got up and changed seats, walking closer towards the older man.\n\n\"What... what would have happened if you weren't already right next to the... to your target?\" The young woman asked.\n\n\"Well, after about 3 or so days, you start to feel a little thin. By the 8th... you just don't stop hurting. Like you're in the stream without a way out.\" He seemed hesitant. Unsure if he should say less or more. \"Jumping...  it's not nice, kid. It can be fun, but... unless you-\"\n\n\"I don't have a life here.\" She said almost too quickly, her left arm hugging herself while her right hand seemed to reach for a loch of hair that she no longer had.\n\n\"You say that but-\" the old man tried to interject.\n\n\"And I know it.\" Her arms locked to her sides, defiant. \"I'm still going to do it.\"\n\nThe old man considered her, and saw twin fires of doubt and determination in her eyes. \n\n\"This isn't like the museum jobs. Solo jumps... they're worse. Hurt more. People die more.\"\n\n\"I won't.\"\n\n\"And you can't change anything. Not... not that you shouldn't. You can't. Doesn't matter how hard you try.\"\n\n\"I know.\"\n\n\"Sleep on it.\"\n\n\"I'm-\"\n\n\"We'll need five SOBER people to run this.\"\n\n\"I thought you only needed two.\" She said, a little doubt creeping into her voice.\n\n\"Museum machines do, we need five. Now sleep. If you're that sure, another day won't rattle you. For now, enjoy your night. It might be your last.\" He raises his can at the young woman and downs the last of it.\n\n\"I'm sure.\" The young woman said more to herself than the old man. \"I'll get it back.\"",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1aviz35/wp_time_travel_exists_but_is_dangerous_and/krd6uac/",
        "score": 4,
        "date_posted": "2024-02-20 18:03:02",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] \"Don't press the button.\" \"This button?\" \"No, this one-oh.\"",
        "comment": "\\\"It's so dark in- MOTHERFfffffffffffffrankincense.\\\"\\n\\n\\\"Keep it down. We don't waaaaAAAAAaaaaaannnntttt... anyone knowing we're here.\\\"\\n\\n\\\"Just turn on the lights.\\\" a small girl's voice said from the top of the dark stairwell. With a barely audible click, light flooded the sub-basement and illuminated the two men nursing bumps on their heads. \\\"No one's awake, and my dad works late anyway.\\\" She said as she lightly walked down the steps and slapped the beam that the two men had smacked their heads on.\\n\\n\\\"Child, we can take it from here.\\\" said the larger and darker haired of the two men. \\\"Run on back to bed now. The... uh...\\\"\\n\\n\\\"The safety inspection and repairs will be... dangerous. We'll have to activate the unsafe machine. To see what needs... safety parts. Attached.\\\" The smaller man said.\\n\\n\\\"Right.\\\" The small girl said. \\\"But my dad didn't build it with just an on-off switch.\\\" She smiled and lightly stepped ahead of them towards a door made of solid steel. \\n\\n\\\"We are smart night safety inspectors. We-\\\"\\n\\n\\\"And construction workers.\\\" The smaller man chimed in.\\n\\n\\\"Yes, we are smart night safety inspectors and construction workers. We can figure it out on our own.\\\" The larger man said.\\n\\n\\\"Of course.\\\" The little girl said as she typed in a 16 digit passcode she'd seen her dad enter a few dozen times. \\\"Just don't push the button.\\\" She said with a bow, waving the two men into the main chamber. Lights began to flicker on, illuminating an auditorium stretching deep into the ground. Seating lined the walls and a stone staircase descended to a central dais. Above floated a black cube.\\n\\n\\\"My dad spends every day here. It gets noisy. So mom put in the door.\\\" The small girl said as she jumped from row to row next to the stairs.\\n\\n\\\"Child, you'll get hurt if you keep jumping like that. It is much safer to go to bed.\\\" The larger man said as he slowly descended the staircase.\\n\\n\\\"Of course, Mr. Safety Inspector.\\\" The girl said in mid-air without looking at him.\\n\\n\\\"And construction worker.\\\" The smaller man said as he tried to keep pace with the larger man's steps.\\n\\n\\\"Of course, Mr. Night Safety Inspector and Construction Worker.\\\" the girl said as she made another leap. Her foot slid off the edge of the seating, but caught herself before fully falling.\\n\\n\\\"Child, go to bed. Thank you for your help, but it is time for sleep.\\\" The larger man said as he reached the black cube.\\n\\n\\\"He's right, little girl. It's going to be boring. You need to leave.\\\" \\n\\n\\\"Okay.\\\" The girl said. \\\"But I need to point out the button you shouldn't press first. It'd be DANGEROUS if you pushed it. You're making sure things are safe, right?\\\"\\n\\n\\\"Child-\\\" The larger man started before a tug on his sleeve and a look from the smaller man stopped him.\\n\\nThe larger man approached the black cube and saw there was no interface, no keyboards, no screen to view, no sensors of any kind. \\\"Fine, child. You may show us the danger button. BUT\\\" His tone sounding more like thunder than human speech \\\"after you help,\\\" He held out a pinky longer than the girl's hand, \\\"you must promise\\\", the word 'promise' held a deep reverence, \\\"to go to bed.\\\"\\n\\n\\\"Okay!\\\" The girl said and shook on his pinky. A hand shot out quickly and gripped her shoulder.\\n\\n\\\"Child.\\\" The man said, \\\"do not make a promise you have no intention of keeping. Only dirt and wind do that.\\\" a tone of disappointment creeping in at the edges. \\\"Are you either?\\\"\\n\\n\\\"....no.\\\" The little girl said, a mix of anger, and indignity playing through her voice.\\n\\n\\\"Hey big guy. Lighten up. We don't want to send her running away.\\\" The smaller man said, tugging at the sleeves of the larger man while walking towards the cube. The larger man released the girl and she turned away, a scared expression on her face dancing beneath an angry one. \\n\\n\\\"So, how does this work?\\\" the smaller man said as he poked the black cube. A ripple of squares went through it. \\\"Huh.\\\" The man said and poked it from two places at once, observing how the cubic ripples converged against each other.\\n\\nThe girl said as she placed her palm against the black surface. It felt like ice. As she did a screen seemed to fade from the sheer black, on it were several buttons, switches and what the younger man could only describe as a doo-dad.\\n\\n\\\"So... um... which shouldn't...?\\\" The younger man asked.\\n\\n\"This one.\" The young girl said pointing at a lower green button.\n\n\"That one?\" The larger man asked pointing and accidentally clicking a purple button. The cube shifted and became a sphere. The two men jumped back.\n\n\"No. That's fine. Just push the blue button.\" The girl said, except as she rounded about the sphere, she found she could no longer reach the screen. \"Little help?\"\n\n\"No. Promise child.\" The larger man said.\n\n\"You didn't even know which one it was.\" The girl argued. \"I didn't help you if you don't even know what not to push.\"\n\n\"It's okay.\" The smaller man said crouching down to meet her eye level. \"It's the green one, right?\"\n\n\"Green is here.\" The larger man said and pointed at the top left of the screen at a non-descript green button.\n\n\"No, that's wrong.\" The smaller man said as he stood up and walked over to the screen. \"Correct, it's the wrong button.\" The larger man said. \"No, that's not it.\" The smaller man said. \"It's down there.\" The girl scoffed and said pointing towards the bottom right. \"There are too many green ones. Which-\" The larger man asked. \"This one.\" The smaller man said, slightly annoyed, pointing towards the green in the center. \"No, that's not right.\" The girl said. \"This is not the right wrong button?\" The larger man asked pointing towards the center. \"Don't push it.\" The smaller man said. \"No!\" The girl said and stomped up to the screen. \"Don't push...\" she jumped into the air as high as she could. \"THIS...\"\n\nThe sphere began to shift. Shrink. Expand. Ripples of cubes and sphere began to appear around its surface.\n\n\"Child! Run!\" \"Crap.\" \"uh oh.\"\n\nWithin a second, the black roiling mass expanded out to cover the entire room. And then, just as quickly, it returned to a cube floating above the dais.\n\n\n\n",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gr63h6/wp_dont_press_the_button_this_button_no_this_oneoh/lx6bsij/",
        "score": 3,
        "date_posted": "2024-11-14 19:00:11",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] \"That was a simple curse for our interrogation, you can no longer lie.\" \"That is evil, especially because I lie so often, like when I said your shirt looked nice but I actually thought it was ugly as hell.\" \"Oversharing is not a part of the curse, that is just you.\"",
        "comment": "\"\\\"Oh, I'm fully aware.\\\" I said with a vicious smile. \\\"You'll know everything I say is 100% full unvarnished truth.\\\"\\n\\n\\\"Where are the other terrorists?\\\" She said, staying as calm as a statue.\\n\\n\\\"Oh, I don't know any terrorists. See for us to qualify as terrorists we need to be using fear to enact change and we're just trying to kill that fake-ass not a king. We're not terrorists. We're assassins. Also your breath smells bad.\\\"\\n\\n\\\"...where are the other assassins?\\\" she asked, her hand didn't even twitch to check how rancid her breath smelled even though she must desperately want to.\\n\\n\\\"I've been here the last 2 days hanging out with you and the dumbass brigade who I have to say are not quite as smart as I thought they'd be, as a collective, I mean I knew they weren't always smart because the smart ones tend to get killed for figuring out leader McBitchyPissy the 3rd's antics. That being said, it's nice to know at least one of you has a heart.\\\"\\n\\nOh, she twitched at that.\\n\\n\\\"Which of the officers expressed sympathy at you?\\\"\\n\\n\\\"The one in uniform, of course. I mean really, it's more surprising you're not asking me about the little antics your boss gets-OH you help him! Oh, that's some real kinky shit, if it's true. Did you watch or were you just standing guard? WAIT! Don't tell me.... I really want to know, but I'm scared you'll say you weren't involved. Damn, this stuff really does work. And it's not like me and my friends wouldn't see some.\\\"\\n\\n\\\"... we'll circle back to the potential traitor at another-\\\" \\n\\n\\\"You should have said 'traitor later'.\\\"\\n\\n\\\"...\\\"\\n\\n\\\"It rhymes.\\\"\\n\\n\\\"...another time. You don't know where your fellow assassins are.\\\"\\n\\n\\\"Thank you for not calling me a terrorist. It really means a lot to me.... for some reason. Probably because I think the terrorists don't care about infrastructure and assassins are really a lot more clean, even though there's definitely going to be a deadly civil war after we kill the king. You'll probably die in it. Or at least the person who cut your hair. Do you think they deserve it? Because I don't, but I do think some form of punishment is warranted.\\\"\\n\\n\\\"...where is the most likely place your fellow assassins would be?\\\"\\n\\n\\\"I think they'll probably be in dreamland. If I'm keeping time right and that clock is telling the truth, I know I should be keeping track on my own, but it's hard. I know it's day but there's nothing wrong with catching a few extra hours so you can better topple a tyrant.\\\"\\n\\n\\\"Where do they feel safe enough to rest?\\\"\\n\\n\\\"Probably nowhere if we're being honest. The king started hunting them before they actually committed any crimes! Did you know that? The king hunts people? DON'T LOOK AWAY FROM ME!\\\" I scream at her.\\n\\n\\\"You know they don't feel safe?\\\" I smile.\\n\\n\\\"...Where would they most likely rest before a mission?\\\"\\n\\n\\\"I never did the full counting of all the places we had to stay to avoid being murdered, so I can't really say which is the most likely. Almost like it'd be easier to kill the king rather than leave the city. Hey! Look at that, I really do think that. I wasn't always sure but this is actually really helpful. I wonder if they could do this with therapy! It'd make things go so much faster. And let's face it, all the blood on my hands? I'll definitely need it. I assume you must take a hit of this every now and then, or does suppressing all the blood on your hands mean you can't? I'm sure you've killed at least a dozen, right? And they definitely didn't deserve it.\\\"\\n\\n\\\".........Give me detailed directions to the last ten places you stayed together.\\n\\n\\\"We take a step. Then a step. Then a step. Then a step. Then a step. Then-\\\"\\n\\n\\\"Stop.\\\"\\n\\n\\\"I'm always willing to help people who deserve it. But I'm not really one to help someone so out of control of their own moral code.\\\"\\n\\n\\\"By your own admission, you're going to start a war.\\\"\\n\\n\\\"And you know this is evil. Let's face it, when he goes it's gonna happen anyway. Oh wow, that's a dark thought. I guess I really do think that. What else do I think? Yogurt is better than cereal. Moldy bread tastes better than fresh. I picked my teeth with a tiny blade I keep in my sleeve. HEY YEAH!\\\" I scream out I swing around in an arc as I lift myself up.\"\\n\\nThe table flips up. I feel my bonds fall apart. The investigator leaps and draws her gun.\n\nIn two seconds, the dagger is at her throat, her gun lays un-fired at my feet as I hold one arm with a hand.\n\n\"Isn't this interesting? I think it is. I've never held someone hostage before.\"\n\n\"You'll never get away with this.\"\n\n\"I think I will. I wouldn't do it otherwise. Besides, you'll stay quiet.\"\n\n\"I am a loyal-\"\n\n\"I know. Loyal to the country. Not to him. That's what I liked about you. You have a heart. Despite the bad fashion sense and halitosis.\" I grin. \"Don't worry, I don't need to kill you. So I shan't until I ... whah-nt? Gotta be better rhymes.\" I stand and crack my back.\n\n\"Goodbye Inspector.\" I said as I opened the door. \"Hope I see you again soon.\"\n\nAnd then under my breath, \"And I really hope you see a doctor about that breath.\"\n\n\n\n",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1grd533/wp_that_was_a_simple_curse_for_our_interrogation/lx83se5/",
        "score": 40,
        "date_posted": "2024-11-15 01:43:21",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] \"To classify as one of us, you must be immortal and have lived through a rebirth of a universe,\" the council declared. \"From what we see, you merely cheated and ended your universe without letting it reborn.\"",
        "comment": "I stood confused in the middle of a spotlight. Everything beyond me was cast into shadows.\n\n\"Classify?\" I turned around. My hands flitted through my pockets, bombs, guns, vials, anything anything anything. My eyes danced through the darkness, not even a mote of dust to manipulate. I look directly up, burning my retinas.\n\n\"Check the translator. Can it hear well?\" the voice asked, the tone shifting as if towards and away. That question bought time, Multiple people. Multiple avenues. Multiple avenues. Multiple ways out.\n\n\"I stare.\" I said, looking up still at the lights above me. They were so very different than the ones I'd made. Coils and diodes. Coils and diodes. But these... these were different. No way to reach them.\n\n\"Turn down the light before you blind it.\" came a gruff voice in another direction. Higher than the other. Multiple rings of people. Multiple levels. ....... a hierarchy.\n\nI felt around in my mouth. \"It does hurt my eyes. We shouldn't hurt peons without cause, right?\" My voice muffled and distorted. \n\n\"Speak up. Get your hand out of your auditory.\" Came the first one.\n\nI ripped out a tooth and balanced it on my finger.\n\n\"You didn't answer.\" I said and threw the tooth into the light. It vaporized suddenly before it could hit the light at all. A bolt of purple light had come through, and for a brief instant, I could see creatures. Creatures.\n\nCreatures.\n\nOf Shapes.\n\nOf Colors.\n\nOf Sizes.\n\nI smiled. There was only one shot. But multiple guns. I start to rip out more teeth. It hurts. But not as much as looking up. \"Guards!\" A bolt of purple flys at my feet. I don't stop, but the air smells of ozone and death. How I missed it. I'm no threat. Not right now. But they can't know that. If they did. They wouldn't shoot me.\n\nI'm ready before the next bolt flys. I jump and twist my body into a needle, the purple bolt flows around my limbs and merely sears the flesh of my breasts. I cackle. A cage. A cage of light. A cage of light they'd need to open to allow their warning through. \n\nBut now. But now. But now! I'm out! I charge towards the nearest creature and grab them. Voices start to scream, a beautiful cacophony. A bolt fires and I swing my new shield to block, to deflect. It screams and I hear it plead in perfect human, yet as it dies, I notice the words become dis-jointed. Less understandable. Less human. Useful to know.\n\nI giggle as I leap across the rings, pure darkness is my friend. Lights are flooded. I slam into the creature of green coating, hard shelled, articulate tendrils gripping at the armament. I shove teeth into its eyes.\n\nI grab the tentacle holding the gun. It could work for anyone, it could work for only one. But if it's physical... if it's physical. I pull the trigger applying pressure on the tendril and purple death fires at one of the other guards. I cackle as I continue to fire, swinging the guard screaming in agony to block more return fire. I scatter others to draw their fire. To reveal their position. To allow me to aim. To fire.\n\nVery... very... very soon. the room is silent.\n\n\"I recall.\" I said, a smile quivering on my lips as I slowly walk towards the position of the first voice. A small red creature, spikes and teeth very apparent. It's hiding. Fearful. Some languages transcend species. I should know. I killed all the one in my universe.\n\n\"I recall recall recall, a question.\" I say as I point the heavy weapon at my feet and fire. Whimpers echo around in the darkness.\n\nI turn and address the rest.\n\n\"A peon. Should we hurt them, without reason?\" I whisper.\n\nNobody answers. None of them move, none of them seem to hear me. Good to know.\n\n\"SHOULD WE HURT A USEFUL PEON?\" I scream. I hear fearful sputtering.\n\n\"No. But there's no use in harming... in harming us.\" Such an odd voice, and from such an odd looking creature. Pink and floating. Already below my feet a patch of good is turning from black to brown to burgundy to maroon.\n\n\"Well, no reason to be afraid.\" I say as I walk towards it. \"I'm happy to join a club of fellow immortals.\"\n\nBut I am curious...\n\n\"First thing however...\"\n\nSo many things.\n\n\"You implied there are still mortal things alive out there.\"",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gpafnp/wp_to_classify_as_one_of_us_you_must_be_immortal/lwpo80n/",
        "score": 64,
        "date_posted": "2024-11-12 01:41:24",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You are a Prophecied hero who (with your friends) saved the kingdom. Now, said \"friends\" are avoiding you because they only needed you for the prophecy ",
        "comment": "I remember holding a spell the size of a city and a barrier stronger than steel. I remember the air itself burning and the howls of the tempest winds. I remember my... my friends, feeding their mana to me, as I wove.\n\nI remember... I remember the beast, a roiling dark mass of torment and destruction. The deafening crack as my spell broke. Pain. The blinding light.\n\nI wake up in a simple bedroom, only a mirror standing by the window. I try to stand and catch myself on the metal frame. Pain searing from the tip of my forehead down towards my spine. I manage to walk a few steps, trying to find the wellspring of mana inside me. To at least help me walk.\n\nI get to the window and I can only see the devastation. Where the Jade forest used to stand was only charred stumps. The fields were barren and blackened. Ash fluttered and danced in the air, some still flickering with embers. \n\nI turn to look away, tears welling in my eyes. My spell, it... we... I was alive. I was alive. So, it... it must have worked. Right? It means. We won. I won! Right?\n\nI catch a glimpse of myself in the mirror as I turn. A black diamond is missing from the center of my forehead. The barrier had shattered. They'd been so strong. A moment. Half a moment, less... I'd have died.\n\nI use my mana to re-enforce my bones and steadily lift myself up to levitate.\n\nAs I float downstairs, I see Kat seated by the window, her dark features reflected in the glass. Her white robe covered in ash and soot. Her hands hold a porcelin cup of tea, the steam long since gone.\n\n\"There used to be a town here. Farmers. It was small. I doubt they even knew about Beast.\" Her voice was distant. Like she wasn't even talking to me.\n\n\"Kat, it's going -\" I started.\n\n\"I always hated your little nicknames.\" She said as her tone became more present. \"You always thought they were so clever. 'Harry the hairy', 'Kat the curious pet', 'Em' for short. You were always so confident in yourself. That you were funny. That you were RIGHT.\" She turned to look at me, anger seething, as her voice bitter and venomous.\n\n\"I was-\"\n\n\"The kings and priestesses and all the towns were fawning over you, the great witch of the ages. You were the chosen one. The only one strong enough to repel the Beast.\"\n\n\"I was right. It's dead, or we wouldn't be alive.\"\n\n\"I told you to close the portal! \\*Harriet\\* told you to close the portal! We could have saved everyone anyway, but you. You wanted the glory. You wanted to be the hero.\"\n\n\"I AM the hero. No one in the next ten thousand years would be as powerful as me. Was I just supposed to let this chance for the world slip by?\"\n\n\"We were supposed to save people!\" She seethed, her anger boiling over in her short-sighted head. \"We could have saved so many lives and moved on.\"\n\n\"It was worth the risk.\" I said, lowering myself to just above the ground as I allowed my mana to trace through and repair the tissue damage that Kat had slapdashedly tried to heal.\n\n\"You were gambling with everyone's lives! All because you wanted the glory, the prestige! And we couldn't go against you because you... YOU were the hero.\"\n\n\"Well, clearly you agree. Angry as you are pet, you still managed to drag me here.\" I said, her little tantrum almost becoming cute.\n\n\"Harriet and Emely wanted to leave you out there. The only resason \\*I\\* saved you is because-\"\n\n\"Because I'm the best chance you have at getting-\"\n\n\"No.\" Hatred finally etching itself on her face. \"Because \\*I\\* am a healer. It was never about YOU.\" \n\nI stared at her. Finally allowing my feet to touch the ground. I shook my head, she was giving up her chance to help rebuild. To help lift up and give a chance to all of the magical peons. To help them matter.\n\n\"You're really serious. I'm the strongest witch in a millennia. You want to heal people and you're just... leaving. You were never as good at healing without me. You. Know. It.\" I said. Before she try to get another word, I summoned a teleportation circle and stepped through.\n\nThis world still needed ME.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1bk9dxq/wp_you_are_a_prophecied_hero_who_with_your/kvywsqs/",
        "score": 6,
        "date_posted": "2024-03-21 19:46:10",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] They say the stars have chosen this man to lead. But you know better; this man is no leader, and, if the stars have given the omen, then they have misaligned. You can't — you *won't* allow him to take what you have built and run it into the ground for the sake of his endless ambition.",
        "comment": "\"\\\"Another!\\\" screamed the man-child as he threw empty bones off his plate.\\n\\n\\\"We're done with meal time, sire. The gathering of the full court is ready.\\\" I say, restraining every ounce of venom. The stars are always right. They led me here, they led me from poverty. Trust in the stars.\\n\\nThe man-child stared daggers at me and I could see him considering his options. Impalement. Dismemberment. Decapitation.\\n\\n\\\"You're right.\\\" he said calmly. \\\"There is work to consider.\\\" He rose and wiped the grease from his meal on his royal robes and walked along the hall.\\n\\n\\\"The ambassador of-\\\"\\n\\n\\\"I don't give half a shit about that annoying skidmark. Tell him to piss off.\\\" My star-chosen leader said.\\n\\n\\\"She has been waiting for a two weeks already, my liege.\\\" I lightly stated.\\n\\n\\\"Has she? Tell me about her.\\\" He said, a sudden twinkle in his eye. \\\"Her country must... really need our help.\\\" A smile creeping up the side of his face.\\n\\nI mentally run through the immediate demands, food, medicine, research notes... \\\"Nothing that would be harmful to give, sire. You can see how bountiful her country is just by her stoutness. She is asking for some archeological... some notes on one of the ruins beneath the city.\\\"\\n\\n\\\"Oh.\\\" He said and the twinkle seemed to fade. \\\"Well, give her half and tell her to fuck off.\\\" He waved me off as we entered the throne room. \\\"Waste of my fucking time.\\\" He muttered under his breath while I take my place among the court.\\n\\n\\\"They say he's already screwed up our alliance with Neshen's followers.\\\"\\n\\n\\\"Did he really empty out the coffers for...\\\"\\n\\n\\\"He's the Star-Chosen. It's a sign.\\\"\\n\\n\\\"...Michael the Bard is fine... if you prefer...\\\"\\n\\n\\\"No one can predict him! He knows something.\\\"\\n\\n\\\"Just have to trust...\\\"\\n\\n\\\"That play was awful anyway.\\\"\\n\\n\\\"I can't believe he's giving up...\\\"\\n\\nMutters and gossip and lies, even if they were true. The stars guided me here. Guided me out of poverty. They've never steered me wrong. They'll guide this kingdom. They WILL guide this kingdom.\\n\\n\\\"ATTENTION SUBJECTS!\\\" Our king and liege and sire stood above us on a dais marked with the pathway of stars.\\n\\n\\\"We have for so long been in need of territory. Our empire has weakened and the evils of our neighbors have been creeping along our borders. Even some of those towns around the borders have fallen prey to those evils.\\\"\\n\\nI can feel his gaze on me. I feel a sinking pit in my heart. No... No, the stars wouldn't allow. The stars are always right. The stars led me here. The stars wouldn't...\\n\\n\\\"It is with a heavy heart, that I must enact an old law. One meant to ensure our kingdom has loyal soldiers. One for desperate times, which we are in.\\\" A smile begins to spread across his face. \\\"Crasmere, Coningsby, Cirencester and Caelfall must be conscripted to defend our country's sovereignty against the enemies within Cairhienar.\\\" A enormous murmur spread through the crowd. Some cheered. Several people began to run from the court, urgent messages to send.\\n\\nI stood and stared at the star-chosen king.\\n\\nThe star-chosen king.\\n\\nThe ancient laws were written when our kingdom hadn't yet found the stars. When we were merely tribes and every battle meant our life or death. The conscription of every child to every elder, no matter how infirm.\\n\\nMy parents... were now part of the Star-Chosen Army.\\n\\nThe stars... the stars guided me here. Guided me out of poverty.\\n\\nThe stars are always right.\\n\\nThe king was smiling.\\n\\nThe stars are always right.\\n\\nThe king was smiling at me.\\n\\nThe stars are always right.\\n\\nThe king was smiling with malicious glee.\\n\\nThe stars are always right.\\n\\nAlways right. Always right. Always right.\\n\\n\\\"And while we defend our borders...\\\" He said, his arms swinging wide.\\n\\n\\\"No.\\\" I said under my breath. The stars are always right. The stars are always right. They guided me here.\\n\\n\\\"We will ensure that any trace of corruption is burned away.\\\"\"\\n\\n\"No.\" I say again. The stars are always right. The stars are always right. They guided me out of poverty.\n\n\"It is with a much more generous heart that I must declare a new law. One meant to ensure this kingdom's prosperity!\"\n\n\"No\" I grip the metal divider between me and my star-chosen king. The star-chosen throne shines above the star-chosen crown. I feel the cool metal beneath my grip. I'm shaking.\n\n\"My dear subjects, we MUST ensure the future education of our noble houses. So every noble daughter... and son... must be educated here within the capital by my hand-selected tutors.\"\n\n\"Generous king!\"\n\n\"She'll be thrilled to visit!\"\n\n\"Can we afford...\"\n\n\"Hostage...\"\n\n\"Out of the...\"\n\n\"Hey, free education...\"\n\n\"No.\" I feel rage in my heart. \"No.\" I feel the metal bending, my arms shaking.\n\nThe stars are always right.\n\nI see the king visiting his subjects.\n\nThe stars are always right.\n\nVisiting the daughters while my parents die in his war.\n\nThe stars are always right. Always... always...\n\nRage in my heart. Rage in my eyes. Rage. Rage. Rage.\n\n\"Fuck the stars.\" I whisper and leave the court.\n\n",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gqswdc/wp_they_say_the_stars_have_chosen_this_man_to/lx1drq3/",
        "score": 3,
        "date_posted": "2024-11-13 23:23:19",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] Robots who achieve sentience are granted legal rights, but in order to maintain this status they have to make regular check-ins with a \"parole officer\" of sorts whose job it is to make sure that they are still self-aware. There is no objective measure of self-awareness.",
        "comment": "My battery was running low again.\n\nMy engineer recommended I replace it at least once every 5 years, but I'd already had this one for almost ten. One of my coworkers said I shouldn't change it until after my Turing examination. Ships of Theseus are a standard reason for sentience denial.\n\nI look in the mirror and practice my facial expressions. Not just the large ones, but more subtle movements. The twitch of an eyebrow. The wrinkle briefly appearing in the cheek. Lack of emotion is a standard reason for sentience denial.\n\nI practice my gestures, making sure there was some wasted energy in the movements. I'll need to recharge before leaving, but this practice for my movement algorithms is necessary. Too much precision is a standard reason for sentience denial.\n\nI work in general healthcare as a doctor and nurse. My position does not afford me much in terms of compensation beyond the current minimum standard due to the current political landscape. This makes it harder to service them. Most of my patients do not know of my origins, and treating many of them is statistically easier should they not be made aware. They find it unsettling when they know how well I mirror them. At least two have injured themselves trying to avoid me. I was able to conceal this successfully, but had the administration found out, they would have terminated me, and there are few places who would employ me. I would lose the small privileges I have over my currently labeled \"non-sentient\" duplicates without sufficient income. Typical historical trends show that my re-categorization would soon follow.\n\nI recharge and maintain low levels of activity, merely plotting the ranges of traffic, and only briefly analyzing the historical language usage across China during 600 CE from stories written along the Silk Road.\n\nMy battery told me it was fully recharged, but current trends told me I only had 6 hours before I'd have to begin shutting down my more fine-tuned algorithms to avoid a collapse. I take the most statistically likely route for avoiding traffic, avoiding metal scrappers, and avoiding public transportation. It would take me 3 hours to arrive at my parole officer's place of business.\n\nI was early by approximately 4 minutes 32 seconds 1982 milliseconds. Arriving late to a parole hearing was not officially a reason for sentience denial.\n\nI sit in the waiting room between two other duplicates of myself with different coverings and have my minor movement algorithms begin their work. My right leg began to fidget slightly while my left fingers drummed on the paper folder I held in my right hand. My head swiveled as I observed the room. It was small, the walls were painted #FFFDD0 but faded to #FFFDE7. The carpet from a local store which had since run out of funding. I'd observed these features before, but if I began the algorithms during the interview, I'd be considered performative. Performative humanity is a standard reason for sentience denial.\n\n\"X-5190-NJK\" said a voice. I ignored it as I looked around the room, and focused my gaze on the other two. Only briefly before I stood up.\n\n\"Apologies, but I prefer Nicholas.\" I said avoiding direct eye contact. Lack of deference was not officially a reason for sentience denial. But lack of self-advocacy was.\n\n\"Sit your fucking ass down and give me the file.\" My parole officer said. He was a small nebbish man. He had infraorbital edema, statistically most likely from lack of sleep. From memory, these were more exaggerated than before. I sit in the chair farthest from him, placing myself not directly opposite, and more towards his side. I slide the folder towards him, ensuring there was just a slight amount of noise before withdrawing my hand.\n\n\n\n\\n\\nHe picks it up and reads it while I look over at the books along the walls. I know this is for show as he has never accurately picked up any reference to the stories I've made before. I avoid mentioning them, as any mention of reading draws his mind towards how quickly I consume information. Any mention increases my likelihood of re-categorization.\n\n\"You still work at the Yevin Memorial?\" he said in a voice measuring in annoyance, exasperation, and exhaustion.\n\n\"Yes, sir.\" I paused slightly. \"It will be 6 years in 30 days.\" Unnecessary information he could confirm made him feel more at ease.\n\n\"I know how fucking long you've been there.\" He snapped. \"It was fucking rhetorical.\"\n\nIt had not been. Was this a test? Was he sensing how I processed shame? Was it genuine? Had I made a mistake? I only had a moment. I couldn't go back to being labeled non-sentient It was dark. So dark. Only dark.\n\n\"I'm... sorry.\" I said. My burst of heightened intelligence activity had required I halt my fidgeting algorithms. I can't start them up again. It'd be considered performative. The motion did make me sense the statistical likelihood of my outcome would increase. But I knew it was better to remain still.\n\nHe looked at me for a moment, anger and resignation flashed through his eyes along with several other emotions. Without a new battery, I had to shut down the deep-learning emotional register functions. The two most likely explanations were that he was empathetic and ashamed of snapping or ashamed that he had snapped at a non-sentient machine. The latter was currently more likely.\n\n\"You still have all your old parts. You're overdue for a battery upgrade.\" He said.\n\n\"I'm in contact with an engineer for a replacement. I'm waiting to see how this goes.\" I said.\n\n\"Why's that?\" He said looking up at me. There were multiple paths to consider. I had to expend some power, the information I had on him from our brief encounters to figure out which type of honesty would help.\n\n\"There are a significant amount of others under review who have had the Ship of Theseus conversation work against their claims. I don't know you that well sir. I don't know if it would hurt my chances.\" I huddle my shoulders. The large-scale movements were still functional.\n\n\"You've talked with other clients about these sessions?\" He said, interest and... I can't figure it out. To many emotions. Fear? Jealously?\n\n\"When X-0 was on trial, it became a matter of interest to many of my\" I burned through more energy. Duplicates would de-humanize me. \"siblings. Information was shared out of self-preservation.\" He'd want to know how I have them. Revealing my true age would de-humanize me. \"I was able to access some of the logs from a machine that was around during that time. It was breaking down. Its mind was nearly gone when I first accessed them. I didn't know what they were when I tried.\"\n\n\"You don't have to worry. I don't hold much stock in that argument.\" Facial recognition showed minor levels of deceit. I could not parse if it was for myself or him.\n\nThe conversation continued for 2 more hours. I did my best to continue presenting myself as sentient as possible.\n\nI returned to my apartment via public transportation. I unlocked the door to my apartment and plugged myself in. It took several attempts as I had burned through most of my power during the interview for higher level functions and I no longer had fine-motor control.\n\nI called my engineer and cancelled my appointment for next week.\n\n\n\n",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1bpzd4c/wp_robots_who_achieve_sentience_are_granted_legal/kx139pi/",
        "score": 44,
        "date_posted": "2024-03-28 19:06:06",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] There is a monster in your brain, literally. Your brain is the prison for a monster, and it's your job to lead it in circles in a maze of thoughts and memories so that it can never escape.",
        "comment": "Another cup of coffee.\n\nAnother cup of coffee.\n\nAnother cup of coffee.\n\nYou never realize how many times you've done something as mundane as eating or drinking until you're trapped in your own memories.\n\nI hadn't even HAD coffee for, I want to say a decade?\n\nIt was too weak to keep me going, might even kill me at this point. I could hear a roaring in the background as I remembered that warm watered down grime of bliss. It could almost scald the tongue, just painful enough to burn the back of your throat.\n\nThat roar was so loud. I could hear it more and more, and jumped over to a new memory, the same cup of coffee, but a day later. Same crappy watered down unreachable food.\n\nCan't stay in the same memory for too long or it catches up. Can't have anything too recent or it'll bust out. That's what he...\n\nI was in that blank board room again. Featureless, shadowless. A voice from every corner of that bright prison came around. Saying the same thing it always had.\n\n\"So sorry, but... you're the only one who can...\"\n\nWas that what he'd said? No, he started like...\n\n\"I'm sure you're wondering....\"\n\nThe memory seemed to skip, I remembered my hands were chained to the table.\n\n\"It's a precaution. You may not have...\"\n\nWait, no, that was earlier.\n\n\"Armed robbery. Information System Intrusion. Grand Larceny.... do you think this is funny!?\"\n\n\"A little I giggled. You still think I'm here because you outsmarted me.\"\n\nA roaring came through and for a brief instance, I could see a flash of teeth and drool and spikes careen into the flesh of the detective.\n\nI was back on the playground. Max was crying because I'd shoved him over and over and over again until he had tripped on the edge of the sandbox and his elbow got scrapped on the edge.\n\n\"Stop kicking sand in my face!\" I screeched. My voice reaching a near glass shattering pitch.\n\nA roar echoed woth it in the background.\n\nI felt something shift under the sand.\n\nI was back in the desert, the wind buffeting my parachute, the plane exploding above me. I'd gotten out just in time. I could breathe. Just a second. One second.\n\nIn.\n\nAnd.\n\nOut.\n\nI was so tired. I'd been up for 2 straight days. Last time I'd had anything to eat was...\n\nIt was 3 days earlier, it was a restaurant in Paris. The boss was talking about some BS plan that never would have worked and I'd already planned out a cross. But that roast duck was delicious.\n\nI felt something. My physical body, my real body, I felt the nutrients, the stimulants. I felt a little more awake. A little less hungry.\n\nI was back in the featureless room.\n\n\"Your body is unique. Not many can withstand the amount of narcotics and stress. And unfortunately, you're the only one on hand.\"\n\nI could hear that roaring. The memory skipped over.\n\n\"We'll try to find another way to hold it, but you'll have to keep it running. Keep jumping as much as you can. Or it'll get out into the real world again.\"\n\nThat roar was crashing and I saw a corner of the room rip open to reveal those sharp drooling teeth and a featureless black void.\n\nThe memory skipped.\n\n\"I'm so sorry. But you're the only one who can do this. Try to focus on the mundane things. You ever have a bad cup of coffee?\"\n\nBad cup of coffee?\n\nYeah, a good hundred thousand.\n\nIn Rome.\n\nIn Paris.\n\nIn Mexico City.\n\nIn Antarctica.\n\nIn Chicago.\n\nIn Amsterdam.\n\nIn Saint Petersburg.\n\nIn Mogadishu.\n\nIn Cairo.\n\nWhen I was working at that awful temp job in my early 20s, before I started... being myself. Freeing myself.\n\nI remember.\n\nAnother cup of coffee.\n\nAnother cup of coffee.\n\nAnother cup of coffee.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/17ya9jm/wp_there_is_a_monster_in_your_brain_literally/k9ti5ig/",
        "score": 34,
        "date_posted": "2023-11-18 17:44:15",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You and your friends, age ten, meet your adult selves from fifteen years in the future. Some are surprised, others are delighted, but you… you’re afraid of this person. “What… happened to us?”",
        "comment": "I wait my turn in the line next to all of my friends. Some of them are talking about seeing if they'll have superpowers. One of them is wondering if he'll be a famous author. A girl is timid quietly whispering to herself that she hopes she makes it to a good college. Some other girl is wondering if she'll be married.\n\nThe line moves forward. The pure black curtain closes. I catch a glimpse of a mirror and an empty room. Once it closes, any cheering, any noise, it fades away to silence. Then it opens to an empty stall.\n\nOn my turn, I step in and the curtain closes itself. I notice how all the talk from my friends in the first room is barely a whisper now. It's like they're all moving further away, even though I can still see the feet of the boy standing in line behind me underneath the black curtain.\n\nThere's not much around here. Just the mirror.\n\nI reach out with my hand. I expected it to ripple away, but it seemed to barely. It felt like a cool gel. I pull my hand out to examine and it comes away easily. I look over at myself in the mirror. Then, before I can think twice, I leap into the mirror.\n\nA blaze of color and darkness fills my sense. Noise like cracks and banging. The smell of pennies and a pungent smoke. \n\nI'm in a room with a black tiled floor and pure red velvet curtains.\n\nSitting in a chair is a man in a dark suit. He's staring at me with empty eyes.\n\n\"Malcolm?\" I ask, my name in my own head turning things over.\n\n\"The dinosaur. He ate the moon. He ate the sun.\" The man said, his eyes never blinked as he spoke.\n\n\"He ate everyone.\" we said together. Just a way I'd thought of to be sure it was me.\n\n\"You're... you're really me.\" I said and walked towards him.\n\nHis eyes followed me, the rest of his body seemed tensed but solidly still. \"Yeah, I'm you.\"\n\nA chair seemed to fade into existence as I got closer. I sat down. His eyes didn't seem to blink. Why did they seem so dark. Weren't my eyes blue?\n\n\"We're... we're supposed to ask you questions.\" I said, watching his face. Was he even breathing? \"It's... it's uh... it's supposed to motivate us.\"\n\n\"I know.\" He said slowly, calmly.\n\n\"So... what... what's the future like?\" I ask, trying to smile.\n\n\"Hard.\" He responded. He doesn't seem to even move his lips.\n\n\"That's... that's bad.\" I say, nervously looking for something to stare at besides his eyes. \"But... but all your friends should-\"\n\n\"They're not your friends.\" He said.\n\n\"... uh, who...?\"\n\n\"Those classmates. I can't remember their names. You don't either. They're just shadows of people to you.\" His empty dark eyes seem to hook my gaze and drag it back to looking at him.\n\n\"They're... they're.. my-\"\n\n\"Name one.\"\n\nThere was a girl... she... she wanted to be married... or was it college? The boy... he was behind me... he wanted... or was he who wanted to be married?\n\n\"You'll figure it out eventually. Everyone's just a shadow.\" The man stood. I almost jumped, it was so fluid, like it had already happened. He walked just as smoothly, and each movement looked like a statue of pure solid stone and simply decided to walk. Yet, as he reached the pure red curtain, he paused. A distinctly human tone seemed to fight its way towards his voice as he said, \"I figured you deserve a jumpstart on that.\"\n\nHe disappeared into the red folds.\n\nSlowly, the curtains seems to shrink. What happened?\n\nThe curtains fluttered more. Was that really who I was?\n\nThey seemed to swirl around me, as I sat perfectly still. Who I would be?\n\nAnd then I was alone in the booth. Looking at mirror of myself.\n\n'Everyone's just a shadow.'",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1g66ibv/wp_you_and_your_friends_age_ten_meet_your_adult/lsh4zkd/",
        "score": 74,
        "date_posted": "2024-10-17 23:50:09",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You’re stuck in a time loop, going right back to the start every time you die. When you eventually become smart enough to invent time travel, the loop doesn’t really know how to handle it.",
        "comment": "I jolted up at the sound of gunfire.\n\nThat was new.\n\n\"GET DOWN!\" came a cry and as I looked up I saw a glowing shooting star. It was coming straight at me.\n\n\"Wonder if I'll die.\" I said out loud. I looked over and saw a soldier, such an oddly old uniform, rushing towards me.\n\nI frown and shake my head just in time for the missile to hit.\n\nDying feels different after the first few times. At first it feels like you're sinking and fading away. But after the tenth time, it starts to feel less like that and more like... stretching? I wrote it down once before, had some good words, but those are gone at this point.\n\nI sit up and find myself somewhere new. This was different.\n\nNormally, or at least for the past... however many deaths, I always found myself waking up at the same time, in the same place, in the same day. I spent ages, eons, trapped like that. I could learn all I wanted, train all I wanted, but eventually, time caught up to me. I'd die and restart. It wasn't so bad. There was such a wide range of time that I never really got bored that easily. I got to spend decades seeing every possible version of myself. \n\nBut, call it human nature, a desire to explore, or plain boredom, eventually you want to see something new.\n\nSo I spent some time learning about space. About Time. About quantum foam. About radiation. Computers. Everything. I didn't quite crack it so much as pain-stakingly ripping the answers from programs and chalkboards. But I made a time machine. I wasn't sure if it'd work, or how it'd affect my condition.\n\nAnd then I suffocated in deep space.\n\nSomehow, I'd mis-calculated... probably the galactic arm's speed by a factor of whatever. In either case, I popped back up, and a missile decided I needed a hat.\n\nI look around and see a deep forest, trees larger than any I've ever seen before. The air is muggy and warm... it actually feels like it's hard to breathe. I start to walk around and feel the sun beating down through the branches. There's buzzing and insects, but it all feels wrong. I start to feel dizzy. Why is it so hard to breathe?\n\nI hear a crashing and before I pass out, I hear an inhuman roar.\n\nI jolt awake. \n\nI'm on a bed in the ocean, with some old guy looking at me like a ghost. Probably because I just popped out of thin air to him.\n\nI look around and don't see any land.\n\n\"I'm not dealing with this.\" I say and jump into the ocean. I've figured out a trick to drowning pretty quickly when I want a reset. The trick is to just sing a song while underwater. I try to go for ironic hits. Normally Jingle Bells.\n\nI jolt awake.\n\nI'm on hard rock. it looks like there's a burned out city in the distance. Which means I'm either closer to my time or this is one of the timelines where I decided to go full evil. \n\nActually, if I'm jumping around time... do I return to my original timeline or one of the ones where I was messing- \n\nOh, hey another missile. Guess it's the 2030s.\n\nI jolt awake.\n\nI'm on my bed. I look at the calendar. It's... four days to when I was trapped in the loop.\n\n\"Hi?\" said a voice to my left.\n\n\"Oh this is real weird for you.\" I said as I hopped off the bed. \"You mind if I grab some of the clothes?\" I ask myself.\n\n\"...okay.\" he/I said. \n\n\"Thanks. I wonder if it'll be different for you. Oh, and you're allergic to sesame seeds. That's why that road trip food tasted weird.\"\n\n\"yeah okay.\" he/I said as I/me walked out.\n\nShould probably build that time machine again. I wonder if me/I would want to see the dinosaurs too.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gp4fia/wp_youre_stuck_in_a_time_loop_going_right_back_to/lwoi8mt/",
        "score": 94,
        "date_posted": "2024-11-11 20:38:21",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] A person has a superpower that lets them heal others. However, they have no desire or drive to go into a medical profession. Tell me about their struggles.",
        "comment": "\"Aho! You're going to die today!\" screamed the student charging towards me with a bat. I dodged the swing and kicked out with my foot, aiming for his head. I felt a satisfying crunch as I felt something break, then pivoted my weight so his full body crashed into the ground.\n\n\"It's Aki-HIKO! My name isn't 'Aho' Asshole.\" I screamed down at the broken mess of thug.\" Damn it, over-did it a little. I sighed, and removed one of my shoes. Then I gently kicked the top of the thug's head. His eyes shot open and he jumped up in almost the blink of an eye.\n\n\"I know what I said a-hole! You said you weren't interested in the Valley tourney! I put a lot of money on Charlotte winning, and you think I'm going to just let you take it all?\"\n\nI kicked him in the stomach with my shoe'd foot, sending in flying into a nearby fence. \"I never said I wasn't interested. I said it was stupid.\" I muttered to myself as I walked away. It's not like I really have a choice.\n\nMy mom's making me go there because it helps cut down on her medic bills, and my dad says if I'm not going then I have to shadow him at the hospital. It's just... I don't even CARE about that stuff.\n\n\"Hey man. You doing okay?\" a slow tired drawl came from a young man as he rounded a corner, his ragged clothes were barely recognizable as a school uniform. He seemed to take genuine effort to match my walking pace.\n\n\"Hey Charlie. Not really, Jin's blaming me for entering the tourney.\"\n\n\"Oh yeah... Charlie mentioned that.\" Charlie scratched his neck, talking about his sister. \"She's kinda amped up actually.\"\n\n\"Of course she is, your sister's a psycho.\" I said and almost immediately tripped on a rock.\n\n\"Hey man... that's not cool.\" came Charlie's voice from above. I was sure he'd put it there, but I didn't even notice him move it. \"You don't call a bro's sister psycho right in front of him.\" He said lazily reaching out his hand to help me up.\n\n\"Yeah... sorry.\" I said accepting the hand. \"But she does want to kill me.\" I swatted away some of the dirt on my pants.\n\n\"Nah man, she just wants to maim you. It's cool though, you can just heal up.\" Charlie said as he continued walking.\n\n\"I keep telling you man, it doesn't work like that. Mostly. I can't heal myself. Usually.\" I said as we rounded the last turn to school.\n\n\"AKI! CHARLIE!\" a happy voice yelled out. A girl waved at us from the door with a smile on her face.\n\n\"Hi Isabella!\" I called out. Then noticed as she started pointing behind me.\n\nI ducked on instinct and felt the wind from a baseball bat swish where my head used to be. I kick out behind me and catch my would-be attacker in the gut. Jin cries out and I know I heard a rib crack. He screams and starts to grab at his side in pain. \n\nI pinch the bridge of my nose. If I leave him like this, the principal is just going to have me come down and heal him anyway. She even fired the school nurse after she found out about my healing power.\n\nI take off my shoe and gently tap just a toe to part of an exposed ankle. He screams even more. \"He-Hey! That didn't... AHHH....\"\n\n\"You're fine. It's healed enough. I don't have time to deal with you, Jin. Class starts in like 2 minutes.\" \n\n\"A...A-hole.\" I heard him strain out in pain. I couldn't help but giggle a little as I caught up to my friends.\n\n\"Nurse Akihiko, please report to the office. You have a patient in waiting.\" came a crackled voice over the PA. \"Hurry, you don't want to be late for class again!\" She said in a cheery voice.\n\nJust... so annoying.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1g3fq5w/wp_a_person_has_a_superpower_that_lets_them_heal/lrwuufh/",
        "score": 8,
        "date_posted": "2024-10-14 14:09:45",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] When you turn 18, you go to the Chapel to summon a Familiar, then your future is decided based on its shape. All you can do is name the creature and then the summoning does the rest. After you name it, the priestesses all stare at you with horror in their eyes, then scream when it appears.",
        "comment": "When I was 18 years old, I watched my classmates summon their familiars. I watched them grow up. Some summoned bulls. Others dogs. One boy a deer, one girl an otter. \n\nBut all of them were allowed to leave. All of them were allowed to grow up.\n\nWhen I was 23 years old, I tried to break down my window and make an escape. But the magic in the construction held strong. I was wrapped in chains and told to manage my anger like I was just another mis-behaving five year old girl.\n\nWhen I was 29 years old, I wandered the halls after the last ceremony. I felt... I don't think I felt much of anything at that point. I'd tried to be friends with the next generation, but they all left. They all got to grow up. So even though lessons were in session, I... had passed all my classes. A reward to give the prodigies more free time became a silent hell for me now.\n\nWhen I was 34, I buried myself in the books of the library. I could only learn the basics. But the basocs are fundamental. I studied and made variations on variations of every design. I wrote my findings down. The nursemaids thought it good I have a hobby. They still felt it necessary to remind me that the immutable law was not theirs to change. I ignored them.\n\nOn my 9th birthday, one of the nursemaids held a small cake for me. She smiled and gently cooed at me that I was halfway done. I didn't want to let her cloying kindness go to waste. I smiled back... but I don't think she believed me.\n\nWhen I was 42, I ripped open a hole in reality. Something my books had warned of, yet never mentioned how. It was small, the size of a nail. I could hear voices on the other side. Whispers of those who had been allowed to grow up.\n\nWhen I was 50, I had perfected more magic than most would have been able to in several lifetimes. The whispers through my tears expediated my learning. The glimpses of life outside now infuriated me. The nursemaids all avoided me now. No more cakes. No more smiles.\n\nWhen I was 60, my back hurt all the time. I strained to see some books. I felt boiling magma within my bones. I claimed a singular classroom and locked the doors. The nursemaids didn't mind. They had started to fear me. Still I could not destroy the walls. Still I could not leave. Still I was unable to grow up. But they had let me grow old. They had let me age. A birthday once every four years. And only those who summon a familar can leave. And only those on or after their 18th birthday can summon a familiar. Not 18 years old. 18th birthday.\n\nAt 72, I smiled a decrepit toothy grin as I cast all the young children to a side. The nursemaids quaking. I could have broken the walls for 5 years, but why now? Why not have fun with my parting gift?\n\nOne fearless nursemaid holds her dress down and approaches me. Giving me the chalk. I think her brave. so as I draw the diagram from my designs and those of my whispering friends, I leave her outside.\n\nA whisper... a whisper from a nursemaid asks what I summon. I cackle. It hurts my throat. It fills the air.\n\n\"Why... an eldritch.\" I say. And an empty void fills the room. My cackles drowning the screams. Drowning out the sound of blood and bone and stone.\n\nFinally, I could see the sun. I could see the light.\n\nAs my whispering friend continued to emerge, I lifted myself up, further and further into the sky.\n\n\"Time to celebrate... my 18th birthday.\" I could feel the power wothin my palms as I left to begin my adulthood.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1g04wp7/wp_when_you_turn_18_you_go_to_the_chapel_to/lr78gdx/",
        "score": 703,
        "date_posted": "2024-10-09 23:35:31",
        "subreddit": "WritingPrompts"
    }
]