[
    {
        "post_title": "[WP] A human woman is employed as a maid for a rich vampire. She is almost comically oblivious to the fact both her employer and coworkers are vampiric.",
        "comment": "\"Rise and shine!\" Amy pulled the drab black curtains aside while greeting her lovely new employer, Countess Elizabeth.\n\nWho had this peculiar habit of sleeping in a coffin of lacquered wood, padded with red satin inside. After some annoyed screams, the countess rose from her coffin to slam the curtains shut and go right back inside.\n\nDefinitely not a morning person.\n\nAmy tried patting out the thick smoke that billowed from the countess, who only grumbled about burnt skin and ruined makeup. Or so that's what Amy thinks she said. Her employer almost slammed the coffin lid shut on her fingers, but Amy was fast enough to get out of the way.\n\nWhistling to herself, Amy exited the mistress' bedchambers and headed out to clean the rest of the castle. It's really tough when it turns out none of the other servants wake up in the day too. Ordinarily, she'd file a complaint at the Domestic Employee Union, but the pay is too good.\n\nThe folks who live here have this bad habit of spilling red wine everywhere after their late-night parties. How they even get it so high up on the living room wall is a total mystery. But Amy isn't paid to ponder upon these things. She's paid to clean.\n\nIt is to her relief Jeff is awake. And climbing the walls like a creepy spider monkey to help her clean things up. His uncanny ability to get anywhere to remove stain is something she always wanted to learn from him.\n\n\"Thanks, Jeff. Glad to see you're up and working too.\"\n\n\"You're welcome, Amy,\" Jeff bowed and seemed to float away.\n\n\"Wait, Jeff,\" she called out to him. \"You have some red wine stains on your sleeves. I have a mirror you can use.\"\n\nDespite his insistence, Amy pressed him into using it. Not that it proved useful. For once, it didn't reflect Jeff's face at all, nor show him where the stain was. But he got it out all the same with a simple scrub of a handkerchief he produced from his breast pocket.\n\n\"Sorry I wasn't of much help,\" Amy said.\n\nJeff waved off her concern and assured her he was fine.\n\nThe countess' son was the first of the noble family to rise. George was a peculiar young man who liked to nibble on her neck. Sometimes, he'd leave a cute love bite. Others, there would be a little blood, but he'd licked it off playfully. If it were any other man, Amy would have complained to the Domestic Employee Union about harassment. But its kinda cute when it came from George for reasons she can't explain. Maybe its his charisma. Perhaps she felt a strange giddy feeling when he did it, however brief.\n\n\"Greetings Amy. Do take care not to disturb my mother's mannequin collection today.\"\n\nAh, that reminded her of that occasion she picked the lock to a storeroom to clean it. She was adamant she wanted to keep every corner clean. Unwilling to be stopped by a simple lock, she entered the room to find rows upon rows of mannequins.\n\nThey were all so realistic, they seemed to breathe. Like those sci-fi movies, where humans were kept in suspended animation. Held up by long chains. Connected to long tubes that snaked around, except in this castle, the tubes were red.\n\nYup, the countess really loved red. And black. Typical gothic aesthetics of a rich noble family. Amy had many questions about these mannequins. But she wasn't paid to ask. She was paid to clean.\n\nSo, her first reaction when she accidentally broke a tube that began spraying red liquid onto the floor was to wipe the floor. The butler Vorg nagged about the waste of a perfectly preserved meal. Probably because the countess forced him to stop eating his dinner to help her out. That's what he said.\n\nShe likes Vorg. Even if his jokes are really weird and not funny. Like that time he joked about farming humans like cattle. Amy doesn't even see a farm anywhere near the castle grounds. But she appreciated any attempt to lighten the mood while they were working.\n\nAre rich people and the company they keep always this eccentric?\n\nTurns out, Countess Elizabeth has even more bizarre friends. Lord Elvari probably takes the cake. Dude claimed to be some kind of tentacle god. A very ancient one that can see a curse hanging over her head. Some spell by a witch who cursed people to think that supernatural entities are just strange humans who really are into this gothic Halloween look.\n\n\"[I've seen this curse in another woman](https://www.reddit.com/r/WritingPrompts/comments/188r5lk/wp_youre_completely_oblivious_to_the_supernatural/kbntqef/), Amy,\" he spoke in a rather grave tone. \"I can remove the spell if you wish.\"\n\n\"No offense, my lord, but this is the third time you've said this same joke. You should trade jokes with Vorg,\" she pointed in the butler's direction. \"Maybe break his curse. I'm telling you, he's the one under some magic that messed up his sense of humour.\"\n\n\"Perhaps you mean, sucked him dry of humour?\" The pale lord chuckled.\n\nAmy laughed at what was probably the first good joke she heard in the castle for a long time.\n\n\"What brings you here on this day?\" She couldn't resist asking.\n\nHe flashed her one of those charming smiles. \"I'm here to retrieve some mannequins. Don't tell Elizabeth, okay?\"\n\n\"Okay.\"\n\n**\n--\n\nElizabeth was screaming about the empty storeroom. Something about her stolen humans and a massive loss of her blood supply, before correcting herself to say it was red wine instead.\n\nAmy said nothing. She promised Lord Elvari. She wasn't paid to ask questions. She was paid to clean. According to the countess, the lord had left a trail of broken tubes and shattered chains in the storeroom. Amy had a lot of work to do.\n\n---\n\n[Thanks for reading! If you enjoyed this, click here for more prompt responses and short stories featuring Elvari the eldritch god.](https://www.reddit.com/r/TregonialWrites/)",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1ga7f82/wp_a_human_woman_is_employed_as_a_maid_for_a_rich/ltdljmj/",
        "score": 25,
        "date_posted": "2024-10-23 13:52:02",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You were send to kidnap a loved one of your objective as bait, what you weren't told is that they were a lot more dangerous and lethal than your objective.",
        "comment": "**Tinseltown's Most Terrific Tea Party! Admission is Free for All!**\n\nCarl hammered the sign down on the cracking concrete in front of the rusted, disused warehouse and stared at his partner Ralph. \"Bro, you sure this is going to lure in that pesky detective who keeps foiling Boss Bernando's plans?\"\n\n\"Carl, you dumbass!\" Ralph slapped him on the back of his head with a goat plush toy. \"Didn't boss make it clear? We're kidnapping the loved one of Detective Watson as bait. She wouldn't fall for such an elementary trick. But her dorky boyfriend will.\"\n\n\"Right, right. So, what do we know about Katrina Watson's boyfriend?\"\n\n\"He's obsessed with tea and cakes, and goats,\" Ralph read his briefing notes. \"We're serving chamomile tea, strawberry cheesecakes and he can go pet some goats at the back of this warehouse.\"\n\n\"What does he look like?\"\n\n\"Some goth LARPer who dresses like a necromancer in black robes. Pale, white-haired guy.\"\n\n\"That one?\" Carl pointed to the strange man sauntering towards them on...tentacles? Those have got to be some fake animatronic, right?\n\nRalph nodded, \"That one.\"\n\n\"Greetings humans!\" Their target waved at them with a cheery grin. \"Ah, the Tinseltown's Tea Party! Boy, am I glad to have free flow of tea and cakes! Where do I register?\"\n\n\"The guestbook's right here,\" Ralph presented to him the book he purchased from Poppa's Art and Craft shop just twenty minutes ago. \"Sign here.\"\n\n*Lord Elvari was here! :D*\n\n*Who doesn't love tea parties! :P*\n\n\"There! I've signed it. Let's get down to the party, shall we?\" He rubbed his hands, and those oddly realistic tentacles together. \"You can't have free lunches all the time, but I'm sure am glad free tea parties exist!\"\n\nCarl kept his head down and his mouth shut while Ralph led their gullible and eager target inside. The cheap plastic utensils, scrappy tablecloth they bought off a second-hand goods store, and the paltry Christmas decorations they salvaged from an impoverished orphanage, would that dork really buy it? About the only thing that costed more than pocket change was the exquisite porcelain teapot and silver serving platter for the cake. That's the most important things, Ralph said. The things that their target would focus on. And the tea, of course.\n\n\"You sure do have many armed guards for a simple tea party,\" Elvari scanned the sparsely decorated warehouse and pointed towards the gang members standing by armed and ready.\n\n\"Yea, we want to ensure our VIP party guest is secure in our premises,\" Ralph said. \"That'll be you, our honored guest.\"\n\n\"Why, thank you. How very considerate of you.\"\n\n\"Only the best for our guest,\" Ralph forced a smile on his face and gestured his kidnapping target towards the sole table and chair in the area. \"Would you like to take a seat and enjoy what we have to offer?\"\n\nThe weirdo in black robes plopped himself down on the chair and poured himself some tea. No sooner than he aimed his fork towards the cheesecake, the warehouse door slammed open.\n\n\"Freeze!\" Detective Katrina Watson shouted as she aimed her gun towards Ralph. \"You're under arrest for kidnapping...Elvari?\"\n\n\"Kidnapping?\" He sounded displeased. \"I was told this was a tea party!\"\n\n\"It's a kidnapping,\" Carl pressed the muzzle of his gun against Elvari's head. \"Detective, take a step closer and I'll blow his brains out.\"\n\n\"Which brain?\" Elvari asked in the puzzled tone. \"I have nine of these squiggly organs you call brains.\"\n\n\"Oh god Elvari, this is not the time for jokes!\" Kat bemoaned. \"Not when you're the target of a kidnapping attempt.\"\n\n\"But I do actually have nine brains in total...\" he pouted and tented his tentacles. \"I know...they've been accused of sharing one same braincell at times, but they're still nine separate brains.\"\n\n\"Boys, I'd advise you put your guns down,\" Kat spoke to the armed gangsters surrounding them. \"You have picked literally the worst target to kidnap to impede my investigations. Not because he's a big dork who thinks there could be a real tea party in an abandoned warehouse. Because he's an actual eldritch deity who could shatter your minds and have you pissing in your diapers in a psychiatric ward for life.\"\n\nThe men backed away with their guns down. A few ran out the door and never looked back. Ralph kept his gun on Kat, while Carl —\n\n*Bang!*\n\nBlood trickled down from the side of Elvari's head. He sat still, eyes wide open, before blinking.\n\n\"That wasn't very nice of you,\" he frowned while his tentacles hissed angrily. \"I was suspicious of the abandoned warehouse setup, but the tea was just too good, so I thought I should be a gracious guest and play along. But playtime's over.\"\n\nA tentacle coiled around Carl's hand to twist it until audible cracking sounds echoed across the room, alongside the gangster's screams. His gun fell to the floor, as did his knees crashed down onto the concrete. Ralph let out gurgling noises when a tentacle throttled his throat. Both unable to protest while tentacles slapped them repeatedly in their faces. Elvari continued to sip his tea and stuffed his face with cake like it was a pleasant afternoon at his favourite cafe and totally not punishing two gangsters for a failed kidnapping attempt at an old warehouse.\n\n\"Elvari? You can stop now,\" Kat squeezed his shoulder. \"I've notified Officer Jenkins to come by and make an arrest, so please leave those two to be recognizable by other scam victims at a line-up, okay?\n\n----\n\n[Thanks for reading! If you enjoyed this, click here for more prompt responses and short stories featuring Elvari the eldritch god.](https://www.reddit.com/r/TregonialWrites/)",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gvb8zm/wp_you_were_send_to_kidnap_a_loved_one_of_your/ly19avn/",
        "score": 1,
        "date_posted": "2024-11-19 21:16:55",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You've been isekai'd. For some reason, Fishing is the most dangerous job in this world. You just figured out why",
        "comment": "Mack grew tired of the boring main quests and uninspired plot of this particular isekai he was transported into. The evil minions were a bunch of pushovers. The boss fights were big dumb muscles and HP sponges. But worst of all, he had no interest in the vapid love interest he was supposed to rescue.\n\nTime to dive into silly side quests and mini-games right?\n\nFishing was this cute, idle mini-game right? Mack used to enjoy fishing in Stardew Valley and Final Fantasy XV. Hours upon hours lost, getting sidetracked.\n\nBut this world came with a warning.\n\n**\"Are you sure you wish to reclass to fisherman? It is the most dangerous job in this world.\"**\n\nMack snorted and laughed. Isn't being the hero the most dangerous thing? The job that required fighting monsters and evil dark lords? A mini-game had no business being more dangerous than the combat of this game, right?\n\n\"Greetings, hero,\" the old man by the fishing shop greeted Mack. \"Would you like to purchase fishing supplies?\"\n\n> Fishing Rod x1\n\n> Fishing Catapult x1\n\n> Tiny Tackle x999\n\n> Big Bait x999\n\n> Large Lure x999\n\n> Feast for the Gods x999\n\n> Fishing harpoon x1\n\n> Underwater rifle x1\n\n> Sea cannon x1\n\n> Underwater nuclear launcher x1\n\n\"Wait, what the fuck is that last thing?\" Mack couldn't resist pondering out loud. \"What fishing game needs a nuke? And supplies 99 of them? Also, what up with that *Feast for the Gods* bait? This has gotta some parody, right?\"\n\nWhatever. The isekai hero had more than enough coin to buy the whole lot. His plan was to start small anyway. Sit by the dock, throw his fishing rod and tiny tackle first. It didn't take long for a small bass to take the bait. When he tried to unhook the fish, an extra pair of jaws sprouted from its body and tried to bite him.\n\n\"Okay, that was a little unexpected,\" Mack chuckled as he tossed the weird fish into a bucket. His curiosity perked, he wasn't going to go down the list of fishing equipment. No, he had to go for the big thing. The nuclear launcher.\n\nAs hinted by a floating tool tip that appeared before him, Mack tossed a single *Feast for the Gods* as far as he could with the catapult and waited. After a minute, he wanted to cancel his fishing attempt and try a big bait instead but—\n\nWaters rose from the ocean. Turning, twisting, sucking up a myriad of smaller fish with it. The watery death spiral shot up into the sky, where the seas engulfed the clouds and blotted out the sun. Red glowing arcane symbols emerged from the base of the tornado, forming an ever-growing circle. With a massive explosion, that sent enormous tidal waves crashing into the lands and flattening nearby houses, a monstrous entity emerged.\n\nBoss battle music rang in Mack's ears. Thundering drums and an energetic strum of electric guitars, combined with the rising crescendo of the piano and organ pipes. And to top it all off, ominous Latin chanting.\n\nWith much dramatic flair, the crimson runes rearranged themselves to introduce their caster.\n\n**Tzaragosa The Terrible - Elder God of the Deep**\n\n\"Take that!\" The hero yelled, firing his nuclear launcher at the beast. No time to wonder why a fishing game would have a surprise hidden boss like this. His shoot hit the monster in the chest, taking a chunk of flesh and HP off. When an arc of lightning shot towards him, he leapt onto his boat and started paddling towards the Elder God.\n\n**Prepare to dodge the Lightning!**\n\nMack saw a red flash in the skies to the left of him and steered this boat right. The lightning strike almost blinded him to the rock in front, but he was sufficiently fast to turn the boat left again. One after the other, many electrifying bolts rained down upon his tiny boat. Time and time again, he avoided them. Just like his old dodging and QTE mini-games.\n\nUpon closing the distance to Tzaragosa, Mack leapt off his boat and sank his blade into its hide.\n\n**Climb the Beast! Strike its weak points!**\n\nOh, we playing Shadow of the Colossus now? Mack double jumped to reach a boney ridge and climbed on it. Then running along it until he saw alternating spikes that jutted out of the creature's back. He scaled up to the top, one spike at a time. Swung from one spike to another when it was too far for his hand to grab it. Mounting the god at the top, he saw a big red eye blinking from the back. One powerful strike from his sword caused the entire eldritch horror to roar and shudder, the eye oozing black eldritch fluids.\n\n*Might as well have said \"Hit me baby one more time\"*.\n\nGrabbing a horn to ensure he didn't lose his balance, Mack powered up his next strike and attacked the weak point again. Dodging spikes that ran along from its skull to the end of its spine, he timed his assault to the rhythm of those counterattacks. His onslaught was relentless, even as the eye burst into goo and Tzaragosa's face peeled itself apart to reveal shifting bones to attack. It was only until the beast slumped into the seas with a big crash, leaving only a small portion of its back exposed like a small island in the ocean, that Mack knew it was over.\n\n**Thank you for trying out our beta content and secret hidden boss! Would you like to leave feedback?**\n\n\"Fuck you,\" Mack whispered. \"Why couldn't this be a chill fishing mini-game?\"\n\n----\n\n[Thanks for reading! If you enjoyed this, click here for more prompt responses and short stories written by me.](https://www.reddit.com/r/TregonialWrites/)",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gm6x5n/wp_youve_been_isekaid_for_some_reason_fishing_is/lw0v5c9/",
        "score": 9,
        "date_posted": "2024-11-07 22:59:19",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] After humans have finally discovered FTL travel, they receive a—wait, what's that? A speeding ticket?",
        "comment": "Some things just don't change. I got that same sinking feeling when I see police lights in the rear window, except this time, it's the viewing station of mankind's very first FTL space shuttle. Who would have guessed aliens were real, and that they had fucking space cops.\n\nThe spaceship with the blinding red and blue lights stopped beside mine. A column of light flashed in the alien ship. Said beam then shot into our space shuttle. The tentacled creature emerging from it had a black police cap and blue uniform, making me wonder if this was some universal galaxy standard.\n\n\"Greetings earthlings, who is your pilot?\" It grunted and snorted through some device which probably translated its noises into words we understood.\n\n\"That will be me,\" I replied through his little contraption, which translated my words into blorps, slorps and gurgling noises it seemed to comprehend. \"I'm Captain Raymus.\"\n\nIt tapped on another device, this time shaped like an octopus, which then spit out a piece of paper.\n\n\"Speeding ticket,\" the tone was as flat as a flatline you see in those hospital drama shows. \"You have travelled faster than light. How would you like to make payment? We accept fuel, psychic energy or precious metals.\"\n\n\"Cash?\" I tried digging the pockets of my space uniform but came up empty. \"Credit card?\"\n\n\"Is your planet registered with the Intergalactic Federation?\" The octopoid alien asked. \"If not, you may request membership in order to register your currency as one of the accepted forms of galactic trade.\"\n\n\"I'll have to speak with my supervisors on this,\" I was confused. \"Look, I'm just a test pilot. Testing out the first ever faster-than-light space shuttle, so—\"\n\n\"Bwa Bwoo blorp blurp,\" the creature blobbered in a fierce tone that I was struggling to take seriously because he was so darn cute. \"That's what every race that first comes into our galaxy says. Always the same excuse. So many of you have rammed our most venerable god Cthulhu in the head while jamming your accelerators at full speed. First it was speedboats, then it was speed racers, and now FTL space shuttles. You wonder why Cthulhu is in a deep sleep, now you know,\" it waggled an angry, hissing tentacle at me.\n\n\"Wait, we humans aren't the first to invent FTL?\" I had to ask; there was so much valuable information to be had from this angry little tentacle boy in his police uniform. \"This is a new major breakthrough for us.\"\n\n\"Listen here, meatbag,\" the crackling voice from his translator bore the same anger as he did. \"Cthulhu has been here for eons. Many entities have shared this space with us before you learnt to light a fire. You humans ain't the first ones to discover faster than light travel. Some have done it centuries before you. Your major breakthrough is little toy. Xylonians have wormholes. Zandarians have interdimensional teleportation and space portals. There's Zmass Effectual Transportation. None of which would smash through the flesh of our god at faster-than-light speeds. So take your goddamned speed ticket and pay the fine. Since you're new, you have a one month limit to do so.\"\n\n\"And if I don't?\"\n\n\"We will vaporize your spaceship and feed you to our god,\" the alien glared at me with its many eyes.\n\nI scratched my chin. \"Isn't that punishment overly harsh for a speeding offense? It's a very minor offense. Perhaps we can negotiate, I know a friend of Cthulhu's, he can talk to you, or your god. He's octopus-shaped, lives in Innsmouth and—\"\n\n\"To you humans, is small offense,\" it pouted at me and jabbed a tentacle at my chest. \"To us, you hit our god, that is big offense. I will beam back to my spaceship. Pay the fine as stipulated on your ticket within a month, or I will hunt you down to the edges of reality. There is no negotiation.\"\n\nI raised my hands in surrender. \"Fine, fine, I'll work something out with my bosses.\"\n\n\"Good meatbag. I look forward to your timely payment of your fine,\" it saluted me with a tentacle. \"I shall take my leave.\"\n\n\"Wait, I have some cheesecake in the fridge. Do you want some?\" I offered, pointing to the pantry. \"Do you think I could get a little deduction if you like it? Maybe have this penalty reduced to a warning.\"\n\n\"I cannot deduct your fine. You must pay exactly what is stated on ticket in an acceptable form of payment as listed,\" little octopus alien cop stood his ground. \"But I can delay your deadline or...\" he paused to sniff the slice of cake I brought out from the fridge in the pantry. \"I like this. This is soo divine, exquisite. Oh la la. You know what, human? I will shred your speeding ticket and print a warning ticket. There is no second time. Goodbye Captain Raymus.\"\n\nWith a flourish of happy tentacles, the alien cop beamed out of my space shuttle and back into his own, then blasted off into space in a few seconds.\n\nSome things just don't change. That weird mutant octopus god I met on earth loves cheesecake, and turns out, weird mutant octopus alien cop loves it as much as he does. Can't wait to tell him when I return to Earth and head back to Innsmouth. I bet Elvari will get a kick out of knowing that space octopuses have the same taste in desserts as he does.\n\n----\n\n[Thanks for reading! If you enjoyed this, click here for more prompt responses and short stories written by me.](https://www.reddit.com/r/TregonialWrites/)",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gqtyfv/wp_after_humans_have_finally_discovered_ftl/lx1mx4t/",
        "score": 9,
        "date_posted": "2024-11-14 00:35:08",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] Getting kicked out of the orphanage wasn't what Blake had wished for on his eighteenth birthday. All he had was $5000 in cash, a change of clothes, a pack of cigarettes, and a lighter. He sighed, pulled down the brim of his Colts hat, and stepped into the smoggy air of Indianapolis. ",
        "comment": "Getting kicked out of the orphanage wasn't what Blake had wished for on his 18th birthday. What he really prayed for, was that the matron would stop breathing down his neck and nagging at him to do his homework.\n\nInstead, she told him this was the last time she would ever nag at him and kicked him out. You're old enough, you're 18. No longer a child. As far as she was concerned, she had many hungry mouths to feed. Younger children who stood a better chance at adoption.\n\nNow he stood outside the door, all alone. All he had was $5000 in cash—\n\n\"Wait, what orphan has $5000 right after leaving lol? If the orphanage matron couldn't afford to feed him where the money come from?\"\n\n—All he had was no cash, a change of clothes, a pack of cigarettes—\n\n\"Who the fuck let the kid smoke? Smoking isn't a cheap hobby yo. Where he get the money to buy a pack of smokes, dammit?\"\n\n\"Why are you such a smartass little kid? Anyway, let your grandpa Blake continue with his story okay? Moving on!\"\n\n—All he had was a battered backpack with a change of clothes and his Colts hat. And a few missions. Like finding a place to stay, a job to earn money. But most importantly, who the fuck granted his stupid wish. After all, Blake was pretty darn certain he heard whispers at the back of his head when he prayed.\n\nHe wandered aimlessly in town. Concerned about being spat at or kicked out again if he entered one of those shophouses. Blake kept going until he saw a sign looking for new hires at a cafe.\n\nThe lady at the counter greeted him and asked him for his orders.\n\n\"I'm here about the job. This cafe hiring new wait staff right?\"\n\nShe nodded and gestured him to enter the backroom. And that is where she murdered him!\n\n\"Hey, gramps, not funny! I'm pretty sure that's not how the story goes!\"\n\nAlright, kiddo. Let's get back to the story. The lady, her name was Marianne, she was the owner of the cafe. Upon hearing Blake's story, she hired him on the spot.\n\n\"Lemme guess, that's grandma. This is one of those how I met your mother stories, but this time, with grandma.\"\n\n\"Marianne isn't my dear Maria!\"\n\n—Anyway, Blake found a nearby shelter for the homeless where he lived there. He had a job and a roof over his head. But he had yet to discover if he was overthinking it, or if the voice who whispered at him that night was real or just...his imagination. The cafe served good food, and had a small, but dedicated clientele. Life wasn't easy, but it was alright. Blake was saving up money for reasons he wasn't sure of. Maybe buy a house one day and move out of the shelter. Get a car. Fall in love.\n\nAnd fall in love he did. With this gorgeous goddess who walked into the cafe. Such glorious long blonde hair like golden threads, luscious lips and...ah...she was so pretty, Blake just stood there as still as a totem pole instead of taking her order. Yes, your grandpa Blake was a dumbass back then. She shook him a little bit and whispered in his ear if he got her order and that's when he knew.\n\nThat was the same voice who whispered to him at night when he prayed and wished the matron of the orphanage would stop breathing down his neck. He wasn't dreaming. She was real. And she was a goddess.\n\nAfter being a typical rom-com moron who made the wrong order and spilled coffee on her dress, Blake offered to pay her back once he received his pay and gave his number to her. She gave him his number. He saved it under \"Maria\", the name she gave when he wanted to know her better.\n\n\"And you got Maria's number too.\"\n\n\"Totally did.\"\n\nAnyway, Blake called her to pay her back, but Maria turned down the money. So, they...just went out for a walk in the nearby park. And that's how we hit it off. Me, a silly mere mortal, and Maria, the goddess. Yea, your grandma was a real goddess. So beautiful, such an excellent cook. Its how your grandpa Blake knew how to cook so good. She was a great teacher.\n\nWe had children, and our children had children. Like you, little Jacob. But you see, goddesses don't stay on earth forever. They got things to do in heaven. She had to go, after a long, well at least in human terms, back to where she came from, above the skies. She left us many gifts before she went away. A car for your dad. Her bestest cookbook choke full of recipes for your mom. You got your favourite wooden horse from her, Jacob. And—\n\n\"What did she leave you with?\"\n\n\"She left me with this awesome story I'm sharing with you.\"\n\n\"You just made all this up, didn't you? Grandma was cool, but she ain't a goddess.\"\n\n\"Hey, your grandpa Blake is great at cooking, don't you know? And I don't just mean food.\"\n\n\"Hah! Called it. You cooking a story again.\"\n\n\"You used to love your grandpa stories the same way you loved my food. You were such a huge fan of my cooking. So, Jacob, did I cook with this story?\"\n\n\"This one's real cheesy, but you get 10/10 because I think its something Grandma would've loved to hear from you if she were here with us.\"\n\nTogether they stood at Grandma Maria's grave, placing flowers and a bottle of her favourite sauce. Whether she was truly in heaven as a kind soul or a goddess, Jacob always did like to think she heard all of Blake's stories and chuckled at them.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gqrfce/wp_getting_kicked_out_of_the_orphanage_wasnt_what/lx16l72/",
        "score": 2,
        "date_posted": "2024-11-13 22:33:59",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] \"MIMICS CAN TALK!?\" \"Of course we can, you idiot, we're not mindless monsters.\" \"Then why do you guys always attack adventurers?\" \"You'd attack a stranger too if they opened your mouth and stuck their hands in it unwarranted.\"",
        "comment": "The mimic tried to chomp down on the invasive limb that entered its mouth, only to spit out the disgustingly slimy tentacle.\n\n\"Ugh, you fetid piece of seafood!\" The mimic groaned.\n\n\"OH MY GOD, MIMICS CAN TALK?\" The man in a rogue's leather armor exclaimed, waving his daggers about.\n\nWith a piercing glare, the mimic retorted, \"Of course we can, you idiot, we're not mindless monsters.\"\n\n*\"Then why do you always attack adventurers?\"* The small mind flayer in an adventurer's outfit asked, flicking off mimic saliva from its tentacle.\n\n\"You'd attack if a random stranger too if they opened your mouth and stuck their hands in it unwarranted,\" the mimic gnashed its teeth. \"I bet it feels awful.\"\n\n*\"I don't know, humans don't seem to be able to locate my mouth, or want to stick their hands within my tentacles,\"* that tiny tentacled thing shrugged. *\"Do you have a name? I'm Lando.\"*\n\n\"So do you have treasure in your mouth?\" The rogue squatted down to speak with the mimic.\n\n\"No, I don't,\" it snarled. \"What I have in mah belly is adventurer flesh.\"\n\n\"I bet it probably has a ring or two if it has eaten many hands,\" the wizard with the long beard said. \"Maybe even a magic bracelet.\"\n\n\"Am I being robbed now?\" The mimic backed away from the trio. \"This isn't fair! This is three against one!\"\n\n\"Alright, let's discuss this. Wait for us, mimic,\" the rogue pulled the other two away into a short distance where the mimic could still hear them talk. \"Do we choose someone to fight the mimic for treasure, or we let the mimic pick its opponent.\"\n\nThe wizard leaned against his staff and spoke out loud. \"I say I launch a fireball and be done with it!\"\n\n*\"That'll burn up any treasure inside,\"* Lando piped up, wriggling his tentacles in a weird way. *\"I propose we let the mimic choose. If I'm right, it will choose to go for a challenge or someone who will yield the most treasure. Don't mimics like treasure?\"*\n\n\"We looted a few dead goblins earlier,\" the rogue said. \"Do you think we can bait it?\"\n\n*\"Papa Regis...if I were the mimic, I wouldn't be baited because I'd start running already,\"* the mind flayer pointed in the mimic's direction.\n\nThe bizarre trio of adventurers, if that small squid thing counted as one, returned to face the mimic. Which was already trying to slip away unnoticed as Lando guessed.\n\n\"That sneaky bastard!\" The rogue yelled. \"As the party rogue, I'm supposed to be *the* sneaky bastard!\"\n\nHearing the roaring flames of a fireball, the mimic dodged to one side and kept bouncing towards the cave exit. The pounding of hurried footsteps only urged it to keep up its pace. When the cave split into three paths, it quickly hopped into the right path. The thump of boots grew fainter as the mimic ventured deeper, the passageway growing silent.\n\nToo silent.\n\nThe mimic spun around to see what was amidst but saw nothing. No bats, no guano on the cave floor. The unnatural quiet unnerved it, spurring it to keep sprinting towards some exit. Having lost its sense of direction, it trudged round and round in circles. Before it could let loose a scream in frustration, tentacles clamped down on its mouth.\n\n*\"Gotcha!\"* Lando pounced upon it with gusto. *\"Now let's see what treasure you have!\"*\n\n\"Mmmm...\" the mimic struggled to break free as tentacles slithered into its mouth.\n\n*\"Finger bones...more finger bones...\" the mind flayer muttered. *\"That is a lot of adventurer hands you have caught. Oh this one has a shiny ring to it,\"* he appraised the ring on a skeletal hand. *\"James will know what this is worth. Oh this hand is still somewhat fresh, there's still some flesh to it.\"*\n\n\"Alright mimic,\" the two humans had caught up to it. \"No running this time. Lando, you got any treasure from it?\"\n\n*\"Yesss!\"* Lando raised the shiny ring triumphantly. *\"Will it fetch a pretty penny at the jeweller's?\"*\n\n\"Probably,\" the wizard stepped forward to take the ring. \"Nothing else?\"\n\nThe rogue snapped his fingers in excitement. \"Can't just leave this huge cave with only one ring! I say we grab this mimic along with us! Sell it to any Innkeeper who wants mimic furniture to bite unruly robbers!\"\n\n\"Like all of you!\" The mimic shouted. \"You awful adventurers! You're all the same! And you wonder why mimics hate you and want to eat your hands!\"\n\n\"*If this mimic doesn't want to be furniture, I say we throw it into a wood chipper.\"*\n\n\"Fine, whatever. Sell me as mimic furniture.\"\n\n\"It's a good life I hear,\" Regis said. \"A loving owner, free food, no weird people sticking their hands into your mouth...\"\n\n\"Do I get a monthly stipend or salary?\" The mimic asked.\n\nThe wizard squeezed his staff tightly. \"Why do you know about these things?\"\n\n\"I tried approaching the Adventurer's Guild to sue them once. So. I've learnt a thing or two about my rights as an intelligent being.\"\n\n----\n\n[Thanks for reading! If you enjoyed this, click here for more prompt responses and short stories featuring Lando the small mind flayer.](https://www.reddit.com/r/TregonialWrites/comments/1fm93y5/lando_the_mind_flayer_adventurer_%E3%81%A4_%E3%81%A4/)",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gjudqg/wp_mimics_can_talk_of_course_we_can_you_idiot/lvgtjlo/",
        "score": 108,
        "date_posted": "2024-11-04 22:38:07",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] Theres a wandering immortal who has been planting flowers and trees after the fall of Humanity..700 years later the remaining survivors wake up from cryosleep to a foreign, yet breath taking earth.",
        "comment": "Once, he was a prisoner sealed within the earth. The humans said an eldritch entity like him was a danger to earth. As cities crumbled and civilizations fell from mutually assured destruction of the global nuclear war among humans, he watched silently. Tasting the delicious irony with his forked tongues.\n\nWithout its wardens, the prison that held him eventually collapsed. In the ruined wastelands that once teemed with buzz of urban life, he walked the desolate earth. This solitary figure that witnessed and survived the fall of humanity in its hubris. Gone were his enemies. There was nobody left to oppose him. To stop his plans.\n\nSo, he started sowing the seeds of life. If he was to remake this earth to be a place he could comfortably live in, there was so much work to do.\n\nFor the young saplings he had nurtured, they needed room to grow. He tore down the hollowed towers of broken glass and steel. All to pave the way for the flora and fauna of nature to retake the lands the humans said they \"reclaimed\" to build their concrete jungles.\n\nThe young saplings grew into might trees. Tall grass weaved across the formerly deserted lands of sand and stone like a green carpet. He watered them with love for this land. The dominant sapient species of this earth might have little love for him, but this earth still held a special place in his hearts.\n\nWhen the oceans were washed of pollutants, the breeze clean and refreshing, he began to reintroduce animals into this planet. Nobody liked being the sole ruler of a big globe of nothing, so it made sense to repopulate earth with all sorts of creatures, big and small.\n\nOver the centuries, he forgot his name. For there was nobody to speak with him. The birds sang their songs, the dolphins clicked and whistled, but none knew of this new creator of their earth. And eventually, even he ceased to remember anything of the humans who once fought to seal him away.\n\n**\n--\n\nThe cold hum of the cryosleep machines greeted Commander Lilian when she emerged from her pod, groggy and disoriented. Her datapad beeped, reminding her of her mission. To survive mass destruction in a bunker a hundred miles beneath the earth, then rebuild and repopulate this earth with a selected band of a thousand humans.\n\nWhen she led their team to ascend the stairway to leave the bunker, she was blown away by what she saw. The earth they had left was a wasteland, a dying planet choking under poisoned skies with radiated smog. Not this. This land of dense forests stretching beyond the horizon, their canopies full of life. Filled with the songs of birds and the chatter of monkeys. Vibrant grass and splendid flowers blanketed the hills in vibrant patches of color. Rivers sparkled in the distance, cleaner than they had been in centuries.\n\nShe pinched herself once. Then twice to make sure she wasn't dreaming. With a deep breath, Lilian approached the horned creature of multiple arms and tentacles that sat atop the hill.\n\n**\n--\n\nA murmur ran through Lilian's group. A man spoke of the terrible eldritch monster that humanity imprisoned beneath the earth over 700 years ago. Some spoke of gods and legends maintained in the records of their datapads. Others debated between trying to speak with it or fighting it.\n\nOnly Lilian saw centuries of loneliness that stretched far beyond human understanding in his eyes. And a long-buried desire for companionship that the animals he created could not fully provide.\n\n\"Hey,\" she whispered as she stepped towards it, extending her hand for a handshake. \"Did you do this? Restore this earth?\"\n\n\"Yes,\" came the low, rumbling voice.\n\n\"Our records said you were a destroyer. Why this change of heart?\" She asked. \"How have you rebuilt this earth all by yourself without us?\"\n\n\"I sought to destroy humanity back then because you were destroying this earth, slowly but surely. It is arrogant to assume the world needed humans to return to rebuild. You are but one of many creatures on this earth. It can and will continue to revolve in your absence. But...welcome back, I suppose,\" he shrugged. \"Please promise me you won't go back to the old ways.\"\n\n\"What happens now?\"\n\n“That is up to you,” the eldritch being replied. “This world is yours as much as it is mine now that you humans have returned. Do not squander your second chance.\"\n\nShe felt a quiet fear that lingered in the entity's hearts: the knowledge that the cycle of destruction could begin again if humanity did not change.\n\n\"We'll do our best for our earth. Do everything not to repeat the old mistakes of the past. We are ready. Show us the way.\"\n\nHe smiled, his eyes twinkling with newfound joy while his tentacle curled around Lilian's hand to return her handshake. \"Come, young humans, I have so much to show you.\"\n\n----\n\n[Thanks for reading! If you enjoyed this, click here for more prompt responses and short stories written by me.](https://www.reddit.com/r/TregonialWrites/)",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1ga6uc0/wp_theres_a_wandering_immortal_who_has_been/ltc2b70/",
        "score": 42,
        "date_posted": "2024-10-23 08:59:22",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] Each mage is assigned a warrior to protect and serve them. You arrive at the temple to meet your warrior. Turns out, they are someone that you never wanted to see again...",
        "comment": "The magic bond between mage and warrior meant that Lyssa couldn't kill him. Her only consolation was that Grim couldn't slit her throat the same way he did to her parents.\n\nShe was beginning to wonder if the god of Therion Temple was truly the God of Justice. Or jokes. Such was the irony, she could taste its bitterness in her lips. For most of her life, Lyssa had travelled far and wide. Trekked through the wilderness, trained in the isolated mountains where the Therion Temple stood. All to run away from the murderer who destroyed her family.\n\nYet now he stood, largely unchanged. Waiting. Her chosen warrior to protect and serve her during her pilgrimage. Many mages of Therion would have a warrior by their side, but only one would actually reach the end of the journey.\n\nHer fellow mages had renowned paladins and adventurers. She was stuck with a dishonorable assassin. One who could not leave her side.  Compelled to save her from harm, and if deemed necessary, take near fatal blows meant for her. The only thing she enjoyed was his horror upon realising he was meant to protect and serve her for a foreseeably long time.\n\nSlowly, Lyssa found ways to torment Grim. Payback, she'd say. She could hurl insults and throw pots and pans at him. Just not fireballs or bolts of lightning. Nothing in the contract said he couldn't yell back at her. But he didn't. He was too quiet.\n\nUntil one day, when she was deployed to defeat a fiery dragon, he spoke.\n\n\"Did anyone tell you about your parents?\"\n\n\"You don't deserve to talk about them!\" Lyssa flung a searing fireball that curved out of his way. Grim didn't bat an eyelid. \"You murdered them!\"\n\n\"Did you ever ask why?\" He sharpened his blade upon a whetstone.\n\n\"Because you were paid to,\" she spat out the words.\n\nUndeterred, he kept up his questioning. \"Did you ever find out who paid me?\"\n\n\"I don't care! I'm just trying to move away from my past! Who the hell paid you is—\"\n\n\"Your father.\"\n\n\"What?\"\n\n\"He wanted out,\" Grim was as calm as the surface of the serene lake just a few meters away from their campsite. \"Out of this system the Therions cooked up. Say, girly, do you believe in Therion the god?\"\n\n\"...I don't know,\" she hadn't felt this hesitant in a long time.\n\n\"I used to think he was a phony. Like a bunch of hogwash these acolytes churned out to get people to do their dirty shit. You think a good mage needs a protector? Why is it always a warrior anyway?\"\n\n\"Why is that important?\" Lyssa snapped. \"Why am I listening to the man who killed my parents?\"\n\n\"Because, if you don't, you might be the next one to be sacrificed.\"\n\n\"What?\"\n\n\"You're not the first mage I was bonded to. But I do hope you're the last one,\" Grim twirled his blade in the air before sliding it back into its sheath. \"The best mage and warrior duo, the first pair to reach the end of the pilgrimage, to defeat all obstacles and monsters, they're sacrificed. Something about the gods wanting the souls of great men and women to join their divine war in heaven.\"\n\n\"My parents, were they a mage and warrior pair?\" Lyssa grew curious.\n\n\"Yes.\"\n\n\"What's the difference between dying to the gods and dying at your hands?\"\n\n\"They don't go to heaven if they didn't die in a brave fight,\" Grim stood up and stared into the night sky. \"It was your father's idea to die by his own terms than be a plaything of the gods after death. But suicide is a shameful thing for losers. Or so that's what tradition dictated.\"\n\n\"Just exactly what are you?\" The young mage's brain was spinning. \"You've bonded with more than one mage in the past. Mages who are dead. Probably sacrificed to arise as another pawn of the gods. But you're alive.\"\n\n\"Undead,\" he corrected her. \"Because there's one deity who's tired of all this endless eternal fighting among his kind.\"\n\n\"And he chose you to put the kibosh to these old traditions by the Therion Temple?\"\n\n\"Yes.\"\n\nLyssa inched ever closer to a strange truth. \"Do you know the name of your god?\"\n\n\"He sure did make himself known to me. Once I used to think he was a phony, but Therion burned his name into my mind so that I may never forget how these temple folks use his name in vain. Now, he's made it clear. Therion's a joker who chose to put a girl and her parents' murderer as a team. But if we do this right, we could be the last bonded mage and warrior of this land. The last one to never go fight the war for the gods.\"\n\n----\n\n[Thanks for reading! If you enjoyed this, click here for more prompt responses and short stories written by me.](https://www.reddit.com/r/TregonialWrites/)",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gexe9m/wp_each_mage_is_assigned_a_warrior_to_protect_and/lue7muw/",
        "score": 144,
        "date_posted": "2024-10-29 14:55:43",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You're granted a wish giving you the power to transform into any animal. You're surprised to find some cryptids, undiscovered species, and . . . sinister things at your selection. The implications are starting to unnerve you.",
        "comment": "\"Big Foot is on the list?\" Lionel pointed at the list of animals on earth given to him. \"That's a legit choice?\"\n\n\"Is it so peculiar?\" I asked, spreading my arms. \"You won a lucky draw to be granted a wish to transform into any animal. In my town, where humans live alongside supernatural beings and entities of the Deep. You are talking to an eldritch god. Why does the existence of Big Foot surprise you this much?\"\n\nLionel shrugged. \"Always thought that was just a myth.\"\n\n\"I could grant your wish to be Big Foot.\"\n\n\"I'm not done flipping through this list,\" the human continued browsing my catalogue. \"Gotta say, your selection is crazy. Like shoggoths? Chthonians? Really?\"\n\n\"For as long as they exist on this earth, they are in this most comprehensive list. Even if some of these species are not native to earth,\" I nodded while sipping my tea. \"And as long as there is one specimen that roams the lands, I can make it happen.\"\n\n\"Is Big Foot native to earth?\" Lionel perked up with sparkling curiosity.\n\n\"Yes.\"\n\nHe deflated instantly. Ah, inquisitive humans always wanting the strange, bizarre options. Suddenly Big Foot wasn't such an attractive option now that he was told it was an earthly creation and not some migrant from the Abyss.\n\n\"Elder Things? Wow I—\"\n\nI accidentally crushed the teacup in my hands and spilled my tea all over my robes.\n\n\"Lionel, that must be a mistake by one of my employees. The Elder Things may have once lived on earth, but they're dead. Extinct,\" I pressed a tentacle on the catalogue while my hands were occupied, wiping the mess I made. \"Pick something else. Anything else.\"\n\n\"So, they're not just fictional things Lovecraft came up with,\" he was deep in thought. \"Make me one of them! I want to go to Antartica. See the ruins discovered by the Miskatonic University. Dig their deepest, darkest secrets. Climb the Mountains of—\"\n\n\"I will not allow it,\" I had to be firm on this one. \"No mortal should step into the Mountains of Madness. The Six-Star City buried beneath the snow must stay that way.\"\n\nHe was laughing. \"Did I hear correctly? The Eldritch God of Madness, Lord Elvari, telling me to stay away from the Mountains of Madness? Are you afraid?\"\n\n\"Your mind is not equipped to comprehend the shared memories of the Elder Things. The horrors they witnessed and fought against,\" I flipped through several pages to point to the page on dragons. \"Many humans like dragons. Huge, majestic beasts. Intelligent and long-lived. What's not to like about a dragon?\"\n\n\"This thing, next to Elder Thing, I can't even read the text,\" Lionel forcibly turned the pages back. \"But I want whatever that mysterious creature that is.\"\n\n\"You can't even comprehend the name, and you want that? It is in R'lyehian, an eldritch language of the Abyss,\" His mindset was frustrating to deal with, as much as this clerical error was. \"No human mind or soul was made to grasp—\"\n\n\"Only one way to find out.\"\n\n\"No, I've made that mistake once,\" I stared deep into the man's soul and sighed. The depths of his determination to get that forbidden fruit only grew stronger the more I denied him of the obvious dangers ahead. \"But if you must, I insist you sign a contract stating that I am to bear no responsibility for the consequences of your wish and subsequent decisions and actions that come after it.\"\n\nHe signed it. Bound by my promise to honor the results of the lucky draw, his wish would be granted.\n\n**\n---\n\n\"Is it dead?\" The monster hunter Carmen asked me, her rifle still pointed at the twitching mass of faces that melted off this carcass like low-grade Halloween masks. Its toros splitting apart akin to a cracked melon, flailing appendages bending at bizarre angles. \"What in the fucking Abyss was that thing?\"\n\n\"It is truly dead,\" I replied, my gaze fixed upon the entity transformed by a wish. \"You are only witnessing the final death spasms of a monster that the Elder Things created as a living weapon many years ago, only for it to turn against its masters.\"\n\n\"Shouldn't it be a frozen popsicle alongside the rest of the Elder Things found in Antartica?\" Carmen's expression was a mix of disgust and morbid curiosity. \"Elvari, you owe me an explanation.\"\n\n\"It is a long story,\" I cleared my throat. \"One that started with a wish...\"\n\n----\n\n[Thanks for reading! If you enjoyed this, click here for more prompt responses and short stories featuring Elvari the eldritch god.](https://www.reddit.com/r/TregonialWrites/)",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gr30vp/wp_youre_granted_a_wish_giving_you_the_power_to/lx3jekh/",
        "score": 51,
        "date_posted": "2024-11-14 10:21:41",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] The eldritch abomination who makes those who gaze upon it go insane is the monster equivalent of a young child curious about an anthill.",
        "comment": "Zhyzal poked his visage through layers of swirling stardust. His form was nebulous, ever shifting as his eyes were, always on the lookout for lifeforms that piqued his curiosity. Dark, star-speckled tendrils of void and fractured reality flowed from it, shimmering and undulating, sometimes taking the shape of whatever organism caught his interest, sometimes spiraling into unknowable, non-Euclidean geometries.\n\nWith a sweep of a tentacle, a smattering of stars was scattered across galaxies. Zhyzal sifted through the atmosphere of this globe of land and seas. All to hone its sights into these tiny little things called humans. Such insignificant beings. Yet they scurry about their business with vivid dreams of such joy and sorrow, pumping emotions of love and hatred.\n\nA small town pulsed with eldritch energies, drawing Zhyzal's attention. He let out an excited squee. Eagerly seeking the source of that energy like an eager child combing through the sand for crabs. His eyes all focused on scanning every little human who looked interesting.\n\nThe first human to accidentally meet his gaze screamed. It was not intentional on Zhyzal's part, but as a nascent young eldritch, he had no control. Somewhere within the depths of his mind, memories of other realms he toyed with flooded the single human's tiny brain.\n\nAnother human howled as she saw herself, aged and decayed, across countless lifetimes. A young man waiting for his girlfriend dropped his bouquet of roses. Tears rolled down his face as he was gripped by a feeling both foreign and familiar—a love that stretched eons, as ancient as it was heartbreaking. All before it was torn asunder by the claws of insanity.\n\nZhyzal tilted his head and widened his eyes. Why did gazing at them from afar in his galaxy had such reactions? All emotions washed away in favor of insanity. He would prod and poke at their minds no different than a young child poking at an ant hill. Except, humans couldn't bite him back the same way ants would swarm and bite a child.\n\nWhen he leaned back, tearing his gaze away from this town and its small mortals, the insanity that poured into their minds swiftly dispersed. Unable to comprehend that he was utterly incomprehensible to them, Zhyzal tried to communicate.\n\nWhat he thought was a single \"hi\" was a projection that seized them in catatonic horror. Some frozen with their mouths opened in terrified screams. Others were laughing mad, their minds unraveling as a thread pulled from a seam.\n\nPuzzled by such reactions to his first contact, Zhyzal extended a tentacle to poke around. Was it so hard to find a new friend? Now, it was his turn to freeze as his appendage was held in place by that mysterious eldritch energy he detected earlier.\n\n\"Hello,\" the white-haired stranger gazed upon his Abyss with vivid violet eyes.\n\n\"Hi earthling!\" Zhyzal spun and flapped in his void in a failed attempt to conceal his nervousness. \"Hi I'm Zhyzal!\"\n\n\"Hello Zhyzal, little one of the Void.\"\n\n\"I am not little!\" The eldritch child of the void yelled, shaking stars all around him. \"I am very big! I am bigger than your tiny globe!\"\n\n\"You are young.\"\n\n\"And you sound really old,\" Zhyzal could hear the weight of thousands of years of memories in this voice, not of this earth. \"Where are you from? Why you live on earth now?\"\n\n\"I was from the Abyss, but have since chosen to settle on earth in this form of flesh and blood of three dimensions. Earth is a nice place to stay.\"\n\n\"But I can't squeeze into a globe that's smaller than me!\" Zhyzal whined, sending shockwaves across his void. \"Oh, what is that?\"\n\n\"Zhyzal! Its dinner time, son!\" His mother's call echoed through the galaxies. \"Stop playing with those dinky planets!\"\n\n\"Wait, mom! I'm talking to a friend!\"\n\n\"Friend? How'd you befriend those microscopic little things on such tiny planets?\" She wasn't convinced. \"No more excuses! Get over here for your dinner!\"\n\n\"Aww shucks, mister,\" Zhyzal slumped into a floating pile of goop and tendrils. \"I really gotta go, mom's shouting for me. I wanna know your name so I can look for you again.\"\n\n\"Just call me Mr. Elfie,\" replied the stranger, projecting his words through the atmosphere and directly into Zhyzal's mind.\n\n\"And your town? So, I can zoom into it faster?\"\n\n\"Innsmouth.\"\n\n---\n\n[Thanks for reading! If you enjoyed this, click here for more prompt responses and short stories written by me.](https://www.reddit.com/r/TregonialWrites/)",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gpil5g/wp_the_eldritch_abomination_who_makes_those_who/lwrgdvi/",
        "score": 29,
        "date_posted": "2024-11-12 10:42:08",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] Your mother is an adventurer, she left 10 years ago. You left home with your sister to go find her. You are enraged to find her laughing it up in a tavern months after you set out.",
        "comment": "\"One more demon to slay,\" Mom said that ten years ago. \"The people of Rivervale need me.\"\n\nWouldn't be the first time she told me and my sister the same thing. Over and over again, her town, her country needed this heroic adventurer more than we needed our mother. We were used to fending for ourselves. Her long absences once hurt us, but now we're just numb to yet another quest she had to undertake.\n\nTerra said we should be adventurers too when we were old enough. Maybe mother will stay home if one of us could go kill a demon instead of her. I told my sister there had to be other heroes. Why did it always have to be mom?\n\nThat was ten years ago. We're adventurers now. Terra loves the fame and fortune that comes with it. That jagged scar across her face gave her plenty of stories, each fancier than the last. I knew how she got it; getting mauled by a bear while trying to collect 20 bear skins. But given her love for theatrics, who was I to correct Terra's tall tales?\n\nThe allure was there. To have ordinary citizens sing praises of your names. For bards to compose ballads of your deeds. Commendations and rewards from the king himself. I could see why mother was attracted to these things.\n\nIt was by chance, when we both entered the Flying Flagon Pub did we saw her. Her hair had streaks of white, skin as tough as leather. Eyes as wild and excited to set off to go slay a demon as ever.\n\nMother drank her tenth mug of ale, regaling her audience with stories of slaying a dragon.\n\nI was pissed. Even though my sister and I, we knew somehow in our hearts this was to be expected. She was a wild woman, addicted to alcohol and adventure. This was not someone to stay at home and be a good wife or mother.\n\n\"Do you know who we are?\" I stormed across stunned patrons and made my way to her. \"Do you remember us?\"\n\n\"Hey, if it isn't another band of adventurers too!\" She waved at us. \"Come sit by the table and share with me your stories! I'm sure you have incredible feats to tell!\"\n\n\"I'm Bess and this is Terra!\" I shouted. \"Ring any bells?\"\n\n\"Oh, Bess and Terra!\" Mother exclaimed. \"I'm Madison, good to meet you both!\"\n\nWas she pretending not to know us? There weren't any signs of recognition in her eyes. As though she never met us before.\n\nTerra stepped forward to stand next to me. \"You have two daughters, Madison.\"\n\n\"I do?\" She seemed genuinely surprised. \"Well color me rainbows and skittles, kids? I barely have downtime from all the questing and slaying to get laid, much less have children. I'm a busy woman. Comes with the baggage of being the most in-demand adventurer.\"\n\n\"Lemme slap some sense in you!\" I roared, raising my hand, only for Terra to pull me back.\n\n\"That won't work,\" she whispered. \"Mom...Madison. Something, or someone, they wiped her memories. Getting mad won't do a thing.\"\n\n\"Are you sure about this? I asked my sister.\n\n\"I did a quick mind scan while you two were talking,\" she made the hand sign for an apology before dragging me out of the pub. \"That memory wipe, it has attained a stronghold in her mind. The kind of grip that takes years to build. Ten years.\"\n\n\"This is why she didn't come back unlike her previous expeditions? Can't come back to what she doesn't remember? What monster did that to her?\"\n\nTerra paused, her eyes averting my gaze.\n\n\"If you know something, tell me!\"\n\n\"That spell was by a human. You know what that means. Mother was so good at this adventuring thing, that person wanted her to keep going. Without coming back to be *distracted* from heroics by...us. They thought we were holding her back from going all out to be a heroine.\"\n\n\"No. That, that cannot be.\"\n\n\"It is what it is, Bess. Too late to clear the fog in her mind. It has lingered for far too long. Too strong. We've lost her. Not today. She was gone ten years ago.\"\n\n\"No matter what, I'm getting mom back, now that she's here. Now that we both know she's alive. Where do we get started? What do we do first?\"\n\n\"We could start by asking around. Talk to those who have worked with her in the past. One of them has bound to be the one who administered the memory wipe. But honestly, there's no going back even we succeeded in bringing her back. Ten lost years are forever lost. None of us is ever getting that back.\"\n\n\"But we could at least take a chance to stop further loss. I don't want mom to die never ever recalling she had us.\"",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gn5ztg/wp_your_mother_is_an_adventurer_she_left_10_years/lw9mucy/",
        "score": 69,
        "date_posted": "2024-11-09 11:19:40",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] \"Uh, that's your weapon of choice?\" \"Yeah, I know, its not technically a weapon but BOY does this thing know how to KILL!\"",
        "comment": "\"Welcome to the 4th day of the Varfeld Under-15 Magic Tournament! Today, we have Cara Velan, a young promising witch from Tinseltown in the left corner! And in the right corner, we have Jane Foster, a magical girl from...Innsmouth? Did I get that right? Anyway, contestants, please choose your weapon!\"\n\n\"Uh, that's your weapon of choice?\" Cara blinked, wondering if she was going crazy from seeing things, or if her opponent was nuts. \"That's a limp, wet noodle.\"\n\n\"Now you just hurt his feelings,\" Jane pouted, patting the disembodied tentacle in her hand. \"Say sorry to Banana.\"\n\nCara was incredulous. \"Who calls a tentacle a banana?\"\n\n\"He came up with the name himself,\" Jane frowned and cracked him like a whip. \"Banana is a sentient tentacle given to me by my dad. He told me Banana will be a fine substitute while my wand is getting repaired. I get it, he's technically not a normal weapon to wield, but boy does he know how to kill!\"\n\n\"Oh, I remember your wand getting broken in the last round,\" the witch sneered, swinging her scythe. \"I can't wait to slice that tentacle into two. Maybe even make sushi out of it. Tell Lord Elvari to enjoy his banana split.\"\n\n\"Girls, this round is for both of you to test your mettle against various monsters, not each other,\" the announcer reminded them. \"You're both pretty, and you both have incredible weapons. Remember to kiss and make up after this friendly competition is over, okay?\"\n\n\"Eww, gross. I'm not kissing her.\"\n\n\"Are both of you ready? On a count of 3, 2, 1, release the monsters!\"\n\nCara dashed forward to slice off the arm of the first Night Gaunt that entered the arena. Her next move was swinging towards its neck, only for that blasted tentacle to coil around the creature's neck and rip it clean off.\n\n**Jane 1 : Cara 0**\n\nDammit.\n\nA troll stepped in the ring, thumping its chest with one hand while swinging a spiked club with another. Cara swung her scythe at the back of its knees, slashing into tendons and bringing it down on its knees. Jumping up to sink her blade into the troll's neck, she felt a slimy tentacle curl around her leg and slap her into the ground.\n\nDid that creepy tentacle just...grinned at her? Did it have teeth? Or stuck out its tongue at her?\n\nIt wasted no time in stabbing into the troll's left ear, and thrusting out the right.\n\n**Jane 2 : Cara 0**\n\nTime for a change of strategy. To sit back and let Jane and her banana tentacle strike first, then steal the kill. Except he chomped on the next critter's face for a swift kill. He was as flexible and deadly as unorthodox of a choice he was for a weapon. A living weapon that whipped and stabbed and slapped various monsters around.\n\nWhen Cara dug her scythe into the skull of a Nightmare and celebrated her first kill, Jane already had a massive lead.\n\n**Jane 35 : Cara 1**\n\n\"Why does a wet noodle know how to kill so well?\" She screamed, releasing bottled rage as a volcano would spew lava and smog. \"How is that lame, noodle thing more effective than my scythe?\"\n\n\"Because he's an awesome gift from my dad!\" Jane shot back, whipping off the skull of an undead dread knight. \"I can ask Elvari to lend you a tentacle too!\"\n\n\"Never!\" Cara yelled, her inner turmoil stirring a storm within. Her brain said no to wielding a stupid tentacle, her heart wanted something so powerful and deadly despite appearances. \"I'll catch up to you, I swear!\"\n\nKills three, four and five came in for Cara. Her scythe was soaked in monstrous blood, and her arms began to ache.\n\nBut that tentacle was still wriggling around, this happy murder machine with infinite stamina. Jane looked too relaxed. She had a bounce in her step. The easy smile of someone enjoying a casual stroll in a garden. All while monsters dropped dead like flies. And the blood? All noisily slurped up by Banana.\n\n\"This is a massacre! A massacre of monsters and scores!\" The announcer exclaimed. \"Jane wins this match hands and tentacle down, with a score of 42 to Cara's 8!\"\n\n\"Hey Jane,\" Cara sat beside her opponent in the locker room. \"I've been thinking, I want an incredible weapon like that. As...stupid as it looks.\"\n\n\"He,\" Jane corrected. \"Banana prefers male pronouns.\"\n\n\"Fine, he, him, whatever. I'm not sure if my coven will allow it, but I want a new contract with a new patron god. Preferably one that supplies murder noodles like Banana here.\"",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gmjp21/wp_uh_thats_your_weapon_of_choice_yeah_i_know_its/lw3i0kq/",
        "score": 52,
        "date_posted": "2024-11-08 11:00:33",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] Inside you were rotten. But you've made the masses love you. Pretending to be the noblest of heroes was the easiest way to gain power. Finally, as your rule becomes absolute, you prepare to unleash your true self and begin your reign of terror... and then you die and end up in Heaven.",
        "comment": "\"Timmy Tarkin, Dark Lord, no, False Hero of Envosta, welcome to Heaven,\" the creature of flaming concentric rings and too many wings and eyes greeted the man in golden armour.\n\n\"There must be a mistake! What do you mean, *false hero*? The masses love me! Worship the ground I walk!\" Timmy shouted. \"I was supposed to...save the world! Become the absolute power to eliminate all villains—\"\n\n\"And any who would oppose your dictatorship?\" The entity blinked its multitude of eyes. \"You cannot fool me.\"\n\n\"Did you kill me, you monster?\"\n\n\"I am no monster. I am an angel of my lord. Do you not desire heaven after all your supposed good deeds?\" Its voice dripped with venomous mockery. \"This is the place where heroes go when they die.\"\n\n\"NO! I was meant to rule the world!\" Timmy gnashed his teeth and clenched his fists. \"To unleash my true self and begin a reign of terror—\"\n\n\"You can do so in your little corner of Heaven. Come with me,\" the angel beckoned with its feathery wings, pure white with crimson markings. \"There, do you see these kindly folks here? They are yours to interact with.\"\n\nTimmy wouldn't argue. He would rule this new domain given to him and terrorize the folks. Did he need to once more keep up his pretense of being the noblest of heroes? Could the rotten, darkened heart of this man pour out the malice within?\n\n\"Wait, angel, where is my weapon?\" He demanded with an outstretched hand.\n\n\"Where you live here now, you have no need for weapons,\" the angel proclaimed. \"Now, go meet with your fellow residents.\"\n\n\"Hey, welcome new person!\" A woman came up to greet him.\n\nBAM!\n\nTimmy threw a nasty uppercut to her face. She turned back to face him without any injury or reaction. More people stopped what they were doing, from watering their plants to tending to their pets, and approached him.\n\n\"Hey, welcome new person!\" She repeated. \"Welcome, welcome to Heaven.\"\n\n\"Heaven is a wonderful place to be!\" Declared a young man who joined the growing crowd. \"There's no better place to be than Heaven!\"\n\n\"Fork you!\" Timmy roared. \"Why you forking shirtballs! Get the forking shirt away from me! Bow down before me!\n\n\"Fuuc~, fooork this!\" He huffed and puffed and tried to swear to no avail. What kind of Heaven would forbid its residents to swear? What is this, a Disney Park? \"The slu~, slots! The whor~, horses! The fork is this!\"\n\nNo weapons, no swear words, and people who don't react to being punched in the face or kicked in the balls. They didn't even deviate from whatever limited scripts they were given. None would listen to him preach. His usual manipulation and lies fell apart without an audience. It didn't matter if he spoke as the Hero of Envosta, or paraded as the Dark Lord.\n\nHe slumped in his deck chair. Not feeling like a hero. No sense of people worshipping the ground he walked. And to think he was so close to achieving that in real life. To add fuel to the fire, the angel seemed to derive snarky pleasure in denying to tell him the truth of how he died. Without any consequence regardless of his actions, from fighting random people, strolling around in his birthday suit, it got boring.\n\nToo boring.\n\nSo much so, he went up to the angel to lodge a complaint.\n\n\"Heaven isn't supposed to be like this! Isn't it a good place for good heroes like me?\"\n\n\"Yes, it is good for people like you indeed,\" it spun on its circles and flapped its wings. \"What is so bad about your slice of heaven?\"\n\n\"It is boring!\"\n\n\"But peaceful. Or would you rather live in *interesting times*?\" There was a dangerous edge to the creature's voice.\n\n\"Let me tell you,\" Timmy waggled a finger at it. \"My life on earth was so much more interesting! I had women throwing themselves at me, begging to have my babies and—\"\n\n\"That life is no more, human.\"\n\n\"The real good place for me is Earth, not this sanitized Heaven!\" He stomped his foot. This place is forking bad!\"\n\n\"Oh, so you've realised,\" the angel blinked, black liquid spilling from its crimson markings to stain its once pristine white wings black. Clean white walls disappeared to reveal fire and brimstone and lakes and rivers of lava. \"This is the bad place for bad people like you.\"\n\n----\n\n[Thanks for reading! If you enjoyed this, click here for more prompt responses and short stories written by me.](https://www.reddit.com/r/TregonialWrites/)",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gkv6y5/wp_inside_you_were_rotten_but_youve_made_the/lvpjyx0/",
        "score": 309,
        "date_posted": "2024-11-06 08:50:37",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] \"Magic cares about what something means, not what it literally is. So when we adopted you into this family, when you truly accepted us as your parents, you became part of it in the eyes of magic. Which is why you've begun to manifest some aspects of our bloodline.\"",
        "comment": "We have adopted many children after the devastating war. Children without parents. Without family. Poor lonely little creatures who roamed the scorched lands and city ruins on their bare feet. Regardless of race, we took in as many as our domain could accommodate.\n\nAs the nation began to repair and heal, so did some members of the population return. Slowly, life sprung once more. The hustle and bustle gradually grew to from a dull hum to lively gossips along cobbled streets and spirited bargaining at the markets.\n\nTo us, it meant there were people in good fortunes, able to adopt these children. Try as we might, we aren't the same species. We're not even of this earth. Merely a wandering couple that traversed the different realms and dimensions, then choosing to settle in this one. For all its flaws and conflicts, earth felt mostly cozy to us.\n\nNot all the children found new families. Some decided to walk their path by themselves when they were old enough. Others chose to venture further into life together with friends. We provided them ample supply and coin. Bid them farewell, with goodbye kisses and hugs, and invited them to come visit us again if possible.\n\nBut Aaron never wanted to leave. Unlike the others who wanted to live and work among their own kind, he stuck with us. We knew, when the other children left, we were a temporary refuge. To find themselves. To pick themselves back up. To learn of this world and, when they were ready, leave our domain. No matter what we did, we were loving guardians but not parents, for we were too alien for them.\n\nAaron begged to differ. He wouldn't want to be anywhere but here. So, we taught him our magic. To weave protection wards to keep the new children we took in safe. How to maintain this save haven with its runic seals. He took to it well, much to our surprise, for the odd, curious mortal that approached us to gain a fraction of our powers usually...failed, to put it lightly.\n\nOnce in a while, Aaron made mistakes. Like trying to put the kitchenware back into their rightful places by magic, only to have them clang and clash as though they were on a battlefield. Another time, he accidentally gave a stray cat eight extra tails and pleaded with us to help him undo it.\n\n\"What were you actually trying to do with the cat?\" I towered over him while questioning him.\n\n\"Trying a color change spell,\" he scratched the back of his head sheepishly. \"Was gonna turn the cat from orange to blue.\"\n\nToday, he ran to us, panicking over two tentacles that grew from his back. His words were garbled from his anxiety, something something about how he wanted to be like us. His experimental spell to conjure extra floating hands to help with household chores ended up giving him extra eldritch octopoid arms alright. Just not the sort of arms he was expecting.\n\n\"Why?\" He yelped. \"Did I mess up a spell reagent or a hand wave? Maybe it was my words, I used the wrong magic chants—\"\n\n\"Don't be afraid,\" we reassured him in a group hug. \"When you said you wanted to be like us...the magic of this world heard you. It listened not just the words that came out of your mouth, but what you felt on the inside too.\"\n\n\"I don't understand.\"\n\n\"Magic cares about what something means, not what it literally is. So, when we adopted you into this family, when you truly accepted us as your parents, you became part of it in the eyes of magic. Which is why you've begun to manifest some aspects of our bloodline. Such as these tentacles,\" I waggled my octopoid arms as a demonstration. \"It's a good thing.\"\n\nHe sniffed and slipped out of the group hug. \"Will this thing stop at these two tentacles, or will there be more?\"\n\n\"We can't say for sure,\" I scratched my whiskers with a tentacle. \"But we will do everything within our power to ensure you adapt well. We hope you will embrace the changes, as much as we love you no matter how you turn out to be.\"\n\n\"...I'll try. So there's no going back?\"\n\n\"Shapeshifting back to your old look is an option. We have taken many photos of you. These copies are all yours. Keep them all as a reference, so you may never lose yourself and can always revert if you wish.\"\n\n----\n\n[Thanks for reading! If you enjoyed this, click here for more prompt responses and short stories written by me.](https://www.reddit.com/r/TregonialWrites/)",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gj0f26/wp_magic_cares_about_what_something_means_not/lvaj0rx/",
        "score": 146,
        "date_posted": "2024-11-03 22:12:56",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] \"I kicked out my tenants, demolished my 5 million housing units, salted the ground with radioactive matter, and wreaked the sewer system. All in 2 weeks. New York will soon become a wasteland.\" \"Why are you telling me this?\" \"Because no one will believe you.\"",
        "comment": "\"My allies can stop you! You'll see! You made the mistake of telling me your plans! I'd fuck you up so bad yo momma won't recognize you! She'd mistake you for a pile of dog chum and nobody would fuckin' blame her for it!\"\n\n\"Did you think I was one of those cartoon villains you fight for fun on live TV for an adoring audience? My plan is already in motion. I completed my task list two weeks ago. You see, I'm telling you my plan just to watch you squirm. I can confidently share these details for two reasons : It is already too late to stop me. Oh, and nobody will believe you. Not after that Scamgate scandal. Confidence in superheroes are at their lowest.\"\n\n\"Clockmaster can go back in time! He is never too late to stop you.\"\n\n\"If only he wasn't on my payroll.\"\n\n\"What? When did the fuck did that happen?\"\n\n\"While you weren't looking. Let's be honest. You're an ass. I don't believe in petty little things that don't affect my grand plans. But you? You do stupid shit such as breaking Clockmaster's favourite limited edition pocket watch while drunk.\"\n\n\"That's it? He quit the Hero League to join you over that?\"\n\n\"That was merely the straw that broke the camel's back. If you thought you could do only good, you don't know yourself, or your team mates all that well. They hate you. Every single one of them. Valiant's skull is so thick you couldn't penetrate it with radiation. You ever heard that one? You're only the face of the League because you're handsome. Because you can sell Hero League merch. But deep inside, if they could help it, those heroes don't want to work with you. Don't want to come save you.\"\n\n\"This cannot be! I'm supposed to scout ahead until they disabled all your traps and joined me in your throne room!\"\n\n\"That's what they told you.\"\n\n\"No...\"\n\n\"This is a setup. Now if you'll excuse me, it is time I chuck you into that aircraft. It will be dropping its radioactive payload over Washington. Perhaps it will become a wasteland like New York. Perhaps not. Maybe, the superheroes of Hero League will band together to stop it. And you, Valiant, you'll be quite the martyr, fighting to control the aircraft and trying, but failing to stop it from exploding.\"\n\n\"I won't play into your game! We'll see what happens if I don't try to stop—\"\n\n\"You won't stop this aircraft? Doesn't matter, for as long as you perish within. And I'm not a bond villain. I have surveillance built inside, and I will watch you die. Are you not a fan of escape games? Valiant, let's see you make a valiant escape.\"\n\n**\n---\n\nValiant didn't think the self-proclaimed Dark Lord Vandemar would make it so easy by slipping the key into his palm. Almost like a mockery, as though he was so sure the superhero wouldn't be able to break the chains. He felt almost, just almost ashamed to use the key than his superstrength to break through. This wasn't the time to talk about saving face when he was aboard an aircraft on autopilot, set to crash into Washington.\n\nRushing to the control room completely unopposed, he saw that the control panels were badly damaged. There was no way to land the plane safely or communicate. As if Vandemar needed to mock Valiant further, steering the plane worked. Just egging him to turn the aircraft away from Washington. Send it diving into an isolated place where he'd die alone. Where nobody would know it was him.\n\nThe Dark Lord knew him well. Valiant hated the idea of performing heroics nobody would see. Almost as much as how tempting it was to slam the plane into the Hero League HQ after being told of all the bullshit they whispered behind his back. But if there was one thing Vandemar got wrong, despite all of Valiant's faults, the dark lord seemed to have forgotten why Valiant became a superhero in the first place.\n\nWith a sigh, Valiant sat down on the empty pilot's chair and began steering the plane upwards. He would push the aircraft past the atmosphere and into space. It wasn't made for space travel, this much he knew, but he was banking on burning up and never landing. Better to burn brightly than fizzle out quietly.\n\n----\n\n[Thanks for reading! If you enjoyed this, click here for more prompt responses and short stories written by me.](https://www.reddit.com/r/TregonialWrites/)",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1gtsccn/wp_i_kicked_out_my_tenants_demolished_my_5/lxpac9q/",
        "score": 70,
        "date_posted": "2024-11-17 22:32:29",
        "subreddit": "WritingPrompts"
    }
]