[
    {
        "post_title": "[WP] You have broken the strangest rule that your parents made, but instead of getting mad they give you a wand, a spell book for children, and a sword.  The last thing you heard from them for a while was “well, I warned you”.",
        "comment": "My father had always been the kind of man who patted you on the back instead of saying I love you. The kind of man who'd said 'interesting' when he'd accidentally put a screwdriver through his hand. The kind of man that, on their wedding day, told my mother she 'looked very nice.'\n\nHe saw me walk into the room and screamed. \"GOD FUCKING DAMMIT!\"\n\nI stopped in the doorway as he threw his copy of automotive magazine across the room and slapped his hands down on the couch cushions. After a second, he pinched his nose and I heard him swear over and over and over.\n\nI'd come to the living room to apologize for breaking his 'house rule', but this was not the reaction I'd expected.\n\nMy mom was the polar opposite of my father, they'd been attracted like magnets. She was the kind of woman who texted hearts 37 times an afternoon. The kind of woman who said nothing on her wedding day because she was busy blubbering. The kind of woman who...\n\nActually her pain tolerance was shockingly like my father's. Fancy that. Though she'd still cried when she found out swans could be gay, so the point still stood.\n\nMy mother rushed into the room skidding along the hardwood in a panic, asking what was wrong. Then she saw me in the opposite doorway. She stopped. Went silent. Then pale.\n\nDad was inconsolable. Mom needed no consoling.\n\n\"What's going on?\" I asked. Neither parent answered but I knew what they were going to say anyway so I spoke up for myself. \"I know you guys didn't want me to do this, but it's just for the concert and I really made sure I cleaned the shower and--\"\n\n\"She's your daughter,\" my Dad finally said.\n\n\"I think this comes from you,\" Mom spat.\n\n\"The fuck?\" I asked.\n\n\"You knew the rules young lady,\" Mom said. Since when did she take charge in discipline? \"And look what you did anyway.\"\n\n\"I dyed my hair red Mom, I can have it out in like a week if it's that big a problem.\"\n\n\"Fire truck red and she thinks she can just undo this,\" Dad sighed.\n\n\"I physically can, like right now but it'd fuck up my hair.\" Then, after a second, I turned to him, \"What the hell is going on? I came out to you like a month ago and and you just asked me if I still wanted to watch the baseball.\" I walked into the room. Dad still hadn't looked up. \"Now it's this?\"\n\n\"We didn't have a house rule against you liking girls,\" my Mom said. \"Why would we?\"\n\n\"Woulda made more sense then this stupid rule about dying hair/ Would you prefer I'd gotten a tattoo?\"\n\n\"Clearly!\" My Dad raised his voice. I jumped. Still wasn't used to that.\n\n\"Pause. Family meeting.\" I said. \"Can I grab the Talking Penguin?\" The Talking Penguin was a little statute we'd kept in the front hallway. If you were holding it, it was your turn to speak. It'd gotten us through ages 12-14.\n\nMy mom took a second, not because it looked like she needed one, but almost just because she was used to it. \"I can explain, you don't need the penguin. Herold can you grab her kit?\"\n\n\"My poor little girl,\" my Dad sighed. I raised an eyebrow as he pushed past me toward their bedroom.\n\n\"What's going on Mom?\"\n\nMy mother sighed, still eerily calm on the Janet scale. She took my Dad's place on the couch and patted for me to sit down. \"How do I explain this?\"\n\nI almost had snark for that, but I bit it down.\n\n\"Honey, we have a genetic condition in the family. It's called Main Character Syndrome. It used to be useful, but now it's just... well it's just asking for bad things to happen.\"\n\n\"Like we're shitty and self centered?\" I asked.\n\n\"No, like this.\" My dad was back in the room, dour again, and carrying a sword that I could have used as a snowboard. \"You're going to need this honey.\"\n\n\"What the hell?\" I asked. I turned to Mom, she was nodding sagely.\n\n\"You have an odd hair colour now honey, you're the main character. We're just waiting for the quest now.\"\n\n\"What quest?\" I asked.\n\n\"We don't know, but you're a teenager so it will probably start with me and your mother getting killed by someone,\" my Dad sighed. \"I knew what I was getting into when I married into this family. Love you both.\"\n\n\"What?\" I asked.\n\n\"How many stories do you read where the parents are in the picture?\" Mom asked. \"We raised you as a reader.\"\n\n\"I'm not just letting you die!\" I yelled back.\n\n\"Shouldn't have dyed your hair red,\" my Dad answered, like that made any sense, before throwing me the sword.\n\n\n\n\\n\\n\"You're. Not. Killing. My. DAD!\" I screamed in time with each strike, it helped me get more umph if I channeled emotion into my slashes. That was one of the many things I'd found out over the past days, and all of them had been useful. The mysterious stranger that'd approached the house fell backward, mostly because he was in pieces. I spat on the body and took a moment to catch my breath. Once I had air back in my lungs, I wiped some of the viscera off my face with the back of my hand. I was getting way too used to being covered in blood. Never thought that would be a habit.\n\nI prodded the man's divided arm with my toes. Still. Limp. Warm. Finally seemed like he was staying down.\n\nI spun the sword my Dad'd thrown me in the living room earlier this week. Mom'd told me to give her a name so I'd called her Olivia Rodrigo. Mom told me I needed a less copyrighted name so we dropped the Olivia. There were so many rules to being the main character. A million little things that were supposed to help me on my quest. Things to make me stronger. Things that made no sense in a world with Facebook and Snapchat, but Mom'd explained that the Main Character Syndrome came from a time when swords were normal so....\n\nThat had been most of my past week. I killed things. Mom explained things. I rolled my eyes. Rinse. Repeat. Stain the shower with red hair dye.\n\nI pulled out my phone, and texted my Mom, telling her that we were all clear outside but just when her three dots popped up I heard a squelch behind me.\n\n\"Oh my god, Bruh. Give up already!\" I sighed as I pulled Olivia Rodrigo out of the lawn. \"Just take the L.\"\n\nThe man that had stood up several times despite dismemberment was staggering back to his feet as he reassembled himself. The first time he'd walked up, he'd explained that he was going to kill my parents so that I could start my quest. The next four times, I hadn't given him time for an explanation before beginning operation limb removal. I took half a step back and shook some of the blood off my shoes.\n\n\"Why do you resist your quest?\" the man asked, his voice was rasping and broken, probably because he was still stitching his lungs back together.\n\n\"I don't know. Maybe because you're trying to kill my parents?\"\n\n\"Fate will not be denied.\"\n\n\"Fate can suck my dick,\" I snapped. I lunged with Rodrigo, cutting through the air. I'd gotten fast in the past days, but the man managed to side step my blade as he twisted his spine back into place.\n\n\"You cannot continue to deny it.\"\n\n\"Dude, you're the one who keeps having to rebuild yourself,\" I pointed out, \"I'm crushing this 'denying fate' thing.\"\n\n\"You know not the forces with which you meddle.\"\n\n\"YoU kNow NOt tHe ForCES wiTh WhIch YOu MeDDle,\" I mocked.\n\nThen a sound behind me. The door opening. Mom.\n\n\"I thought you said you were done.\"\n\n\"I thought I was.\" I protested. The man went to make a move and I kept my sword pointed at him.\n\n\"Did you crush his head last time?\"\n\n\"Ew. No?\"\n\n\"You have to do that or he keeps coming back,\" my Mom explained. I checked over my shoulder. The man kept trying to find a way around the sword to get to my Mom.\n\n\"Gross.\"\n\n\"Hailey. You'll be late for dinner. Dad will clean up.\"\n\n\"Fine.\" I slashed without giving the man a verbal warning this time and I caught his throat, then turned my Rodrigo to the broad side and held it up over my head. \"In my slay era I guess.\"\n\nThe splatter looked more like watermelon than I was comfortable with. Watermelon with skull in it at least.\n\n",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1coawrz/wp_you_have_broken_the_strangest_rule_that_your/l3dh653/",
        "score": 501,
        "date_posted": "2024-05-09 22:04:40",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] Possibulletin: The world's first newsletter with regular updates about alternative realities. Learn now what could have happened instead!",
        "comment": "This is the first issue of the Possibulletin! Thanks for reading!\n\nIn a reality close to yours, yesterday's Thanksgiving Parade was interrupted when the Garfield balloon deflated in the middle of the event. Though none were injured in this event, it marked a diversion in several evenings, adjusting reality A37b to a new A39b position as it erred further from the archival reality and took a new place. The new A37b is a reality where jello is considered to be a luxury desert. \n\nYou an discuss more online! Check out the Possibulletin's web page for more details in a reality near you!\n\n---\n\nThis marks the Possibulletin's 1 Week Anniversary! Thanks for reading!\n- A nearby reality suffered a catastrophic earthquake yesterday in the late evening. The shift in tectonic plates marked a notable drop in Italy's height compared to sea level, causing the city of Venice to dip below the waves to an unlivable degree. The death toll is expected to be in the thousands, and 4928 vacations were disrupted as a result of this event. \nNotable, Linda Hamilton, in other realities, you're happier than you are right now. Consider why that may be and possibly attempt adjusting your existence in the Archival Reality to match that as others. \n\n----\n\nWe here at the Possibulletin love your feedback and understand that many were made uncomfortable by our last Sunday issue. We have adjusted our measurement formulas to both avoid commenting on single citizens of the Archival Reality and focus on realities further from AR, \nFor those who have reached out asking how we attain this information or whether it is simply a work of fiction, we ask that you avoid calling the hard work and research done on behalf of the Possibulletin make believe. Our Archivists are hard at work to find interesting stories for you!\n\n---\n\nThis is the first end of month Wrap-Up for the Possibulletin! Thanks for reading. \nOverall, the Archival Reality moved further away from the other measured realities in dimensional space this past May, leaving gaps that have recently been filled by other realities to fill in the gaps. We're pleased to welcome our new neighbor! A1b, though, due to our new 'No Single Citizens' policy, we cannot outline the differences from our reality to theirs. \nIn Multiverse News, the growing fractures and new worlds to replace them have disrupted several containment measures set in the past by our team here at the Possibulletin. We look forward to having them back in place soon!\n\n---\n\nThanks again for all your feedback to the Possibulletin. We understand that some were worried by our recent comments on containment measures enforced by the Possibulletin. We will refrain from mentioning these procedures in the future as to not disrupt your normal reading pleasure!\n\n----\n\nThanks for reading the Possibulletin, today is June 19th! \nThe last sunset has ended in Reality B347c, but that doesn't meant there won't be sun. The reality has experienced a celestial phenomenon where the Earth has adjusted its rotation to match its orbit around the sun, plunging half the world into eternal sunshine and half into eternal darkness. To us here at the Possibulletin it sounds like that would make for a lovely beach vacation. \nWe're proud to announce that this marks the Possibulletin's second multiversal point of interest added since the start of our publication. Drowned Venice and the Twilight Ring will both be getting regular updates on our website. Thanks again for reading and make sure you follow us on social media for images from other realities.\n\n-----\n\nThis is the third end of month Wrap Up for the Possibulletin! We appreciate our readership's continued support. \nDuring the past month, the Possibulletin added two more multiversal points of interest. You can follow the progress of the Artemis Impact Site and Swallowed Tokyo on our website. \nThis past month has marked another distinct shift between the realities, resulting in further separation between established realities and new, unobserved worlds have taken there place in the multiversal coding system. We here at the Possibullitin are hard at work discovering what lies out there, so we can bring you the news about it. \n\n---\n\nLinda Hamilton, we know you're still reading. You're headed in the right direction. You just need to commit and you can be as happy as your other selves.\n\n---\n\nPardon! We here at the Possibulletin weren't prepared for our surprise issue last night. We didn't intent to disturb anyone with the contents, that article was not to be published. We will continue our commitment to not interfering in the individual lives of our dear readers. We've included a free wistful thought in this issue as an apology to our readers.\n\n---\n\nThis is a special news update replacing our six month celebration here at the Possibulletin. The Porcelain Queen is on the march and has found her way into the growing cracks between realities. We ask that any and all readers take head. Tell your friends and loved ones to avoid speaking to women dressed in white or light blue, and if someone offers you your greatest wish in exchange for a dear memory, do not accept their bargain, maintain eye contact with the person offering you the exchange and procced to the nearest 90 degree angle.\n\n---\n\nThanks for Reading the Possibulletin! Today is April 16th \n\nReality A37b has experienced a grand multiverse phenomenon and will no longer be tracked by our Archivists. We ask for understanding in this time though we are aware that this will disappoint some of our long time readers. As a brief reminder, it's critical that our readers understand that experiences are a currency and you should not gives yours away. A single experience removed from your memory can cause erosion and doubt to all memories you've accumulated over time as human biology cannot understand the blank space in established neural pathways. \n\nThank you for the understanding. \n\n----\n\nDid you know that life is delicious? You can find out how today. Grab your nearest genuine teacup and think about your dearest childhood friend. Once you've done that, simply add hot water and enjoy the vibrant flavors of nostalgia and sweet summertime grass. It's that easy.\n\n----\n\nThis is an emergency issue of the Possibulletin. Disregard our last issue! DO NOT FOLLOW ITS INSTRUCTIONS. If you have, call your childhood friend and try to reclaim those memories before they are digested!\n\n---\n\nThis is the end of month update from the Possibulletin. There have been large shifts in the order of the Multiverse in the past month. The arrival of the Porcelain Queen on the Archival Reality has caused a great shift in the multiversal coding system. We here at the Possibulletin are working hard to ensure that our order is as up to date as possible on our website, but you will notice some of our Points of Interest having shifting titles over the next several days as we finalize our new order relative to the rest of the realities we measure. We thank you for your understanding. \n\nAs a reminder. All glass and dinnerware should be avoided to ensure you retain control of all your thoughts. \n\n----\n\nLinda Hamilton. Please don't do this. We know you're unhappy here at the Possibulletin, we want to help you but we can't. Don't do this. It will only make things worse for everyone, not better for you. Linda Hamilton please don't do this. We know you're unhappy here at the Possibulletin, we want to help you but we cannot. Don't do this. It will only make things worse for everyone else, not better for you. Happiness is relative. Linda Hamilton. Please don't do this. We know you're unhappy here at the Possibulletin, we want to help you but we can't....\n\nThe message continues for all 452 pages of this special issue, with slight adjustments and occasional errors over the thousands of repetitions in 4 point font. \n\n---\n\nWe here at the Possibulletin would like to say welcome to the Porcelain Queen, who now has established herself as a pillar and reality anchor in the Archival Reality. Long may she reign. This will be the last issue of the Possibulletin in this reality as we adjust our archives to live on a further one. For those able to follow us, we look forward to your continued readership. For those unable to, we have appreciated your support over our tenure here. Memories are something to be cherished. \n\nYour Editor in Chief, and Nobody Elses.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1caqlsw/wp_possibulletin_the_worlds_first_newsletter_with/l0tr8j3/",
        "score": 4,
        "date_posted": "2024-04-22 21:33:23",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You've been fully blind since birth. You also just can't make sense of why the charming Greek lady who runs the local statue garden doesn't seem to have many friends besides you...",
        "comment": "There was a solemn quiet in the garden most days. The kind of serene calm that only followed in the wake of funerals. The way that, when people stepped into a graveyard, the weather seemed to give way to grey clouds and quiet breeze.\n\nIt was a nice calm. A kind calm. Something that Imogen was grateful to feel away from hospital and chapels. She'd spent enough time over the years, and she wasn't even that old.\n\nIt had been the middle of early Spring when she'd found the garden, mostly by accident. The paratranspo she'd scheduled had never shown up and she'd gotten turned around on her walk home. She'd found the first gate that seemed open and welcoming, and, despite the owner's surprise, Imogen had been able to get shelter from the rain and some nice conversation.\n\nSince then the garden had been a weekly stop. It wasn't that far from her way home and, outside of a few winter storms, it was always a lovely place to be, which worked out well, because Imogen didn't have much to do in the afternoons, and the owner never seemed to have anything going on at all.\n\nDespite having talked for hours, the owner of the garden, Euryale was still mostly mysterious to Imogen. They could kibitz for hours about nothing, but whenever the conversation train followed the tracks to something person, Euryale got off at the first station and left Imogen complaining about her life.\n\nNot that Imogen minded complaining, especially when someone was willing to listen. Vocalizing life's annoyances sometimes made everything feel better.\n\nToday was different though. Imogen had been listening to a new book about how to maintain her friendships and realized that she'd been a bad friend to Euryale. She'd just been taking from the lovely woman, emotionally and time-wise. It was time for her to give back. She was going to be the shoulder today.\n\nHopefully nobody would be crying, but she would be the shoulder.\n\nThe quiet morning air felt cold against Imogen's skin as she slipped through the shaded entrance to the garden, tapping her talking stick on the metal grate to her side to keep track of her path. Then, as she felt her way down the familiar path, she tapped against something dead in the centre of the path.\n\nThat was new.\n\nImogen felt around to find a way past the new obstacle and then brushed her hand along it as she squeezed past. Cold stone, another statue. Imogen frowned. Euryale had so many of those statues but she didn't seem to like them. Maybe that was what she would get Euryale to talk about today. Not her past in Greece, not her rarely mentioned sisters, but the statues. That seemed like a safe avenue.\n\nOnce she was past the statue she was able to squeeze out of the entryway and into the proper garden Imogen stood and waited. Then, as per usual.\n\n\"Hello, Imogen.\" Euryale greeted from the left side instead of her usual right. She had an edge to her voice cut into its usual sing-song tone.\n\n\"I'm sorry, is it a bad time?\"\n\n\"No, no. It's. It's fine.\" Imogen tracked the soft steps of Euryale across the grass until her sandals scratched on the concrete path. A moment later, Euryale's soft hand took Imogen's as a way to guide.\n\n\"Am I interrupting a delivery?\"\n\n\"Pardon?\"\n\n\"The statue in the front walkway. I just--\"\n\n\"That's right in your way isn't it, Darling? I'm sorry I'll get that moved soon. Not the most convenient place for it.\"\n\n\"Oh, it's not a problem for me if you like it there. I can just slip around it on my way in. I have my guide cane.\"\n\n\"It certainly doesn't' need to stay there,\" Euryale squeezed Imogen's hand as she spoke, \"I'll get it out of your way.\"\n\n\"Do you have a space in mind?\"\n\n\"Space in mind?\"\n\n\"For the statue.\"\n\n\"Ah,\" Euryale stopped and whispered a soft 'and we're here' to Imogen to tell her when she could sit. That said, Imogen already knew they were by the fountain from the sound of running water, but she understood that Euryale worried.\n\nThat and having a kind guide was nice.\n\n\"Do you have a place in mind then?\" Imogen used her hand as a guide to find the edge of the fountain and dropped the end of her guide cane into her lap.\n\n\"Not really.\"\n\n\"You bought it without having a place in mind?\"\n\n\"They just arrive on their own sometimes.\"\n\nImogen nodded along. She understood the idea of getting a package that you'd forgotten about, but it seemed like a statue would be very expensive to forget about. Maybe it simply took years for them to ship. \"What do you like about this one?\"\n\n\"The one that arrived today? Hm.\" Euryale sat down beside Imogen and she could feel the former drumming her fingers on the stone of the fountain. \"I'm not sure.\"\n\n\"There has to be something you like about it.\"\n\n\"Does there have to be?\"\n\nImogen's initial thought was to protest about the price of the statues, but she didn't know what Euryale did for work, let alone how much she made. Considering the circumstance asking about money felt rude. She decided on something else. \"I feel like they take up a lot of space.\"\n\n\"They do.\"\n\n\"So you don't like anything about this one?\"\n\n\"It's fine I suppose.\"\n\nImogen wanted to frown, but didn't want to show it. She wasn't getting anywhere, she was supposed to be letting Euryale talk about her life but she couldn't get anything out of her. \"Do you have a favourite?\"\n\n\"A favourite statue?\"\n\n\"Yes, you have so many and, well I don't know what they look like obviously, but you have to have a favourite if you have so many.\"\n\n\"Hm.\"\n\n\"I understand if its hard to pick.\"\n\nThere was quiet for a moment. The solemn quiet Imogen loved about this garden swept over them both and left them in the reverent ambience of the fountain. Just when Imogen was about to cut back in, Euryale spoke up.\n\n\"Several, but it's complicated.\"\n\n\"I can listen to complicated things.\"\n\n\"I...\" there was quiet again. In most conversations Imogen could try and understand body language based on listening to someone move but the fountain made that impossible. \"There are some that I'm very close to, they remind me of people I used to have in my life.\"\n\n\"Are the statues of them?\"\n\n\"...Yes.\"\n\n\"That's very sweet. Will there ever be a statue of me?\" Imogen did her best to not sound expectant as she asked.\n\n\"Hopefully not,\" Euryale answered, \"all of the statues are of people who've passed away. It makes it difficult to talk about sometimes.\"\n\n\"I'm sorry.\"\n\n\"You don't have to be. I have wonderful memories when I remember to think about them.\"\n\n\"Has it been a long time?\"\n\n\"Quite.\"\n\nImogen didn't hide the confused frown this time, not to what Euryale had said but more that she understood that the woman was older than her, but not by exactly how much. \"And the rest of the statues?\"\n\n\"Some last minute whims, some accidents.\"\n\n\"How many do you have?\" Imogen decided not to ask how in God's name someone could accidentally procure a statue.\n\n\"More than I should, less than I used to.\"\n\n\"That's not a number.\"\n\n\"If I knew how many I had, I'd tell you. Actually...\" Euryale moved a little closer to Imogen to the point where their shoulders were almost touching. \"There is been something I've been meaning to mention.\"\n\n\"Yes?\"\n\n\n\n\\n\\nQuiet. The breeze cut in after several seconds.\n\n\"Actually, can I say it another day?\"\n\n\"But now I'm curious!\"\n\n\"I...\"\n\n\"It's fine. Don't worry about it.\"\n\n\"Thank you,\" Euryale answered. Then after enough silence for a topic to slip away. \"So, how has your week been?\"\n\n\"Oh,\" Imogen considered her options for a moment, and then felt a soft smile creep over her cheeks. It hadn't been much, but she'd gotten something out of Euryale, and it was clear that pressing like that would make her more comfortable over time.\n\nFor now, the pair could slip back into comfortable routine.\n\n\"Well, I was in charge of a small committee meeting today, which was difficult because it was on video...\"\n\n\n\n",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/17oec63/wp_youve_been_fully_blind_since_birth_you_also/k7z00zt/",
        "score": 50,
        "date_posted": "2023-11-05 14:59:49",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You're a deaf superhero. You're hated by most of the villain because you kept beating them during their monologue. One villain however, knows your deaf disability and learnt sign language just to monologue themself to you.",
        "comment": "People called Intricate and no-nonsense hero. She was not a fan of that label. \n\nFor the first part, she considered most of her life to be nonsense. In a rational world, she wouldn't be speeding around on a motorbike in spandex punching other spandex clad villains as they tried to take over the city. A no-nonsense person, she figured, would be filing their taxes in early March as opposed to fighting crime. \n\nSecond of all, she tried to have fun on the job. She was riding a motorcycle for goodness sake. Who could say that a motorcycle was the most practical form of transportation! If she weren't fun loving and self indulgent, she would be taking public transport around the city. That would be helping solve the falling ridership issue, and securing funding for public transit might be more critical to the city than punching any villain. \n\nIn, as far as Intricate understood, she was a fun-loving, nonsense filled hero, just as much as anyone else. Okay, maybe not as much as 'everyone else' but many of them were just plain unprofessional!\n\nAside from bristling against the no-nonsense label, Intricate had also found that it made her life, marginally harder. Villains seemed convinced that they were running out of time when she showed up. They objectively were,  but they were more frantic than they were when they fought other heroes. \n\nShe'd seen videos of the famous showdowns, everyone had. The villains talked, they japed, they showed off. Intricate? Intricate got none of that. It was straight to business when she showed up.\n\nBack at the start, villains had tried talking through their fights, but, it'd literally fallen on deaf ears. \n\nMaybe that was what made people think she was no-nonsense. She couldn't take fun, after battle, interviews because there were rarely interpreters around after a fight. Logically they ran away once the building-chunks started flying. \n\nThat no-nonsense label was also why Intricate was sitting on her bed, in her 'Miranda' clothes considering whether she was going to get dressed for the day of crime fighting. She read the news. She understood how brand deals worked. \n\nShe liked protecting people, loved it even, it filled her with purpose, but at the same time... reading that the city you protect doesn't like you is never a good way to start the morning. \n\nBut she'd gotten the call, people needed help. So she'd get ready as she always did. One glove at a time, and in the peace and quiet. \n\n....\n\nBy the time Intricate reached the scene of the crime, chaos had already ensued, past tense. She was late. Now there were police scattered around the bank using their cruises as shields and keeping an eye on the main door. There was only one way in or out of the central bank. Whoever was in there would have to fight they way out. \n\nIntricate pulled up to the scene and hopped off her motorcycle. The first thing she caught in the corner of her eyes was someone rolling theirs. She frowned. Allowed herself an extended blink, then moved on. Marching toward the door without knowing what was going on inside. \n\nPerhaps that was part of her label as well, Intricate's armor was nigh-invincible, and means that she was able to simply walk at most threats. She started up the steps then turned and waved the police officers further back. \n\nThey didn't move. \n\nIntricate tried again with, what she feared, was too much enthusiasm. She wanted them to get to safe distance, not to think she was telling them to shoo. \n\nShe was too far in her head, it was probably fine.\n\nIntricate entered the bank, tossing the door open and marching into the foyer. In the dead centre of the room was a villain that she didn'tm recognize. \n\nMost cities had a rogue's gallery of a sort. Sure, they got locked away, but there were only so many powers in a population and keeping them in jail was a pain in the ass. That all to say, it was a rare novelty to see an unknown on a crime scene. \n\nThe woman, villain, opened her mouth and clearly said something. She was only wearing half a mask so Intricate, in theory, had a chance to read her lips, but she'd never been good at that. A second later, the woman stopped and scanned Intricate. \n\nShe was never, so Intricate gave her the moment to do so. \n\nThen another novelty. \n\n\"Intricate, it's a pleasure.\" the woman signed. Intricate stared for a moment. She knew the words enough to understand them, but was too distracted by what the hell was going on to process them. She only had the common response to this revelation. \n\n\"You sign?\" Intricate ask. \n\n\"Obviously.\" the woman retorted. The signs were somewhat hard to read, a mix of rough gestures and the multicolored costume contrasted with her dark skin. Too much extra visual noise.\n\n\"I'm going to stop you.\" Intricate signed back. She took a deep breath, but instead of moving right into a fight, the woman kept signing. \n\n\"You're going to stop me? How adorable. Don't you know how long I've planned this heist for?\"\n\n\"No?\"\n\n\"Months. Months I've been waiting to come onto the scene and fight you. The woman who's been putting all the other villains to shame.\" \n\n\"What?\"\n\n\"This heist? A minor distraction.\" The woman started pacing as she signed. \"I'm not here for the money. I'm not here for the lock boxes, Intricate. I'm here to prove a point.\"\n\nFor the first time in front of a villain, Intricate asked a question out of curiosity. \"What point?\"\n\n\"That the old generation of heroes is sloppy. They're too reliant on the rules of the game. On getting their time to monologue. On showmanship. Pomp. Circumstance. Mercy.\" She let the last sign drag, waggling her dominant hand. \"But you? You're different. You've punished them for their monologues and games. By beating you I'll show them the new way of doing things. A no-nonsense way of doing things.\"\n\nIntricate considered the woman's words for a moment. Were villains usually this talkative? When she watched the old videos she saw that they were talking but she'd mostly skipped to the interesting parts, like combat and tactics. Then once she'd considered the woman's words, she bristled at them and signed back. \"I'm fun.\"\n\nThe villain laughed. No signing back this time. \n\n\"I'm not boring.\" Intricate signed at her. This didn't get a laugh. Instead the woman watched her hands and then Intricate's eyes. \n\n\"No, they're way of doing this is boring Intricate,\" the villain struggled adding any emotion to the words. \"You're no into their vapid costumes and grandstanding. You're better than them! You don't need to sit there and listen to a monologue and--\" The villain, Intricate had never asked her name, stopped, she needed her hands for this. \n\nBut it was too late, Intricate was on top of her. \n\nThat villain was right, she didn't need to sit there and listen to a monologue, but she was wrong about Intricate. \n\nShe'd show her she was fun, hit by hit.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1c3rlza/wp_youre_a_deaf_superhero_youre_hated_by_most_of/kzk9e99/",
        "score": 131,
        "date_posted": "2024-04-14 13:51:27",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] A teenager gets sent to join a summer camp, unaware that it's actually a cult.",
        "comment": "\nIt didn't start as bad as it ended. What story did?\n\nSomewhere deep in the forest there was a Summer Camp, at least by all appearances. A bright and sunny oasis locked dead in the middle of missing cell service. It was a lovely place by all accounts. Happy kids. Happy counsellors. Happy people. \n\nHappy memories. \n\nIt was a dark night, the kind of dark that you could only find out in the wild. Rain played percussion on the rooftops, keeping time in whatever song nature was singing that night. \n\nSandy, as she was known at camp, was one of the older kids to get sent there at the start of the Summer. She'd needed a summer away from life back home. From school. From her 'environment' and though they'd never admit it, her parents. She loved them, it was just...\nShe and them were very different people. Or maybe she was the only one that was different. Either way, she'd chosen to go to camp to get away. For the most part, it'd been great, a happy camp filled with happy counsellors and happy people. \n\nMostly. \n\nOn nights like that one, Sandy pulled her blanked close to her chest and tried to force sleep, which was never the way to do it. The pitter patter of rain reminded her of her bedroom window, of the quiet solace and comfort she found there. It was the one thing in that place that made her feel homesick. \n\nThe kind of serious, scarring homesick that threatened to make you really sick. \n\nShe kept quiet in her bunk, staring across the cabin and over Amanda to the rain slicked window. She could barely tell there was water on it. Back in the city the light danced across everything. Out here? Moonlight faded faster than it could draw shapes. \n\nSandy sat up, quiet as she could, letting her blanket fall and welcoming the cool midnight summer. Nobody in the cabin stirred, so she swung her legs off the bed and looked at the door. \n\nShe'd been out in the middle of the night before. When she'd first gotten here she'd needed midnight walks out of habit, but now? When it was raining? Back home she might have done it for the pure aesthetic, but here? She didn't want to be sick for days. \n\nThen again, what else was she supposed to do in the dead of night? She was cruelly tired of trying to fall asleep. \n\nGetting up was a slow process, taking deep breaths with each stage as she waited for someone in the cabin to wake up and glare at her, but the moment never came. Sandy was alone at the front door, listening to the rain on the other side as she slipped on her summer-battered shoes. \n\nAugust rain wasn't cold, but it wasn't warm either. \n\nSandy ran the first few steps away from the cabin, partially out of habit, and partially so she didn't rethink things and walk right back inside. Once she was good and wet the bed would feel lovely. Once she was cold it would be warm. Once she'd cleared her head, she'd be able to sleep. \n\nEven in the new-moonlight the camp looked cheerful somehow. It was cozy and inviting as opposed to foreboding, but the same couldn't be said for the trees, which stuck up around the edge of camp like a million wrought iron fence posts. Black against a navy and starlight sky. \n\nSandy had come out here to walk, so she walked. \n\nIt'd been raining long enough that puddles had started dotting the stone and mud pathway between buildings, water filling in worn out spots and new shoeprints. Each step Sandy took left a new mark on the mud, something she could follow in the morning to figure out where she'd gone wandering in the middle of the night. \n\nBy the time Sandy could call it a walk, she was soaked. The tip of her hood was dripping down onto her nose, and her sleeves clung tight to her arms. She couldn't have explained when it started pouring, but at some point between before and where she was now, it'd started. \n\nRight now though, Sandy didn't care about being wet. What Sandy cared about, was the soft white light pouring out of the crack in a cellar door. She'd never noticed that the west maintenance shed had a cellar, let alone one with electricity. \n\nShe couldn't explain why, but those questions and the purity of the light had affixed her in place, staring at the cellar door. Her rational brain tried to analyze, but then teenage confidence made her step forward. Marching over to the lit cellar in her dripping hoodie and muddy shoes. \n\nThen, she was leaning over it, the white light was pouring onto her face instead of out to the sky. She tried to get a peek into the room beyond, but she couldn't make out any of the pieces. It was just white light. \n\nSandy put a hand on the cellar door and tested. It could move. It was unlocked. Curiosity held a knife to another cat and Sandy considered her options. There were going to be people down there. Probably counsellors and, though it wasn't against the rules for her to be awake, she \nwould get a lecture about it. \n\nShe felt like she had to know. \n\nSandy chose to just ask in the morning. \n\nThe rain picked up as Sandy made her way back down the path, cutting around larger and larger puddles. She was going to get sick from this, there was no doubt about it. At this point she just wanted to get back to her cabin, into bed, and pray that she'd feel fine in the morning.\n\nIn a way, that meant the walk worked.\n\nThen something stopped Sandy, a creaking noise.\n\nSandy took two steps off the path, her rain darkened hoodie disappearing into the new-moonlight as she turned and watched the cellar door open. White light poured out toward the stars, and then a woman climbed out of the cellar. \n\nThe woman was long limbed to the point of parody, rail thin with wispy blonde hair pulled back into a tight ponytail. The girl was wearing white that quickly darkened in the rain. Sandy stared. \n\nThe body told Sandy that this was a girl, but a white mask covered her face, a porcelain smile mixed with other colors that didn't show at midnight. \n\nThe woman looked down at the muddy shoeprints that had been left outside the cellar. Then followed their line down the path, to the shadows Sandy'd crouched in. \n\nSandy held her breath as the woman stared. The mask didn't have eyes.\n\nThe rain calmed for a moment, downpour to storm. It was still loud enough to muffle Sandy's breath, but she could make out a little more of the staring woman. \n\nHer fingers were dark, contrasted to her pale skin. \n\nThe woman cocked her head. \n\nSandy froze.\n\nThe rain picked up.\n\nThe woman turned back to the cellar and went down. She closed the door behind her. Seconds later the white light flicked off. \n\nSandy stood in the rain for too long. She couldn't tell if it'd been minutes or hours, but eventually she was convinced that the woman was gone. \n\nShe'd go back to the cabin, but the cabin was so close to the cellar.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1c1ueq4/wp_a_teenager_gets_sent_to_join_a_summer_camp/kz6ieoq/",
        "score": 6,
        "date_posted": "2024-04-11 23:06:36",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] Death comes for all eventually, although it seems to avoid you for some reason?",
        "comment": "In my first days, I didn't recognize death. In fact, I don't think anyone does until they know the signs. You can spend your whole life, see them in a thousand crowds with a thousand faces and never understand who or what you were looking at. \n\nUntil all at once, I understood. \n\nIt was raining that morning. It usually was when they were around. It was the scene of a car accident where we'd been too late. Blood had mixed with the rainwater and tears on the side of the road, and our trip had become about retrieving a body as opposed to saving a life. \n\nIt happened. It happened over and over. Eventually you got used to it. At least that was what the vets all said. \n\nI locked eyes with them while I was sitting on the back of the ambulance wait for fire with the jaws of life. On that day, Death was young girl in a cafe window. I locked eyes with her for a brief moment and I understood I'd done something wrong. Something blasphemous against the order of things.\n\nBut Death didn't look away, because on that morning, Death was a little girl and little girls are innately curious. \n\nEyes were the way to spot the reaper in a crowd. They wore different skins and faces eyes were always the same, a sharp silver, like the edge of a gleaming scythe. I didn't know whether the eyes were thematic, or whether they'd been given a scythe in myth to give their stare a physical form. \n\nThey were everywhere, once you were looking. Even when I wasn't around their domain I'd catch them in the crowd. Waiting. Watching. Considering. Always a voyeur, never a participant. \n\nThen I met them. \n\n----\n\nYou never think that you're going to be on the hospital bed when you get into the field. You get so used to setting people on gurneys that you forget what it's like to lay on one for something other than a nap. \n\nBut here I was, here we all were. The hum of a dozen ventilators in the outbreak ward mixing into a somehow relaxing cacophony. The beep of machines muffed by drawn curtains and tiredness had distracted me awake again. Now I was staring at the ceiling, waiting for sleep to happen again. \n\nAfter all, it wasn't like I could do anything except wait for sleep to come again. I was too tired to raise my arms to read, and there wasn't anyone around. Until there was.\n\nA woman in plain scrubs with black hair pulled back in a tight bun pushed the curtain to the side and slipped into my 'room.' In my bleary state it took a moment, to notice the eyes, but the understanding was instant once I did. \n\nSilver sharp eyes, like the edge of a reapers scythe. She was wearing a familiar face at the moment. I woman I'd passed in the halls a dozen times during emergency runs. \nBut they weren't that woman right now. \n\nDeath leaned down at my side, checking the machine to my right. They'd turned the blood oxygen monitor away from me once they understood that I could read it. They'd said it was bad for my recovery if I kept watching it instead of falling asleep. Death watched the numbers for a moment, and then turned the monitor to face me. \n\nOh fuck. \n\nYou don't realize you're dying until you're already halfway there. My lungs weren't pumping enough oxygen into my system, and there was either something wrong with the ventilator or my body wasn't taking it. \n\nDeath stared at me, scythe sharp eyes almost glinting in the lowered evening lights. They stared. \n\nI reached out to greet them. I'd known them for a long time. Maybe it was my time to---\n\nThey stepped out of my reach and kept staring at me. Never a participant, always a voyeur. \n\nI tried to take a deep breath, but I wasn't in charge of that right now. \n\nThey took another step back and scanned me one last time, eyes lingering on every edge and curve. Gaze stopping on the scars I'd picked up over the years. \n\nThey walked away. I head a monitor flatline across the room. \n\n----\n\nIt was my turn for an accident after helping so many. They'd run a red light and thrown us across the intersection. \n\nIt was raining, like it usually was when they were around. The ambulance was late. Blood was mixing into the rainwater and pain had stopped shooting up my legs minutes ago. \n\nPeople were shouting outside but I couldn't understand words. The issue with ringing your bell was that it kept echoing after. I was blinking away a concussion as people tried to explain what they were doing or needing to do. \n\nSirens. Help.\n\nA man crouched down beside the car, resting his palms on the wet and blood on the asphalt. His greying hair was matted down from the rain. \n\nThose eyes. Their eyes. Of course they were here. It was a mirror. It all made sense. \n\nThey watched for a moment. Acting like they were a bystander here to help. I locked eyes with them for the first time since that first crash, and they stared back unblinking. \n\nIf I had the strength, I would have reached out. \n\nDeath stood up.\n\nI would never walk again, but I was the only survivor. \n\n----\n\nThey were waiting for me when I got home. An impossible person in a locked apartment of the retirement home. They weren't wearing a familiar face, they were new, novel, gaunt. \n\nPerhaps true. \n\nI sighed as I pushed into the apartment. I didn't need to see their eyes to understand who they were. \n\nThey turned to look all the same, scanning me. Holding their eyes on every scar and wrinkle life had left on me. \n\nFor the first time, they were close enough for me to talk to them. \"Hello old friend.\"\n\nDeath didn't say anything, but maybe their expression softened. \n\n\"I was really hoping to make it to the craft sale this week, but I'm ready to go if you are.\"\n\nQuiet. Silence. Staring. \n\n\"Well.\" I rolled toward them. I didn't move as fast as a used to. When I'd first gotten the chair I was downright quick, but frankly this thing was only manual because I'd been stubborn about it. \n\nDeath didn't approach, but they didn't walk away as I did either. They watched. \n\n\"Alright then?\"\n\nShe stepped away. Walking past and toward the door. \n\n\"Wait!\"\n\nI couldn't know if her expression softened when I'd greeted her as a friend, but I knew she stopped now. \n\n\"Why?\"\n\nThe woman turned back to me, and by the time they were facing me it was a man in the prime of his life with salt and pepper hair and a leather jacket. He looked at me for a moment, silver eyes reading my face.\n\nThey didn't answer. They just left me alone. \n\nAgain.\n\nIt was always someone else.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1carg71/wp_death_comes_for_all_eventually_although_it/l0u2l25/",
        "score": 66,
        "date_posted": "2024-04-22 22:47:39",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] A fey cursed a monster hunter to have his firstborn being a half human and half monster. Some years later she is surprised by the unexpected outcome.",
        "comment": "Therestinal had spent so many years in the Wilde and cast so many curses that she'd lost track of some of them, in fact, she'd lost a lot of them, and she needed solutions. At first, she'd kept them all in a secret tome, locked away in a birch box at the bottom of a bubbling spring, but eventually she'd run out of pages in the Curse Book. She started storing the curses wherever they would fit: On the passing breeze, on a sprouting rose, in a whispered promise.\n\nThat was the reason that Therestinal wasn't surprised when someone she didn't recognize came to her door, or at least she was only partially surprised. There were many people who were looking for Therestinal, but there weren't that many who could find her. She'd never tried to stay hidden, but she was still within the Wilde, navigating the timeless space between petals was nigh impossible for mortal blood.\n\nAnd yet there he was.\n\nTherestinal didn't remember her curses, but she remembered faces. Of course, the man in front of her had been weathered by the years but mortals never truly changed, wrinkles didn't affect the essence of a face.\n\nHis expression had changed though, alongside his demeanour.\n\nThe man at the door was a Monster Hunter -or at least he had been at one point, Therestinal didn't know what petty mortal job he kept now-, someone who had raised a blade to her during one of her many excursions to the material plane. Back then he'd been an aggressive braggart, but he'd quickly learned that immortality didn't end at agelessness.\n\nNow the man had been standing in Therestinal's doorway for over a minute, waiting in silence. Such quiet would have been unfathomable in a human conversation, but timeless people had time for truly considered answers.\n\nMore critically for Therestinal, the man had left his blade at home, and she hadn't had a visitor in some time.\n\n\"Come in,\" she finally relented, standing to the side so that he could enter her home, at least the version of it she allowed guests to see.\n\nThe man took a moment once he was inside, walking around Therestinal's home before deciding to take a seat whether he was offered one or not. Once he was seated, he put the helmet he'd been carrying under his arm in his lap. He watched Therestinal for a breath before finally speaking. \"I suppose you're surprised to see me.\"\n\n\"I'm surprised to see any mortal blood in this realm,\" she corrected. Therestinal was still at the door, only now allowing it to close.\n\n\"I'm not here for revenge.\"\n\n\"I can see that much,\" the Fey answered, \"but if you're here for mercy from your curse, I can't offer that either.\"\n\nBased on the man's reaction, it was clear that he hadn't expected that response. \"Can't?\"\n\nThe words weren't there, but the implication was 'Not wouldn't?'\n\n\"Can't. Cannot. Can. Not. Whatever the human word is. Your language is confusing and unspecific even when you're not smashing words together like a pair of sticks.\"\n\n\"That's okay,\" the man said shifted in his seat, trying to squeeze his hulking frame into a chair made for fey, \"I wasn't going to ask for you to remove the curse. It's already come to pass.\"\n\n\"Has it now?\" Therestinal was a fey. She couldn't lie, but she could omit. At the moment she was omitting the curiousity from her voice.\n\n\"Yes. I've had a monstrous child.\"\n\nThat was it! He was the man she'd cursed to have a half-human child no matter who his bride was. Where had she put that curse? It was a good one. It fit the crime and felt thematically resonant. Now, Therestinal struggled to omit her curious tone. \"So you're curse came to pass.\" In that moment, Therestinal decided she was wiling to keep the human in the Wilde for long enough to share his story, so she snapped her fingers and summoned a sea glass kettle. \"How did that turn out for you?\"\n\n\"Its a somewhat rambling tale.\"\n\n\"The time means more to you than it does to me, mortal.\"\n\n\"When you first cursed me, I despaired.\" Therestinal ensured the man didn't see it, but she rolled her eyes, what a droll way to begin his story. \"I was unsure how I would ever live knowing that I was going to bring a monster into the world after hunting them for so long.\"\n\nTherestinal poured water into the kettle, and then made it boil.\n\n\"So I decided I wouldn't. I would never have a child and I would bear the mark of your curse to the grave, whether it was on the battlefield or in my twilight years.\"\n\n\"How noble,\" Therestinal was good at hiding tones, but she ensured the man understood that he was boring her.\n\n\"Naïve, that's what it was. I spent some years angry and bitter. I got reckless on the battlefield. I was stuck down. My coat covers it now but there is a large scar across my chest from a griffon's claw.\" He took a breath. \"I was dying in the mud in the early spring, an angry boy who'd wasted his life.\"\n\n\"I can't help but notice you're here now,\" Therestinal commented. \"Tea?\"\n\n\"I couldn't possibly,\" the man answered. His polite way of showing he understood that accepting Therestinal's food was a trap to wrap him in the Wilde's wreath forever.\n\n\"Suit yourself.\"\n\n\"I was dying, but I was saved. I don't remember being saved, but I remember waking up in the tree. There were creatures there. Harpies. I thought they were speechless monsters but there they were, saving me.\" He sighed. \"I wasn't a good guest at first. Tried to escape more than once and just hurt myself over and over while they tried to figure out how to communicate with me.\"\n\n\"Hm.\"\n\n\"A long story short. I fell in love. I suppose it's something you've heard before in your long years. Man and beast is a fairy tale as old as the...\" the man didn't finish the saying 'Fey themselves.' In retrospect, he realized that fairy tales might not have been the best wording either. \"So I guess I found my way to you here in the Wilde so that I could thank you.\"\n\n\"Thank me?\" Therestinal poured herself the tea.\n\n\"If I weren't destined to have a half-monstrous child, I never would have ended up wed to one. It wasn't the outcome I expected, but I appreciate the way you twisted my destiny ensured that I fell in love and truly changed my...\" the man stopped talking and watched as Therestinal overfilled the cup, letting boiling water pour over her unharmed hand. \"You're. You're uh--\"\n\n\n\n\\n\\n\"What kind of curse did you think I placed on your human?\" Therestinal finally stopped considering the mortal's words and put the kettle down. The water in the ground evaporated with a wave of her hand.\n\n\"Well. One that would ensure that I would have a half-monstrous child.\"\n\n\"By any mother,\" Therestinal didn't know where she'd stored the curse, but she could recall the wording. \"Your bride wasn't my doing.\"\n\n\"Pardon?\"\n\n\"Do you think I stoop as low as to offer someone who'd struck me love,\" she said. \"Do you understand how much magic it takes to shape emotion... No. Of course you don't. You're a mortal. You have no understanding of these things.\"\n\nThe man was quiet in his seat, now staring into the middle distance. Therestinal nodded. That was how she liked her mortals, confounded.\n\n“So I can accept your thanks as a gift, but not as a transaction,” Therestinal added, “you may sculpt your fate from here, human.”\n\n“Oh um.” The human was still staring toward the floorboards, having lost the explanation for half his life. “Well, my darling Halleigh is bearing our first child, and we were looking to get wed under my culture. I had brought an invite for you considering I… well we thought you’d be heavily involved in our romance but…”\n\nTherestinal, for the first time in their conversation, noticed the paper in the human’s hand.\n\n“Pardon the intrusion I suppose. I hope you found our story interesting. It took some time to find you in the Wilde.”\n\n“Not so fast human,”-the ancient Fey held out her hand, -“you truly don’t know the rules of the Wilde. Stumbling around in ignorance.”\n\n“I didn’t accept the drink.”\n\n“No, but a gift offered cannot be rescinded here,” Therestinal said, “and I believe that invitation is dedicated to me.”\n\n",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1cj5w3i/wp_a_fey_cursed_a_monster_hunter_to_have_his/l2faduj/",
        "score": 98,
        "date_posted": "2024-05-03 13:12:16",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] \"You thought I liked you?! Is that why you kept wearing those tight outfits and tilting my chin up with your sword and doing that villainous murmur thing in my ear?? Are you crazy?! What the hell do you mean enemies to lovers?! You burnt down my entire village, I'm trying to kill you!!\"",
        "comment": "\"Good try little thing,\" he whispered in my ear. I hated the sound of his voice. Hated the breathy non-serious way he spoke to me. Hated the way I got mercy every time I made a move on him. Despite all that hatred, here I was on the floor in front of him again, the cold steel of his sword resting against my jaw. He used it to lift my head up. \n\nI complied, because dying was worse than getting humiliated, dying meant that I could never try again. I at least ensured I was glaring at him as he looked down on me. \n\n\"Ah don't be so hostile,\" he said, \"I've knocked you down again, fair and square. Now, if you're nice about it, I can help you up.\"\n\nHe pulled away his sword, even his casual mocking movements lighting fast. Then he offered a hand to me. I kept glaring and didn't reach for it. \n\n\"What? Did you prefer being pinned to the floor?\" He took a step forward. \"That could be arranged.\"\n\n\"Stay away from me,\" I hissed as I staggered to my feet. He'd winded me with that last blow. I was just lucky he'd used an elbow instead of the blade. I'd need to plan better next time. \"Just let me go.\"\n\n\"Let you go so you can try and kill me again?\" he asked. Got the way he said it was infuriating, almost like he was playing along with me. Treating my life and mission like it was a game. \"Now why would I do that? Every time you run away and come back later, feistier than ever.\"\n\nI went to dive for my blade but by the time I'd turned he was already on top of it, boot holding ancestral steel to the floor. I growled in frustration. \n\n\"That wasn't nice,\" he chided, \"maybe if you learned some manners, we could be friends.\"\n\n\"Who would wanna be friends with you?\"\n\n\"See, like I said. Feistier.\" He put his boot under my father's sword and kicked it up to himself, catching it by the handle with shocking grace. \"Maybe I need to keep you around, teach you some manners. You'd certainly learn some travelling with me.\"\n\nI just glared at him as he surveyed the blade. After a moment he looked over at me, and a flash of annoyance crossed his face in response to mine. \n\n\"Cat for your tongue?\" he asked. \"Speechless?\" He took several steps toward me before turning my blade as to offer it back. \"Breathless?\"\n\n\"Fuck you.\"\n\n\"No then,\" he snapped the sword away before I could get my hands on it, shoving it into his scabbard and leaving his weapon out in the open. \"I was trying to be nice.\" His dark eyes scanned me, though the breeze kept threatening to push his long black hair over them. \"I do think you need some lessons.\" he said after a moment. \n\nHe walked toward me and I backed up with each step until I was against the wall. I felt the cruel gouge his blade had left in the stonework with my palm. He was so damned strong. How was I supposed to ever win against him. \"Let me tell you,\" he began as he reached me, \"I'm a strict teacher, but a very good one.\" He was almost whispering in my ear now as he pressed the pommel of his blade into my stomach to pin me. \"AS long as you behave.\"\n\nThe breathy way he said it. The deep growl he added to his voice. All of it set me off. To the hells with it. If he killed me for speaking up he could, but he hadn't killed me for trying to to kill him before, why would he now? Finally, I let it all out. \"What the fuck does that even mean?\"\n\nHe pulled away, surprise. Maybe shock. \"Pardon?\"\n\n\"No. What the hell does that even mean? I was just trying to kill you. Why are you asking me to behave and telling me to be a good student and--\" I waved around in frustration. \"All of this!? What the hell is all of this?!\"\n\nFor the first time in all the years I'd been chasing them, the smug fuck sat there in shock, staring at me. Their eyes flicked up and down twice, scanning me, trying to find a sign of something, but I had no idea what. Who knew what they were thinking right now?\n\n\"You don't know?\" they asked. \n\n\"What would I know?\" I snapped. \"I've been trying to kill you ever since you attacked my town on behalf of the evil lord and you just keep stopping me, then letting me go. I don't know why I'm alive or why you keep pinning me to the floor and...\" I trailed off. I'd been in life or death situations before, hell, I'd gotten stabbed, but I'd never felt my blood run this cold. \"Are you flirting with me?\" \n\n\"I would never.\" They said, but it was a stammering awkward retort. \n\nSilence echoed over the dark room we'd fought in. An inn with a plush bed. Downstairs there was a riotous party, but up here? \n\nWell I didn't even know anymore. \n\n\"Why would you FLIRT with me?\"\n\n\"I thought that was what we were doing?\"\n\n\"We?\"\n\n\"You kept coming back. Don't act like there wasn't something to that.\" The stood up with that, breaking the awkward retreat they'd started. \"You're just as much part of this as I am.\"\n\n\"Part of what?!\"\n\n\"Enemies to lovers?\" They said like I was the idiot. \n\nBlank stares. A glass broke downstairs. \n\n\"Enemies to what?\" I asked after it'd been much too long. \n\n\"Oh by the Dark God you're from too small a village.\"\n\n\"You burned down my village.\"\n\n\"Which one was that?\"\n\n\"You're kidding.\" I snapped.\n\n\"No, you're kidding. Not knowing what's going on here. What a joke.\" They rolled their eyes and pulled my sword out of their scabbard before tossing it at my feet. \"Take this seriously.\"\n\nI bent down to pick up the sword and spoke quietly to the floor. \"You burned down my village.\"\n\n\"Good.\" They seemed almost excited. \n\n\"Everyone I loved.\"\n\n\"That's it.\"\n\n\"Everyone I cared about. My friends. My family.\" I hissed.\n\n\"There we go!\"\n\n\"I'm hate you,\" I grabbed my blade, feeling my fingers slip into the familiar worn dents in the leather straps of the handle. \n\n\"Perfect. Now let's try again.\" They were almost laughing now. \n\n\"and I'm going to kill you!\" I slashed out, but by the time my sword would have caught them, it was already clattering across the room. I was stuck dumbfounded as I watched their open palm fly toward me, slamming into my chest and pinning me to the wall. I didn't even have time to struggle. \n\n\"Too slow,\" they chided, back in that damned breathy voice, \"but we can take it slow if you'd like. Do you need me to go slower for you?\"\n\nI screamed, partial rage, mostly confusion.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1c3w69h/wp_you_thought_i_liked_you_is_that_why_you_kept/kzmfvoc/",
        "score": 28,
        "date_posted": "2024-04-14 22:19:10",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You are a demon and have just been summoned by a hysterical 7 year old. The problem? The ice-cream man put their ice-cream in a tub and didn't give them a spoon. Naturally, you decide to help the child get revenge.",
        "comment": "I was suddenly crosslegged on the floor of a carpeted bedroom that had bright blue walls with an intricate gold mural carved into the far one. Toys were strewn across the floor haphazardly, to the point where they crossed the sacred line into the summoning circle. \n\n\"You're here! Yay.\"\n\nI signed and rose to my feet. My shadow, usually imposing, felt silly in this room as I loomed over a small child with pigtails and way too much knowledge about summoning rituals for her age. \n\nA made a quick check around the room and didn't see anyone else. This had been an unsupervised summoning. Strange. \n\n\"Mr?\"\n\n\"Pelanas.\" I corrected out of habit.\n\n\"Pelan...ass.\"\n\n\"Close enough.\" I took a step outside the circle and took another scan of the room.\n\n\"Where are you going?\"\n\n\"I'm looking for--\"\n\n\"You're supposed to stay in the circle.\"\n\n\"There is a train through the circle. Which means it doesn't count.\"\n\n\"That's dumb.\"\n\n\"Those are the rules.\"\n\n\"The rules are dumb!\" the little girl shouted. I winched at how high pitched it got.\n\n\"Yes they are.\" \n\n\"Circle.\"\n\n\"Where's your mother?\"\n\n\"Get in the circle.\"\n\n\"Is she down the hall?\"\n\n\"Circle.\"\n\n\"I'm not getting back into the--\"\n\n\"CIRCLE!\"\n\nI considered my options for a moment. If I went and searched for Nicole I was just going to have a child screaming after me. On the upside she'd find me, on the downside she'd probably swing before I could explain myself. \n\nConsidering the kid was already screaming, I was probably getting accosted in a minute either way.\n\n\"Sure,\" I relented, taking two steps backward and getting back into the 'circle'. My tail hung over the end but she wouldn't understand it was defiance.\n\n\"'hank you.\"\n\n\"Why did you call me?\" \n\n\"Um.\"\n\n\"Did you know you were calling me?\"\n\n\"Um.\" She said, but she nodded. \n\n\"That's a yes?\"\n\n\"Ya!\"\n\n\"So you knew you were calling me.\"\n\n\"Yep.\"\n\n\"And what's your name?\" I asked. Now that we were in conversation I got back down on the floor so I was closer to her height. I could see the snot. Kids were so damned sticky.\n\n\"Holly.\"\n\n\"Okay, Holly. Why did you call me?\"\n\n\"Um.\"\n\nI sighed. She'd probably just called me because she remembered how to without an understanding of pact.\n\n\"Ice cream.\"\n\nThat was a new one. There was no way that she thought the best way to get ice cream was... Maybe she'd called me because she knew her Mom had used me to get things and she'd confused me for a damned Alexa. \n\n\"Ice cream.\" She repeated, pointing towards the, mostly melted, ice cream cup on top of her pink dresser. \n\n\"Are you giving me ice cream?\"\n\n\"My ice cream.\"\n\n\"Understood.\"\n\nI tapped my tail on the ground. There was something refreshing about speaking to a five year old after speaking to a thousand summoners with precise and careful wording. A casual conversation after a cavalcade of lawyers.  \n\n\"'Oon.\"\n\n\"Try again.\"\n\n\"Spoon?\" she asked. \n\n\"Spoon is a word.\" I stared at her, and then back at the-- \"Oh. No spoon.\"\n\n\"No spoon.\" Followed by rapid nodding and then stomping over to the cup on the counter. \n\nI followed, she didn't seem to mind that I'd left the circle this time. We both stared at the ice cream for a moment. \n\n\"No spoon.\" She repeated, sadder this time.\n\n\"Want me to get a spoon for you?\"\n\n\"Mhm.\"\n\n\"Okay. I'll go get a spoon.\" \n\nI'd been summoned into the house before, so I simply headed down the hall and into the kitchen, raising my claws to avoid scratching the false hardwood. Last time I'd done that... \n\nI didn't need to think about that. \n\nAfter coming to the mortal world hundreds of times, I thought I understood the rhyme and reason of kitchens, but I tried every cupboard and drawer in the place before I discovered a haphazard pile of mismatched silverware stuffed into a half-organized drawer. \n\nKnowing Nicole I'd expected more organization, she'd kept most of her i's dotted and t's crossed during our conversations.\n\nOnce I'd levelled judgement over kitchen organization I headed back to Holly's bedroom, where she was still staring at the ice cream with tragic eyes. I had to offer Nicole credit in a  counterpoint to the silverware, I'd figured most children would had shoved their hands in at this point. \n\n\"Spoon.\"\n\n\"Spoon?\" Holly snapped her attention back to me, her eyes turning into shining beacons of light blue excitement, only to suddenly break down into a spiral of despair. Then tears.\n\nNicole was going to kill me. \n\n\"Hey hey,\" I got down on a knee again, still holding out the spoon to her. \"What's wrong. The spoon is right here.\"\n\n\"Wrong spoon!\"\n\n\"What?\"\n\n\"WRONG SPOON!\" she wailed. \n\nI tossed the offering spoon across the room and placed an infernal hand on her shoulder, the heat of it seemed to shock her out of her tears. \"What spoon do you want, Holly?\" \n\n\"Ice cream man.\"\n\n\"Ice cream man?\"\n\n\"Ice cream man,\" she reaffirmed.\n\n\"You want the spoon he gave you? Where is it?\"\n\n\"He didn't!\"\n\n\"He didn't give you a spoon when you got the ice cream?\" \n\n\"Nuh-uh.\" She sniffed. There was so much snot.\n\n\"Where's the ice cream place? I'll get your mon and--\"\n\n\"Truck.\"\n\n\"An ice cream truck?\"\n\n\"Mhm.\"\n\n\"That would have left a while ago and be somewhere else now?\" I asked. \n\nBlank stare. At least it wasn't tears. \n\n\"Is it here?\"\n\n\"Gone.\"\n\n\"Great.\" I sighed before rising to my full height. This was going to be my whole afternoon. And I wouldn't even be able to say I achieved anything with it. So much for reaching my goals this week. \n\nActually. \n\n\"Holly, you're asking me a pretty big favour,\" I held out a hand, \"can you do me a favour later just to make sure we're even?\"\n\n\"My Mom told me I shouldn't.\"\n\n\"Did your mom tell you to summon me?\" \n\n\"No.\"\n\n\"What's Mom know?\" \n\nI watched the single hamster-powered gear behind her little eyes turn for a moment. Then the lightbulb sputtered on. \"Nothing!\" \n\n\"Bingo! We're friends.\"\n\n\"Bingo! Bluey!\" \n\n\"What?\"\n\n\"Dad!\" \n\n\"I'm not going to tackle that,\" I said more to myself than Holly. \"Shake?\" I held out my hand again. \n\n\"Yeah!\" \n\nShe grabbed my hand. Nothing but a favour of equal measure but it was something and--\n\n\"ARE YOU FUCKING KIDDING ME PELANAS?! MY DAUGHTER?\"",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1b4vznv/wp_you_are_a_demon_and_have_just_been_summoned_by/kt1sebi/",
        "score": 61,
        "date_posted": "2024-03-02 15:24:39",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] “So you’re telling me,” the Guild Leader said to the blood soaked adventurer. “You defeated the Dragon King, wiped out the Northern Bandit Tribes, and rescued six cats from trees all because you wanted to impress a girl?”",
        "comment": "Oshvold the Heavy had seen a lot of things, both during his time as the Guild Leader and back in his adventuring days, but he wasn’t quite sure he’d ever seen anyone like Helena. \n\nShe had started out like most adventurers that came through his door. Eager to prove herself and frustrated with the types of jobs he’d offered at the start, but there was a method to Oshvold’s madness. Saving cats was a job that showed you if someone had followthrough, goblins would show you they could handle themselves in a fight. \n\nTo the adventurers, especially those that came from other guilds, the jobs were tedious, but to Oshvold, it was all research. Critical information gathering that let him run an efficient and safe guild hall. \n\nWell, as safe as guild halls got.\n\nNo amount of information gathering had prepared him for Helena. The woman pulled a small bundle of bounties out of her bag–so she was who’d been stealing his copies–alongside the signatures marking job completion. \n\nOshvold suppressed his surprise as he grabbed his reading glasses, replacing his shock with a gruff, “Guild rules say one job at a time.”\n\n“Sorry,” she said as she took her midnight hair out of her ponytail and let it fall. “Stuff was on the way.”\n\n“On the way? Hm.” Oshvold read over the sheets. It was impressive that she’d taken care of the bandit tribes, considering she usually worked alone, but then he flipped over the last sheet–\n\nHe was right, he’d never seen anything like her. That last writ was from the palace, the bounty for the Dragon King. How had she even gotten her– “What rank are you?”\n\n“Gotta cash those in order,” she said, “I should get to journeyman from the cats, then vanguard from the Northern Bandits which would make me legal for the–”\n\n“Yeah yeah,” Oshvold waved a dismissive hand. “You know that the point of the limits ain’t the logistics of it. It’s to keep kids like you safe.”\n\n“Oh,” Helena said. “In that case the order doesn’t matter.”\n\nOshvold rolled his eyes. He was used to this sort of behavior from Wizards and other egg-heads who tried to game any system they got their ink splotched hands on. From what he understood, Helena couldn’t tell ass from teakettle when it came to magic. “What was your party for the Dragon King job?”\n\n“Rowley.”  \n“Rowley?” Oshvold asked, it was just the first name and that didn’t make any sense. Helena might have been confused about magic, but Rowley was confused about everything. “You brought Rowley with–”\n\n“Oh, no. He just pointed me toward the right way at Jaggard’s Crossing when I’d lost my map so…He helped. That puts him in my party right?”\n\nOshvold looked down at the sheet. She was seriously saying she went alone and–Well the King of Tarvineium had only signed her name on the bounty sheet. Did everyone else possibly die? “Deceased?”\n\n“The Dragon King,” Helena said with the stalwart tone that showed she didn’t know she was answering the wrong question. “On the Dragon King quest. If we’re talking the other quests there was a nest of hornets in one and then about 14 bandits.”\n\n“About?”\n\n“Twelve through fourteen might have made it. I wasn’t sticking around to check. I had places to be.”\n\n“Where did you have–”\n\n“The Dragon–”\n\n“Yeah, the Dragon King,” Oshvold nodded along as he caught onto the answer to his question. “Look. Helena.”\n\n“Yeah?”\n\n“You did good work here.”\n\n“Thank you\\!”\n\n“But.” Oshvold slammed the pile of papers in front of her to draw her attention and set the scale for his next words. “The rails are there to keep you safe, Helena. You can’t just go ignoring the order and embarking on high level missions alone.” \n\n“Oh,” she said, “I’ll bring someone next time then.” She offered a weak thumbs up. If it wasn’t for professionalism Oshvold would have sworn, instead he just massaged his temples. \n\n“Just one more question before payout,” he said. \n\n“Sure.”\n\n“Why in the patheon did you feel like you had to do this?” he asked. \n\n“Oh\\! That’s easy. I was speaking to Sarif, the mage, and I asked if she’d let me take her out to dinner. She didn’t seem that interested.”\n\nOshvold nodded. That sounded like Sarif. \n\n“But then I asked if I could change her mind, and she said I just needed to kill the Dragon King.”\n\n“What?”\n\n“So I did,” Helena shook her head to fluff her freshly released hair, her armor clattering as she did. “Now I just need to find her this evening to let her know I did it and that we can go on that date.”\n\nOshvold was a professional at keeping his mouth shut, it was almost half his job, dealing with egotistical adventurers. That said, he couldn’t keep the next words to himself. “Oh you poor girl.”\n\n“What?”\n\n“So you’re telling me,” Oshvold said to the blood soaked adventurer. “You defeated the Dragon King, wiped out the Northern Bandit Tribes, and rescued six cats from trees all because you wanted to impress Sarif?”\n\n“Yeah.”\n\n“Oh Helena,” he said, reaching across the table and grabbing her hands. “Sarif didn’t really want you to kill the Dragon King.”\n\n“Then why’d she say it?” \n\n“She said it instead of no,” Oshvold explained. “To someone like you, killing the Dragon King is supposed to be impossible. Like the Infernum freezing over, or Illsmoth blinking every eye at once.”\n\nHelena stared at Oshvold for a moment. “So she meant to say no?”\n\n“Yes.”\n\n“Then why didn’t she just say that?”\n\nThere was a lot of things Oshvold could say to that. There was the fact that most people would understand what she meant. The fact that most people would get killed trying if they didn’t understand Sarif’s meaning. The fact that Sarif, above all, was a bastard. \n\nInstead he said none of them and only offered a small smile. “No idea Helena. Would you like your payment in Gold or Platinum?”\n\n“Oh\\!” she seemed to forget her mild heartbreak at the mention of money. “Platinum please.”\n\nOshvold turned away from the bar to find a safe and chuckled to himself once he was out of earshot. He was sure that he’d never met anyone like Helena, but he was starting to wondering where he could find more of them.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1grlwxb/wp_so_youre_telling_me_the_guild_leader_said_to/lx7bye4/",
        "score": 208,
        "date_posted": "2024-11-14 22:25:14",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] \"So, you want to apply to be a hero?\" \"Yup\" \"You saved your world?\" \"Yep\" \"But you didnt get the girl?\" \"She said no\" \"Couldnt you have, I dont know, tried harder?\" \"Dude...She said no\"",
        "comment": "“And in that moment, right when the Dark Lord was gloating about the weakness in heroes hearts, I charged up from behind him and cracked his head in with my war hammer! Crumpled like a cloak.”\n\n“One and done?”\n\n“One and done!” Thorin confirmed.\n\n“HA! Classic boy!” One of the older heroes slapped his knee as he said it and the table broke out into cheers. The tavern had already been rancorous, and it wasn’t every night someone came back from saving another world.\n\n“Good Ol’ fashioned hubris,” Thorin held up his stein, “To HUBRIS! May our enemies have it!”\n\n“And we only have what we deserve!” The barkeep called from across the room.\n\n“Aye! And get my friends another round! All this gold from that world is weighing me down!” Thorin pushed out from the table and patted the old-hand he’d been talking to on the back. He had a lot of people to visit tonight. It’d been a while since he’d been back at The Valhalla.\n\nThorin approached the bar, and the Barkeep turned their attention away from their conversation and toward the man ordering the next round of drinks. “Lookin’ for something cheap, I assume.”\n\n“Something hard if you have enough, but don’t leave me beggin’ on the street.”\n\n“You can sleep under one of the tables instead.”\n\n“How’d you know my favorite place to wake up in the morning?”\n\n“You talk in your sleep Thorin, I’ll save a pillow for you under table three.” The bartender added, before walking away to prepare the drinks. Once he was out of sight, or at least not staring at Thorin, the hero softened for a moment.\n\nComing back to the Valhalla was always a joy, but a bittersweet one. These heroes all went out into other worlds, getting summoned across space and time to stop calamity after calamity. It was the greatest profession someone could ask for, but Thorin couldn’t help but miss parts of the world he went to save.\n\nHe’d lived there for years, after all.\n\nThe bartender served Thorin first, exchanging another set of jabs before beginning to distribute the round. The cheers of free drinks added to the cacophony, snuggling in with bard songs, tall tales and gambling debts. Thorin considered the drink. There had been one back in Halensya, they called it Dragonglass. It’d burned in such an interesting way. He’d need to figure out the recipe, if it was something they could make in The Valhalla.\n\n“I know that expression,” a woman said as she leaned backward against the bar to join Thorin. “Feelin’ homesick for a place you’re not from?”\n\n“Happens a bit every time, right?”\n\n“To every one of us,” she nodded along with what he’d said. Kalena was an old hand in The Valhalla, a talented sorceress who’d saved more realms than Thorin’d seen. She always strode around the bar like a mobile rainbow, covered in colourful trinkets and fashions from the lands she’d rescued from darkness. “Got a question about your story if you’ll lend an ear.”\n\n“I got two for a reason.”\n\n“Thank ya kindly,”-Kalena accepted her drink from the passing barkeep- “In your story, you mentioned a maiden. What happened to her?”\n\n“Oh, Aerenae?” Thorin suggested.\n\n“Your story, not mine. Don’t pretend you don’t know the name.”\n\n“Yeah, Aerenae.”\n\n“What happened with her? You talked about her at the start and then never told us how it wrapped up.”\n\n“Eh,” Thorin grunted. He took a drink of the near-toxic swill he’d ordered for the bar instead of giving a proper answer.\n\n“Well, consider my curiosity satiated.” Kalena rolled her eyes as she said it. “Don’t wanna give the gory details. I get it. Just thought she was critical.”\n\n“She said no.”\n\nThere was a pause. Certainly not in the bar, but in this conversation.\n\n“Pardon?” was how Kalena broke it.\n\n“She said no.”\n\n“To a night with you?” she clarified. “Ah, well. Happens to the best of us. Can’t find the best fling on every plane an--“\n\n“I asked her back to The Valhalla with me.”\n\nAnother pause in the conversation. This time it was Kalena waiting until the bar was loud enough to cover their voices again. “You asked her back?”\n\n“And she said no.”\n\n“That was it?”\n\n“She said no,” Thorin reiterated. “Didn’t wanna leave her kingdom. Told me she couldn’t. Not after everything that happened.”\n\n“Did you tell her we save kingdoms all the time? Worlds even?”\n\n“She knew where I was from, Kalena,” Thorin sighed, “and she said no. Now if you don’t mind. I’m trying to have fun drinking about everythin’ else so I don’t ruin a lifetime thinking about it.”\n\n“Thorin.”\n\n“She said no, that was the end of it.”\n\n“Yeah, of course,” Kalena broke her casual backward lean against the bar, turning to match Thorin’s hunched posture. Her multicolour bangles jingled as she fell into the conversation again. “But you’re asking a girl back to the Valhalla. I’m just wondering…“\n\n“I’m not gonna tell her everything she told me. She had her reasons and—”\n\n“Thorin, what the fuck are you doing here?” Kalena cut him off. It wasn’t like he was making the right argument. “You offered this Aerenae your one invite, and when she said no, you just left?”\n\n“What was I supposed to do? World was saved. She said no.”\n\n“Stay. You stay there, you dumbass. Send back your medallion and we’ll find another hero. Gods.”\n\nThorin shot up. What the hell was he doing back here? He’d saved a hundred worlds and nobody had ever tempted his invitation out of him. Now he was just going to... “I need to talk to Odin.”\n\n“Yeah, you do,” Kalena rolled her eyes as Thorin pushed off from the bar and sprinted toward the door. The bar fell silent as he ran.\n\nThen. Once the door was closed, the Old Hand Thorin’d expounded his adventures to spoke up. “He going after that Aerenae girl?”\n\n“Yessir!” Kalena confirmed, “He’s going back!”\n\n“GOOD MAN!”\n\nThe bar broke into cheers. Another hero found their deserved fate, and this one had been obvious to anyone who’d heard Thorin’s story.\n\n----\n\n/r/Jacksonwrites for more stories until the book comes out on the 27th.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1cpxl1q/wp_so_you_want_to_apply_to_be_a_hero_yup_you/l3o7it1/",
        "score": 551,
        "date_posted": "2024-05-12 00:56:23",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] You've been diagnosed with cancer. It's too late to treat it. The doctor has given you months to live if you don't undergo chemotherapy. You refuse. Soon you start to see family members who've passed before you, and you're not so afraid of dying.",
        "comment": "The Dr. Do wore a sour look as she offered the prognosis and even though she was having a worse day, Amanda couldn't envy her. Day in and day out the poor Doctor had to tell people that they were dying. Outline painful options that would buy them days. Dangerous ones that would buy them weeks. \n\nAmanda had been sitting on the bed when Dr. Do shared the bad news. Cancer. Amanda's systems were so far gone that it was a miracle she'd walked here on her own. The girl wasn't just dying, she was essentially dead. \n\nDr. Do offered half hearted options. A prattled list of required suggestions. Once she was done, Amanda looked up at her. \n\n\"How much time are we talking?\" She'd expected tears, but in the moment it was just shock. \n\n\"Without treatment weeks. With treatment.\" Dr. Do looked back down at her clipboard and furrowed her brow. Whatever was on there, it was clearly bad news, even in the cancer context. \"Educated guess, just over a month. I can't promise you two.\"\n\nAmanda sighed. She understood that she'd hear this explanation again when friends and family came back from lunch. Right now she was getting the frank answers, later the Doctor would be filled with hope. \"How bad is it?\"\n\n\"It's chemotherapy.\" \n\n\"Yeah.\" Amanda took a deep breath and stared at the tear in her jeans. They were falling apart even more than when she'd bought them. Casualty of a bad picking habit. \"Do you have...um.\" She thought about her words for a moment and the Doctor didn't dare guess where she was going \"Do you know how much it's going to hurt without it?\"\n\n\"In your situation, there shouldn't be much pain until we're somewhat close to the end of life expectancy.\" Dr. Do was impressively matter of fact in those moments before she turned the sympathy faucet back on. \"Closer than we already are that is. You'll start feeling more pain when there are days left. Even then, there are options for that.\"\n\n\"And if we're taking chemo it'll be pain every day.\" Amanda surmised.\n\n\"Five days of the week about, maybe more if we go for aggressive treatment.\"\n\n\"Why would we?\" \n\n\"Some people accept any treatment that might extend their lives.\"\n\n\"Why?\"\n\n\"It's not my place to guess Ms. Gellar,\" Dr. Do offered with a polite nod. Amanda could tell from the tone that the Doctor agreed with \nher, which was at least a slight comfort in the room. \"You have time to discuss with family before you make a decision.\"\n\n\"I don't need it. Thanks.\"\n\n\"You have it nonetheless.\" The Doctor flipped back to the front page of Amanda's clipboard, a sign of closing the conversation. \"We never want people to rush.\"\n\nAmanda, on the other side, didn't want people to talk her out of it, but that was the end of the conversation. Dr. Do pushed the curtain out of the way and headed back out into the rest of the room. Then she was out the door. \n\nAmanda was alone, at least as alone as she could be with a curtain between her and two other grieving families. \n\nShe wouldn't be alone for long. But she knew she wouldn't get polite company. She might be at strange peace with things, but her family?  How could she take those days away from them?\n\nAmanda laid down on the hospital bed, scruffy sheets crumpling under her clothes. Hopefully she didn't have to sleep here again tonight. \n\n.....\n\nIt wasn't long before she heard the door open, but she'd almost managed to fall asleep, she was so tired these days. \nAmanda cracked an eye and listened to the footsteps. Soft and short. Certainly not her whiplash father, anxious mother or frantic boyfriend. Someone else's guest. \n\nThen Amanda sat up as someone pushed her curtain out of the way and walked up to the bed. Amanda shook her head. Once. Then twice. \n\nThe woman in front of her was a crouched old thing with wrinkled smiling cheeks. The woman's skin was paper thin over her fingers, making them look boney and fragile as she leaned against the bed for support. Amanda knew better, she knew how warm those hands could be. \n\nBut she also knew that they shouldn't be here. \n\nFor the first time since she'd heard her prognosis, a tear escaped lockdown, running down her cheek before the hand authorities wiped it away. More followed. A silent prison break. \n\n\"Nana?\" Amada managed after a moment. \n\nThe old woman just smiled, reaching out and placing her warm palm into Amanda's hand before interlocking her fingers with hers. \nWrinkles pulled against young skin. Then a short nod. \n\n\"How?\" \n\nThe question wouldn't make sense to a stranger, but it'd been three years since she'd been in this same ICU waiting for her grandmother to stop breathing. She'd watched blood oxygen hit zero. She'd felt the warmth leave. \n\nYet here it was. \n\nThe woman scooted a little closer and added her other hand to the quiet embrace. She didn't need words to answer Amanda's question. \n\n'Did it matter?' Did it matter why she was here? \n\nWhat mattered was she was. \n\n\"I'm scared.\" Amanda admitted after a moment. The tears were free now. It was the first time she'd said those words. She'd been avoiding it up until now, like speaking them would make it real. Maybe she did. \"I'm dying.\"\n\nNo words against, just a soft smile Amanda'd seen a million times across photographs and childhood memory. \n\n\"Is it bad? Does it hurt?\"\n\nThe woman kept smiling, but it transformed into a sympathetic expression. No words, but everything said. The answer to every question was 'I still love you, forever and always.'\n\n\"I'm still so scared.\" Amanda admitted. \n\nShe heard the door open again, and Amanda realized she was alone in the room, but her hands were warm. \nThen the first words.\n\n\"It's okay, Sweetie. I'm here.\"\n\nAmanda's father threw the curtain open and he saw his daughter crying. Then slowly, surely, Amanda found a soft smile.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1c2k1nl/wp_youve_been_diagnosed_with_cancer_its_too_late/kzathrp/",
        "score": 7,
        "date_posted": "2024-04-12 18:07:47",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] A parent’s clueless child calls the Hoarders TV show to help their believed hoarder family members clean out their home from clutter and junk. Only to find when they are reviewing the “junk,” their home is completely filled with once believed lost historical artifacts.",
        "comment": "There was a Camera crew outside. That was strange. One of the things that had been critical to Elaine when they’d been picking out their home had been that it was in a quieter neighborhood. It meant she didn’t need to see things, explain things or explain things she didn’t feel like explaining.\n\nBut there they were, in the middle of the sleepy neighborhood. With a sharply dressed hostess swearing at a clipboard.\n\nElaine let the curtains close. She had things to do today. A memoir to pen. A dinner to make. A child to entertain. A younger woman could have rubbernecked for a little longer, and an older woman could have too, but now?\n\nSomehow after retiring from the old work, Elaine felt busier than ever.\n\nThen, a sharp knock at the door.\n\nElaine had a philosophy about someone knocking. The first was a test for the weak hearted that trapped you into speaking to solicitors. The second was when someone needed you.\n\nThe person at the door knocked again.\n\nElaine huffed. But still got the door.\n\nThe woman at the door- or should Elaine say hostess- was prim and proper, already holding a microphone out to Elaine before she’d managed to step into the doorway.\n\n“Hi! We’re from channel four’s Hoarders, and we’re here to help you!” The woman was beaming the entire time and laying it on entirely too thick.\n\n“I think you have the wrong house,” Eline answered before almost closing the door. She would have closed it the whole way, but a shined pink pump stuck itself in the crack.\n\n“This is 48 Hagathar Way?”\n\n“Yep.”\n\n“A member of your household called us and said you needed help. Now. I know this can be hard but we’re here to help you and—“\n\n“What are you talking about?”\n\n“Hoarders.”\n\n“Like the garbage house show?” Elaine asked.\n\n“You don’t need to call it a garbage house. We understand that you’re struggling and…” the woman watched as Elaine opened the door back up. “May we come inside?”\n\n“No?”\n\n“Mom! Are those the people?” Came a young voice from upstairs.\n\n“What. People?” Elaine asked in a voice usually reserved for using Cassandra’s full name.\n\n“The hoarders people! I called them. One—“ The girl stomped around upstairs to put herself together.\n\n“Cassandra Halland Ravensview!” There it was.\n\n“One second, Mom.”\n\n“I’m sorry.” Elaine turned back to the confused crew. “She does stuff like this. Doesn’t know what kind of trouble you can start with a phone. What kid does, right?”\n\n“It’s okay, we’re here to help,” the Hostess said.\n\n“Gods.”\n\n“Oh my god! Linda Breakgale!” Cass screamed from halfway down the stairs.\n\n“The one and only!”\n\n“Come on! I’ll show you.”\n\n“Show her what, Cass?” Elaine hissed.\n\n“All the junk! Come on.”\n\nThe Hostess took a step forward, which gave Elaine a choice. She could either stay in the way and stop the woman, or try and talk her way out of this…\n\nOr maybe it was time for ‘that’ conversation.\n\n“Come in,” Elaine said, but she still rolled her eyes as she said it.\n\n“Thank you so much for coming,” Cass chattered, she spoke quickly at the best of times and now excitement had added its flair. “I watch your show all the time online and I’m so happy we can finally get my parents some help with the basement.”\n\n“The basement?” The Hostess asked.\n\n“Yeah the basement. It’s totally stuffed. It’s nuts.” Cass answered.\n\nThe Hostess looked over at Elaine.\n\n“By all means, follow the kid.”\n\nCass was already at the top of the basement stairs, her sock covered feet almost sliding past it. She undid the bolt on the top of the door, a remainder of her toddler days, and flung open the door.\n\nGlittering golden light poured from the basement and showered the hall way of a shining coat of avarice.\n“It’s all down here!” Cass insisted.\n\nThe Hostess was less eager to follow this time, but after a moment she waved the camera man who’d been following her forward. Elaine let him pass.\n\n“See? Look at this junk?” Cass started down the stairs before the camera was around the corner, and was running back up just as they rounded it. “Look!”\n\nCass held her prize out to Linda Breakgale, who, for the first time in modern memory, was speechless on camera.\n\nIn the nine-year-old girl’s hands, was a shining sapphire blade, cut from a single massive stone with runic instructions on either side of the blade. It caught impossible light, and smelled like the sea breeze.\n\n“See? Who even has stuff like this?” Cass asked before she dropped the blade and went back downstairs to find another prize.\n\nLinda hesitated about catching a sword, so Elaine swooped in. After a moment, the hostess found her voice. “Is—Is that?”\n\n“Viannafair, the Blade of Moon and Tides?” Elaine suggested.\n\nLinda Breakgale nodded.\n\n“Yeah.” Elaine flipped the sword once to take a good look and both sides before leaning it against the wall. “Do you take a lot of hints from nine-year-olds?”\n\n“Look at this!” Cass interrupted without acknowledging her mother’s sardonic question. “What even is this?”\n\nA pearl white robe of shimmering starlight was crumpled into a ball in Cass’s hands.\n\n“The Robe of Everlasting Starlight?” Linda Breakgale asked.\n\n“Yeah, nobody in my family wears robes. Our basement if filled with stuff like this!”\n\n“O-oh…”\n\nOnce she’d had enough fun watched Mrs. Breakgale emotionally melt into the floor, Elaine explained. “Yeah, we wanted her to want a normal job, so we hadn’t told her what Mommy and Daddy did for work before we had her.”\n“So you’re?” The camera started, speaking for the first time.\n\n“Elaina Mass, of Yoviron’s Legacy,” Elaine finished, “and my daughter  is in so much trouble.”\n\n“Get them to throw this out,” Cass said, before throwing a petrified dragon’s fang at Linda Breakgale’s feet at the top of the stairs.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1cjj1ib/wp_a_parents_clueless_child_calls_the_hoarders_tv/l2gvs5y/",
        "score": 103,
        "date_posted": "2024-05-03 19:22:53",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] As the latest employee in the world's most prestigious amusement park you are handed a list of rules all employee's must abide to. But it's filled with rather strange rules. What does: \"There's only ever one of each mascot inside the park. Check for eyeholes.\" even mean?",
        "comment": "The computer room to the left had one piece of furniture in front of massive screens, a brown plastic chair bolted into the ground by a plate on each leg. It was a cold place, even for the cold building. It wasn't anything like she'd pictured when Cali'd signed up to work in Joyland, but then again these were all the backrooms and you couldn't find information about the employee experience online, only people bragging about how they'd been able to come for a vacation.\n\nBefore Cali had even sat down the screen sparked to life, light blue text on a dark blue background.\n\n[Please take a seat]\n\nA second after the text was on the screen, a manufactured voice repeated the request. Cali paused for a second at that. The voice was so...blatantly inhuman, like the robotic and stilted text-to-speech algorithms you saw in museums covering the turn of the century. The voice repeated. Cali complied.\n\n\"Thank you for joining us and welcome to the Joyland Team [Abbigail!]. In just a moment, I will be walking you through employee registration, but first [Abbigail] I have some questions for you.\"\n\nCali looked around the room with each instance of [Abbigail] not only was it clearly in a different voice than the rest of the speech and also not her name, but there wasn't anyone else it could have been referencing. As far as Cali could tell, she and Queen were the only ones who'd come in here within the past few minutes.\n\n\"Please confirm your preferred gender presentation [Abbigail].\"\n\nThe screen gave two options, which was a strange sight. Cali clicked female. At least one of the options had been hers.\n\n\"I am now going to preform an eye scan. Please stay still.\"\n\nCali waited for a moment, nothing seemed to happen but then the machine chimed like it was done.\n\n\"Just a moment. Processing.\"\n\nCali took another look around the room, trying to see if there was an ID badge or anything that the machine could have been scanning to get Abbigail from nowhere. Then again, she didn't have an ID badge yet, so it would have been strange for the machine to require one.\n\n\"It looks like you're wearing glasses. Please remove them and deposit them into the bin. They will be returned once you have finished orientation.\"\n\nPardon? Cali removed her glasses without thinking but didn't give them away. She wasn't one of those people who could get along without them. She needed them.\n\n\"Glasses cannot be worn in front of guests. Some stages of orientation will take place in front of guests. Please deposit your glasses into the provided bin.\"\n\nA small drawer popped out of the wall. Cali still didn't comply, but at least she spoke up. \"I need these to see. I can't do orientation without them.\"\n\nQuiet. Then the drawer retreated.\n\n\"You have been registered for class 2 visual adjustment surgery. This will be covered in full by your Joyland insurance. You may continue to wear your glasses for the time being, but you cannot wear them within the guest facing areas of the park. Your surgery is to take place on May 27th.\"\n\nCali sat up. Surgery? What the hell? How expensive did that have to be?\n\n\"Now [Abbigail], is there something you would prefer to be called?\"\n\n\"My name is Cali.\" Finally.\n\n\"Cali is not in the registered database of authorized names within Joyland. Please choose another.\"\n\nCali blinked twice and finally put her glasses back on. There was a list on the screen now. Dozens of feminine names, most of which were too old to have a population these days, or at least a population without nicknames. Blessedly. Caroline was an option.\n\n\"Thank you for making your selection [Caroline]. Your employee profile has been adjusted. Printing ID card.\"\n\nThe same drawer that had tried to take Cali's glasses popped out of the wall again, this time with a single laminated card in the center. The name was right, but the picture was wrong. A dark haired mousey girl was staring back at Cali. Just when she was about to speak up, the screen shut off, leaving the cold room dim.\n\nCali grabbed the ID card from the drawer, and three of the floor tiles partially lit, creating an arrow telling her to go down the hall. She'd have to talk to someone about the ID card. Maybe Queen? Then again, Queen didn't really strike her as the HR type.\n\n\\n\\nWhen Queen had said she might see her later, Cali hadn't expected her that to be almost right away, that just wasn't the way the language worked. That said, it didn't look like Queen had expected her either.\n\nThat and it barely looked like Queen. Somehow within the last twenty minutes Queen had gone from barely morning put together to a prim and proper Joyland employee. Her color scheme had gone from black to emerald, her lips had gone from plain to ruby and if that wasn't a wig, Cali had to ask how Queen did it because she was clearly a wizard. There was also something else different about her, but Cali couldn't put her finger on it.\n\nCali made all of those observations from the door and Queen had been starting at the same time, looking just as confused even though Cali looked, by all accounts, exactly the same. \"They let you keep your glasses?\" She asked after too much time had passed.\n\n\"I'm signed up for surgery about them.\"\n\n\"Well, lucky you. That should be covered,\" Queen half motioned to her eyes as she spoke, the blue glow behind them had dulled and faded into the normal hazel of her eyes, \"but you won't have any implants. They don't like the look of them. They'll keep it to corrective.\"\n\n\"That's still more than I thought I'd get,\" Cali said. Now that she was done getting shell shocked by Queen's transformation, she looked around the room. Whomever had designed this place had somehow wrangled a perfect mix between dressing room and corporate office.\n\n\"You're here faster than I thought,\" Queen commented. She was looking through the top drawers of her desk now and Cali cocked her head at the search. This place had so many drawers, where were the tablets and displays that kept track of everything for you? \"Didn't have many questions for the machine?\"\n\n\"It kept calling me Abbigail.\"\n\nQueen tsked at the name and approached once she had pulled a small penlight from the drawer. \"Miss her.\"\n\n\"Abbigail?\"\n\n\"Yep.\" Queen shone the pen-light in Cali's eye, and she flinched. Once she'd flinched away the first time, Queen used her free hand to catch Cali's chin and hold her in place. \"Did you give it a new name?\"\n\n\"Caroline was an option.\"\n\n\"Lucky again.\" Queen shone the light in the other eye and Cali tried to keep it open. \"Carta wasn't. Parkside I'm Quinn.\"\n\n\"Quinn? Not Queen.\"\n\n\"Queen isn't a traditional name Cali.\" The girl pause, holding the pen-light in her teeth for a moment and using her hands to pulled Cali's hair back. On the way in, Queen must have had horrid posture because she had several inches on Cali now. \"They had Quinn, which was close enough. I used Cass for a while but once people started calling me Queenie I switched it.\"\n\n\"Do people change their names a lot here?\" Cali struggled to speak as Quinn swapped a hand back to her cheek now that she had Cali's hair in one hand.\n\n\"Often enough, but you see 'em everyday so it won't be an issue.\" Queen ran the penlight along each line of Cali's face and eventually frowned. \"You're not wearing a faceplate.\"\n\n\"No,\" Cali said, \"I could never afford one. Do I need one?\"\n\n\"Your skin should be fine as is, it's pretty clear. Acid wash should cover it.\" As Queen spoke Cali realized what was so 'different' about the girl in this room. On the walk in, the lines of Queen's faceplate had been clearly visible, they were covered now, synthetic skin smoothing out the hard lines. \"Do you have any replacement parts that will show in the uniform?\"\n\n\"I don't think I do.\" Cali tried to get another look at the Uniform up close, assuming Queen was wearing it. She'd only seen it online before. \"Just a couple cuts from a hospital visit when I was younger.\"\n\n\"What for?\"\n\nCali didn't answer. Silence waited for Queen to press or let it go.\n\n\"Long as the cuts are in the midsection you should be fine. It'll make your mornign routine earlier. I have to cover up a whole aug phase when I prep.\"\n\nCali still took a little too long to respond. \"So they aren't allowed to see your augs in the park?\"\n\n\"Joyland is the happiest place on the planet Cali. Nobody's too poor to afford proper treatment in there.\" Queen patted Cali on the cheek. Cali couldn't wrap her head around the tone Queen'd used for that, a soft of saccarine hatred. Whatever it was, Queen cooled for the next sentence. \"I'll get the requisition in for the salicylic in and we'll be good to go get you into a uniform.\"\n\n\"Okay.\"\n\n\"Down the hall to the right, I'll meet you there and we can get you sorted. Looking proper for your time in front of the guests.\"\n\n\n\n",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1ct38s5/wp_as_the_latest_employee_in_the_worlds_most/l49zmsq/",
        "score": 308,
        "date_posted": "2024-05-16 03:52:52",
        "subreddit": "WritingPrompts"
    },
    {
        "post_title": "[WP] The heist was going perfectly, right up until Jerry opened a portal to hell.",
        "comment": "When you’re making a plan, you never want to include the psyker. Sure, they have their uses, but the volatility is never worth it. Drills are loud, but they’re safer than the potential side effects of having a psyker open a path through the vault door.\n\nBut, sometimes the plan spirals out of control and a splash of magical blasphemy is exactly what you need. Replacing one person and some time with a psyker? Reckless and dumb. Replacing two squads and an entire Plan B with one? At that point, I could call it a calculated risk.\n\nThe risk was calculated, but the forces of chaos don’t give a fuck about math.\n\nReality shattered like glass, tumbling down the sides of our minds with a sickening crack as Jerry lost control of his power. He stumbled and a viscous liquid poured out of his mouth, drenching the floor before funneling into the broken shards and twisting the world to new dimensions.\n\nJerry, bless his soul, tried to cover his mouth, then tried to scream, but there were only gurgles.\n\n“What do we do?” Carmine asked from my left. She was pulling her bolter off her hip.\n\n“Fucking. RUN.” I answered and followed my suggestion. My two backward steps before spinning around gave me time to watch a clawed and scarred hand erupt from Jerry’s mouth and grab him by the eyes. I couldn’t see the rest, but I learned what someone getting pulled into themselves sounded like.\n\nAlarms blared across the ship, crashing into us before the eternal scream of Jerry’s last gasp crushed them to pace. The screams turned into tearing metal, and then to the cackling laughter of something nobody should ever perceive.\n\nThe overhead lights went red as the ship shot into lockdown, and a blast door down the hall started to close, several tons of metal moving inch by inch toward the floor.\n\n“Trau?” Carmine asked as we sprinted toward the closing door.\n\nI didn’t answer, I couldn’t risk the breath.\n\n“TRAU?” she asked again. The door was getting close to the floor, but we were so close.\n\nI dropped into a slide, barely making it under the door, my bag brushing against the closing metal as I rolled onto the other side. Carmine followed.\n\nHer hulking armor caught in the door. Metal groaned. I didn’t know if it was her or the door.\n\n“Shit!” I snapped to my feet, finding the panel on the left and reading as quick as I could. Carmine groaned. Then screamed. Then cried.\n\nI found the bottom to override the emergency closure, then my finger froze over it.\n\n“Trau?” she sputtered.\n\nI could hear them on the other side. The cackling. The screams. The tearing fabric of reality. The glow of an impossible colour bled out the crack Carmine’s body was forcing in the door.\n\n“TRAU?”\n\nThis door was all I had.\n\n“No no. Don’t do that. Don’t leave me like—”\n\n“I’m sorry. I don’t know what button it is and—” I lied and she started to scream as the door pushed her armor down into her spine.\n\n“Trau?” she whimpered.\n\nI ran. I ran from the door as it finally broke through and crashed down onto her. I tried to focus on the alarm and my footsteps to drown out her screams, but they kept getting louder and louder.\n\nI was sorry for everything I’d done. I was sorry for everything I stole. I was sorry for every time I’d lied. If I could just get out of here, I’d get onto the straight and narrow. I’d devote my life to—\n\nThe sound of twisting metal made me look over my shoulder back, just in time to watch a black claw wrap around Carmine’s soul and tear through her skin. The blast door hadn’t made a difference. I’d left her behind, and it hadn’t even bought me any time.\n\nI turned back to my path, cutting to the right to follow the path we’d taken in. I’d planning this heist from the start. I knew this ship like the back of my hand. The escape pods weren’t far now. I just had to get to one and then I’d be free. At least one of us would get out. That would have to be enough. It wasn’t like I could have saved her. It wasn’t my fault.\n\nNo matter how much distance I put between myself as Jerry’s mistake behind us, I couldn’t separate myself from the screams. They just kept getting louder. Despite distance. Despite logic. I should have gone deaf from the volume, but it just kept ringing in my head. The same hoarse voice layered over itself in suffering a trillion times. One for each soul. One for—\n\nI rushed into the escape pod as I found it, almost smashing into the far wall before spinning to find the controls. Military hardware was standard across the Milatarum, which meant my pre-desertion years were saving my life again.\n\nEight button presses and the launch sequence initiated. The door slammed shut, and the escape pod shook. A six second countdown to buckle down. I was ready in three.\n\nA deep breath. Shaking lungs and hands. I closed my eyes, but I could still hear the muffled screams through the escape pod door. The crew would have been trying to close the breach by now. But I’d be out of here. Then I’d need a new name, but there were plenty of those to go around if you knew the right...\n\nThe escape pod hadn’t launched. Dreaded words flashed on the screen.\n\nLAUNCH ERROR. BIO-ACCESS REJECTED,\n\nI unbuckled and shot up. I remembered the override codes, didn’t I? I just had to—\n\nThe door groaned.\n\nOnce I was in the submenu, all I needed was…\n\nThe screams were deafening again.\n\nJust one more second and...\n\nA fetid claw tore through the door and revealed the world outside. The shapes were impossible, but they were made of Jerry’s teeth and Carmine’s desperate tears.",
        "url": "https://www.reddit.com/r/WritingPrompts/comments/1bvwgkx/wp_the_heist_was_going_perfectly_right_up_until/ky3f0ye/",
        "score": 13,
        "date_posted": "2024-04-04 19:46:02",
        "subreddit": "WritingPrompts"
    }
]