[
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The prompt involves a humorous and unconventional scenario with extreme accountants, which requires a blend of action, satire, and character dynamics. The author's style emphasizes character motivations, historical context, societal issues, and vivid language, which will be crucial in crafting the Story Rules. I will ensure the rules reflect these elements while aligning with the prompt's themes of humor and heroism in the face of bureaucratic absurdity.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Begin the narrative by introducing the key characters, focusing on their motivations for either joining or opposing the White Collar Gang. For example, describe a hero like \"Max Ledger,\" who once worked as an accountant but now fights against financial crimes due to a personal vendetta against corporate greed.  \n  - Use a historical and educational context to frame the story, such as the founding of Emerald City and its financial institutions, to provide depth to the bank's significance. Mention how the bank was established during a \"gold rush era,\" symbolizing both opportunity and exploitation.  \n  - Focus on the community's practical concerns, such as the impact of the bank heist on local businesses and citizens, rather than the heist's technical details. Highlight how \"local shopkeepers fear for their savings,\" emphasizing the societal stakes.  \n  - Structure the narrative around the interactions between the heroes and the townspeople, showcasing their precarious position as protectors in a city that may not fully trust them. For instance, \"if the heroes fail, the city council might replace them with automated security systems.\"  \n  - Emphasize broader societal issues, such as economic inequality and the power dynamics between corporations and citizens, rather than focusing solely on the immediate conflict. Describe how \"the city's wealth disparity is laid bare by the heist, with the rich unaffected while the poor panic.\"  \n\n- **Creativity**:  \n  - Reinterpret the prompt by focusing on the personal histories and dynamics among the heroes and the gang members, rather than the heist's logistics. For instance, explore the backstory of a gang member who \"turned to crime after being laid off during a financial crisis.\"  \n  - Integrate a detailed history of Emerald City's development, focusing on its financial sector's growth and the coexistence of different economic classes. Describe how \"the city's skyline is a testament to both prosperity and poverty, with skyscrapers casting shadows over rundown neighborhoods.\"  \n  - Incorporate local cultural and societal elements, such as the city's annual \"Tax Day Parade,\" which adds a layer of irony and humor to the narrative.  \n  - Introduce unique world-building elements, such as \"the Ledger of Legends,\" a mythical book said to contain the secrets of financial success, which the gang seeks to obtain.  \n  - Use elements of anthropomorphism to depict the bank's dynamics, such as describing the bank vault as \"a sleeping giant, waiting to be awakened by the right combination of numbers.\"  \n\n- **Development (Character and Setting)**:  \n  - Develop characters through detailed backstories and interpersonal relationships. For example, portray a hero like \"Clara Balance,\" who struggles with her dual identity as a mild-mannered accountant by day and a vigilante by night.  \n  - Establish the setting through historical context and social dynamics, such as the bank's role in the city's economic history and its impact on different social classes. Mention how \"the bank's architecture reflects its storied past, with marble columns and gilded vaults.\"  \n  - Emphasize the city's architectural diversity and its impact on community dynamics, such as the contrast between the opulent financial district and the struggling residential areas.  \n  - Develop characters through their roles and interactions with the financial environment, such as a hero who \"uses their knowledge of tax codes to outsmart the gang.\"  \n  - Create an immersive setting by detailing the bank's interior, from the \"echoing marble halls\" to the \"intricate security systems,\" creating a vivid backdrop for the story.  \n\n- **Language Use**:  \n  - Employ a formal and descriptive language style to convey character insights and historical context. Use phrases like \"a city built on the dreams of many, yet owned by the few,\" to provide depth to the setting.  \n  - Use descriptive language to convey the gang's unsettling appearance and the community's reaction. Describe the gang as \"dressed in crisp suits, their eyes hidden behind reflective glasses, exuding an aura of cold efficiency.\"  \n  - Incorporate colloquial language and informal sentence structures to create a grounded, realistic tone during dialogue. Use phrases like \"the heroes knew they were in over their heads, but they couldn't just sit back and watch.\"  \n  - Use vivid imagery and sensory details to enhance the atmosphere, such as \"the clatter of keyboards and the rustle of paper echoing through the bank's halls,\" immersing the reader in the setting.  \n  - Use descriptive language to create a vivid sense of place and atmosphere, such as \"the bank's lobby, a cavernous space filled with the scent of polished wood and the distant hum of machinery.\"  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet to identify key storytelling elements across the categories of Plot, Creativity, Development (Character and Setting), and Language Use. I will then tailor these elements to the prompt about a sinking galleon, ensuring the narrative reflects the author's style while addressing the prompt's themes of survival, community response, and disaster management.\n\n### Plot\nThe author often structures narratives around character motivations, historical contexts, and community concerns. For the galleon story, the plot should focus on the townsfolk's motivations for saving lives and goods, the historical significance of the galleon, and the community's practical concerns about the disaster.\n\n### Creativity\nThe author creatively reinterprets prompts by focusing on personal histories and societal dynamics. In this story, creativity can be expressed by exploring the personal histories of the crew and townsfolk, and the societal dynamics of the town as they respond to the crisis.\n\n### Development (Character and Setting)\nThe author develops characters through detailed backstories and interactions with their environment. Characters in the galleon story should be developed through their roles in the crisis and their interactions with the sea and town. The setting should be established through historical and social context, emphasizing the town's relationship with the sea.\n\n### Language Use\nThe author uses formal, descriptive language to convey character insights and historical context, alongside vivid imagery to enhance atmosphere. The language in the galleon story should vividly describe the sinking ship, the circling sharks, and the tense atmosphere, while providing insights into the characters' thoughts and motivations.\n\nUsing these insights, I will create detailed Story Rules that guide the narrative development for the Writing Prompt, ensuring alignment with the author's style and the prompt's themes.  \n</thinking>  \n\n<story_rules>\n- **Plot**:\n  - Begin the narrative by introducing key townsfolk and their motivations for responding to the galleon crisis. For example, depict a character like Captain Elara, who is driven by a sense of duty to protect her town and its people, and a merchant, Tomas, who sees an opportunity to salvage valuable goods.\n  - Structure the plot around the historical significance of the galleon, perhaps as a legendary ship known for its voyages, which adds urgency and a sense of duty to the townsfolk's actions.\n  - Focus on the community's practical concerns, such as the potential economic impact of losing the cargo and the immediate threat to lives, rather than solely on the mystical or dramatic elements of the sinking ship.\n\n- **Creativity**:\n  - Integrate personal histories and dynamics among the townsfolk and crew. For instance, explore the backstory of a crew member who has a personal connection to the town, adding depth to their struggle for survival.\n  - Creatively depict the societal dynamics of the town, such as the roles of different community members in the rescue efforts, highlighting the town's unique culture and social structure.\n  - Introduce unique world-building elements, such as a local legend about the sea that influences the townsfolk's response to the crisis, enriching the narrative with cultural depth.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their roles and interactions with the sea and the town. For example, portray a fisherman who uses his knowledge of the waters to guide rescue efforts, and a town leader who coordinates the community's response.\n  - Establish the setting through historical and social context, emphasizing the town's longstanding relationship with the sea and its reliance on maritime trade.\n  - Create an immersive setting by detailing the atmosphere of the docks as the galleon approaches, using sensory details to convey the tension and urgency of the situation.\n\n- **Language Use**:\n  - Employ formal and descriptive language to convey character insights and the historical context of the galleon. Use phrases like \"a vessel of storied past, now a specter of its former glory\" to provide depth to the narrative.\n  - Use vivid imagery and sensory details to enhance the atmosphere, describing the \"roiling sea, a cacophony of crashing waves and circling predators\" to immerse the reader in the scene.\n  - Balance formal language with colloquial expressions to reflect the grounded, realistic tone of the townsfolk's dialogue, capturing their urgency and determination in the face of disaster.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The goal is to create rules that reflect the author's unique style while aligning with the narrative potential of the prompt, which involves a fleet entering enemy waters with a diverse crew led by a hawk captain.\n\n### Plot\nThe author often structures narratives around character introductions and motivations, historical contexts, and societal issues. For this prompt, the plot should focus on the diverse crew's backgrounds and their motivations for joining the mission, the historical significance of reclaiming the lost homeland, and the practical concerns of navigating enemy waters.\n\n### Creativity\nThe author creatively reinterprets prompts by focusing on personal histories and dynamics, integrating detailed histories, and incorporating unique world-building elements. For this prompt, creativity should be expressed through the unique backgrounds and dynamics among the crew, the history of the lost homeland, and the integration of magical and mythical elements like mages and wyvern riders.\n\n### Development (Character and Setting)\nThe author develops characters through detailed backstories and interpersonal relationships, and settings through historical context and social dynamics. For this prompt, character development should focus on the hawk captain's leadership and the crew's diverse backgrounds, while the setting should emphasize the historical and cultural significance of the lost homeland and the strategic importance of the enemy waters.\n\n### Language Use\nThe author employs formal and descriptive language, vivid imagery, and sensory details. For this prompt, language should be used to vividly describe the fleet, the diverse crew, and the tension of entering enemy waters, using formal and descriptive language to convey the gravity of the mission and the richness of the setting.\n\nWith these insights, I will craft detailed Story Rules that guide the language model in creating a narrative that aligns with both the author's style and the Writing Prompt.  \n</thinking>  \n\n<story_rules>\n- **Plot**:\n  - Begin the narrative by introducing the hawk captain and the diverse crew, detailing their backgrounds and motivations for joining the mission. For example, describe the hawk captain's past as a decorated naval officer and his personal vendetta against the Kichledai navy.\n  - Structure the plot around the historical context of the lost homeland, explaining its significance and the strategic importance of reclaiming it. Use the fleet's journey as a backdrop to explore these themes.\n  - Focus on the practical concerns of navigating enemy waters, such as the crew's preparation for battle and the challenges posed by the Kichledai navy. Highlight the tension and urgency of the mission.\n\n- **Creativity**:\n  - Integrate the personal histories and dynamics among the crew, such as the rivalry between the wyvern riders and Pegasus-mounted cavaliers, and the mages' unique magical abilities that contribute to the mission.\n  - Creatively incorporate the history of the lost homeland, detailing its cultural and economic significance, and how its loss affected the crew members' lives.\n  - Introduce unique world-building elements, such as the magical properties of the fleet's ships or the mythical creatures that inhabit the enemy waters, to enrich the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the hawk captain as a complex leader, exploring his leadership style, personal motivations, and the respect or tension he commands among the crew.\n  - Flesh out the crew members through their roles and interactions, such as a mage who uses their powers to navigate the fleet or a cavalier with a personal connection to the lost homeland.\n  - Establish the setting by emphasizing the historical and cultural context of the lost homeland and the strategic challenges of the enemy waters, using these elements to create a vivid and immersive backdrop.\n\n- **Language Use**:\n  - Employ formal and descriptive language to convey the gravity of the mission and the diverse backgrounds of the crew. Use phrases like \"a fleet poised on the brink of destiny\" to set the tone.\n  - Use vivid imagery and sensory details to describe the fleet's journey, the tension of entering enemy waters, and the magical elements of the narrative. For example, describe the \"crimson sails billowing against a stormy sky\" or the \"arcane glow of the mages' spells illuminating the deck.\"\n  - Maintain a balance between formal and colloquial language to reflect the diverse crew's interactions, using formal language for the captain's speeches and more conversational tones for the crew's dialogue.\n</story_rules>"
]