[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a setting on Hephaestus Station, a decaying space station, and introduces a diverse group of characters with potential for intrigue and conflict. The author's style is characterized by non-linear plots, character-driven narratives, surreal elements, introspective character development, and vivid language. I will create Story Rules that incorporate these elements, ensuring they are tailored to the space station setting and the themes of survival and ambition.  \n\nFor **Plot**, I will focus on non-linear storytelling and character interactions. For **Creativity**, I will blend omniscient and character-focused perspectives, incorporate surreal elements, and mix modern and historical details. For **Development**, I will emphasize introspective character development and vivid setting descriptions. For **Language Use**, I will use atmospheric language to create tension and employ a conversational tone with subtle humor.  \n\nI will provide examples inspired by the Evidence, ensuring they are relevant to the space station setting and the diverse group of characters.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:  \n  - Begin the narrative with a fragmented scene on Hephaestus Station, such as a dockworker witnessing a mysterious figure disembarking from the supertanker, before introducing the main characters in a non-linear fashion. Use disjointed timelines to create a sense of mystery and disorientation, reflecting the chaotic environment of the station.  \n  - Structure the plot around character interactions and dialogue. For instance, start with a conversation between a smuggler and a shadowy figure discussing a secretive deal, allowing their dialogue to reveal the stakes and tensions rather than relying on exposition.  \n\n- **Creativity**:  \n  - Use an unconventional narrative perspective by blending an omniscient view of Hephaestus Station with a focus on individual characters, such as a smuggler's internal monologue about their past and ambitions.  \n  - Incorporate surreal and abstract elements, like a recurring vision of the mined-out world below the station or a strange artifact found on the supertanker, to add psychological depth and intrigue.  \n  - Integrate modern and historical elements, such as a character using an outdated communication device amidst advanced technology, to create a unique and anachronistic setting.  \n\n- **Development (Character and Setting)**:  \n  - Develop characters through introspective details, focusing on their internal states. For example, describe a dockworker's anxiety about the station's decay and their role in the unfolding events, providing insight into their motivations and fears.  \n  - Use distinctive dialogue to reveal personalities and relationships. Craft exchanges like, \"You think you can trust them?\" \"Trust is a luxury we can't afford,\" to highlight the tension and alliances among the crew.  \n  - Establish the setting with vivid, sensory details. Describe the station's corridors with \"flickering lights casting long shadows\" and \"the constant hum of machinery,\" creating an immersive and mysterious atmosphere.  \n\n- **Language Use**:  \n  - Employ vivid and atmospheric language to create a sense of unease and tension. Use phrases like \"the oppressive silence of the void\" and \"the cold, metallic scent of the station\" to enhance the eerie environment.  \n  - Use a conversational tone with subtle humor to engage the reader. Include exchanges like, \"Another day, another credit,\" \"If only it were that simple,\" to add levity amidst the tension.  \n  - Use concise and impactful dialogue to convey character intentions and plot developments. For example, a character might say, \"The cargo isn't what it seems,\" hinting at hidden agendas and secrets.  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a mysterious and urgent scenario where survivors must make critical decisions as a creeping fog threatens their world. The author's style is characterized by non-linear narratives, character-driven plots, surreal elements, introspective character development, and vivid language. I will incorporate these elements into the Story Rules, ensuring they are actionable and tailored to the prompt's themes of urgency, survival, and mystery.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:  \n  - Begin the narrative in a fragmented, non-linear fashion. Start with a surreal scene, such as a character waking up in a disorienting environment, like a room filled with fog, before introducing the main action of preparing for the Loss.  \n  - Focus on character interactions and dialogue to drive the plot. For example, open with a conversation between two survivors debating what to salvage, using their dialogue to reveal the stakes and urgency of the situation.  \n  - Introduce the creeping fog, the Loss, through indirect means, such as a character recalling a past encounter with it or overhearing a radio broadcast about its approach, to build tension and mystery.\n\n- **Creativity**:  \n  - Use an omniscient perspective to describe the fog's approach, then shift to a character-focused lens, such as detailing a survivor's internal struggle with leaving behind cherished items.  \n  - Integrate surreal and psychological elements, like a character experiencing hallucinations or hearing whispers in the fog, to enhance the narrative's tension and mystery.  \n  - Blend modern and historical elements in the setting, such as survivors using an old map alongside digital devices to plan their escape, creating a unique and anachronistic atmosphere.\n\n- **Development (Character and Setting)**:  \n  - Develop characters through introspective details, focusing on their internal conflicts about what to leave behind. For instance, describe a character's emotional turmoil as they decide whether to save a family heirloom or essential supplies.  \n  - Use distinctive dialogue to reveal personalities and relationships. For example, have a character say, \"We can't save everything, but we can save each other,\" to highlight their pragmatic yet caring nature.  \n  - Establish the setting with vivid, sensory details. Describe the fog as \"a silent, creeping blanket that swallows the horizon,\" and the environment as \"eerily quiet, with only the distant hum of the Loss approaching,\" to create an immersive and foreboding atmosphere.\n\n- **Language Use**:  \n  - Employ vivid and atmospheric language to convey unease and tension. Use phrases like \"the fog's tendrils reaching out like ghostly fingers\" to enhance the eerie mood.  \n  - Incorporate a conversational tone with subtle humor to engage the reader. For instance, during a tense moment, a character might quip, \"Well, at least the fog doesn't charge rent,\" to lighten the mood briefly.  \n  - Use concise and impactful dialogue to convey urgency and plot developments. A character might say, \"We have sixty minutes. Grab what you can and run,\" to emphasize the immediacy of their situation.\n</story_rules>"
]