[
    "<writing_style>### Plot\n1. **The user often focuses on internal conflict and personal relationships to drive the narrative.**\n   - Example: In the story regarding \"Virginia Rothery's struggle with grief and faith after losing her daughter,\" the plot centers on Virginia's internal struggle with her faith and the memory of her daughter, as seen when she recalls Leslie's last moments and the decision against a blood transfusion. [1]\n### Creativity\n1. **The user frequently incorporates specific cultural and religious elements to reinterpret the prompt.**\n   - Example: In the story regarding \"Virginia Rothery's struggle with grief and faith after losing her daughter,\" the narrative includes the Jehovah's Witnesses' beliefs about blood transfusions and the symbolic use of cakes, which are not traditionally part of Virginia's life, to explore themes of belief and loss. [1]\n### Development (Character and Setting)\n1. **The user tends to create multidimensional characters with detailed backstories and emotional depth.**\n   - Example: In the story regarding \"Virginia Rothery's struggle with grief and faith after losing her daughter,\" Virginia's character is developed through her memories of Leslie's childhood, her relationship with her husband Roger, and her interactions with the congregation, providing a rich emotional landscape. [1]\n\n2. **The user often establishes intimate settings that reflect the characters' emotional states.**\n   - Example: In the story regarding \"Virginia Rothery's struggle with grief and faith after losing her daughter,\" the setting of the Rotherys' ranch house, filled with congregation members and memories of Leslie, mirrors Virginia's internal turmoil and isolation. [1]\n### Language Use\n1. **The user employs vivid and emotive language to convey character emotions and atmosphere.**\n   - Example: In the story regarding \"Virginia Rothery's struggle with grief and faith after losing her daughter,\" phrases like \"maple branches against the sky like cracks in a glazed plate\" and \"the sheets with their smell of husband\" use metaphor and sensory details to evoke Virginia's grief and the story's somber mood. [1]\n</writing_style>"
]