[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a character, Romi, who experiences a neighbor's tragic death and suspects it was meant to disrupt her life. This scenario offers opportunities for meta-narrative structures, escalating tensions, and intertwining past and present events, all of which are elements the author frequently employs. The author's style also includes gritty realism, layered storytelling, and vivid language, which can be used to explore Romi's internal turmoil and the mysterious circumstances surrounding the death. I will create Story Rules that incorporate these elements, providing detailed guidance and examples inspired by the Author Writing Sheet.  \n</thinking>  \n<story_rules>  \n- **Plot**:\n  - Frame the narrative using a meta-narrative structure. Begin with Romi writing in her journal about the neighbor's death, using this as a device to explore her suspicions and emotional unraveling. For example, Romi might write, \"In this new chapter of my life, the ink is stained with questions and shadows.\"\n  - Structure the plot around escalating conflicts and emotional tensions. Start with Romi's initial shock, followed by her growing paranoia and strained relationships with other neighbors. Culminate in a confrontation where Romi accuses someone of orchestrating the tragedy. Illustrate this with a scene where Romi confronts a neighbor, saying, \"I know you were there that night. What did you see?\"\n  - Intertwine Romi's past traumas with present events. Reveal her history of anxiety and how it resurfaces with the neighbor's death. Use flashbacks to show moments of past instability, such as, \"The last time I felt this way, I was standing in the ruins of my first home, watching it burn.\"\n\n- **Creativity**:\n  - Integrate multiple layers of storytelling by having Romi imagine different scenarios of the neighbor's death, each reflecting her fears and suspicions. For instance, she might envision a scenario where the neighbor was pushed, adding a layer of mystery: \"In my mind, I see a shadowy figure, a hand reaching out, a scream cut short.\"\n  - Employ a gritty and realistic approach to Romi's internal turmoil. Use raw language to describe her descent into paranoia and the societal pressures she feels to maintain her perfect life. For example, \"Every whisper in the hallway feels like a dagger aimed at my sanity.\"\n  - Introduce a fantastical element through Romi's dreams or hallucinations, contrasting with the grim reality. Perhaps she dreams of the neighbor warning her of impending doom, adding a surreal touch: \"In my dreams, she stands at the foot of my bed, her eyes pleading, 'Beware the cracks in your foundation.'\"\n\n- **Development (Character and Setting)**:\n  - Develop Romi's character through her creative expressions and personal struggles. Show her using art or writing as an outlet for her anxiety, revealing her complex emotional layers. For example, \"Romi's sketches of the apartment grow darker, each line a testament to her unraveling mind.\"\n  - Use interactions, internal monologues, and personal histories to reveal Romi's character depth. Highlight her interactions with neighbors and her internal dialogue about the death, such as, \"I can't trust them. I can't even trust myself.\"\n  - Create a vivid setting that reflects Romi's emotional state. Describe the apartment as both a sanctuary and a prison, with details like, \"The walls, once a comforting white, now seem to close in, suffocating in their silence.\"\n\n- **Language Use**:\n  - Use dialogue and internal monologue to reveal Romi's emotions and relationships. Capture her paranoia and suspicion through conversations with neighbors, like, \"Why do you keep looking at me like that? What do you know?\"\n  - Employ colloquial and candid language to convey Romi's emotional state and the story's tone. Use phrases that reflect her raw emotions, such as, \"This place was supposed to be my escape, not my nightmare.\"\n  - Use vivid and emotive language to convey Romi's internal conflict and urgency. Describe her growing desperation with phrases like, \"Every creak of the floorboards is a countdown to my breaking point.\"  \n</story_rules>"
]