[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories. The author’s style is characterized by a focus on internal reflections, bureaucratic absurdities, satire, and vivid language. The Writing Prompt involves a writer trying to please his mother with a children's story, facing her sharp critique and demand for a happy ending. I will incorporate the author's style by emphasizing the writer's internal struggles, using satire to highlight the absurdity of the situation, and employing vivid, humorous language. The character development will focus on the writer's interactions with his mother and his internal monologue. The setting will reflect the writer's chaotic creative process.  \n</thinking>  \n<story_rules>  \n- **Plot**:\n  - Structure the plot around the writer's internal reflections and frustrations as he attempts to craft a children's story. Focus on his internal monologue about the challenges of meeting his mother's expectations, such as questioning, \"Is a happy ending really just a formulaic conclusion, or is it the ultimate test of a writer's creativity?\"\n  - Incorporate a series of failed attempts to write the story, using humorous and absurd elements, like the writer's computer crashing every time he types \"happily ever after,\" to highlight the ineffectiveness of his efforts.\n\n- **Creativity**:\n  - Employ satire and irony to reinterpret the prompt, highlighting the absurdity of the writer's situation. Use humor, such as the writer's mother suggesting that \"dragons should be more environmentally conscious,\" to emphasize the unrealistic nature of her demands.\n  - Use metaphors and analogies to explore abstract concepts, such as comparing the writer's struggle to find a happy ending to \"searching for a needle in a haystack made of rejection letters.\"\n\n- **Development (Character and Setting)**:\n  - Develop the writer's character through his interactions with his mother and his reactions to her critiques, emphasizing his frustration and helplessness. For example, show him nervously presenting his draft, only to receive a list of \"improvements\" longer than the story itself.\n  - Highlight the writer's creative environment, portraying it as chaotic and cluttered, with stacks of children's books and crumpled drafts, reflecting his tumultuous creative process.\n\n- **Language Use**:\n  - Use vivid and humorous language to create a satirical tone, enhancing the narrative's engagement. For instance, describe the writer's workspace as \"a battlefield of ideas, where every crumpled page is a fallen soldier in the war for a perfect story.\"\n  - Employ a conversational and introspective tone to convey the writer's thoughts and interactions. Capture his internal dialogue with lines like, \"Why does every fairy tale need a prince? Can't a frog just be a frog?\"  \n</story_rules>"
]