[
    {
        "game_pid": "kw6pzv",
        "story_name": "Give me your tired, your Poor",
        "post_title": "World War I has not yet erupted, but the Earth is most definitely rumbling as the Spirits, children born at the dawn of the century, travel Europe with the Circus Europa. The circus is really a training ground for future heroes, but they may be called to act far sooner than their trainers realize.\n\nIn every town they've visited, there is almost a constant angry murmur among the poor; stepped on and squashed for far too long, feeling forgotten by the more fortunate.\n\nAnd unfortunately, the Spirits are not the only ones active across the world. Shadows are also preparing to drag the world into a darker time. \n\nOn the stage, in the streets, and even in the homes of those both rich and poor, the Circus Europa will battle  a hawkish faction of villains, aided by Shadows, to battle for the hearts, minds, and futures of the continents' people from all walks of life.\n\n======\n\nThis game is set at the eve of WWI and your characters are tween born on January 1st, 1901s. This game should have the feel of a children's action movie with a healthy bit of intrigue thrown in. Despite the serious content with some social commentary that is likely to come up, this is not a game with graphic violence or adult themes.\nPlayers will take on the roles of one of thegifted children and use their talents, with the others, to thwart  the plot that threatens Europe even before WWI rears its ugly and destructive head.\n\nThis game takes inspiration not only from the \"young Centurions\" game world, but also will draw a few themes and plot elements from \"Poor Folk,\" By Fyodor Dostoyevsky though loosely enough that no knowledge of the story is necessary, or even helpful for the story.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2019-12-25 00:13:44 UTC",
        "comment": "The Circus was headed into Marseilles, and the port city looked like it could really use the cheer of a circus. The city was an industrial center and clouds of smog filled the skies, giving the sky a nasty brown color, or at least orange on a good day.\n\nThe market square, at the center of the harbor district would be the site of the performances for the next 4 days. It was hard to figure out how long the circus would be at any one point. The children had spent only 18 hours in Lyons and then for some reason, squatted down and put on full performances for 3 solid weeks in a little town in wine country that had fewer villagers than could possibly have been profitable. The circus staff on that stop had actually more than doubled the town’s population. \n\nBut you didn’t question the manager on such things .Menindez made you afraid to ask about what was going on, except in the odd cases where he got mad if you didn’t. It was hard to peg “Old Ed,” as a couple of the English and American performers called Eduardo Menindez, the grizzled 65-year-old manager who could pass for 45 most of the time. He was the real one that kept the circus running, but even in business affairs, he usually used the ring mistress, Clara Poe, an American who did triple duty as public face of the Circus Europa, Ring Mistress, and trick shooter.\n\nThe little Dark-haired woman of about 40 was sometimes called “clair’pow” playfully by many at the circus, and the name was used when there were enough English people in the crowd to like the onomatopoeia. Even when she wasn’t doing her act, she carried a number of guns on her person, most of them with flashy ammunition or even comical attachment or noises involved, because her act was often quite comical.\n\nBut as they looked at the harbor, there was the mix of people that had made Marseilles a hotbed of activity, both good and bad, since pre-Roman times. As a Mediterranean port, the city was part of the known world since before writing, and people from Africa, Asia, and all over Europe had gathered there for trade, intermingling, and at times, violence. \n\nClara had announced that morning that England had changed its tune again and now was praising Germany to the heavens. Unfortunately, Germany had just decided that France was its closest ally. The circus had learned from her reports that the uneasy situation between the three countries changed almost every couple of weeks, though it was becoming more unstable.\n\nBut life went on in Circus Europa, and the brilliant performing children were still at work preparing for the afternoon’s performance.\n\nWhether they worked in the sideshows, or would be in the center ring, the kids always had extensive training exercises each day and although they were paid and treated well, they were worked hard as well.\n\nNow each one was putting the finishing touches on preparing what they would do today."
    },
    {
        "game_pid": "a6a7bd",
        "story_name": "The Myth of Footprints",
        "post_title": "The hunters have protected the few remaining city-states nestled in the wilderness  for untold ages. But recently, the titans, creatures of immense power and size seem to be appearing out of nowhere in some of the largest cities, killing hundreds before they are brought down. Not only are many dying, but many are going missing. \n\nThe hunters can kill the beasts most of the time, but this is merely reaction and it isn't going to stop the problem. The hunters and their teams are charged with finding out how the titans are entering the cities undetected, appearing from nowhere despite their truly enormous size.\n\n=======\n\nThis game largely uses the gargantuan world as is, except in addition to the action component, it has a strong mystery element and the heroes are going to learn a lot about both the wraiths and the titans in their search to end the destructive ambushes.\n\nThis game combines the gargantuan kickstarter world with aspects of the classic Annie Hanes mystery novel \"Who Killed Charmian Carslake\" though no knowledge of the book is necessary or even helpful to play the game as the connection is only very loose and Annie Hanes herself wouldn't recognize the similarity of the planned plot if it weren't pointed out.\nAlso, the hunters will be in more urban environments more often in this story because of necessary socialization to solve the mystery and also the strange sudden appearances of the titans in large cities.\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2018-11-12 00:27:00 UTC",
        "comment": "Shlossheim was one of the Northernmost cities in the known world. It had longer winters than almost anywhere else and as the hunt strolled down the wide center street, it was clear that the locals built their city with this in mind. Even though Schhlossheim was not a city accustomed to war, homes were build like little stone fortresses, or rather, little ceramic fortresses as many of the chimneys had ceramic tiles about them, to make sure they retained the escaping heat from inner fires. Each of the hunting party had experienced the large ceramic stoves and how effectively they heated a room as well as they had been put up for the past 3 days by the townsfolk. \n\nTitans carved out enormous territories, and yet the many beasts of the colder North did not go anywhere near this city. It had been that way in Capulan, Storp, and Gilgrim as well right before the sudden appearances of some of the most powerful titans the hunters had seen in a long time. What was more was that the titans weren’t any of the many hundred that were known, and many had died, not only of the hapless populace, but even the hunters when they arrived as the bizarre powers of the beasts proved to be nasty, and lethal surprises for everyone involved.\n\nThey were searching for evidence of titan territorial markings, the presence of nearby titans, or even simply a sighting, but if something didn’t happen soon, they were probably going to be expelled from the town, it wasn’t safe to have beacons around, and hunters, two of them no less, were even worse.\n\nThe hunters in question, two younger men, hadn’t received the same dignified treatment the others had and stayed with a young surgeon named Hamon, along with his mentor. It wasn’t a game, hunters were no less dangerous than the titans and a surgeon needed to be ready at all times to quell the influence of an acrimonious wraith to make sure the hunters behaved themselves. Hamon had been told he had to deal with only one wraith, so the fact that he was dealing with two hunters definitely surprised him.\n\nHe worked twelve-hour shifts with a colleague and they were never more than 10 feet away from the young men, and as for the young men and their wraith, they might have chafed at the tight control, and if they were chafing, some of that was definitely due to their own inner demon, who was urging them constantly that they wouldn’t enjoy themselves unless they ditched the wet blanket surgeons.\n\nThe others however, had a rare bit of comfort with local families and were given free room and board wherever they decided to stay. The Huntmaster would soon have to deal with the mayor, and the beacons were simply to take brief constitutionals around the streets, just in case some invisible titan was watching. There had been invisible titans before, and maybe that was the secret of the sudden attacks on the cities. Even so, the hunting party had a definite break from hardtack and jerk meat and the many annoyances of the road."
    },
    {
        "game_pid": "pe1py9",
        "story_name": "Dirt Road Detectives",
        "post_title": "The town of Thatchington Tennessee is a farming community with no real claim to be a town. Just miles and miles of adjacent farms, a gas station, and a Mom and Pop store. \n\nBut there is more to Thatchington than there seems to be, and there is a dangerous criminal hiding among the fields and farms, more of a drug trade than people would like to admit, and the inherent ugliness that is hiding just below the surface of southern hospitality. \n\nBut there is too much involvement in the normal humdrum life for most to notice, it is up to a lot of outdoors types to uncover the dangers lurking in this community. \n\n========\n\nThis adventure story is based on the Edgar Walace sensational crime story \"The Runaway Tramp\" and is an adventure mystery story taking place in rural farmland with adjacent forest.  It is likely to adopt some of the tone from sensational detective fiction of the 1920s and will probably embrace some of the tropes. no knowledge of the original source material is necessary or even helpful.\n\nCharacters should be comfortable outdoors or have at least a connection to them and will probably spend a lot of time outdoors, even in between scenes, overnight, or in bad weather.\n\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2018-08-06 20:24:59 UTC",
        "comment": "Pines, Pintoaks, and willows grew in abundance along the narrow blacktopped path through the October Natural forest. A Truck sat on it’s side, tipped over from a turn that was taken just a little too sharply by a man who had thought about taking a shortcut along a narrow road. \n\nBehind it, with the front end smashed a bit was a schoolbus from Thatchington High. The driver had been far too confident and had been riding right up the back of the semi.\n\nThis could’ve been the siteof a tragedy, but miraculously, nobody in either of the vehicles was hurt beyond a slight bruising of maybe an arm or leg. \n\nA trucker  sat to the side of his ruined machine, waiting for when he could get his wet goods out of sight in this dry county. If he knew more than just the forest rangers were on the way, he’d be more worried. Because parts of the forest were considered to be part of Thatchington just as some Tenessee cities were seen as being partly Kentuckian, the local police would need to look into this as well.\n\nThe bus had been carrying some students from the high school who had been found to be too gifted to be cooped up in the building. A young teen from DC was one of these as the Tenessee schools were not particularly good and so most of what they were teaching her she had learned effectively years ago. It was either working in the forest or farm work. She’d get a little of that too before she made her final decision on what intern program she wanted.\n\nAnd even though the farming sneak peak was next month, a farm worker or too had also come to the forest on their own account. Elk and more kinds of White-tailed deer had been reintroduced a few years ago, but without the reintroduction of any predators larger than coyotes with the paranoid fear of wolves or a larger bear population, the Deer had bred like only deer could and the animals had made nuissances of themselves in Thatchinton’s fields. Overpopulating in the forest and thus streaming out of it in search of food every sunset and sunrise. Hunting was not only approved of in this town, it was considered a duty. Without hunters keeping their numbers low, every orchard and field in the town was at risk. Many of the deer and elk even had multiple hunting seasons per year, so many farm workers came in for trophies and venessin when they could.\n\nAnd in the shadows, the October Dryad watched. The Law knew there was some young lady squatter in the forest, but there were tales among the young and/or stupid of some maiden of the forest, some saying she was an indian, others, a criminal, and still others, what the sasquatch was really like. What exactly she looked like even the law and rangers couldn’t say, other than the forest was peppered with little improvised shelters, small animals were shot with crude arrows obviously not from any store, and little female footprints were always near the water.\n\nAs for the Dryad herself, she had to come closer to this road more often, either it was a mine or something new, but some of the streams she knew about were no longer safe to drink."
    },
    {
        "game_pid": "1da9sg",
        "story_name": "Cracking the Kichledai's Egg.",
        "post_title": "Alissandra is a realm of floating waterways and floating islands called aviaries. The battles over them remain fierce as the high-tech, owl-like beings known as Avarians, of the Kichledai have captured and held many lands. \n\nIt is time to take some of that back. A Hawk commander has convinced the Skyriver Republic to launch an attack on the Bronze Egg, a well-guarded Kichledai base but one that will give safe acess to much of Alissandra for the republic and others if the Avarians can be driven out. \n\nNow it is up to you, a group of sailors in the Skyriver republic’s navy to take and hold the base to put a serious halt to the Kichledai’s plans of expansion and conquest, while also giving the Hawks a small bit of their ancestral home back.\n\n\nThis is a naval warfare game in a fantasy world with steampunk elements, even though the naval battles will take place  on bodies of water suspended miles in the air by unknown forces. There will also be airships at least once. \n\nThis game was inspired by the Alissandra world I created on “AI Dungeon”\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2022-08-02 18:45:03 UTC",
        "comment": "The fleet knew they’d be seeing the Kichledai navy soon. They were approaching their waters, and the  target would come into sight within a few days. \n\nThe river was wide here, and so the ships moved several abreast, with no real risk of any of the ships crashing down beyond the misty edges of the bedlless rivers. Some merfolk ships  hung in the river, their pontoon roofs holding the cage like frames below. \n\nWyverns squawked furiously. Though the creatures were definitely draconic, they had the personalities of foul-tempered birds of prey, but their winged-elven handlers worked to  keep the fragile trust that made their cavaliers, and the small dragons themselves major weapons of war. \n\nOn a couple decks, Pegasus nostrils flared and the ears of the gentler of the two flying mounts of Alissandra always swiveled towards the wyverns, which were notably a threat to them if one got loose and it was hungry enough. \n\nBut the rivers had meandered close enough to Goldfinch Isle, and the drifting aviary was always near the junctions of three major rivers. \n\nAs  cannon wheels squawked as they were wheeled into position, and the smell of petrichor rose as the handful of mages warmed up, or used their magic to adjust the wind or the currents for the sails, a bright yellow hawk, the Skyriver captain who had convinced the republic  to authorize this bold move against the  Kichledai’s Avarians was ready to address the fleet.\n\nPilklik was generations removed from the times when the Hawks had any territory in  Alissandra, but the oral traditions were strong among the hawks, and their hatred of the Avarians, and the Kichledai itself united the creatures that tended to work as mercenaries now. \n\nPilklik knew the power of money, and also how much the Skyriver Republic loved it. Gold Finch Isle was an aviary on the edge of Kichledai territory and capturing it would open up a much better trade route. It would also be the first step the hawks would take to get their home back. \n\nPilklik, a tall yellow-feathered hawk with taloned hands and looking like an enormous humanoid golden eagle, signaled to his wind and water mages. He would address the entire fleet.   He lifted his large, taloned hand, and clacked the claws a couple times.\n\nThe ships became engulfed in a fog, the moisture would make sound carry well, and the winds would blow his message well among the fleet. \n\n“I am honored to work with the Skyriver Republic on this undertaking,” Pilklik began, his beak clacking loudly on some of the hard consonants. \n\n“The Kichledai have made us take the long ways around the river webs,” He began, “Many of you are probably from merchant families,”\n\nPilklik knew that only a few of the people here gave a flying frigate bird about the hawk homeland, so he knew he would only mention it briefly. \n\n“I’m doing this to reclaim my legacy,” He said, “But what you can get from it is cutting your time in half between Turtlefurt, Bat cove, and, North Ebbspan.”\n\n“Many of you will be hailed as heroes when this is done, by hawk and Skyriver citizen alike,” Pilklik said, “I don’t know who, and I don’t know whether I will lead all the way through, but there will be legends written here on this expedition.”\n\nSeveral heard Pilklik’s words, and as the fog cleared in an instant\n\nEach prepared to enter enemy waters."
    },
    {
        "game_pid": "smrj8m",
        "story_name": "A Brief Return.",
        "post_title": "Humans, Elves, Dwarves, and their kind have been gone from the world a long time. Each of those races had wondered what would happen if the monsters that lurked in dungeons, forests, and the forboding snow-capped mountains ever took their lands. \n\nIt turns out, that the \"monsters\" largely formed societies much like those of the \"good races\" though of course, these societies were much more cosmopolitan. Schools were formed, cities built, and nations emerged.\n\nWhat the monsters never understood was why the ancient races of humanity, elvenkind, smallfolk, fairies, and their like vanished in the first place, literally overnight if the legends are true.\n\nWhat is even more astounding is just as swiftly as they vanished, those folk are back, seeming to not even know that time has passed.\n\nIt is up to some monster children to unravel the mystery from their school, and perhaps stop something far bigger even than what made several races vanish from the world entirely all those years ago. \n\n==========\n\nThis story is supposed to be a somewhat family--friendly story of fantasy monsters saving the world from an incideous and horrific evil. The concept is somewhat inspired, though very loosely by Paul S. Kemp's \"Shadowbred.\" \n\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2017-10-24 20:02:15 UTC",
        "comment": "Chapter 1: Creatures of Myth\n\nIt was a late winter day as several students were led from the confines of the Deken Academy, the local school dedicated to teaching the children of the community all the necessary learning to become productive adults in the town of Freln, were  towards the city hall. Today was the aniversery of the founding of the town, over 1200 years ago. Students as small as kobolds and as large as giants marched through the streets, along buildings of equally varying size.\n\nThe students learned that when the town was first built, all buildings for one size of creature were put all in one place, putting the space work as efficiently as possible for the community. Studies had been made on the different rates at which races reproduced and so allowance was made for expansion, but problems had emerged. \n\nThe separate neighborhoods created cities within Freln where the smaller monsters had formed into a hostile camp against the larger and the early community had almost been destroyed in an early city-wide riot as the big warred against the small. \n\nThe solution was that all races would be put together, with dragons living next door to goblins and shops for spriggans sitting next to shops that served ogres. It admittedly made the city look a little strange, and sometimes even ugly, but with lanes on the cobblestone streets for different sizes and all monsters coming into contact with all the others every day, the community was extremely peaceful.\n\nThe lesson today was a history of Freln and its place in the Nation of Duril, but it wasn’t the same lesson for all. The young ones would see a play put on by a childrens’ theater about Freln, while the older students, who would appreciate the significance, would tour the small museum at the Freln City hall.\n\nEach Student had their own thoughts about what history was worth, but what they saw as they approached the large square in the center of the town, in front of the strange building that was built in 3 wings of very different sizes  made it difficult to think of Frelnian or Durilian history.\n\nThere was a crowd of gawking monsters looking over a crowd of strange creatures in the center of the square. There were rumblings and babblings as each monster who was already there discussed the impossible happening.\n\nIn the center of the square, there were several dozen creatures that were all but mythical, not that their existence had ever been doubted, but nobody thought they would ever be seen again.\n\nThe children gazed upon elves, dwarves, humans, and several others for the first time, and most of the adults were in exactly the same position.\n\nThe mysterious beings looked frightened, angry, or just confused as they felt the eyes of all manner of creatures upon them, their grey or white skins creased with worry, their eyes, usually black or grey stared with horror or amazement about them, and most of them didn’t even cast a shadow in the cold, but brilliant light of a winter sun. \n\nWhat was strangest about them was their utter lack of color. Even crude illustraitions of them showed them to wear bright colors and have brightly colored eyes, and sometimes even hair. Some humans and elves wer pale, but they had some color to their skin where these looked like paper.\n\nThis was far more of an event than the Frelnian museum."
    },
    {
        "game_pid": "mk0mv6",
        "story_name": "The Z-Listers: A Storium Beginners game with 3 scenes.",
        "post_title": "A Massive cosmic entity threatens the east coast, bringing a threat completely unlike anything the world has ever seen. Furthermore, the world's most devious villains and most fiendish masterminds have joined this unfathomable being of evil. \n\nBut this story is not about that conflict and you are not those legendary heroes. who have joined the fight against it.\n\nThe west Coast city of Emerald City Oregon used to be a hotbed of super-powered activity, but now, only the most pathetic and inept heroes and villains remain. \n\nThe players take on the incompetent or pathetically weak Z-list heroes, and must defend Emerald city from equally inept and powerless villains.\n\n=====\n\nThis game is meant to be a comedy superhero game in the style of Saturday morning cartoons. and it is meant to help teach beginners how to play Storium in a simple 3-scene short game.\n\neach scene will be narrated by a different member of the Storium Arc podcast.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2020-02-22 01:17:57 UTC",
        "comment": "The reconverter of planets had just been seen flying past Pluto. The heroes of the world had thought they had had more time, but they all had finished school before Pluto stopped being a planet and so they had bargained that the horrible evil would start with that little ball of ice and snow, since it was o fun to eat snow and all. \n\nThe creature had called out to the worlds’ villains too on social media, but some of the messages were blocked because of those pictures those handful of villains posted and several never heard about the big opportunity. \n\nEven so, enough had heard the call, and the heroes and villains from all over the world, and rushed to Washington, where all the big things happened, except for government to fight the menace, or join it. \n\nBut some had to stay behind in the superpowered city of Emerald City Oregon. Some were deemed not ready, some knew that home needed protecting, and some just couldn’t afford the bus fares. But anyway, there were a few heroes and villains left in the city, which grew quiet and peaceful with fewer flying cars, especially the non-flying kind, and volcanic eruptions blasting up through cracked sidewalks caused by all the frequent hero fights. With the relative lack of massive destruction, insurance companies were sending accessors to see if they could do business in the town again. \n\nUnfortunately, the peace could not last, the villains that were her were regrouping and one of the villain teams made their move on the second National bank of Emerald City. Nobody knew what had happened to the first one.\n\nA door flew off its hinges and 2 men and 2 women strode into the bank holding clipboards.\n\n“All right everyone!” The big man in front shouted, “This is an audit! Everyone in the bank get out your sails receipts, tax returns, and business ledgers, Now!”\n\n“Don’t make me use this clipboard in a bad way! You hear me!?” The man shouted angrily, waving his ledger about, “We’re going to make sure you are FDIC compliant, and if you know what’s good for you, you’ll cooperate.”\n\nThe four were the infamous “White Collar Gang” the most dangerous extreme accountants in all of the western United States, and they were aiming for the whole country, but the Wall Street Fat Cats were still far more successful.\n\nThe leader was the infamous accountant, N. Triplicate, who had the unique ability to split into three musclebound hulks, but only when he held his clipboard of power.\n\nNext to him stood the mysterious Executrix, wielding a pen knife and a letter opener and taking up a martial arts stance. Her face was swathed in bandages as in her first fight, a hero sent her crashing through a glass ceiling. Rumor had it that she was actually the brains of the outfit, though not the voice.\n\nBehind them stood the Pink slip twins; two deadly siblings who ran a firm in Russia. However, they were forced out of their company and came to America to take up a life of crime. Downsize and Fired (Alexandra and Pavlov Ladolf respectively,) Each wielded a supply of deadly pink cards. Downsize could shrink people to the size of paperweights and fire caused people to ignite when she struck them with one of her own slips. However, they were still accustomed to their own business lives and were only competent throwers from a sitting position behind a desk. \n\nThe Ladolf twins sought out their position, and a banker hit the alarm, hoping there were some heroes in the area to come and save them from perhaps hours of tedium."
    },
    {
        "game_pid": "jvtgrj",
        "story_name": "Role of a Lifetime",
        "post_title": "Moonhand Studios is one of the big names in the B-movie business in Hollywood. Even though they rake in the money, they've always specialized in low-budget, but strangely popular cheesy fantasy flicks.\n\nThey even get big names in their tiny pictures and among the biggest was the actress Alistrael Goh, a French actress who was roped in to play the female lead in their latest film, \"Mirrorblade.\" \n\nBut the filming was tough, and strange accidents have plagued the filming since it started, always when Alistrael was on the set.\n\nAnd now she's been found dead in her trailer from a heavy blow to the head.\n\nBut yet more accidents have continued as they have continued with the show, and now it is up to the cast and crew, along with the police to find out who killed the actress, and why the not-so-harmless accidents continue.\n\n======\n\nThis game is loosely based on the 1920s Annie Hanes mystery novel \"Who killed Charmian Carslake.\" and the story is a murder mystery that might develop into a serial murder mystery as time goes on. However, this is not a violent game nor is it supposed to invoke horror. It is meant to invoke the popular pulp mystery fiction of a century ago, much of which still survives in modern mystery fiction.\n\n\n\nIt is also supposed to invoke, somewhat lightly some of the Hollywood culture or popular images of it.\n\nNo knowledge of the original work that inspired this game is necessary or even particularly helpful. so just come in with an idea you are playing a mystery game in Hollywood and you are fine.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2018-11-26 20:02:18 UTC",
        "comment": "“BB!” Called a nerdy young woman, clothes stained with grease from working on the pyrotechnic equipment, “We can’t hold this stuff up much longer.”\n\n“To make the purple flames you want, The chemicals can’t sit out much longer, we need to get Miss Goh out here for the scene or we’ll run out.”\n\nBenedict Boatwright, called Ben by his friends and BB by everyone else ran his fingers through his black hair. He wondered where Alistriel could be. He also wondered why he was the only black man on set, but that was a bigger question for another day.\n\nMoonhand had treated him with a respect other studios hadn’t and had given him free license with Mirrorblade, which would finish filming shortly. It had been one hell of a filming though, and that someone wasn’t dead yet was a miracle with everything that had happened.\n\n“We’re running out of time,” The skinny, grease-covered woman said, digging into some equipment.\n\n“Send someone to Get Goh,” BB Said, “Chea.”\n\nA director’s assistant soon joined him, “Yes BB?”\n\n“Go and Get miss Goh,” He said, “And stop and get Kirkland as well, Alistrael got slashed by a dragon a few days ago and still needs to have a couple scratches and she can paint ‘em on.”\n\n“Right away Sir,” Chea said, nodding her brown head and sprinting, “She’ll be here within half an hour.”\n\n“Make it a quarter!” called BB “She  can quickchange, and she’s late already. She’s not paid to stare at herself in a mirror! She’s here to lead in Mirrorblade.”\n\n“Now you…. Miss,” He trailed off speaking to the Pyrotechnician, Trying to read her nametag.\n\n“Owen Sir, Erin Owen,” She said, “of Scarecrow Pyrotechnics…”\n\nShe realized she was babbling and corrected, “but you can call me Erin if you want.”\n\n“I don’t Miss Owen,” He said, “How much of the violet flame do we have left.”\n\n“Aside from this sir?” She asked nervously.\n\n“Yes, since we’ll be using that soon,” BB answered.\n\n“Probably enough for 3 more blasts,” Erin replied, “We’ve wasted over half of it waiting and having it go bad.”\n\n“Can you get more?” He asked.\n\n“Maybe, but not quickly, It’s only made in Italy Sir,” Erin replied.\n\n“Can you improvise anything.” He asked again sharply, his annoyance at the possibility of running short in the chief action scene of the movie.\n\n“Maybe….” Erin thought aloud, “We know how to make something magenta or lavender but it wouldn’t have that murky look you said you wanted.”\n\n“Damn! Then where is that woman, We’ve been waiting hours.” He said \n\nChe came running back, her  brown hair  set off by her sudden palor. Her eyes were wide but she was doing everything she could to master whatever her fear might have been.\n\nShe plowed right into BB, nearly knocking him over but he steadied them both with a quick push. \n\n“Get everyone in the trailer park,” Chea said urgently, “Don’t let anyone leave.”\n\nBB looked around, still not seeing the platinum blonde who had been the intended draw for Mirrorblade. \n\n“Where’s Goh!” He asked, wondering what the answer would be. He expected something bad.\n\n“She’s in her trailer, and she’s dead.”\n\nThat was worse than what he thought. \n\n“Get everyone there and call the police,” BB said, “And notify Mr. Moonhand that if we’re not going to lose everything, we’re going to need some  fast writing.”\n\nThis movie, despite being 2nd-rate, would make 1st-rate bucks like everything else both he and the studio as a whole touched. But there was a dead woman to tend to and something  had to be done. He let out an announcement that everyone on the premises was to gather in the trailer area immediately."
    },
    {
        "game_pid": "wp3cv5",
        "story_name": "Church Mouse",
        "post_title": "\"The Moushole\" is one of the worst neighborhoods in  Rootgold, a large Midwestern city in the heart of America. Life is hard in the Mousehole  and it is where all of Rootgold's poor live. Life in this part of the city is hard, rough, and frequently tragically short. But just like rats and mice themselves, there is tenderness and love, even here.\n\nThis is the story of one of The Mousehole's many residents, deeply impoverished, just like everyone else as they try to make their own way, and perhaps help others along the way.\n\n======\n\nThis is a poor neighborhood domestic story, with little action and a bit of grit. The player will need to navigate their way between the crushing poverty here, and negotiate trying to find their way out, while perhaps making this den of vermin and filth just a little bit better.\n\nThis land is filled with every kind of poor humanity, from the drug dealer, to the social worker, to the cop to the ones that dream of leaving the little borough forever. \n\nWhich one will you be?",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2019-11-27 01:03:11 UTC",
        "comment": "It was a very hot summer in Rootgold, and even at night, when most of the animals came out of hiding, the air remained stifling and hot. The chirping of insects almost brought to a low roar by the high heat and humidity was the only natural sound. \n\nIt was too hot for the night birds to come out of hiding, and they probably wouldn’t seek food until just before sunrise, when the temperature might drop below 95 and perhaps a bit of dew would give everyone something to drink.\n\nEveryone would have something to drink tonight, except about half of the Mousehole. Over the past week, water mains had broken in 5 different places and now far too many had no clean drinking water. The convenience stores had bottled water, but most couldn’t afford to get enough, even if the prices weren’t suddenly raised to absurd levels. \n\nThe Cathouse, the name the neighborhood used to refer to their station, had cracked down on gougers as much as they could, but there weren’t enough cops in Mousehole to make sure that the prices stayed reasonable. There also wasn’t enough space in the small station jail to lock up every criminal they found. \n\nBut it was hot, thirsty weather, which always produced hot, thirsty, and angry people. The violence would spike tonight for sure.\n\nIt was well past 10, and the sun had gone down. Most of the city of Rootgold was still lit up, with artificial lighting, and it was the bane to stargazers throughout the area, but Mousehole was pretty dark. There weren’t as many street lights, and as every parent knew, people were a lot like children, and they were more likely to misbehave when they thought they couldn’t be seen. \n\nOf the few lights Mousehole did have, about a quarter didn’t work at all or had been broken and never repaired. It wasn’t uncommon for a beat cop to come upon people in the dark and not see them until they were only a few feet away. Almost every cop had gotten skunked before and it wasn’t uncommon to have a run-in with a coyote, coydog, or raccoon every once in a while.\n\nPolice were always on edge here, partially because the neighborhood was very spooky, even to experienced cops, filled with the sounds of humanity and animals while they walked, nearly blind along the streets. Sometimes it was loud, and sometimes it was disturbingly quiet.  Where the cops could only hear their own breathing and the clomping sound of their own bootsteps.\n\nThere were the usual faire of night travelers in the Mousehole, you had the two gangs: the foxes in their red and white, and the eagles in their gold and black, women, and sometimes men, of the night, drug dealers, and what every cop learned quickly, mostly just everyday people going about their business: needing that one last thing at the store or going to see someone who could use their help. \n\nAn officer got a call as he walked alongChekovsky Avenue.\n\n“There’s been a fight at the Roberto Park pool, get there and put an end to it. We’re running low on space in the jail tonight, so only arrest someone who really causes trouble.” Came the voice of the captain Vera Fife, one of the best officers in the force.\n\nPeople joked that the Hispanic woman had risen through the ranks so fast because she grew tired of being called Deputy Fife, but she knew how to handle a gun and knew how to handle police work with both skill and subtlety.\n\nShe gave the lone officer the directions and waited for his response, though he was already making his way towards Roberta Park."
    },
    {
        "game_pid": "nccw3p",
        "story_name": "Dreams of the Future King",
        "post_title": "Several unknown heroes have recently received troubling visions, seemingly from a much younger Merlin about a coming threat to Camelot that only the few heroes this spell has reached can stop. Apparently, there are a few members of Camelot's court who are conspiring against the King and his just reign, hoping to put a much more wicked king on the throne.\n\nIt is up to the heroes to keep this from happening. They will have to fight foes, both human and monstrous, as well as tiptoe around politically treacherous areas in order to prevent a calamitous disaster. \n\n============\n\nThis story is an arthurain adventure that revolves around the tragic fall of King Arthur and his knights. A handful of unknown heroes have received a message from merlin's younger self that will allow them to possibly re-write the ending to this tragic tale. Though the fantasy classic deck is what I am using, I have edited it significantly to fit more into a \"knights of the Round Table\" setting, though I have still left things open. Also, I still allow for creation of cards. \n\nthis game will be about ten to twelve scenes long, and I want to run it at a normal pace, though flexibility is in my head for this game. There will be no word limits and comments will be private. \n\nhere are a few things to consider when joining this game. \n1. I am blind and cannot provide art for any of my custom cards, which I use frequently. I don't require art from my players either. \n2. all characters in this story are to be human.\n3. If you reference knights of the round table in your bios, please use ones from Arthurian myth and don't make them up yourself, though I want your characters to be completely original. \n4. I don't require my platers in this story to write in fake old or middle English, and in fact, I would prefer that you not write that way and write more naturally. \n5. my challenges tend to be specific, but branching, with players picking 1 of 2 or three possible outcomes when they finish one that will affect the story down the line.\n6. I would prefer that players write in the past tense, though I don't care if it's first or third person.\n\n\nI will leave the game open until when I go to bed on December 7th, when I will select three or four players from those who apply. Or all of them if not enough join to make that number.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-12-07 16:54:00 UTC",
        "comment": "Four had gathered at a set of standing stones near Dover, it's shining and sheer white cliffs facing the sea. All of them had not only known that they were to meet at these standing stones, but were actually given the directions by which they could gather there. All four arrived at roughly the same time. A knight, a noble lady, a ranger from across the channel, and a watcher of nature, one of the few left in the kingdom. \n\nThese standing stones were bone-white, and looked almost like a half-buried rib cage, jutting out from pebble-strewn earth. Strangely, not a bird made a sound, not an insect stirred, despite the warm climate and the brilliant sunlight. \n\nfacing inward, at one another from four different directions, the views of the strangers were suddenly blocked by the appearance of a legend. A knight, clad in green armor, standing nine feet tall, revealing none of his features, other than the striking color and shine of his amazing armor stood between all of them. \n\nThough none of them had seen him before, and most, if not all of them hadn't even been born when he appeared last, 30 years ago, it was clear they stood in the presence of the Green Knight.\n\n\"I have been sent here, by dreams of my own, as they have told me what guides you. You are to prevent a disaster. You are the only hopes of the land? I find that hard to believe,\" The voice coming from the armor sounded as though it ascended out of a deep pit.\n\n\"I see before me only one champion of arms who doesn't stand a chance against the foes massed against the kingdom. He has the ear and training from Gawaine, Lancelot, and Percival, but he doesn't possess the skills to beat any of them, and two of them may very well spell the end of the King's reign, one by his lust, and the other through his ungovernable anger. And let us not forget that those two are not even our foes.\"\n\n\"And a sheltered noble lady. I am not one to speak harshly of women, but enough is at stake that I must speak what I see. Diplomacy is part of the solution and I know you have much knowledge of the world. But a sord, a ghost, or an assassin cannot be driven off by words and charm and learning alone.\"\n\n\"A ranger, In the near future we will have great need of you. You are not from our land and do not know how it differs from your own. You can navigate the forests and the wilds with ease, but you are caged and helpless within castle walls and what will serve you in the forest will destroy you in town.\"\n\n\"And lastly, the interpetor of nature, a potent spellcaster of natural magic. Impressive, but how much do you really know about your craft. Man is not the only creature that can be depraved and sinful, and I fear that you will not be able to learn to see that among the creatures of nature before it is too late.\"\n\n\nThe Green knight looked about and sighed, \"I could probably stop the moving pieces in the scheme against Arthur, and for Gawaine's sake, I would love to, but I must confess that Excalibur was given to Arthur in a much different spirit than Arthur received it. With all of her power, The Lady of the Lake can be petty and jealous, and she has vowed to not intervene in the affairs of Arthur in what might be his final days. I am vowed to her and thus, beyond the small help I can offer, if I find you worthy, is all I am allowed to do. I must say I am disappointed in what I have seen in you, though if you can convince me that you are more valuable than I think you, I am big enough, to admit when I am wrong.\""
    },
    {
        "game_pid": "80fx5s",
        "story_name": "Disinherited",
        "post_title": "John Harmen is dead and now a horde of heirs are gathered at his manor for the reading of the will as it stipulates that the heirs all be present in person at the reading in order for it to be valid. \n\nBut there is a dark history of the various gatherings that have taken place at the Harmen Mansion in Eastern Virgina. So many heirs in the past have gone crazy or died violent deaths immediately after or at times, even during their brief stays at the Manor, turning them into vicious, heartless creatures of unimaginable  depravity and even rumored odd powers. \n\nHowever, the force behind the evil in this house is unaware that this time, it is dealing with an unusually talented generation of humanity that may in fact, put an end to its machinations forever. \n\n======\n\nThis story uses the occult-pulp horror deck as a jumping off point but like all my stories, custom cards are the norm for me the narrator, and are encouraged among players. This story will not have globetrotting like the default, but rather the manor, the setting for all of the story's action will change dramatically as the story progresses. \n\nAll characters are eitare either heirs or close associates of heirs such as siblings, spouses, or very close work associates and they will work through the machinations of the evil in the house to come out of this experience alive and squash the evil itself. \n\nThis story blends eldritch horror with mystery. It is also somewhat inspired by \"Our Mutual Friend\" by Charles Dickens. Not so much that I am recycling the plot, but the inherritence, part of the manifestation of the evil force, and a couple of the character names are taken from the story's basic premises. You don't need to know anything about the novel to play. \n\nFor more info, see the rules and info for invitees sections on this game's page.\n\nAlso, If you are one of those who has not yet become a member of Storium and thus cannot join games, PM me or contact on the forum for this game and I'll send you an invite so you can join, under the condition that you will have revision requests so you are still auditioning just like everyone else and don't automatically get in.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-01-10 05:31:30 UTC",
        "comment": "chapter 1: near arrival.\n\nJohn Harmen, a magnate in the steel industry, was dead at the old age of 72. He had made a great deal of money over his life from a relatively obscure background. He had never been truly poor, but he had only in his later life been one of the silver spoon crowd. It was 1934, but despite the economic disaster that had ravaged the country, he had been wise and had remained one of the few that had been unhurt on Black Tuesday, October 29.\n\nHe wanted a final gathering from those who had hovered around his money for so long, so he had stipulated in his will that they stay a couple of days at his old mansion before they got their rewards for their fidelity, kindness, or received what was due to them from family obligation.\n\nAmong the mourners and hopeful benificiaries was Bella Welmer, a young wavy-haired blonde almost young enough to have been Harmen'sgranddaughter. She had been his fiancé and now stood to get a lot. She had once been what the Romans would have called a legacy hunter, and what people in these days would call a gold-digger. But those who knew her knew that had changed. Though she had just been a greedy teenager looking for an easy way to sit in the lap of luxury, she had come to truly love John Harmen. She openly admitted to her mercenary wishes before, and was the first to criticize herself for them, and meant every word, but she was still here. \n\nAnother was Lizzy Harkness, a dark-haired woman who was the daughter of one of Harmen's old  fishing buddies. Quieter and softer than Bella but decidedly melancholic, it was hard to tell which of them was more beautiful or more likeable. Her father was good friends with Harmen and had died a few weeks before. She wasn't after the money and was here by strict respect. She was a working woman who mourned her father's loss far more than she cared for what she might get. \n\nThere was also her brother Charlie and Mr. Preston, a teacher Harmen had hired in secret to give Lizzy an educational leg up where her schooling was incomplete. He very clearly had other things on his mind when he looked at the dark girl, but he taught the girl with great skill, even though watching them brought one to wonder who was the more intelligent of the two as Lizzy was unmistakably clever while Preston was what one would call a \"know-nothing know-it-all\" who lacked any real sense and had a lot less learning than he claimed he did.\n\n\nThere was also Mr. Jacob Goldduster, a man who was one of the least corruptible people Harmen had ever known and a guy who had always been dependable to do what he could for those less fortunate. He didn't want the money really, but he respected Harmen's wishes. \n\nThere was also Mr. Peter Venus, a man who seemed very worldly and wise, and who was very handsome. He was a man who really liked the house and was constantly peering into corners, though he never quite said what he was looking for. Learned and suave, the man was beloved by the old Man and a good friend of Goldduster. \n\nAlso, last and certainly least was Mr. Smiddy. Smiddy was a man badly injured in the first world war, moving about on a peg leg and ranting at all he saw. Unlike Bella, he was an unashamed golddiggger and was quick to claim he wanted the money whenever an opportunity showed itself. He constantly carried a copy of \"The decline and fall of the Roman Empire\" which he read from noisily and obnoxiously, much to the shegrin of all present. All would be glad when this guy got his share and left.\n\nAll of these were here when the others arrived. Others that inspired fear, as the thoughts watched and waited, wanting out, though it was not yet time. These new ones were more powerful and wise than any before, and though the thinkers did not know why they feared, what they had done for centuries untold might be being brought to an end."
    },
    {
        "game_pid": "p5j7c4",
        "story_name": "High-flying Ransom",
        "post_title": "From around the world, many people have come to take Captain Button's \"Adventure World Tour\" abourd his wonderous flying machine, \"The Heart's Desire.\" Now a group of tourists, specially selected for the tour by specific inviations from the captain and inventor, find themselves in a sticky situation as their captain proves to have other desires than simply showing the rich the sights around the globe. \n\n=========\n\nCharacters in this story travel aboard \"the Heart's Desire,\" but they are more captives than passengers or crew members, though Captain Button will still use him in various escapades around the globe, even though he is in fact running a ransom scheme. It will be up to them to work alongside this criminal mastermind and ruthless adventurer until they can escape and make their way home.\"\n\na few things to consider. \n\n1. I am blind and cannot provide art for any custom cards I play, (which will be most of them.) I don't require art from my players unless they want to use it personally. \n2. I don't kill off players, even in adventures with great danger unless they abandon the game. \n3. commentary will be private and there will be no word limits. \n4. I don't want to play a character in this game, but if I get fewer than 4 applicants, I will in order to keep the game stable. \n5. I will keep open invitations open for the full two weeks and then select the best five applicants I get. If I get fewer than two, I will scrap the game. \n\n6. I encourage people to create their own custom cards even at character creation if they want, don't feel limited by what's here.\n7. for those of you who take an interest, please let your friends know.\n8. I do not follow the 3-act structure for Storium, instead I usually follow a six-act structure with 3 scenes in each chapter and a short epilogue at the end.. So if you are in this story, it may take a while to complete, but you'll have a deep and enriching story experience nonetheless.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-12-06 16:50:35 UTC",
        "comment": "chapter 1: into the skies. \n\nThe roar of the engines of the large red ship strangely did not drown out the voice of Captain button as he greeted the passengers for his world adventure tour. \n\n\"Hello, all!\" he exclaimed, \"and welcome to the Heart's Desire, the means by which you will see parts of the world your friends have probably never heard of to their own loss.\"\n\nCaptain Button was a man of healthy middle age who was most obviously characterized by his garish red suit and wide-brimmed hat, as rosey-scarlet as his ship. He walked with a cane, well... actually more of a stick with a glass knob at each end. \n\n\"I always look forward to seeing new faces,\" Button said, his handsome, mustached face beaming, \"Please come aboard!\"\n\nHe took the child by the hand and helped him up, simply being courteious and did the same for the ship's one female passenger. \n\n\"This ship,\" he explained, \"Is powered by a mixture of steam power and internal combustion. It is roughly 445 feet in length, and, not including the rods that hold the propellers up, is roughly 25 feet high, and 57 feet wide. We usually maintain a staff on this tour of about 30 and we are eager to please. We may not be able to provide all the fancy faire for dinner you might be used to, but it will be far better than bacon and Hardtac too.\"\n\nHe led the tourists up to a line of rooms, of which there were 8 or so, \"These will be your rooms. They do not have baths or shower-baths, but each contains a small latrine, a bed, and a set of drawers for your belongings, as well as a little space for you to work, exercise, or whatever else you do with your spare time.\"\n\nHe opened the doors to one of the rooms, and it indeed was far better than most births on shipboard, he definitely had luxury in mind for them. \n\nHe shut the door to lead the astounded group to the galley, though he did not fully move his arm to conceal that the rooms could be locked from the outside.\n\n\"Here is where you'll be eating,\" Button said with a flourish, \"I have answered to the foods you have requested for yourselves and have provided as close to your personal wishes as I can.\"\n\nA middle-eastern man with a stern face stepped into the room, \"This is Balal Moghiri, our cook, and he will be the one in charge of your meals.\"\n\n\"It's a pleasure to meet all of you,\" Balal said politely with a slight nod, \"I look forward to our jouries.\"\n\nButton then said, \"You guys will have free run of the ship, and no area, not even my own quarters and study, is off limits to you. You just are not allowed in the telegraph room, the equipment is too delicate to be risked by those who don't normally use it. And some other equipment I use for safety requires the telegraph to be in proper functioning order.\"\n\n\"It will be a few days before our first stop in Reinsfurt Germany, but when we're ready to go down, I'll have you assemble in my study for briefing.\"\n\nA Red-haired woman of about 35 or so walked into the room now. It wasn't clear exactly what country she was from despite the hair color. Her dress was odd, wearing bright blue robes and having much of her face covered in Teal tattoos, including on her eyelids. Objectively, she was pretty, but there was something about her that just somehow kept the passengers from admitting it.\"\n\nShe whispered something covertly to Button, who then nodded to her, \"\"While I've been showing you this ship, your bags have already been taken care of and moved to rooms. The rooms are identical, but if you would like a different one, just ask me.\"\n\n\"Feel free to explore the ship on your own for a bit, I have take-off and navigational calculations to make....\" He said and then looked at the strange redhead, \"Oh, how rude of me, this is Nixola Aribridos, but we usually just call her 'Nick', she's the expert on obscure culture and history I hired, though she also does double duty as head of housekeeping.\"\n\nThe woman said nothing but left quietly, seeming to ignore the passengers, though not directly disdaining them.\n\n\"Feel free to ask me anything, any time,\" Button said, I should be available after take-off in about half an hour.\""
    },
    {
        "game_pid": "xbqjzz",
        "story_name": "Beastmasters of Olympus",
        "post_title": "Hades has failed in one of his most important duties and it won't be long until the titans crush, flood, blow, and burn their way across Greece once more to try and take Olympus back from the gods. Typhon was barely beaten last time by Zeus, and it is unlikely that they will have an easy time of it now.\n\nHowever, Athena has made it clear that they can't leave the mortals to face this alone, so The gods have placed fragments of themselves in several of Artemis' most trusted animal servants and now She has sent them to find mortals that fortune might allow to keep mortals safe while the Gods plan for their own reckoning.\n\nIn this Story, Players play as classical heroes accompanied by a powerful animal companion with a fragment of divine essence in it. Characters will make their character and also their companion and go on an epic quest to find a way to drive the titans away from Greece, and perhaps find an epic destiny that even the MOroii have not yet seen.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2024-01-04 17:54:08 UTC",
        "comment": "“And you Didn’t keep our father and the titans where he belonged?” shouted Zeus to his unlucky brother who had just delivered some fateful news.\n\nResisting the urge to put on his helmet and vanish back in the shadows he had bravely stepped out of for all their sakes, Hades looked at his brother.\n\n“I asked for the aid of your cyclopes to keep the gates closed, but you needed another bolt to satisfy your jealousy,” Hades said, “I am a forger of iron and the like, but I can not ward and guard as many others can. I alerted you of the problem, you did nothing.”\n\n“Dare you accuse your King?” Zeus Thundered, both literally and metaphorically.\n\n“Yes, I do. I can’t do my job when you don’t do yours,” Hades hissed as shadows and winter winds danced around his flowing black tunic. \n\n“And…” Zeus began but he stopped when the voice of the daughter that was his and nobody else’s spoke.\n\n“And he is right to do so, Your Majesty,” Athena remarked, raising her voice enough to be heard and no more, “We should’ve stopped this by helping your brother earlier.”\n\n“That’s what I’m saying and now…” Hades began. \n\n“And now we can’t put the threads back into their spools and unweave them,” Athena interrupted again, silencing Hades, “All we can do is the best with what has come to pass.”\n\nHermes and Iris quickly came from the East and West and stood before the King and Queen of the gods, “We have our reports.” Hermes said. \n\n“And?” Zeus Inquired, “Where are they?”\n\n“Much closer than we would like,” Iris replied, “We are swift, but the titans are fast and are taking a direct path to Mt. Olympus.”\n\n“Then let’s ready ourselves for them,” Ares grunted, “We Beat them before and we’ll have to beat them again.”\n\n“Much as I generally disagree with the oaf,” Athena said smugly, glancing distastefully at her traditional rival, “He’s right. The Titans are creatures of violence and force is the only language they understand. It might not be so easy this time, they have had time to rage and plan for the day we all thought would never come and they were counting on coming one day\n\n“We must make ready,” Hera said, “Hephestus has fashioned new arms for us. My husband and I declare that the forces in battle shall be led by the joint offices of Ares and Athena.”\n\n“That is not all we must do,” Athena said solemnly, “The titans will pass through many mortal lands before they get here, including the realms of the Helotes, Trojans, Persians, and even the Scythians lands will be ravaged. They have given us much over the Iron Age and we cannot leave them defenseless.”\n\n“But we can’t abandon the mountain,” Ares replied, “Don’t you know that with all those brains you supposedly have?”\n\n“I wouldn’t suggest an obvious problem if I didn’t have a solution,” Athena stared daggers and then calmed for a moment, “My half-sister has agreed to help me with this and we have worked something out.”\n\nArtemis, with her silver bow strapped to her back and who was accompanied by many animals; each a marvel of its kind, bowed to the assembled gods, though not nearly as much as was polite in such a circumstance, “I have gathered the first of each of my creatures to send to mortals to aid them in surviving the titans’ rampages as they ravage their lands. I am giving the best of their kind, but I want a bit from you.”\n\nThe Gods looked at the animals and saw each to be a marvelous specimen.\n\n“I know you all have mortals you love or have been watching,” Athena said, “Mortals who aren’t bound as tightly by the threads of the fates, though perhaps they have been snagged just a little as even we are.”\n\n“Give a little piece of yourself to these animals and send them to the mortals you have been watching,” Athena explained, “a small fragment that none of us could ever miss might make all the difference if you send them to the right mortals.”\n\nThe Gods thought, and six agreed, and letting their power be lessened by an amount they would never miss, they would send powerful  beasts to aid the mortals in surviving the titans as they escaped the underworld and brought horrors of fire, water, wind, stone, and other incarnations of raw power used for its worst ends upon the world.\n\nEach would find their mortal and each would lead them to Delphi, as the mortals would not make a difference by themselves."
    },
    {
        "game_pid": "j6ep69",
        "story_name": "Menace Beach",
        "post_title": "Menci Beach is a small port town along the coast of a beautiful ocean. Fisherman, sailors, shipwrights, carpenters, and all manner of people live in this town that thrives on the sea. \n\nBut there are dangers from the ocean as well. Storms, waves, pirates, and the many dangerous creatures that can come up from the waves like sea wolves and flying rays. \n\nBut of all the things Mencians fear most, the Kraken is the creature of their nightmares.\n\nAnd there have been reports that it is awake again.\n\n======\n\nThis story is a town defense story where players will play as inhabitants of Menci, as various threats threaten the town until perhaps the Kraken might arrive. \n\nThis is a simple beginner game that will have 4 scenes and I hope to finish it quickly.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2021-09-24 15:24:43 UTC",
        "comment": "Crack!!!\n\nThe sound of wood breaking apart could even be heard from the shore as the battered ship, half-sunk already and with rigging in tatters drifted towards the docks. It wasn’t going to make it. It was amazing that the ship hadn’t sunk since it had come into view. Even so, it didn’t have much time left.\n\nEveryone in town knew what to do, whether because it was the right thing to do or because of the kingdom’s salvage laws that were there to make peoples’ greed save lives, the town was up.\n\nAll could take a part in this. Alastra was to mobilize the boats, while Amos would go to rescue people from the water.\n\nAlan heard the seals excited about the wreck and saw there weren’t enough boats in town to rescue all the people on the large galleon as it sank. He might be able to work out a solution.\n\nBut it wasn’t just a sinking ship either, to lighten the boat to slow it’s fall into the inky depths of the ocean, the crew had thrown out everything, including several barrels of lard, and now sharks circled the boat, hoping for more dibbles to come their way. \n\nBut despite everything, there was more sadly to think about than the crew’s lives. There were a fortune of goods on the boat and if at least some of them weren’t saved, lives would be ruined, even if they remained. \n\nEither from that knowledge, or just simply knowing that he’d get a stake in the money brought in by anything he helped save, Hagley realized mackerel wouldn’t be the only thing he might catch today in his nets.\n\nFor Players: I am giving each of you a challenge with your character’s name on it. There is a pre-determined strong or weak outcome to each one and all of them will be only one point. I will be giving myself one as well to demonstrate.\n\nWhen you have a challenge, when you play a card, you may play a strong, weak, or neutral card. Strength cards are the only strong cards and weakness cards are the only weak cards. Currently, sub-plots, assets, and goals (more on the latter 2 later) are neutral. \n\nWhen a challenge is completed, the result of the challenge is determined by the cards placed on it. If more strength cards were placed on a challenge than weak cards, the challenge outcome is strong. If more weakness cards are placed on a challenge than strong cards, then the outcome goes weak. \n\nIf the number of strong and weak cards is equal, or the challenge doesn’t get any strong or weak cards at all, the outcome is uncertain, which means that the narrator will adjudicate. In the case of an uncertain outcome, a player should not write the resolution of the challenge and should write what their character does but not how the challenge ultimately ends.\n\nAlso, for how to play cards. Say for example, Alastra is set to ready the rescue boats. Suppose I want her to get the weak outcome on the challenge. I could play the “superstitious” weakness card she has. I would then write how Alastra’s superstition brings about her taking too long to have the boats ready.\n\nIf I wanted the strong outcome, I might play Alastra’s “Leader” card, and then I would describe how her natural leadership helps her get the rescue boats into the water quickly.\n\n\nOne final thing before I move on. One thing you should drill into your heads is that weaknesses and weak outcomes are not “bad.” Firstly, character flaws are often more interesting than when things are going well for your character so you shouldn’t try to argue against your weak plays. If Alastra is being superstitious and it makes things go worse, I should embrace that as I write. Second. For most narrators, weakness doesn’t mean game over or anything, it just means your characters will suffer a little or endure a little more hardship as they go along. \n\nAlso, from a gameplay point of view, you cannot get more strength and weakness cards until you spend all of both.\n\nFor narrators:\n\nIn most of my games, I have a moment where characters make a cardless post at the beginning of the game to introduce their characters into the story, but being that this is a simple tale, I figured I’d drop everyone right into the action. \n\nWhen coming up with these challenges, especially with the weak outcomes, I try to embrace, “Failing forward.” When you design a weak outcome in a challenge, the story and action should not be stopped if the weak outcome comes up. I also try to make my Weak outcomes just as interesting as my strong ones. \n\nSometimes to give players more control, having multiple choices for outcomes that the players get to make can help, especially for weak outcomes, though I am not doing it right now."
    },
    {
        "game_pid": "v4vbxw",
        "story_name": "All that Glitters",
        "post_title": "The harvesting of magic from the other side has gone on relatively well, with an occasional slip or two, around the world for hundreds of years now, with the Danelon having a firm grip on the situation; expertly exploiting the energies to make themselves even more powerful, with an occasional upstart group or wild keymaster getting in the way every now and then.\n\nHowever, a door is being opened on Alkatraz Island in the middle of the night in San Francisco, and the regal creature with his wife coming through the gate is far more than anyone had prepared for. \n\nNow San Francisco is about to be plunged into a magical crisis that threatens to expose the Danelon, reveal magic to the world at large, and result in countless deaths. \n\nThe heroes must find the way to defeat the emerging royal pair and then also perhaps decide if the Deanelon really ought to be forced out into the light, and what to do about magic as well.\n\n==========\n\nThis world is based heavily on the King Midas Story (the most famous of them as there are in fact, many ancient myths about the foolish king,) and also a few major plot points will be based on Shakespeare's \"Merchant of Venice\" while also combining this with the \"Keymaster\" world. However, the basis in Shakespeare is very loose and no knowledge of the play is particularly necessary or even helpful..\n\nThis game will have horror elements but will also involve quite a bit of action and sci-fi elements as well.\n\nKing Midas and his Queen will be more anthropomorphic and less lovecraftian than is typical for most of the nightmare creatures inherent in this world.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2019-04-17 18:36:45 UTC",
        "comment": "They had the 115 magi they would need. \n\nThe San Francisco branch of the Danelon were distinctly low on magical energy, and with favors they owed in Chinatown, and a general quota they owed to the high council, a big draw of energy was exactly what they needed.\n\nFrom all over the west coast of the so-called independent nation of the United States, came some of the most talented Danelon Magi.\n\nBut it hadn’t been a speedily-perfected plan. There were a lot of grudges in the mixture of the needed mystics that had to be ironed out, and the exact best time to open the gate for some more power had not yet been determined.\n\nThey knew where to do it though. Alcatraz Island was no longer a prison, but the rough waters in the bay, and the fact that the tours of the prison were strictly scheduled meant they would have more than enough time.\n\nA few quick spells and the tour boats to the island were “lent” by the night watchmen, along with the consent of a tour operator. They’d never remember these guys, which was exactly how it should be. It was best when even the Danelon’s biggest coups would not be remembered by any of the norms out there.\n\nRalph Bach, a man who could have known Johan Sabastian personally, drew imaginary lines in his head, making sure that the rest were exactly where they needed to be. This would be one of the largest gatherings of magical energy in the 21st century and it would all be for his glory. Perhaps he might even make a better focus, being able to draw on even more of what the Danelon gathered rather than the rations of magical energy he was provided with. He had overdrawn on the communal store of magic many times through his focus and it was why he wasn’t in Las Angeles, New York, or Beijing right now. \n\nThe anchors all formed the inner core of the formation, some of them chained down as draws this big could cause them to flail and hurt themselves when the energy came flooding through. A larger core stood outside the main gate, in the dark as they did not want to alert the outside world to what they were doing. \n\nRalph lifted his hand, the bronze ring on his finger beginning to glow with a slight light of its own, and the chanting and gesturing began, while the Anchors, those who would take the brunt of the energy flowing out of the gate gritted their teeth but also kept up the ritualistic gesturing and incanting that they too needed in order that all this energy that would come forth would fall into the Danelon’s hands. \n\nOver the gate, the gate that many prisoners had passed through, a curtain of glowing colors formed. Greens, blues, pinks, and oranges danced over the opening, and all the Danelon felt a surge of power.\n\nThe power grew. The Most ambitious of the Danelon felt that their schemes were in reach; the official they desired to control, the tech they wanted destroyed, or the  medicines they wanted developed, or conveniently deemed too dangerous all seemed within reach.\n\n\n\nAlie Haiden: A blonde woman almost as old as Ralph, but not as successful, saw herself finally developing the “invisible fire” a fire that seared the soul right out of a being, leaving no physical residue in the corpse. She had always been a scholar.\n\n\n\nArnold Kant, a younger man, saw the many failed missions of assassins lately, and saw a way to infuse human muscles with the strength of Tungsten Steel, weakness would be a thing of the past in the Danelon and it would all be thanks to him.\n\nThe glistening curtain tingled like a chime on a summer day porch. And the energy came in an ever-increasing flow as it was opened wider. The light grew brighter, and despite the toll being taken on the anchors, the Danelon functioned as a well-knit group in the elation of a successful draw, despite the many petty grievances many of the members of this team had with others.\n\nThe music of a doorway never got old, and more “instruments” joined the piece, strings, chimes, bells, and flutes all added their voices coming from the door, unlike any instruments norms knew but flutes, strings, and others, were the closest thing a human mind could understand. \n\nThe energy was almost drawn when a noise, far more discordant than the noise of magic  sounded in the empty prison, echoing off of the old tower, the hard concrete walls, and bouncing about in the cell-lined corridors.\n\nIt sounded much like the braying of a donkey, but somehow had a human malevolence to it as well. \n\nThis had happened before. Ralph made the gesture and several of the Magi began to change their chanting and they began to thrust their hands at the opening.  To drive back whatever was coming through. \n\nThere were two forms striding through the gate. One a shapely female form, though the ground vibrated with every thudding step she took, while the other, larger and more muscular, seemingly even heavier walked a few steps in front. \n\nHe was the first to be seen, and if it were not for his donkey’s ears, he would actually have been quite handsome. \n\nAgain the strange Braying laugh, and a quick gesture and the gate behind the man closed, several of the Danelon Anchors fell unconscious, and the strange, golden creature looked around.\n\n“This will simply not do.  The strange donkey-eared man said.\n\nWith the magic collection suddenly ended, bits of the magic, corrupted by the two creature’s spread out into the bay Area, the only clues that would warn those who could stop the Golden king with his magic touch. A few hours later, each would find something a bit odd, a trinket of silver or gold, that would let them know that something was wrong. Whether assassin, Danelon exile, or even a simple amateur journalist, they would hear the warnings, and if they didn’t, the Bay, and perhaps even more would be in danger."
    }
]