[
    {
        "game_pid": "d05vx0",
        "story_name": "Herofall",
        "post_title": "For years, the city of Welstand has been protected by a hero: the indomitable, ever-encouraging, popular Maximus. With his powers of flight, super-strength, super-durability, and enhanced senses, Maximus has stood as a bulwark against crime. He has saved the city again and again.\n\nWhile some whisper that criminals have become more extreme in response (like the obsessed inventor, Dr. Metus), and while it is true that Maximus has inadvertently created some of his own foes (like the murderer-turned-monster, Gigas), Maximus has proven his might against even these foes, and kept the peace of the city.\n\nAnd crime-fighting is not his only pursuit--he is a frequent sight at charity events, and puts his spare time to use in volunteer activities and works for the public good.\n\nThe citizens of Welstand have put their faith in Maximus, and he has never let them down.\n\nBut today...that will change.\n\nToday is the worst day of Maximus' life.\n\nBut this is not the story of Maximus.\n\nThis is the story of the people caught in the crossfire...the people who must give their all just to survive.\n\nAs a hero falls, and your world crumbles...what will you do?",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-08-15 21:20:48 UTC",
        "comment": "Morning at the Maximus Museum, and it was already fairly crowded. The place had been popular ever since it opened two years ago, established by the mayor to honor the work of local superhero, Maximus, in defending the city of Welstand against threats of all kinds. The museum, first of its kind in the nation, quickly became a popular destination not just for locals but for tourists.\n\nExhibits covered Maximus' many adventures, with more and more being added with every new accomplishment. There were the stories of his myriad struggles against Dr. Metus, for whom the city's justice department had commissioned one specially-built cell after another, each of which had failed to hold him. There was also the tale of Maximus' rescue of a visiting senator from an assassination attempt--and the assassin's subsequent transformation into the monstrous Gigas, after he was accidentally exposed to experimental chemicals during the rescue. There was the tale of Maximus' rescue of a falling plane--accompanied by many stories of thanks from the passengers. There were more--many, many more, accompanied by items--or replicas of them, where the actual thing wasn't deemed safe--that served to tell the tale.\n\nThe superheroics weren't all, of course. No, there were exhibits dedicated to the charitable causes Maximus supported, to his volunteer work, and most notably to his \"Be a Hero\" campaign--set up to inspire people to make a difference in each other's lives.\n\nThough little acknowledgement of it could be found in the museum, Maximus was at times a controversial figure in Welstand, as superheroes were around the nation. His battles were dangerous, and though his defenders said he tried his best and he did whatever he could to keep people safe, the fact remained that it wasn't healthy--physically or financially--to be too close to one of Maximus' adventures. And as in the case of Gigas, people whispered that some threats wouldn't have even existed if Maximus hadn't come first.\n\nBut without him...without him, what might have happened?\n\nEven his most passionate detractors generally hoped never to find out.\n\nBut this morning seemed as peaceful as ever at the Maximus Museum, and found the patrons browsing the exhibits, reflecting on the hero's career thus far.\n\n----\n\n*Getting started here, everyone, with a short challenge-free section just to let you establish your characters.*\n\n*Please set up why you are in the museum today, and also answer the following questions:*\n\n* *What is one thing you know about Maximus?*\n\n* *What is one thing you know about one of Maximus' foes?*\n\n*This information should most likely be the sort you would've heard publicly, from stories of his adventures, news reports, interviews, that sort of thing. Facts introduced here can be major or minor, detailed or simple, as you choose. I don't have too many preconceptions about Maximus other than what's already been revealed and in the game description.*\n\n*For the foe question, please feel free to use an existing villain (Dr. Metus or Gigas) or to make up a new one. I'm honestly hoping at least some folks will make up a new one!*\n\n*Please do write these as part of your narrative! So for remembering something about Maximus, you might pass by an exhibit of a particular item and remember something about how that item was involved in one of Maximus' publicized adventures.*"
    },
    {
        "game_pid": "426jxd",
        "story_name": "Defenders of Akakios (Game I)",
        "post_title": "This is a **beginner game**.\n\nThe small town of Akakios has always known peace--but with the rise of banditry in the area, it has found itself a target for raids in recent years. Now, though, things have become more serious--a local bandit lord has gathered an army, and intends to assault Akakios and take over. If he succeeds, he will make the town his seat of power and use it to strike out into the wider region.\n\nFortunate, then, that you--the citizens of Akakios and the wandering adventurers who have come at just the right time--are ready, willing, and able to fight.\n\n----\n\n\"Defenders of Akakios\" is a simple game taking place in a generic fantasy world. Characters can be any common fantasy race (Elves, Dwarves, Humans, Half-Orcs, etc.) and/or class (Commoner, Fighter, Wizard, Thief, Wizard, etc.). The story will tend towards combat/action situations, so for ease of use I recommend making characters who *are* able and willing to contribute to a fight in some way.\n\nI have set this up to be able to complete in 3-4 scenes in order to teach some elements of the Storium systems to new players.\n\nThough this is set up to run for a shorter time than other beginner games, standard beginner game rules apply. Come in, get the knowledge you need, and then if you'd like to leave and go on to other games, go on with my blessing. \n\nThat said, if you want to stay for the full thing, I think you'll get the most benefit that way and have fun telling a little tale about saving a town from danger. \n\nThere's something really special about the feeling of *completing* a game. :-)\n\n*I will accept **5** players for this game **mostly** on a first-come, first-serve basis. If you see that there are already **5** players in the application pool but would like to join the game, please message me to let me know of your interest. I will do my best to periodically start up additional versions of this game and get new players in, or to invite new players if players drop from this.*",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2017-11-17 14:25:38 UTC",
        "comment": "The village of Akakios was small, a place barely known to most. An unimportant village on the kingdom border, it was home to woodcutters and a small few craftsmen—simple, charming folk who prided themselves on supplying the kingdom with wood and a few pretty crafts.\n\nIt had always known peace. The kingdom was strong, and the king’s army, patrolling the border, easily kept the land free from peril, whether that be from rival kingdoms, monsters, or banditry. Close to the border as it was, Akakios received protection despite its unimportance in the grand scheme of things.\n\nBut now—now, things were different.\n\nThe king’s army was divided, withdrawn from the border to prepare to fight on either side of a likely war of succession. The people of the village whispered in fear of what is coming, knowing that the peace of their kingdom might soon be torn apart if the nobles, ruling from high above, could not agree on a successor to the throne.\n\nIn the midst of such struggles, Akakios was forgotten.\n\nBy nobles, by kings, by armies…but not by bandits.\n\nAnd, hopefully…not by heroes, either.\n\nEach had come to Akakios for different reasons. Some had lived there long, others were passing through. Whatever their stories might be, fate had brought them to this place on this day.\n\nThe sun rose…and with it came a shout of alarm. A bell rang, rousing villagers and wanderers alike from slumber wherever they had found it. Villagers grabbed farming tools and old, rusted weapons, running in disorder as they readied to defend against a threat none ever knew would truly come.\n\nBut before anyone was prepared, the bandits were upon them. Some came on foot, others on horseback. They were of all kinds—big orcs with wicked axes, deserters with still-gleaming armor and bright swords, desperate poor men with knives and ragged armor…the bandits accepted all who were willing.\n\nWilling to kill to get what they wanted.\n\nIt was a larger force of bandits than any had ever seen—an army, it could be called. A horde.\n\nAnd it was already at the village outskirts. Some of the villagers, caught unaware in the early morning light, were caught among the bandit forces, surrounded by laughing horsemen who threw flaming torches into their homes and sheds, lighting them ablaze.\n\nWithout help, all of Akakios would fall. The people needed heroes to lead them…heroes to rescue those who were trapped.\n\nAnd heroes would rise.\n\n----\n\n*And we’re off! First off, a quick note: In Storium, by default, you can play up to three cards on a single move, and up to three cards per overall scene. Since this is a beginner game, though, I’d like to request that you follow two rules:*\n\n* *First, play only a **single** card on each move.*\n\n* *Second, let **at least** one other person make a move between each of your moves.*\n\n*Until further notice, these rules should be considered to be in effect for this game.*\n\n*Barring unexpected events there will be another set of challenges in this scene, so I suggest that you do not play all three of your cards for the scene during this first set.*\n\n*Storium scenes consist of “Challenges,” and you’ll be playing your character cards to address those challenges. I’ve prepared an instructional article on the topic, which you can find here: **http://gamingcreatively.blogspot.com/2017/07/storium-basics-challenges-and-cards.html***"
    },
    {
        "game_pid": "7w2gyq",
        "story_name": "Defenders of Akakios (Game H)",
        "post_title": "This is a **beginner game**.\n\nThe small town of Akakios has always known peace--but with the rise of banditry in the area, it has found itself a target for raids in recent years. Now, though, things have become more serious--a local bandit lord has gathered an army, and intends to assault Akakios and take over. If he succeeds, he will make the town his seat of power and use it to strike out into the wider region.\n\nFortunate, then, that you--the citizens of Akakios and the wandering adventurers who have come at just the right time--are ready, willing, and able to fight.\n\n----\n\n\"Defenders of Akakios\" is a simple game taking place in a generic fantasy world. Characters can be any common fantasy race (Elves, Dwarves, Humans, Half-Orcs, etc.) and/or class (Commoner, Fighter, Wizard, Thief, Wizard, etc.). The story will tend towards combat/action situations, so for ease of use I recommend making characters who *are* able and willing to contribute to a fight in some way.\n\nI have set this up to be able to complete in 3-4 scenes in order to teach some elements of the Storium systems to new players.\n\nThough this is set up to run for a shorter time than other beginner games, standard beginner game rules apply. Come in, get the knowledge you need, and then if you'd like to leave and go on to other games, go on with my blessing. \n\nThat said, if you want to stay for the full thing, I think you'll get the most benefit that way and have fun telling a little tale about saving a town from danger. \n\nThere's something really special about the feeling of *completing* a game. :-)\n\n*I will accept **5** players for this game **mostly** on a first-come, first-serve basis. If you see that there are already **5** players in the application pool but would like to join the game, please message me to let me know of your interest. I will do my best to periodically start up additional versions of this game and get new players in, or to invite new players if players drop from this.*",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2017-11-06 15:31:43 UTC",
        "comment": "The village of Akakios was small, a place barely known to most. An unimportant village on the kingdom border, it was home to woodcutters and a small few craftsmen—simple, charming folk who prided themselves on supplying the kingdom with wood and a few pretty crafts.\n\nIt had always known peace. The kingdom was strong, and the king’s army, patrolling the border, easily kept the land free from peril, whether that be from rival kingdoms, monsters, or banditry. Close to the border as it was, Akakios received protection despite its unimportance in the grand scheme of things.\n\nBut now—now, things were different.\n\nThe king’s army was divided, withdrawn from the border to prepare to fight on either side of a likely war of succession. The people of the village whispered in fear of what is coming, knowing that the peace of their kingdom might soon be torn apart if the nobles, ruling from high above, could not agree on a successor to the throne.\n\nIn the midst of such struggles, Akakios was forgotten.\n\nBy nobles, by kings, by armies…but not by bandits.\n\nAnd, hopefully…not by heroes, either.\n\nEach had come to Akakios for different reasons. Some had lived there long, others were passing through. Whatever their stories might be, fate had brought them to this place on this day.\n\nThe sun rose…and with it came a shout of alarm. A bell rang, rousing villagers and wanderers alike from slumber wherever they had found it. Villagers grabbed farming tools and old, rusted weapons, running in disorder as they readied to defend against a threat none ever knew would truly come.\n\nBut before anyone was prepared, the bandits were upon them. Some came on foot, others on horseback. They were of all kinds—big orcs with wicked axes, deserters with still-gleaming armor and bright swords, desperate poor men with knives and ragged armor…the bandits accepted all who were willing.\n\nWilling to kill to get what they wanted.\n\nIt was a larger force of bandits than any had ever seen—an army, it could be called. A horde.\n\nAnd it was already at the village outskirts. Some of the villagers, caught unaware in the early morning light, were caught among the bandit forces, surrounded by laughing horsemen who threw flaming torches into their homes and sheds, lighting them ablaze.\n\nWithout help, all of Akakios would fall. The people needed heroes to lead them…heroes to rescue those who were trapped.\n\nAnd heroes would rise.\n\n----\n\n*And we're off! First off, a quick note: In Storium, by default, you can play up to three cards on a single move, and up to three cards per overall scene. Since this is a beginner game, though, I’d like to request that you follow two rules:*\n\n* *First, play only a **single** card on each move.*\n\n* *Second, let **at least one** other person make a move between each of your moves.*\n\n*Until further notice, these rules should be considered to be in effect for this game.*\n\n*Barring unexpected events there will be another set of challenges in this scene, so I suggest that you do not play all three of your cards for the scene during this first set.*\n\n***Storium scenes consist of \"Challenges,\" and you'll be playing your character cards to address those challenges. I've prepared an instructional article on the topic, which you can find here: http://gamingcreatively.blogspot.com/2017/07/storium-basics-challenges-and-cards.html ***"
    },
    {
        "game_pid": "1sv3ph",
        "story_name": "Operation Dragonfire",
        "post_title": "For ten years, the world has lived in fear of one man: Walherich Dirksen.\n\nDirksen has stood at the top of a shadow empire for a decade. He has used arms dealing, smuggling, murder, secrets, corruption, terrorism, and even the movement of armies to play the nations of the world like puppets. All along, he has remained hidden, living a secretive life of luxury, untouchable by those he harmed.\n\nNo more.\n\nYou are members of PANGAEA - a specially authorized United Nations task force. You operate independent of your respective nations, and hold no part of any of their conflicts. PANGAEA exists for one reason - one reason only: The elimination of global-class threats, threats to the peace and prosperity of the world as a whole. \n\nYour team was authorized to locate Walherich Dirksen and eliminate the threat he posed to the world. And now, two years later, you have found him. You have surrounded his estate. There will be no escape for him. His days of treating the world as his puppet are at an end.\n\nBut in the deepest recesses of his manor, Dirksen stands over a strange symbol, and a smile comes to his face as he chants strange words...\n\n----\n\n*This is the story of a team of highly-trained operatives equipped with the absolute best gear that humanity has to offer...who will still find themselves entirely unprepared for the challenge that faces them. Finding themselves in another world, filled with magic and mystery, these men and women must still pursue their mission...and seek a way home.*",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2020-05-31 17:31:01 UTC",
        "comment": "*\"One hour to destination,\"* the voice came over the loudspeakers. *\"Repeat: one hour to destination.\"*\n\n\"Final prep,\" Captain Lee Clancy said, leaning forward with both hands on the briefing area table. \"Check your gear and do a last check of the recon data. We don't leave Dirksen with even a single escape route. Understood? This time, we shut him down for good. Everyone in the go zone at 2345 hours.\"\n\nThe briefing was over, but Captain Clancy remained at his seat, leaning over the smart table that currently displayed the best available map data of Walherich Dirksen's fortified mansion. For a few moments, the sound of the transport plane's engines was the only thing they could hear. Then, the group dispersed to prepare.\n\nWalherich Dirksen.\n\nFor ten years, the world had lived in fear of him - a hidden puppet master, living in luxury while he played nation against nation, faction against faction, all to grow rich off the spoils - and supply - of war. Terrorism, hatred, factionalism, greed,  revenge, corruption...he encouraged humanity's worst instincts for his own profit.\n\nWalherich Dirksen was a blight on the world for ten years - and that was just the time people *knew* about. But for all that time, there had been no leads, not even the slightest sign as to his location.\n\nUntil two years ago. Two years ago, Dirksen *finally* made a mistake. The Crimson Heart - the only paragon red diamond in the world - had been stolen from the American Museum of Natural History along with several other gemstones. The Crimson Heart never resurfaced, but others did - and PANGAEA managed to track their sales on black markets. For the first time, there were leads.\n\nFor two years, PANGAEA followed those leads - and assigned one team in particular to head up the investigation. Captain Clancy's team. One by one, they took down Dirksen's associates, exposed the officials he'd corrupted, turned his allies to gather evidence, and broke ring after ring of drug and weapons smugglers. The original trail was cut off, brutally, when Dirksen had every single one of the thieves, fences, and smugglers involved in the Crimson Heart job killed...but by then, several more paths had opened up.\n\nIt all led up to this. One week ago, the team was going over snippets of data gathered from the criminal groups they'd taken down...and noticed a pattern. Dirksen's organization acted worldwide...but increasingly, as PANGAEA closed down its suppliers, new resources were coming in from Southeast Europe. It was as thought Dirksen's reach somewhere in that region was more sure, more solid, than anywhere else.\n\nAs though he could take a hand in operations there...personally.\n\nClancy's team focused their attention, and the pattern was revealed. Everything - *everything* - all centered on one small island off the coast of Albania.\n\nThat was where the plane was headed. Dirksen's private island. In less than an hour, the team would load into the go zone and strap in for low-altitude airdrop in a specially-designed submersible amphibious vehicle, the Makara. The Makara would take them to the island...and there, the final assault would begin.\n\nThis was it. The end of a long, long investigation. At long last, they had Dirksen trapped. At long last, they would bring an end to his shadow empire, and one way or another, Walherich Dirksen would face justice for the lives he had taken.\n\nIn less than an hour, they would arrive.\n\nBut for now...the waiting continued...and the hour could feel like days.\n\n----\n\n*For this first challenge, please play your \"Tales of the Team\" card, and show what you are doing to prepare for the assault. Reflect on what has gotten you to this point, and answer these three questions regarding your service with Captain Clancy's team in PANGAEA so far:*\n\n* *What is one thing, unrelated to your role in the team, that team members have learned about you?*\n\n* *Once during the Dirksen investigation, an operation was going completely sideways, and your abilities turned the tide and made the mission a success. What was going wrong and what did you do to save the day?*\n\n* *Once during the Dirksen investigation, you were in extreme danger on a mission. One of the other player characters saved you with their abilities. What was going wrong, and how did the other character save you?*\n\n*There have been two years of different missions related to Dirksen, including investigations, open conflicts, and stealthy operations. The case has spanned the globe and you have all been working on it for at least the two years of open operations (you are welcome to have been working longer during the years of investigation preceding that if you wish). Dirksen worked with drug smugglers, terrorists, assassins, warmongers, thieves, fences, corrupt officials, dictators, arms dealers, and much more. Feel free to come up with different groups, factions, or individuals that were investigated, turned as resources, or taken down / brought to justice during that time.*\n\n*Please note: On June 13th, I will move the game forward even if some have not gotten to answer these questions. In that case, I will leave the \"Final Prep\" challenge open and you can still play your \"Tales of the Team\" on it and answer the questions even later in the scene - just be sure to write your current actions based on whatever is currently going on at that time.*"
    },
    {
        "game_pid": "x5kma3",
        "story_name": "Defenders of Akakios",
        "post_title": "This is a **beginner game**.\n\nThe small town of Akakios has always known peace--but with the rise of banditry in the area, it has found itself a target for raids in recent years. Now, though, things have become more serious--a local bandit lord has gathered an army, and intends to assault Akakios and take over. If he succeeds, he will make the town his seat of power and use it to strike out into the wider region.\n\nFortunate, then, that you--the citizens of Akakios and the wandering adventurers who have come at just the right time--are ready, willing, and able to fight.\n\n----\n\n\"Defenders of Akakios\" is a simple game taking place in a generic fantasy world. Characters can be any common fantasy race (Elves, Dwarves, Humans, Half-Orcs, etc.) and/or class (Commoner, Fighter, Wizard, Thief, Wizard, etc.). The story will tend towards combat/action situations, so for ease of use I recommend making characters who *are* able and willing to contribute to a fight in some way.\n\nI have set this up to be able to complete in 3-4 scenes in order to teach some elements of the Storium systems to new players.\n\nThough this is set up to run for a shorter time than other beginner games, standard beginner game rules apply. Come in, get the knowledge you need, and then if you'd like to leave and go on to other games, go on with my blessing. \n\nThat said, if you want to stay for the full thing, I think you'll get the most benefit that way and have fun telling a little tale about saving a town from danger.\n\n*I will accept **8** players for this game **mostly** on a first-come, first-serve basis, as that's the most I can see myself keeping track of in a single game. If you see that there are already **8** players in the application pool but would like to join the game, please message me to let me know of your interest. I will do my best to periodically start up additional versions of this game and get new players in, or to invite new players if players drop from this.*",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-05-19 15:26:29 UTC",
        "comment": "The village of Akakios was small, a place barely known to most. An unimportant village on the kingdom border, it was home to woodcutters and a small few craftsmen--simple, charming folk who prided themselves on supplying the kingdom with wood and a few pretty crafts.\n\nIt had always known peace. The kingdom was strong, and the king's army, patrolling the border, easily kept the land free from peril, whether that be from rival kingdoms, monsters, or banditry. Close to the border as it was, Akakios received protection despite its unimportance in the grand scheme of things.\n\nBut now--now, things were different.\n\nThe king's army was divided, withdrawn from the border to prepare to fight on either side of a likely war of succession. The people of the village whispered in fear of what is coming, knowing that the peace of their kingdom might soon be torn apart if the nobles, ruling from high above, could not agree on a successor to the throne.\n\nIn the midst of such struggles, Akakios was forgotten.\n\nBy nobles, by kings, by armies...but not by bandits.\n\nAnd, hopefully...not by heroes, either.\n\nEach had come to Akakios for different reasons. Some had lived there long, others were passing through. Whatever their stories might be, fate had brought them to this place on this day.\n\n----\n\nThe sun rose...and with it came a shout of alarm. A bell rang, rousing villagers and wanderers alike from slumber wherever they had found it. Villagers grabbed farming tools and old, rusted weapons, running in disorder as they readied to defend against a threat none ever knew would truly come.\n\nBut before anyone was prepared, the bandits were upon them. Some came on foot, others on horseback. They were of all kinds--big orcs with wicked axes, deserters with still-gleaming armor and bright swords, desperate poor men with knives and ragged armor...the bandits accepted all who were willing.\n\nWilling to kill to get what they wanted.\n\nIt was a larger force of bandits than any had ever seen--an army, it could be called. A horde.\n\nAnd it was already at the village outskirts. Some of the villagers, caught unaware in the early morning light, were caught among the bandit forces, surrounded by laughing horsemen who threw flaming torches into their homes and sheds, lighting them ablaze.\n\nWithout help, all of Akakios would fall. The people needed heroes to lead them...heroes to rescue those who were trapped.\n\nAnd heroes would rise.\n\n----\n\n**Challenges and Cards:**\n\n*Storium is played, primarily, by making moves that lay cards onto challenges. These cards tell the story, move by move, of what happens during the challenge.*\n\n*When you play a card, write a move explaining what your character does, and how those actions impact the challenge.*\n\n*The effect depends on the card you played. **Strength** cards improve the situation covered by the challenge. **Weakness** cards make it worse. **Neutral** cards, which might be subplots, assets, or goals--you only have subplots for now--push it closer to conclusion without making things feel better or worse.*\n\n*When you lay a card, be sure to involve that card in your move--if you play a Strength card labeled \"Agile,\" for instance, your move should be based on your agility in some way. If you play a Weakness card labeled \"Cowardly,\" your cowardice or tendency to be overcautious should affect things. And if you play your subplot, it's a good time to get a little introspective and show how that subplot is driving you to do what you do, or how the events of the game have changed your view of your subplot--but for first moves, it's usually easier to play a Strength or Weakness.*\n\n*Because you know what impact you're having on the challenge when you lay your card, you should go ahead and write that impact. Don't feel that you need to keep to just your actions--write how you changed things. A lot of narrative power rests with the players here. Don't worry if you don't quite get it right away--it can take some time to learn the right balance, especially if you're used to a tabletop or MUX method where someone other than you determines your results.*\n\n*There are limits: until all pips on the challenge are filled, neither of the final results of the challenge should happen. For instance, until \"Drive Back the Assault!\" is finished, you shouldn't get the enemy army totally clear of the village, and no bandits should get into the main village. Likewise, until \"Rescue the Civilians!\" is finished, you shouldn't state that all the civilians are free of danger, and you shouldn't state that any significant number the civilians have been killed, especially not the mayor.*\n\n*However, while playing on \"Drive Back the Assault!\" you might kill some of the bandits on any card play, organize some villagers into a strong defensive line, take down an enemy champion, slip up and let some bandits surround you, get knocked aside and let the bandits get closer, etc.*\n\n*And on \"Rescue the Civilians!\" you might certainly get some civilians free, kill a bandit or two threatening them, rescue some from a burning building, be unable to find a way past some threatening bandits or into a burning building, or otherwise show the situation developing.*\n\n*It's a balancing act--the trick is to show development but leave the final conclusion for the last card.*\n\n*When you play the last card, you need to write the conclusion. You'll do that based on the result the game displays. Strong or Weak results are written totally by the player. A Neutral result--which happens if there's an even number of Strength and Weakness cards played or if none are played--is written by the narrator. If that comes up, you'll leave the final results open and I'll write something for them.*\n\n*One last thing: In Storium, you can play up to three cards on a single move, and up to three cards per overall scene. Since we have so many players, though, I'd like to request that you follow two rules:*\n\n* *First, play only a single card on each move.*\n\n* *Second, let at least one other person make a move between each of your moves.*\n\n*Sorry for the length of instructions here--please let me know if you have any questions!*"
    },
    {
        "game_pid": "3wxgb9",
        "story_name": "Defenders of Akakios (Game B)",
        "post_title": "This is a **beginner game**.\n\nThe small town of Akakios has always known peace--but with the rise of banditry in the area, it has found itself a target for raids in recent years. Now, though, things have become more serious--a local bandit lord has gathered an army, and intends to assault Akakios and take over. If he succeeds, he will make the town his seat of power and use it to strike out into the wider region.\n\nFortunate, then, that you--the citizens of Akakios and the wandering adventurers who have come at just the right time--are ready, willing, and able to fight.\n\n----\n\n\"Defenders of Akakios\" is a simple game taking place in a generic fantasy world. Characters can be any common fantasy race (Elves, Dwarves, Humans, Half-Orcs, etc.) and/or class (Commoner, Fighter, Wizard, Thief, Wizard, etc.). The story will tend towards combat/action situations, so for ease of use I recommend making characters who *are* able and willing to contribute to a fight in some way.\n\nI have set this up to be able to complete in 3-4 scenes in order to teach some elements of the Storium systems to new players.\n\nThough this is set up to run for a shorter time than other beginner games, standard beginner game rules apply. Come in, get the knowledge you need, and then if you'd like to leave and go on to other games, go on with my blessing. \n\nThat said, if you want to stay for the full thing, I think you'll get the most benefit that way and have fun telling a little tale about saving a town from danger. \n\nThere's something really special about the feeling of *completing* a game. :-)\n\n*I will accept **8** players for this game **mostly** on a first-come, first-serve basis, as that's the most I can see myself keeping track of in a single game. If you see that there are already **8** players in the application pool but would like to join the game, please message me to let me know of your interest. I will do my best to periodically start up additional versions of this game and get new players in, or to invite new players if players drop from this.*",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-06-24 13:23:40 UTC",
        "comment": "The village of Akakios was small, a place barely known to most. An unimportant village on the kingdom border, it was home to woodcutters and a small few craftsmen—simple, charming folk who prided themselves on supplying the kingdom with wood and a few pretty crafts.\n\nIt had always known peace. The kingdom was strong, and the king’s army, patrolling the border, easily kept the land free from peril, whether that be from rival kingdoms, monsters, or banditry. Close to the border as it was, Akakios received protection despite its unimportance in the grand scheme of things.\n\nBut now—now, things were different.\n\nThe king’s army was divided, withdrawn from the border to prepare to fight on either side of a likely war of succession. The people of the village whispered in fear of what is coming, knowing that the peace of their kingdom might soon be torn apart if the nobles, ruling from high above, could not agree on a successor to the throne.\n\nIn the midst of such struggles, Akakios was forgotten.\n\nBy nobles, by kings, by armies…but not by bandits.\n\nAnd, hopefully…not by heroes, either.\n\n----\n\nEach had come to Akakios for different reasons. Some had lived there long, others were passing through. Whatever their stories might be, fate had brought them to this place on this day.\n\nThe sun rose…and with it came a shout of alarm. A bell rang, rousing villagers and wanderers alike from slumber wherever they had found it. Villagers grabbed farming tools and old, rusted weapons, running in disorder as they readied to defend against a threat none ever knew would truly come.\n\nBut before anyone was prepared, the bandits were upon them. Some came on foot, others on horseback. They were of all kinds—big orcs with wicked axes, deserters with still-gleaming armor and bright swords, desperate poor men with knives and ragged armor…the bandits accepted all who were willing.\n\nWilling to kill to get what they wanted.\n\nIt was a larger force of bandits than any had ever seen—an army, it could be called. A horde.\n\nAnd it was already at the village outskirts. Some of the villagers, caught unaware in the early morning light, were caught among the bandit forces, surrounded by laughing horsemen who threw flaming torches into their homes and sheds, lighting them ablaze.\n\nWithout help, all of Akakios would fall. The people needed heroes to lead them…heroes to rescue those who were trapped.\n\nAnd heroes would rise.\n\n----\n\n**Challenges and Cards:**\n\n*Storium is played, primarily, by making moves that lay cards onto challenges. These cards tell the story, move by move, of what happens during the challenge.*\n\n*When you play a card, write a move explaining what your character does, and how those actions impact the challenge.*\n\n*The effect depends on the card you played. Strength cards improve the situation covered by the challenge. Weakness cards make it worse. Neutral cards, which might be subplots, assets, or goals—you only have subplots for now—push it closer to conclusion without making things feel better or worse.*\n\n*When you lay a card, be sure to involve that card in your move—if you play a Strength card labeled “Agile,” for instance, your move should be based on your agility in some way. If you play a Weakness card labeled “Cowardly,” your cowardice or tendency to be overcautious should affect things. And if you play your subplot, it’s a good time to get a little introspective and show how that subplot is driving you to do what you do, or how the events of the game have changed your view of your subplot—but for first moves, it’s usually easier to play a Strength or Weakness.*\n\n*Because you know what impact you’re having on the challenge when you lay your card, you should go ahead and write that impact. Don’t feel that you need to keep to just your actions—write how you changed things. A lot of narrative power rests with the players here. Don’t worry if you don’t quite get it right away—it can take some time to learn the right balance, especially if you’re used to a tabletop or MUX method where someone other than you determines your results.*\n\n*There are limits: until all pips on the challenge are filled, neither of the final results of the challenge should happen. For instance, until “Drive Back the Assault!” is finished, you shouldn’t get the enemy army totally clear of the village, and no bandits should get into the main village. Likewise, until “Rescue the Civilians!” is finished, you shouldn’t state that all the civilians are free of danger, and you shouldn’t state that any significant number the civilians have been killed, especially not the mayor.*\n\n*However, while playing on “Drive Back the Assault!” you might kill some of the bandits on any card play, organize some villagers into a strong defensive line, take down an enemy champion, slip up and let some bandits surround you, get knocked aside and let the bandits get closer, etc.*\n\n*And on “Rescue the Civilians!” you might certainly get some civilians free, kill a bandit or two threatening them, rescue some from a burning building, be unable to find a way past some threatening bandits or into a burning building, or otherwise show the situation developing.*\n\n*It’s a balancing act—the trick is to show development but leave the final conclusion for the last card.*\n\n*When you play the last card, you need to write the conclusion. You’ll do that based on the result the game displays. Strong or Weak results are written totally by the player. A Neutral result—which happens if there’s an even number of Strength and Weakness cards played or if none are played—is written by the narrator. If that comes up, you’ll leave the final results open and I’ll write something for them.*\n\n*One last thing: In Storium, you can play up to three cards on a single move, and up to three cards per overall scene. Since we have so many players, though, I’d like to request that you follow two rules:*\n\n* *First, play only a single card on each move.*\n\n* *Second, let at least one other person make a move between each of your moves.*\n\n*Barring unexpected events there will be another set of challenges in this scene, so I suggest that you do not play all three of your cards for the scene during this first set.*\n\n*Sorry for the length of instructions here—please let me know if you have any questions!*"
    },
    {
        "game_pid": "mycvwr",
        "story_name": "Defenders of Akakios (Game E)",
        "post_title": "This is a **beginner game**.\n\nThe small town of Akakios has always known peace--but with the rise of banditry in the area, it has found itself a target for raids in recent years. Now, though, things have become more serious--a local bandit lord has gathered an army, and intends to assault Akakios and take over. If he succeeds, he will make the town his seat of power and use it to strike out into the wider region.\n\nFortunate, then, that you--the citizens of Akakios and the wandering adventurers who have come at just the right time--are ready, willing, and able to fight.\n\n----\n\n\"Defenders of Akakios\" is a simple game taking place in a generic fantasy world. Characters can be any common fantasy race (Elves, Dwarves, Humans, Half-Orcs, etc.) and/or class (Commoner, Fighter, Wizard, Thief, Wizard, etc.). The story will tend towards combat/action situations, so for ease of use I recommend making characters who *are* able and willing to contribute to a fight in some way.\n\nI have set this up to be able to complete in 3-4 scenes in order to teach some elements of the Storium systems to new players.\n\nThough this is set up to run for a shorter time than other beginner games, standard beginner game rules apply. Come in, get the knowledge you need, and then if you'd like to leave and go on to other games, go on with my blessing. \n\nThat said, if you want to stay for the full thing, I think you'll get the most benefit that way and have fun telling a little tale about saving a town from danger. \n\nThere's something really special about the feeling of *completing* a game. :-)\n\n*I will accept **5** players for this game **mostly** on a first-come, first-serve basis. If you see that there are already **5** players in the application pool but would like to join the game, please message me to let me know of your interest. I will do my best to periodically start up additional versions of this game and get new players in, or to invite new players if players drop from this.*",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2017-01-12 17:49:46 UTC",
        "comment": "The village of Akakios was small, a place barely known to most. An unimportant village on the kingdom border, it was home to woodcutters and a small few craftsmen—simple, charming folk who prided themselves on supplying the kingdom with wood and a few pretty crafts.\n\nIt had always known peace. The kingdom was strong, and the king’s army, patrolling the border, easily kept the land free from peril, whether that be from rival kingdoms, monsters, or banditry. Close to the border as it was, Akakios received protection despite its unimportance in the grand scheme of things.\n\nBut now—now, things were different.\n\nThe king’s army was divided, withdrawn from the border to prepare to fight on either side of a likely war of succession. The people of the village whispered in fear of what is coming, knowing that the peace of their kingdom might soon be torn apart if the nobles, ruling from high above, could not agree on a successor to the throne.\n\nIn the midst of such struggles, Akakios was forgotten.\n\nBy nobles, by kings, by armies…but not by bandits.\n\nAnd, hopefully…not by heroes, either.\n\nEach had come to Akakios for different reasons. Some had lived there long, others were passing through. Whatever their stories might be, fate had brought them to this place on this day.\n\nThe sun rose…and with it came a shout of alarm. A bell rang, rousing villagers and wanderers alike from slumber wherever they had found it. Villagers grabbed farming tools and old, rusted weapons, running in disorder as they readied to defend against a threat none ever knew would truly come.\n\nBut before anyone was prepared, the bandits were upon them. Some came on foot, others on horseback. They were of all kinds—big orcs with wicked axes, deserters with still-gleaming armor and bright swords, desperate poor men with knives and ragged armor…the bandits accepted all who were willing.\n\nWilling to kill to get what they wanted.\n\nIt was a larger force of bandits than any had ever seen—an army, it could be called. A horde.\n\nAnd it was already at the village outskirts. Some of the villagers, caught unaware in the early morning light, were caught among the bandit forces, surrounded by laughing horsemen who threw flaming torches into their homes and sheds, lighting them ablaze.\n\nWithout help, all of Akakios would fall. The people needed heroes to lead them…heroes to rescue those who were trapped.\n\nAnd heroes would rise.\n\n----\n\n***Challenges and Cards:***\n\n*Storium is played, primarily, by making moves that lay cards onto challenges. These cards tell the story, move by move, of what happens during the challenge.*\n\n*When you play a card, write a move explaining what your character does, and how those actions impact the challenge.*\n\n*The effect depends on the card you played. Strength cards improve the situation covered by the challenge. Weakness cards make it worse. Neutral cards, which might be subplots, assets, or goals—you only have subplots for now—push it closer to conclusion without making things feel better or worse.*\n\n*When you lay a card, be sure to involve that card in your move—if you play a Strength card labeled “Agile,” for instance, your move should be based on your agility in some way, showing how it helps. If you play a Weakness card labeled “Cowardly,” your cowardice or tendency to be overcautious should affect things and make them worse somehow. And if you play your subplot, it’s a good time to get a little introspective and show how that subplot is driving you to do what you do, or how the events of the game have changed your view of your subplot—but for first moves, it’s usually easier to play a Strength or Weakness.*\n\n*Because you know what impact you’re having on the challenge when you lay your card, you should go ahead and write that impact. Don’t feel that you need to keep to just your actions—write how you changed things. A lot of narrative power rests with the players here. Don’t worry if you don’t quite get it right away—it can take some time to learn the right balance, especially if you’re used to a tabletop or MUX method where someone other than you determines your results.*\n\n*There are limits: until all pips on the challenge are filled, neither of the final results of the challenge should happen. For instance, until “Drive Back the Assault!” is finished, you shouldn’t get the enemy army totally clear of the village, and no bandits should get into the main village. Likewise, until “Rescue the Civilians!” is finished, you shouldn’t state that all the civilians are free of danger, and you shouldn’t state that any significant number the civilians have been killed, especially not the mayor.*\n\n*However, while playing on “Drive Back the Assault!” you might kill some of the bandits on any card play, organize some villagers into a strong defensive line, take down an enemy champion, slip up and let some bandits surround you, get knocked aside and let the bandits get closer, etc.*\n\n*And on “Rescue the Civilians!” you might certainly get some civilians free, kill a bandit or two threatening them, rescue some from a burning building, be unable to find a way past some threatening bandits or into a burning building, or otherwise show the situation developing.*\n\n*It’s a balancing act—the trick is to show development but leave the final conclusion for the last card.*\n\n*When you play the last card, you need to write the conclusion. You’ll do that based on the result the game displays. Strong or Weak results are written totally by the player. A Neutral result—which happens if there’s an even number of Strength and Weakness cards played or if none are played—is written by the narrator. If that comes up, you’ll leave the final results open and I’ll write something for them.*\n\n*One last thing: In Storium, you can play up to three cards on a single move, and up to three cards per overall scene. Since this is a beginner game, though, I’d like to request that you follow two rules:*\n\n* *First, play only a single card on each move.*\n\n* *Second, let at least one other person make a move between each of your moves.*\n\n*Barring unexpected events there will be another set of challenges in this scene, so I suggest that you do not play all three of your cards for the scene during this first set.*\n\n*Sorry for the length of instructions here—please let me know if you have any questions!*"
    },
    {
        "game_pid": "tx6brk",
        "story_name": "Defenders of Akakios (Game F)",
        "post_title": "This is a **beginner game**.\n\nThe small town of Akakios has always known peace--but with the rise of banditry in the area, it has found itself a target for raids in recent years. Now, though, things have become more serious--a local bandit lord has gathered an army, and intends to assault Akakios and take over. If he succeeds, he will make the town his seat of power and use it to strike out into the wider region.\n\nFortunate, then, that you--the citizens of Akakios and the wandering adventurers who have come at just the right time--are ready, willing, and able to fight.\n\n----\n\n\"Defenders of Akakios\" is a simple game taking place in a generic fantasy world. Characters can be any common fantasy race (Elves, Dwarves, Humans, Half-Orcs, etc.) and/or class (Commoner, Fighter, Wizard, Thief, Wizard, etc.). The story will tend towards combat/action situations, so for ease of use I recommend making characters who *are* able and willing to contribute to a fight in some way.\n\nI have set this up to be able to complete in 3-4 scenes in order to teach some elements of the Storium systems to new players.\n\nThough this is set up to run for a shorter time than other beginner games, standard beginner game rules apply. Come in, get the knowledge you need, and then if you'd like to leave and go on to other games, go on with my blessing. \n\nThat said, if you want to stay for the full thing, I think you'll get the most benefit that way and have fun telling a little tale about saving a town from danger. \n\nThere's something really special about the feeling of *completing* a game. :-)\n\n*I will accept **5** players for this game **mostly** on a first-come, first-serve basis. If you see that there are already **5** players in the application pool but would like to join the game, please message me to let me know of your interest. I will do my best to periodically start up additional versions of this game and get new players in, or to invite new players if players drop from this.*",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2017-01-13 21:25:58 UTC",
        "comment": "The village of Akakios was small, a place barely known to most. An unimportant village on the kingdom border, it was home to woodcutters and a small few craftsmen—simple, charming folk who prided themselves on supplying the kingdom with wood and a few pretty crafts.\n\nIt had always known peace. The kingdom was strong, and the king’s army, patrolling the border, easily kept the land free from peril, whether that be from rival kingdoms, monsters, or banditry. Close to the border as it was, Akakios received protection despite its unimportance in the grand scheme of things.\n\nBut now—now, things were different.\n\nThe king’s army was divided, withdrawn from the border to prepare to fight on either side of a likely war of succession. The people of the village whispered in fear of what is coming, knowing that the peace of their kingdom might soon be torn apart if the nobles, ruling from high above, could not agree on a successor to the throne.\n\nIn the midst of such struggles, Akakios was forgotten.\n\nBy nobles, by kings, by armies…but not by bandits.\n\nAnd, hopefully…not by heroes, either.\n\nEach had come to Akakios for different reasons. Some had lived there long, others were passing through. Whatever their stories might be, fate had brought them to this place on this day.\n\nThe sun rose…and with it came a shout of alarm. A bell rang, rousing villagers and wanderers alike from slumber wherever they had found it. Villagers grabbed farming tools and old, rusted weapons, running in disorder as they readied to defend against a threat none ever knew would truly come.\n\nBut before anyone was prepared, the bandits were upon them. Some came on foot, others on horseback. They were of all kinds—big orcs with wicked axes, deserters with still-gleaming armor and bright swords, desperate poor men with knives and ragged armor…the bandits accepted all who were willing.\n\nWilling to kill to get what they wanted.\n\nIt was a larger force of bandits than any had ever seen—an army, it could be called. A horde.\n\nAnd it was already at the village outskirts. Some of the villagers, caught unaware in the early morning light, were caught among the bandit forces, surrounded by laughing horsemen who threw flaming torches into their homes and sheds, lighting them ablaze.\n\nWithout help, all of Akakios would fall. The people needed heroes to lead them…heroes to rescue those who were trapped.\n\nAnd heroes would rise.\n\n----\n\n***Challenges and Cards:***\n*Storium is played, primarily, by making moves that lay cards onto challenges. These cards tell the story, move by move, of what happens during the challenge.*\n\n*When you play a card, write a move explaining what your character does, and how those actions impact the challenge.*\n\n*The effect depends on the card you played. Strength cards improve the situation covered by the challenge. Weakness cards make it worse. Neutral cards, which might be subplots, assets, or goals—you only have subplots for now—push it closer to conclusion without making things feel better or worse.*\n\n*When you lay a card, be sure to involve that card in your move—if you play a Strength card labeled “Agile,” for instance, your move should be based on your agility in some way, showing how it helps. If you play a Weakness card labeled “Cowardly,” your cowardice or tendency to be overcautious should affect things and make them worse somehow. And if you play your subplot, it’s a good time to get a little introspective and show how that subplot is driving you to do what you do, or how the events of the game have changed your view of your subplot—but for first moves, it’s usually easier to play a Strength or Weakness.*\n\n*Because you know what impact you’re having on the challenge when you lay your card, you should go ahead and write that impact. Don’t feel that you need to keep to just your actions—write how you changed things. A lot of narrative power rests with the players here. Don’t worry if you don’t quite get it right away—it can take some time to learn the right balance, especially if you’re used to a tabletop or MUX method where someone other than you determines your results.*\n\n*There are limits: until all pips on the challenge are filled, neither of the final results of the challenge should happen. For instance, until “Drive Back the Assault!” is finished, you shouldn’t get the enemy army totally clear of the village, and no bandits should get into the main village. Likewise, until “Rescue the Civilians!” is finished, you shouldn’t state that all the civilians are free of danger, and you shouldn’t state that any significant number the civilians have been killed, especially not the mayor.*\n\n*However, while playing on “Drive Back the Assault!” you might kill some of the bandits on any card play, organize some villagers into a strong defensive line, take down an enemy champion, slip up and let some bandits surround you, get knocked aside and let the bandits get closer, etc.*\n\n*And on “Rescue the Civilians!” you might certainly get some civilians free, kill a bandit or two threatening them, rescue some from a burning building, be unable to find a way past some threatening bandits or into a burning building, or otherwise show the situation developing.*\n\n*It’s a balancing act—the trick is to show development but leave the final conclusion for the last card.*\n\n*When you play the last card, you need to write the conclusion. You’ll do that based on the result the game displays. Strong or Weak results are written totally by the player. A Neutral result—which happens if there’s an even number of Strength and Weakness cards played or if none are played—is written by the narrator. If that comes up, you’ll leave the final results open and I’ll write something for them.*\n\n*One last thing: In Storium, you can play up to three cards on a single move, and up to three cards per overall scene. Since this is a beginner game, though, I’d like to request that you follow two rules:*\n\n* *First, play only a single card on each move.*\n\n* *Second, let at least one other person make a move between each of your moves.*\n\n*Barring unexpected events there will be another set of challenges in this scene, so I suggest that you do not play all three of your cards for the scene during this first set.*\n\n*Sorry for the length of instructions here—please let me know if you have any questions!*"
    },
    {
        "game_pid": "gm0j8a",
        "story_name": "Defenders of Akakios (Game C)",
        "post_title": "This is a **beginner game**.\n\nThe small town of Akakios has always known peace--but with the rise of banditry in the area, it has found itself a target for raids in recent years. Now, though, things have become more serious--a local bandit lord has gathered an army, and intends to assault Akakios and take over. If he succeeds, he will make the town his seat of power and use it to strike out into the wider region.\n\nFortunate, then, that you--the citizens of Akakios and the wandering adventurers who have come at just the right time--are ready, willing, and able to fight.\n\n----\n\n\"Defenders of Akakios\" is a simple game taking place in a generic fantasy world. Characters can be any common fantasy race (Elves, Dwarves, Humans, Half-Orcs, etc.) and/or class (Commoner, Fighter, Wizard, Thief, Wizard, etc.). The story will tend towards combat/action situations, so for ease of use I recommend making characters who *are* able and willing to contribute to a fight in some way.\n\nI have set this up to be able to complete in 3-4 scenes in order to teach some elements of the Storium systems to new players.\n\nThough this is set up to run for a shorter time than other beginner games, standard beginner game rules apply. Come in, get the knowledge you need, and then if you'd like to leave and go on to other games, go on with my blessing. \n\nThat said, if you want to stay for the full thing, I think you'll get the most benefit that way and have fun telling a little tale about saving a town from danger. \n\nThere's something really special about the feeling of *completing* a game. :-)\n\n*I will accept **8** players for this game **mostly** on a first-come, first-serve basis, as that's the most I can see myself keeping track of in a single game. If you see that there are already **8** players in the application pool but would like to join the game, please message me to let me know of your interest. I will do my best to periodically start up additional versions of this game and get new players in, or to invite new players if players drop from this.*",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-08-17 22:02:42 UTC",
        "comment": "The village of Akakios was small, a place barely known to most. An unimportant village on the kingdom border, it was home to woodcutters and a small few craftsmen—simple, charming folk who prided themselves on supplying the kingdom with wood and a few pretty crafts.\n\nIt had always known peace. The kingdom was strong, and the king’s army, patrolling the border, easily kept the land free from peril, whether that be from rival kingdoms, monsters, or banditry. Close to the border as it was, Akakios received protection despite its unimportance in the grand scheme of things.\n\nBut now—now, things were different.\n\nThe king’s army was divided, withdrawn from the border to prepare to fight on either side of a likely war of succession. The people of the village whispered in fear of what is coming, knowing that the peace of their kingdom might soon be torn apart if the nobles, ruling from high above, could not agree on a successor to the throne.\n\nIn the midst of such struggles, Akakios was forgotten.\n\nBy nobles, by kings, by armies…but not by bandits.\n\nAnd, hopefully…not by heroes, either.\n\nEach had come to Akakios for different reasons. Some had lived there long, others were passing through. Whatever their stories might be, fate had brought them to this place on this day.\n\nThe sun rose…and with it came a shout of alarm. A bell rang, rousing villagers and wanderers alike from slumber wherever they had found it. Villagers grabbed farming tools and old, rusted weapons, running in disorder as they readied to defend against a threat none ever knew would truly come.\n\nBut before anyone was prepared, the bandits were upon them. Some came on foot, others on horseback. They were of all kinds—big orcs with wicked axes, deserters with still-gleaming armor and bright swords, desperate poor men with knives and ragged armor…the bandits accepted all who were willing.\n\nWilling to kill to get what they wanted.\n\nIt was a larger force of bandits than any had ever seen—an army, it could be called. A horde.\n\nAnd it was already at the village outskirts. Some of the villagers, caught unaware in the early morning light, were caught among the bandit forces, surrounded by laughing horsemen who threw flaming torches into their homes and sheds, lighting them ablaze.\n\nWithout help, all of Akakios would fall. The people needed heroes to lead them…heroes to rescue those who were trapped.\n\nAnd heroes would rise.\n\n----\n\n***Challenges and Cards:***\n\n*Storium is played, primarily, by making moves that lay cards onto challenges. These cards tell the story, move by move, of what happens during the challenge.*\n\n*When you play a card, write a move explaining what your character does, and how those actions impact the challenge.*\n\n*The effect depends on the card you played. Strength cards improve the situation covered by the challenge. Weakness cards make it worse. Neutral cards, which might be subplots, assets, or goals—you only have subplots for now—push it closer to conclusion without making things feel better or worse.*\n\n*When you lay a card, be sure to involve that card in your move—if you play a Strength card labeled “Agile,” for instance, your move should be based on your agility in some way, showing how it helps. If you play a Weakness card labeled “Cowardly,” your cowardice or tendency to be overcautious should affect things and make them worse somehow. And if you play your subplot, it’s a good time to get a little introspective and show how that subplot is driving you to do what you do, or how the events of the game have changed your view of your subplot—but for first moves, it’s usually easier to play a Strength or Weakness.*\n\n*Because you know what impact you’re having on the challenge when you lay your card, you should go ahead and write that impact. Don’t feel that you need to keep to just your actions—write how you changed things. A lot of narrative power rests with the players here. Don’t worry if you don’t quite get it right away—it can take some time to learn the right balance, especially if you’re used to a tabletop or MUX method where someone other than you determines your results.*\n\n*There are limits: until all pips on the challenge are filled, neither of the final results of the challenge should happen. For instance, until “Drive Back the Assault!” is finished, you shouldn’t get the enemy army totally clear of the village, and no bandits should get into the main village. Likewise, until “Rescue the Civilians!” is finished, you shouldn’t state that all the civilians are free of danger, and you shouldn’t state that any significant number the civilians have been killed, especially not the mayor.*\n\n*However, while playing on “Drive Back the Assault!” you might kill some of the bandits on any card play, organize some villagers into a strong defensive line, take down an enemy champion, slip up and let some bandits surround you, get knocked aside and let the bandits get closer, etc.*\n\n*And on “Rescue the Civilians!” you might certainly get some civilians free, kill a bandit or two threatening them, rescue some from a burning building, be unable to find a way past some threatening bandits or into a burning building, or otherwise show the situation developing.*\n\n*It’s a balancing act—the trick is to show development but leave the final conclusion for the last card.*\n\n*When you play the last card, you need to write the conclusion. You’ll do that based on the result the game displays. Strong or Weak results are written totally by the player. A Neutral result—which happens if there’s an even number of Strength and Weakness cards played or if none are played—is written by the narrator. If that comes up, you’ll leave the final results open and I’ll write something for them.*\n\n*One last thing: In Storium, you can play up to three cards on a single move, and up to three cards per overall scene. Since we have so many players, though, I’d like to request that you follow two rules:*\n\n* *First, play only a single card on each move.*\n\n* *Second, let at least one other person make a move between each of your moves.*\n\n*Barring unexpected events there will be another set of challenges in this scene, so I suggest that you do not play all three of your cards for the scene during this first set.*\n\n*Sorry for the length of instructions here—please let me know if you have any questions!*"
    },
    {
        "game_pid": "c4wejj",
        "story_name": "Defenders of Akakios (Game G)",
        "post_title": "This is a **beginner game**.\n\nThe small town of Akakios has always known peace--but with the rise of banditry in the area, it has found itself a target for raids in recent years. Now, though, things have become more serious--a local bandit lord has gathered an army, and intends to assault Akakios and take over. If he succeeds, he will make the town his seat of power and use it to strike out into the wider region.\n\nFortunate, then, that you--the citizens of Akakios and the wandering adventurers who have come at just the right time--are ready, willing, and able to fight.\n\n----\n\n\"Defenders of Akakios\" is a simple game taking place in a generic fantasy world. Characters can be any common fantasy race (Elves, Dwarves, Humans, Half-Orcs, etc.) and/or class (Commoner, Fighter, Wizard, Thief, Wizard, etc.). The story will tend towards combat/action situations, so for ease of use I recommend making characters who *are* able and willing to contribute to a fight in some way.\n\nI have set this up to be able to complete in 3-4 scenes in order to teach some elements of the Storium systems to new players.\n\nThough this is set up to run for a shorter time than other beginner games, standard beginner game rules apply. Come in, get the knowledge you need, and then if you'd like to leave and go on to other games, go on with my blessing. \n\nThat said, if you want to stay for the full thing, I think you'll get the most benefit that way and have fun telling a little tale about saving a town from danger. \n\nThere's something really special about the feeling of *completing* a game. :-)\n\n*I will accept **5** players for this game **mostly** on a first-come, first-serve basis. If you see that there are already **5** players in the application pool but would like to join the game, please message me to let me know of your interest. I will do my best to periodically start up additional versions of this game and get new players in, or to invite new players if players drop from this.*",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2017-02-01 18:34:15 UTC",
        "comment": "The village of Akakios was small, a place barely known to most. An unimportant village on the kingdom border, it was home to woodcutters and a small few craftsmen—simple, charming folk who prided themselves on supplying the kingdom with wood and a few pretty crafts.\n\nIt had always known peace. The kingdom was strong, and the king’s army, patrolling the border, easily kept the land free from peril, whether that be from rival kingdoms, monsters, or banditry. Close to the border as it was, Akakios received protection despite its unimportance in the grand scheme of things.\n\nBut now—now, things were different.\n\nThe king’s army was divided, withdrawn from the border to prepare to fight on either side of a likely war of succession. The people of the village whispered in fear of what is coming, knowing that the peace of their kingdom might soon be torn apart if the nobles, ruling from high above, could not agree on a successor to the throne.\n\nIn the midst of such struggles, Akakios was forgotten.\n\nBy nobles, by kings, by armies…but not by bandits.\n\nAnd, hopefully…not by heroes, either.\n\nEach had come to Akakios for different reasons. Some had lived there long, others were passing through. Whatever their stories might be, fate had brought them to this place on this day.\n\nThe sun rose…and with it came a shout of alarm. A bell rang, rousing villagers and wanderers alike from slumber wherever they had found it. Villagers grabbed farming tools and old, rusted weapons, running in disorder as they readied to defend against a threat none ever knew would truly come.\n\nBut before anyone was prepared, the bandits were upon them. Some came on foot, others on horseback. They were of all kinds—big orcs with wicked axes, deserters with still-gleaming armor and bright swords, desperate poor men with knives and ragged armor…the bandits accepted all who were willing.\n\nWilling to kill to get what they wanted.\n\nIt was a larger force of bandits than any had ever seen—an army, it could be called. A horde.\n\nAnd it was already at the village outskirts. Some of the villagers, caught unaware in the early morning light, were caught among the bandit forces, surrounded by laughing horsemen who threw flaming torches into their homes and sheds, lighting them ablaze.\n\nWithout help, all of Akakios would fall. The people needed heroes to lead them…heroes to rescue those who were trapped.\n\nAnd heroes would rise.\n\n----\n\n***Challenges and Cards:***\n*Storium is played, primarily, by making moves that lay cards onto challenges. These cards tell the story, move by move, of what happens during the challenge.*\n\n*When you play a card, write a move explaining what your character does, and how those actions impact the challenge.*\n\n*The effect depends on the card you played. Strength cards improve the situation covered by the challenge. Weakness cards make it worse. Neutral cards, which might be subplots, assets, or goals—you only have subplots for now—push it closer to conclusion without making things feel better or worse.*\n\n*When you lay a card, be sure to involve that card in your move—if you play a Strength card labeled “Agile,” for instance, your move should be based on your agility in some way, showing how it helps. If you play a Weakness card labeled “Cowardly,” your cowardice or tendency to be overcautious should affect things and make them worse somehow. And if you play your subplot, it’s a good time to get a little introspective and show how that subplot is driving you to do what you do, or how the events of the game have changed your view of your subplot—but for first moves, it’s usually easier to play a Strength or Weakness.*\n\n*Because you know what impact you’re having on the challenge when you lay your card, you should go ahead and write that impact. Don’t feel that you need to keep to just your actions—write how you changed things. A lot of narrative power rests with the players here. Don’t worry if you don’t quite get it right away—it can take some time to learn the right balance, especially if you’re used to a tabletop or MUX method where someone other than you determines your results.*\n\n*There are limits: until all pips on the challenge are filled, neither of the final results of the challenge should happen. For instance, until “Drive Back the Assault!” is finished, you shouldn’t get the enemy army totally clear of the village, and no bandits should get into the main village. Likewise, until “Rescue the Civilians!” is finished, you shouldn’t state that all the civilians are free of danger, and you shouldn’t state that any significant number the civilians have been killed, especially not the mayor.*\n\n*However, while playing on “Drive Back the Assault!” you might kill some of the bandits on any card play, organize some villagers into a strong defensive line, take down an enemy champion, slip up and let some bandits surround you, get knocked aside and let the bandits get closer, etc.*\n\n*And on “Rescue the Civilians!” you might certainly get some civilians free, kill a bandit or two threatening them, rescue some from a burning building, be unable to find a way past some threatening bandits or into a burning building, or otherwise show the situation developing.*\n\n*It’s a balancing act—the trick is to show development but leave the final conclusion for the last card.*\n\n*When you play the last card, you need to write the conclusion. You’ll do that based on the result the game displays. Strong or Weak results are written totally by the player. A Neutral result—which happens if there’s an even number of Strength and Weakness cards played or if none are played—is written by the narrator. If that comes up, you’ll leave the final results open and I’ll write something for them.*\n\n*One last thing: In Storium, by default, you can play up to three cards on a single move, and up to three cards per overall scene. Since this is a beginner game, though, I’d like to request that you follow two rules:*\n\n* *First, play only a single card on each move.*\n\n* *Second, let at least one other person make a move between each of your moves.*\n\n*Barring unexpected events there will be another set of challenges in this scene, so I suggest that you do not play all three of your cards for the scene during this first set.*\n\n*Sorry for the length of instructions here—please let me know if you have any questions!*"
    }
]