[
    {
        "game_pid": "kwmjwb",
        "story_name": "The Waters & The Wild",
        "post_title": "*Where the wave of moonlight glosses*\n*The dim gray sands with light,*\n*Far off by furthest Rosses*\n*We foot it all the night,*\n*Weaving olden dances*\n*Mingling hands and mingling glances*\n*Till the moon has taken flight;*\n*To and fro we leap*\n*And chase the frothy bubbles,*\n*While the world is full of troubles*\n*And anxious in its sleep...*\n\nThe forest in this section of North Carolina's Blue Ridge Mountains grows tall and thick, as if nothing human has disturbed it for centuries. Those of you who have been in the program for months have seen no evidence to suggest otherwise. There's nothing but mountain forest rolling around you, blue as the name suggests. \n\nEveryone has a different story of how they got here and why. If you'd read the glossy brochures that your parents had studied, you'd have read that Summit Journeys promises one of the most effective [wilderness therapy programs](https://en.wikipedia.org/wiki/Wilderness_therapy) for teens on the East Coast. Treating both boys and girls ages 14 - 17, Summit takes troubled teens who struggle with drug abuse, anxiety, depression, defiance, aggression, low self-esteem, and a host of other challenges and introduces them to a therapeutic natural environment free of the distractions that trap them in a cycle of bad habits and disappointment. The program offers nothing less than life-altering transformation for lost teenage souls.\n\nBut you didn't read those brochures. If you're like most of the students at Summit, you woke up to two muscular men in your room who informed you that you were coming with them, one way or another. Some of your parents watched you go, even said good-bye. None of them write to you now, though it's not their fault. Contact with the outside isn't allowed. You're here in the mountains with other \"at-risk teens,\" hiking every day and camping in primitive shelters every night, until the counselors say that you're better. The only escape comes in your dreams, when alone in your tent you take yourself to a world where you have not been abandoned. \n\nIt may be closer than you think.\n\n*Come away, O human child!*\n*To the waters and the wild*\n*With a faery, hand in hand,*\n*For the world’s more full of weeping than you can understand.*\n\n-- \"The Stolen Child,\" W.B. Yeats",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2017-10-09 10:51:52 UTC",
        "comment": "Theyd hiked halfway up Unega Peak when Kurt, the Head Counselor of Summit Journeys Expedition Team, planted his hands on his hips and squinted through an opening in the branches. The exact time of day was impossible to tell, except for the counselors with their waterproof sports watches. Rainclouds had darkened the western horizon all afternoonat least, Ryan had called it the western horizon, and Ryan had been a Boy Scout for five years. Said he was, anyway. Now the sky hung above them in a palette of charcoals and ash. That could mean oncoming dusk or bad rain. See that out there? Kurt pointed toward the valley below, where fog spilled between the mountains like smoke. Gonna be a hell of a night. Or both. Yee fucking haw, pardner, someone in the cluster of students muttered in a cartoonish Old West accent. A few heads turned. There were twelve students at Summit this week twelve dirty, sweaty, exhausted teenage souls carrying at least twenty pounds each through miles of mountain wilderness. Only a few could muster the energy for sarcastic comments before dinner. Whats that? Kurt said sharply. Nobody moved Uh huh. Kurt shook his head. Dont bring a bad attitude out here, people. Wilds got no place for it. You all wound up here for different reasons, but youve all got the same goal: youve gotta change your path. Change your attitude, change your path. Got it? Got it, a few low voices replied. The students knew better than to show any obvious signs of skepticism. *Got it?* Got it! Better, or Im gonna be hauling your ass up and down these trails til Christmastime. Kurt planted one foot on a swell of tree root, the stance he always took when it was time to stop for the day. Alright, time to set up our vacation homes. Eloise. He waited for her to make eye contact before continuing, pointing to Aaron and Izzie. Youre gonna take our newcomers and show em how to make a proper fire. Tomorrow night, theyre taking charge of it on their own, so do a good job unless youve got an appetite for cold beans. Dont go chasing squirrels this time, yeah? Someone spat into the underbrush. This time, there was no need to look for the culprit. No one hawked a loogie as loudly or as often as Brett-- Brett with his low drawl, hunched shoulders, and enough jail stories to fill an episode of Beyond Scared Straight. Brett. Nope. Kurt waved him over with a lazy swing of his arm. Were gonna have a conversation. Liz, you mind divvying up the rest of the work? Brett. You, here. Come on. Whatever. Brett slumped after Kurt, the two of them moving just out of earshot into the forest. Liz, the second most experienced counselor, shook her head. There he goes again. Alright! Listen up, people The usual set of chores stood between them and sweet, sweet rest. In the wilderness, at least the work made sense. Everyone had to set up their own shelters, while specific chores rotated among the students: making the fire, cooking the group meal, gathering kindling and deadfall, andeverybodys *favorite* chorepit duty. The forest didnt offer indoor plumbing. A few specks of water dotted the students forearms the skys warning shots. Could be in five minutes or in two hours, but those clouds were ready to open."
    },
    {
        "game_pid": "533yhw",
        "story_name": "The Veil Is Tearing: Alcippe",
        "post_title": "*With cities, it is as with dreams: everything imaginable can be dreamed, but even the most unexpected dream is a rebus that conceals a desire or, its reverse, a fear. Cities, like dreams, are made of desires and fears, even if the thread of their discourse is secret, their rules are absurd, their perspectives deceitful, and everything conceals something else.*\n\n\n--Italo Calvino, *Invisible Cities*\n\n\n\n\nAt this point in her life, Alcippe has mostly finished with questions. Instead, people feel free to direct their (presumptuous, unwelcome) questions at her.\n\n\n*Well, it’s lovely that your career is going so well, but what else do you have going on in your life right now? Single at your age, don’t you think you’re pushing it? Why didn’t you approve my permit for this new (variations)?* \n\n\nShe’s got her professional, deflecting smile down to an art form.\n\n\nBehind the practiced glare of a woman who knows how to get things done—a vital skill in a bureaucracy like the city of Sophono’s Department of Transportation—Alcippe is starting to feel tired.\n\n\nOh, there are still days when emails get answered near-instantaneously, the gears of the local government flow smoothly in place, and she can almost feel the well-oiled hum of the city purring around her offices in contentment. There are still nights when she comes home to her otherwise empty apartment, and she can look outside the window at the ordered grids of streetlights and highway traffic and feel full inside. Sometimes, it feels like enough.\n\n\nIncreasingly, she comes home to a bottle of wine, maybe a trashy novel, and a hollowness that gnaws at her from somewhere in her esophagus. She catches herself daydreaming about getting into fights with faceless strangers, or packing a bag and escaping to another place, somewhere far away and unimaginable, like the surreal cityscapes that she sometimes paints.\n\t\n\nAfter years of service to the Department of Transportation, questions are starting to enter Alcippe’s mind again. \n\n\nHas she given enough, yet? Can she rest now?\n\n(Part of The Veil Is Tearing. Communal game here: https://storium.com/game/the-veil-is-tearing-communal)",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-07-13 02:37:07 UTC",
        "comment": "#Act I: Earth and Water The GPS said the approximate arrival time would be 11:02 AM. Not bad, Alcippe thought, and remembered to relax her iron grip on the steering wheel. She liked being punctual. In her mind, punctuality meant showing up at least half an hour early and getting a feel for the environment and the situation before the Powers That Be appeared with their plastic smiles and slick presentations. Better to lay down the foundations of understanding herself before someone tried to shove their own biased version down her throat. \"Oh my God,\" the chipper voice in the passenger seat said, and Alcippe's fingers clamped down around the steering wheel reflexively. She had to consciously will her fingers to loosen again. The voice belonged to Cynthia Brower. Twenty-eight years old and armed with a seemingly endless wardrobe of cute yet professional work attire, Cynthia was the cheery bane of Sophono's Department of Transportation. She carried herself like the more naive interns, full of incessant cheer and helpfulness. To be fair, though, she knew how to do her job and she always came prepared. That's why Alcippe hadn't objected too strongly when Cynthia was selected to accompany her on this little venture. *On a Saturday,* her mind couldn't help but add with a touch of bitterness. Brimo Amusements, the company was called. They'd steadily bought up the land around Sophono through a series of real estate deals, some above-board, some a bit... 'mysterious,' for the past two years. Now, they had reached out to Sophono's stakeholders with an invitation to a private luncheon, where they apparently planned to divulge their proposals for land development. They'd rented conference space at the Hyatt. Alcippe wasn't sure what she should expect: a cramped, tiny boardroom full of sweaty middle-aged men in business suits? A lavish affair in the ballroom, complete with fondue fountains and ice sculptures? The ride to the Hyatt wasn't long, but Cynthia had taken the opportunity to regale Alcippe with all of the notes she'd taken on Brimo Amusements' properties and history. The eager young woman had flooded the car with a prattling series of facts and figures that never seemed to end. Cynthia was talking again. \"This Alexander Brimo guy, he owns *seven* other properties across the tri-state area. There's a-- hm, hold on. No, I don't want to buy your whiskey. *Gawd*, why do they always show you alcohol ads in everything? Do I *look* like an alchie? Hello. ...okay, right, seven properties, looks like we've got... a branch of American Amusements, a go-kart place, a... mini-golf place? Or a water park? Or water-mini-golf? I don't even know what this is-- wow. And he wants to bring this new park to *our* neighborhood. He must be a busy man.\" Cynthia laughed. No-- no, that wasn't the right word. She *tittered* like a small bird. \"Gosh. Isn't this exciting? Maybe this place will put Sophono on the map! I mean, the extra traffic from all the tourism might put some strain on our infrastructure, the hospitality industry, things like that, but. The economy. Imagine how much money could come pouring in, huh?\" Alcippe didn't need to look at the younger woman; she could hear the grin in Cynthia's voice. They still had some time before they arrived. Maybe it was worth talking shop, laying out the facts so they could present a common front at the meeting. Or maybe, she should just push Cynthia out into the road and speed off down the Thruway. At least she'd be able to enjoy a little silence on her Saturday morning before schmoozing time."
    },
    {
        "game_pid": "ykvy0m",
        "story_name": "At the Door of Heaven",
        "post_title": "\"Remember that, however wicked you may have been, you have now the chance to win pardon for all your sins. He who strikes a blow to rescue the Holy Sepulchre from the pollution of the unbelievers has thrown open the door of heaven for himself.\"\n-Peter the Hermit\n\nIt is the year 1171, between the Second and Third Crusades. Nearly a hundred years have passed since Pope Urban called for holy war at Clermont and the gathered crowds responded: \"God wills it!\"  The Western residents of the Crusader states have managed to establish stable settlements throughout the length of the Levant, though raids by local mountain tribes and the Seljuqs to the East continue to threaten pilgrims to the Holy Land. To the south, the last Fatimid caliph has fallen to the new Sultan of Egypt: Saladin. King Amalric has journeyed to Constantinople to request Byzantium's help against the increasingly united forces of the Saracens, but no help is coming. Already, Saladin's forces have begun to claim territory in the Kingdom of Jerusalem. \n\nEven here, thirty miles north of the Sea of Galilee, the news is clear: war will come again to the Holy Land. \n\nAtop the summit of a rocky mountain, a hard day's journey east from the major roads that run south to Jerusalem, the modest fortress of Domus Boni Latronis stands near the frontier of Crusader territory. Allegedly, it marks the birthplace of the Good Thief, who was crucified alongside Jesus but repented before his death. Now, it is a lesser-known pilgrimage site for desperate sinners seeking redemption as well as the headquarters of a small garrison of Poor Fellow-Soldiers of Christ and of the Temple of Solomon, known to most as the Templars.\n\nFort Latronis seems an odd place to house a squadron of Christendom's elite warriors in these uncertain times. The frontier is a dangerous place, and the Templars are dedicated to the protection of pilgrims, certainly... but the site is so obscure, its location so isolated. The Templars' vows of obedience discourage active questioning of their leaders, so they continue their daily routines of praying, escorting pilgrims, and maintaining their readiness to battle the Saracens.\n\nIt will soon become clear that there is something older and far more malevolent  in these mountains than Mohammedans. Something that the Order hopes to harness as a weapon in the war for the Holy Land-- if it does not destroy them all, Christian and Saracen alike.\n\n---\n\nFor more information on character creation, visit the forum thread in Looking for Players: https://storium.com/forums#/category/lfp/thread/h4rtq8",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-12-07 00:37:19 UTC",
        "comment": "Brother Tancred cleared his throat. Long moments had passed since either of the two men in the room had broken the silence. Hearing it broken, Master Galien, preceptor of Fort Latronis, raised his head as if carrying a great weight. \"Speak your mind, brother.\" The long years of the Master's service manifested in his voice, a thing dried and hardened by this country-- its merciless sun, its turmoil a test of both body and soul. The commandery chaplain took a step forward. \"Master-- I would counsel against the abandonment of our great task. With honor and fitting dedication, you have sought this thing for over twenty years of your life. Would you abandon the Lord's work now, in what is possibly the hour of its completion?\" \"The Lord understands the value of men, brother. And we have too few.\" \"Spare a few more, to finish the work at last. A handful, well-armed but swift, to seek what they can and return within the week. If not to find the weapon, then to investigate the manner of our brothers' deaths. Surely we will not leave our brothers of the Temple unmarked and unmourned.\" The Master stared into the fire that illuminated the barren stone walls of the council room. When he spoke again, there was a quiet in his voice that no other man in the fortress had been allowed to hear. \"How many more Christian souls will go to the gates of heaven at my behest? How many names of Temple brothers will Saint Peter record in his book-- before our work is finished?\" \"Salvation through sacrifice-- it has ever been the way of the Lord,\" the priest answered. \"The blood of the few will preserve the blood of the many, just as the blood of the Son saved his flock. It is the Lord's work that we do, and have the courage to do. And difficult as the path may be, at the end of it lies the redemption of the Kingdom of Jerusalem.\" The rhythm of the conversation was familiar to both men. It was the master's role to doubt, and the priest's duty to reassure. \"Thanks be to God.\" Master Galien turned and met the priest's eyes. \"I will send my summons. After supper. Best if they leave tonight.\" The priest nodded. \"By your will.\" \"By His,\" Master Galien said. There was a pause, and then the door closed behind him. --- One by one, Master Galien's servant, Bertrand, found them all: some tending to their horses, some after they left the divine offices of Nones or, later, Vespers. By suppertime, each of the chosen knights had received Master Galien's summons. They were to proceed to the Master's council room immediately after supper, for reasons that Bertrand did not explain, or appear to know. Some of them were not terribly bothered. Three pilgrims currently occupied the lodgings set aside for that purpose; likely they had concluded their penances and required an escort back to the main road. Some of them harbored darker suspicions, though. Secrets did not sit easily in the communal life of the Templars, and some among them harbored secrets they did not care to divulge. Could it be that they had been found out? The Gospel reading at supper, delivered as always by Brother Tancred, was recognizable to the educated among them as the temptation of Jesus in the desert and the calling of the Apostle Peter. Those who had not learned Latin still recognized the oft-cited words: *Poenitentiam agite: appropinquavit enim regnum caelorum.* Do penance: for the kingdom of heaven is at hand. At supper's end, they made their way to the Master's council room, down a windowless corridor that led mostly to storage vaults. The door had been left open, revealing sparse furnishings: a long, plain table with wooden benches-- a fireplace in which someone had prepared a steady blaze prior to their arrival-- a stone relief of the Order's emblem, two knights riding a single horse, adorning the wall-- and three chests set against the far wall. Each chest bore the privileged device to which none of them were entitled: a lock. None of \"them\"? It appeared that the summons given to each man had gone to others as well. Who was the Master gathering here-- allies, accusers? To what purpose? And how were they to conduct themselves as they awaited his arrival?"
    },
    {
        "game_pid": "mkq6aq",
        "story_name": "The Veil Is Tearing: Daniel",
        "post_title": "*Yesterday, upon the stair,*\n\n*I met a man who wasn't there.*\n\n*He wasn't there again today-*\n\n*I wish, I wish he'd go away.*\n\n--Hughes Mearns\n\n\nDr. Daniel Lewis can't remember the last time he was alone. He tried to explain this, once, in a fit of drunken despair. It was after 2 AM, which would have been his first clue if he hadn't been a dumb college kid distracted by assignments and the occasional inexplicable happening. Happenings like his blackouts, or the Word documents that appeared every now and then on his laptop, rambling tidbits of philosophy that he couldn't remember writing. He turned to someone who seemed to be equally out of his mind on Jager bombs and who knows what else, and told him about the demon who lived inside his head. Daniel could always feel it, grinning, grumbling, or simply using his eyes to peer out at the living world. Even when it slept, he could almost feel the dull thrum of its snoring.\n\nThe wasted kid said he would totally see the movie that Daniel was making, once the screenplay was finished. Then he spent the next twenty minutes in a locked bathroom stall. \n\nDaniel had had another blackout that night, though he couldn't tell if it was from the demon or the alcohol. A few days later, he heard that the wasted kid had been checked into an in-patient rehabilitation clinic. Something about a drug-induced psychotic break. Poor bastard.\n\nThese days, Daniel saves his heart-to-hearts for his charges: the mad ones, the men (and they are usually men) with the locations of bodies locked inside fractured minds. It's possible that he hopes to find someone who shares his *unique condition.* It's also possible that he's simply most at home among the mad and the dead.\n\nSo, Daniel doesn't have many people he can turn to when he starts to hear whispers of other voices. There's a storm brewing in the spaces between this reality and the next. Even the demon is ill at ease, jittering somewhere in the recesses of Daniel's mind. \n\nWith his (or the demon's?) abilities, Daniel is in a unique position to deal with the coming darkness. Kant would call it a moral imperative. \n\nTo the demon, 'opportunity' is the better word.\n\n(Part of The Veil Is Tearing. Communal game here: https://storium.com/game/the-veil-is-tearing-communal)",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-07-13 06:07:26 UTC",
        "comment": "#Act I: A Handful of Dust Daniel came early to the wake. The funeral home's parking lot was mainly empty, except for a small scattering of vehicles. Two were parked in the spaces closest to the back door, likely the designated spots of the funeral home staff. There were three or four other cars he didn't recognize, and one that he did: a 1998 Toyota Camry, the \"Torture Is a Moral Issue\" bumper sticker still plastered to the back, faded but stubbornly legible. His grandparents hadn't exactly adjusted well to change, as long as he'd known them. He had been sitting in the car for ten minutes. Something kept him in the driver's seat, staring through the windshield at the trees lining the parking lot. It was a sunny Saturday morning, and the leaves made gold-green kaleidoscopes on the sidewalk. The manicured shrubs hinted that a loving hand had directed the landscaping here. The inside would probably be like that, too: extravagant bouquets of flowers, carefully color-coordinated curtains, neat arrangements of chairs, memorial wreaths, photo collages, sympathy cards, guestbooks. The dead body itself, sculpted with formaldehyde, plaster, mortician's makeup, bathed and stuffed and hooked and shaped. They might as well rig it with animatronics and sell it to Universal Studios. Daniel rubbed his eyes and sighed. It wasn't right to think this way about his grandfather, but discomfort lodged in his esophagus, made him want to sulk and tell terrible jokes about the Holocaust and dead babies, made him stay in the car when he knew his grandma was inside and probably needed him. Lung cancer, for God's sake. Eighty-nine years, most of them spent working for the IRS or dodging Japanese bullets in the Pacific theater during World War II, and it was the Marlboros that finally closed out his accounts. Still. As Daniel knew, there were far worse ways to go. In a moment of decision, he jerked himself out of the car, locked up, and walked through the door of Rosenberg Funeral Home. The walls were softly lit and lined with grandmother-pink wallpaper. *Maternal* was the word for it. Daniel looked around the empty hallways. Nothing but chairs lined up outside walls and open doors to empty rooms. He chose a direction, turned the corner, and saw his grandmother standing with her hands clasped to her chest. She was speaking with a tall man who had sympathetic eyes and a crown of wispy white hair surrounding an oddly reflective bald spot. Grandma's eyes wandered, found his, and she stopped. So did Daniel. For a moment, they stood and looked at each other. How many years had it been? She seemed to wonder the same thing. Her eyes were more tired than he remembered. He saw the light of recognition dawning in them, and she unclasped her hands and opened her arms. \"Daniel. Oh. Daniel. You made it here.\" \"Grandma.\" Daniel closed the distance and wrapped his arms around her shoulders. It felt like hugging a baby bird. Grandma ended the hug and looked up at him with her palms against his shoulders. She was smiling, but her eyes had a certain flatness. Was it a hint of anger? \"It's good to have you here, Daniel.\" The tall man shuffled his weight slightly, and Grandma backed away to include him in their confidence. \"Daniel, this is Arthur. He owns the funeral home here.\" \"Pleased to meet you, Daniel,\" Arthur said, turning his kind eyes on Daniel and extending his hand to shake. \"Your grandfather was a friend of mine, going a long way back. I'm happy to do anything I can for the Spanners.\" \"Thank you,\" Daniel said. His mind had chilled a bit after seeing the look in Grandma's eyes, and automatic politeness came out of his mouth. \"I appreciate that.\" Arthur smiled. \"Well, I know you've come quite a ways to get here. I'm sure you'd like some privacy, before the guests arrive for the viewing. If you need me,\" he said, inclining his head toward Grandma almost as if bowing, \"I'll be in my office.\" \"Bless your heart, Arthur,\" Grandma said. \"You've been so kind.\" Arthur left them in the hallway, and Grandma watched him for a few moments. When he disappeared from sight, she sighed and her shoulders seemed to sag. \"It's good to see you,\" she said. \"It's good to see you, too,\" Daniel said. She looked at him, and there was a cold spark in her eyes, even through the grief and exhaustion of the past few days' arrangements. \"It's been a long time, Daniel.\" An edge had crept into her voice, and it hung in the air between them."
    },
    {
        "game_pid": "zc21ss",
        "story_name": "The Veil Is Tearing: Araceli",
        "post_title": "*Nature is a haunted house — but Art — is a house that tries to be haunted.*\n\n– Emily Dickinson\n\nAt 7 AM, the orderlies at Whistler-Down Center for Personal Growth make their rounds for morning checkup. The day begins with the comforting routine of breakfast in the cafeteria (eggs, orange juice, and cereal again, plus a brownish liquid that some folks have the audacity to call ‘coffee’) and the assurance that no one has committed suicide overnight. \n\n\nAraceli, or whatever her real name is, has woken up at 7 AM for—well, a number of years. It’s hard to remember an exact number. She’s pretty certain that the number stands at three, at least. Four, *maybe.* At the last place, it was 6:30.\n\n\nWhistler-Down isn’t so bad, and by now, Araceli is practically a connoisseur. There have been worse places, drearier ones, other places where it felt as if even the walls were angry: peeling paint, four or more patients crowded into rooms meant for two, nurses who looked at the patients as if calculating the precise dollar amount they were receiving for handling each individual request. One facility was better, the one with free WiFi and a yoga studio. That was years ago— five, or ten. Life in a mental hospital doesn’t have seasons. It is always fluorescent lights and temperature-controlled tile hallways.\n\n\nDespite the passage of the years, Araceli tries her best to remember the truth: she doesn’t belong here, not really. She just… knows things, sometimes, that haven’t happened yet. She had tried to warn her family, back in the other lifetime when there were things like seasons and the outside. That’s what landed her here in the first place, and all the other psychiatric hospitals, mental health centers, and residential programs. She knew things that she had no right to know and talked to entities she had no right to perceive. \n\t\n\nShe heard that her family held a funeral for her years ago. She wonders who gave the eulogy and if it was any good. Maybe that’s why these… voices seek her out now: as far as her family is concerned, she’s already dead and buried. She might as well be on the Otherside.\n\t\n\nThe human mind can break in so many ways—in huge fissures like the scars carved into the earth by earthquakes, or in mosaic-shards of color fanned out like the feathers of mallard ducks.\n\n\n\nAraceli is stuck here in the treatment center, with shards of broken minds and snatches of lost souls caught wandering through the worlds with nothing to light their way. \n\n\n\nThe voices have started whispering about a change. Outwardly, the world of Whistler-Down is the same safe, antiseptic environment: the orderlies still come around at 7 AM. On the Otherside, though, underneath and within the meticulously cleaned tiles, something is coming. Something much bigger than anything Araceli has seen before.\n\n(Part of The Veil Is Tearing. Communal game here: https://storium.com/game/the-veil-is-tearing-communal)",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-07-13 00:56:12 UTC",
        "comment": "#Act I: Sparks It was a particularly sunny Saturday morning at Whistler-Down. Breakfast had been scrambled eggs, toast, orange juice, and oatmeal, as usual-- with the addition of bacon. Real, honest-to-God bacon that had once been part of a pig. Even Jaz had cracked a smile, though she was quick to return her black lipstick-painted lips back to their usual scowling position in case someone was looking. Araceli had caught it anyway and tried her best to hide her smirk. The only person who hadn't been happy about the menu surprise was Elsie, but that couldn't be helped. She was starting to make some progress: the day before, she'd eaten at least something at all three meals. Some of the hollowness was starting to fade from her cheeks. After breakfast, the topic of the community discussion group had been Creatively Resolving Conflicts... again. Araceli was one of the more 'permanent' residents at Whistler-Down. In the women's ward, only Grace had been around longer than she had, as far as she could tell. Grace was constantly dozing off, thanks to whatever medication they'd put her on. It was hard to get her to stay awake long enough to have a sustained conversation. Creatively Resolving Conflicts was one of the more engaging workshops, at least. The facilitator had brought in cue cards for role-playing exercises, which was always entertaining. The Saturday wasn't off to a bad start. According to the clock in the common room, it was 9:30. Araceli had to wait until 9:32 for Jim to come find her. Jim was one of the younger orderlies. He performed his duties with briskness and avoided eye contact with most patients when he did. It was apparent that whatever he'd once envisioned for his life, Whistler-Down hadn't been part of the plan. It was the usual Saturday morning for him: his eyes were watery and bloodshot, and he dragged himself through the hallways as if Grace had lent him some of her meds. \"Ara, doctor's check,\" Jim slurred. He followed her at a perfunctory distance until they reached Dr. Janus' office. His hand fumbled at the doorknob for just a moment, as if he'd misjudged the distance. Ara felt the quick glance he shot at her, baleful with the spiderweb-fissures of veins in his eyes. It didn't really matter if she noticed the slip-up-- as one of the longer-term patients and a persona non grata to the outside world, her judgments didn't count for much. But he still had the instinct to check. Jim opened the door. Dr. Benjamin Janus sat inside, the light of the sunny Saturday morning illuminating him like a muted halo. This was the most tranquil space in the entire hospital, with leather couches, soft rugs, bright cheery plants near the windows, and paintings in warm and vibrant colors. Dr. Janus looked up from his papers. \"Ara!\" he called out with a smile. \"Come on in.\" His eyes shifted to Jim. The two men shared a nod. Jim shot a sullen look at Ara before shuffling off. Ara closed the door behind her and took the patient's customary seat on the brown leather couch. On mornings past, an orderly had needed to accompany her into the office and occupied the other end of the couch. With only her and the doctor in the room, the room felt freer, as if there were more air to breathe. The psychiatrist pushed some papers to the side of his desk and turned his full attention to Ara. His smile was a little worn, and his crow's feet seemed sculpted more deeply than usual. He'd already seen a few patients today, and some of them must have given him a hard time. \"You look radiant today, Ara. Milagros tells me you've had a good week.\" It was true. Milagros, the evening shift nurse in the women's ward, would usually be the one to come to Dr. Janus' office bearing bad news about relapses, episodes, and breakdowns. Not so, this week. \"Tell me how you're feeling. How's your mood? And how's the Rozerem working out? We can always go back to Ambien if you've noticed any side-effects.\" It wasn't apparent in his smile, which despite his tiredness shone with genuine affability, but they'd had this conversation many times over the years. Ara knew his usual repertoire of questions and could guess his timing to the second. These were the usual starting questions. In a few minutes, in his usual manner of compassion coupled with professionalism, Dr. Janus would dip into the more serious questions: how were the nightmares. Had she experienced any desires to hurt herself or others. Was she experiencing thoughts of suicide. It was another Saturday."
    },
    {
        "game_pid": "wkvhjf",
        "story_name": "The Wake of His Dreams",
        "post_title": "\"No — Gatsby turned out all right at the end; it is what preyed on Gatsby, what foul dust floated in the wake of his dreams that temporarily closed out my interest in the abortive sorrows and short-winded elations of men.”\n--F. Scott Fitzgerald, *The Great Gatsby*\n\nAfter the parties stopped sometime in 1922, nobody paid much attention to the gaudy mansion sitting at the edge of Long Island Sound, on the utmost tip of West Egg. It was a mad time, back then, a crazy swinging time that moved so fast it was easy to get distracted. Besides, no one knew much about the man whose house it was. So the car loads of politicians, movie stars, and college students that used to parade up and down those marble steps found other parties to fill with their sparkling laughter and their appetites for cocktails and jazz.\n\nMeanwhile, nobody came to claim the rambling mansion or knock it down, and every year it got a little shabbier.\n\nThen 1929 hit, and the party was really and truly over-- not only in the house at the tip of West Egg, but everywhere.\n\nNow it is the final year of Prohibition in the benighted year of our Lord 1933. The papers say that unemployment is the worst it's ever been, that one in four Americans is out of work, but you don't need a newspaper to tell you that the Depression is getting worse every year. Roosevelt might be president now, but this is New York in the image of Hoover: breadlines that stretch for blocks, street vendors with holey shoes selling the same types of apples on every corner, aluminum and cardboard shacks filling the dirt plains of Central Park.\n\nSomewhere in Hoover's New York, Marjorie Perkins hopes that you can find her daughter Ruby, who's been missing for the past four days. Ruby's had a hard time of it lately-- who hasn't?-- ever since her husband's wealth vanished in the crash. Then, in the summer of 1930, he left one night for a pack of cigarettes and never came back. Ruby's lived in her mother's tenement apartment ever since. The past few weeks, before she disappeared, Marjorie says that Ruby had taken to long walks heading God knows where, vanishing for hours at a time, and then talking funny when she came back. Something about a garden, overflowing towers of champagne, and a green light shining in the darkness.\n\nCan you find her? And if you do-- can you bring her back?",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-03-13 20:20:07 UTC",
        "comment": "*\"Won't you come down, old friend?\" the older man said. His eyes blinked hugely behind enormous spectacles, sparing no attention for the opulent bedroom surrounding him.* *The only other soul in the room turned from the window. He was a younger man, fit for magazine pages, and he did not remove his hands from his pockets as he graced his companion with a brief smile.* *\"I'd love to, but I'm afraid it can't be helped. You see, I've got a phonecall coming through, and I simply can't miss it.\"* *The older man fidgeted scrupulously with his spectacles. \"I'm not so sure that phone call's coming,\" he said at last.* *The younger man turned away then. To him, the future was a house already constructed and populated with furniture, and he could stroll its halls counting the fiber in each forecasted carpet. If the spectacled man couldn't unlock the front door, that altered neither the contents of the house nor the certainty of its foundation. \"Why don't you go on down,\" he said presently. \"The party will be starting soon.\"* *\"I suppose so.\" The older man blinked owlishly. \"But-- listen, you'll come down and join us one of these times, won't you? I mean to say, it'd be swell to have you. Sooner or later-- you'll come down?\"* *\"Soon as I take this phone call, old sport,\" the younger man said, but he did not look at his companion as he spoke. A secret was spreading through him in a softening flow of reassurance that set his stance more firmly on the floor and his shoulders more at ease in his impeccable jacket. As his secret reached his face and bloomed there into a dazzling smile, the windows of the room filled with vibrant green light, and the walls shivered in emerald waves. * *\"It won't be long now,\" the younger man said. \"You go on now. Enjoy yourself.\"* *\"Well, alright.\" The older man shuffled to the staircase. As he had for the past decade, he left his companion alone to aim his unfaltering smile into the blind green glare.* --- *\"They used to tell me I was building a dream, and so I followed the mob...\"* As the first of them squinted at faded door numbers, walking over boards that creaked painfully but by some architectural miracle did not give way, [Rudy Vallee's voice]( filled the cramped hallway. The walls were thin here. Doors, too. Thinner than usual, anyway. Whoever had that radio played music for the entire third floor... and whoever was boiling that cabbage perfumed it, too. Between Apartment 3A and 3C was a blank door. Squint hard enough, and the ghost of a \"3\" distinguished itself from the rest of the faded paint. 3B, then. The apartment of Marjorie Perkins-- and, until recently, one Ruby Hollister, the name that had drawn them here. *\"When there was earth to plow, or guns to bear, I was always there right on the job...\"* A second knock was rewarded with the sounds of shuffling, and the door trembled as an unseen hand fumbled with a lock on the other side. It swung open, and there stood Marjorie Perkins through the doorway. Her smiling face resembled the postcard of a schoolteacher, every wrinkle a suggestion of gentle sympathy. \"Oh, hello, hello! So good to see you. Please, come in.\" Marjorie backed away from the door, sustaining her smile even though the effort of moving showed in her face. *\"They used to tell me I was building a dream, with peace and glory ahead...\"* The sound of that far-off radio was barely muted as the front door of Marjorie's apartment swung closed. There wasn't much to see in the cramped apartment. A single room attempted to fulfill the function of bedroom, kitchen, and sitting room in one cramped space, though efforts had been made to add comfortable touches. Some personal effects-- an uncommonly daring jacket, a few magazines scattered on the table-- clearly belonged to the younger occupant. Marjorie flapped her hand at a threadbare loveseat and a cluster of chairs. \"You just sit for a spell and make yourself at home. I've talked to a few other people-- hope you don't mind, but it just seems the kind of thing that could use a few minds working together. They'll be along soon enough, I imagine.\" She turned to a cutting board, where lay the makings of a few humble sandwiches. \"Now, why don't you tell--\" There was a knock at the door. \"Oh.\" Marjorie half-turned from the first comer to the door. \"That would be another one. You're all such nice people-- coming over and helping me like this-- I 'magine you'll get along famously, once you get to know each other.\" *\"Why should I be standing in line, just waiting for bread?\"* \"Would you mind getting that, dear? I've a mind to be a half-decent hostess, even in these times...\""
    }
]