[
    {
        "game_pid": "ghcmsj",
        "story_name": "Rome:  AD 64",
        "post_title": "It has been thirty four years since Pontius Pilate, the Roman Procurator of Judea, ordered the execution of a Nazarene Jew named Jesus in order to quell a riot.  In those three short decades the followers of this man, called also the Christus, have spread throughout the empire, and many of them dwell in Rome herself.  Although the Empire is tolerant of foreign religions, these so-called *Christians* are different.  The political leaders surrounding the Emperor are becoming increasingly concerned.\n\nTwo giants stand out from among the Christians in Rome.  One of them, a Galilean Jew named Peter, is the Bishop in charge of Christians in Rome and Italia.  The other, a Roman citizen of Jewish origin named Paul, is a prolific writer and teacher who has been busy defining the doctrines of this new sect.  \n\nThe teachings of Christus (the *Christ,* or Jewish Messiah) appeal mostly to the downtrodden:  slaves, the poor, foreigners...but more than a few Romans have become followers as well.  It is even rumored that some Patricians and at least one Senator are secret followers of Christus.  \n\nThe Emperor Nero Claudius Caesar Augustus Germanicus has ruled over the Empire for ten years, ascending to the Purple after the mysterious death (murder, most say) of Claudius.  The past five years of his reign have become marked by increasingly erratic and paranoid behavior on his part.  Like Tiberius before him, he sees enemies everywhere and in every circumstance.  Like Caligula before him, he is rumored to be mad.\n\nIn *AD 64,* players will assume the role of a Christian living in Rome, or of a pagan who has come in contact with this strange new religion, and knows not quite what to make of it.  Players will interact with major historical figures such as Peter, Paul, Linus, and Nero, and with each other as they seek to make their way through these exciting but uncertain times.  \n\nTo both pagan and Christian alike, it feels as if dark clouds are gathering over the Eternal City.  Change is coming...perhaps *terrible* change...",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-09-03 08:14:30 UTC",
        "comment": "**URBS ROMA. DAWN. THE IDES OF NOVEMBER, AB URBE CONDITA 816.** As it had every day for eight hundred and sixteen years, dawn came first to the tops of the seven hills comprising the City of Rome. On this second day of the *Ludi Plebeii,* there were no clouds in the east, so the first rays of the sun found their way unimpeded into the bedchamber window of an imposing marble house on the Palatine Hill, falling across the face of Nero Claudius Caesar Augustus Germanicus, who lay sleeping between the dormant figures to two women. Nero groaned as the light of day intruded on his sleep. Rising up on one elbow, he rubbed his forehead and temples. His head was throbbing from last night's wine. Opening one eye, he surveyed the two figures in bed with him. One was the wife of a Senator; the other a slave girl of no account. Nero grinned crookedly. Actually, *neither was of any account.* He, on the other hand, was Master of the world. ----------------------- Dawn came later to the Subura. Nestled between the southern end of the Viminal and the western end of the Esquiline hills, the insulae of this teeming slum remained in the pre-dawn gloom a bit longer. From the third story of one insula, an elderly Jew was already awake, regarding the brightening eastern sky with cheerful anticipation. *Another day to do the work He had commanded him to do.* Although now well on in years, Simon Peter Bar Jonah was an imposing figure of a man, with huge hands and a strongly muscled back, the legacy of many years of casting and hauling heavy nets from his fishing boat. Now, of course, he was a fisher of *men.* --------------------------- Nero soaked in his bath, his chubby fingers daintily taking a wine-soaked honey cake from a tray offered by a slave and popping the delicacy into his mouth. As he did so, his secretary consulted a wax tablet and advised the Emperor of his schedule for that day. After offering sacrifice at the Temple of Jupiter Optimus Maximus, he and the Pontifex Maximus would proceed to the Circus Maximus where he would preside over the races. It would be a grand procession from the Temple to the Circus, with Nero riding in a gilt chariot, with the Pontifex Maximus and Vestals preceding him in the procession. After the races, of course, the nightly parties would resume... Nero sighed with contentment, sinking deeper into the water. *His City. His people. His empire. His world.* ----------------------- After he concluded his morning prayers, Simon Peter consulted with one of his deacons regarding the time which the races were expected to conclude. He planned on proceeding to a strategic location where he could address the crowds, telling any who would listen of the marvelous events to which he had been a first-hand witness some thirty three years ago. As Bishop of Rome, this was his City. Peter rolled his eyes, imagining the look on his Master's face if he had blurted such a thing aloud while following after Him back in Judea. No, thought Peter smiling, Rome was *His* city. Commissioned by Jesus to \"feed His sheep,\" Peter was the head of the Apostles, charged with the heavy burden yet joyful task of spreading His word. Today would be a good day to do just *that*... ------------------- An hour later, two very different men stepped into the bright Roman sunlight to begin their day's work: one climbing into a purple and gold litter, the other simply exiting the door of the insula and blending immediately into the crowd..."
    },
    {
        "game_pid": "2whvx5",
        "story_name": "HAIL CRASSUS!",
        "post_title": "Once again, Rome is beset by civil war.  But this time, the fighting will take place among the stars. \n \nSetting: The story is an alternate history/science fiction drama which takes place in the 22nd Century AD. It is the sequel to \n[Romans In Space!](https://storium.com/game/romans-in-space/chapter-8/scene-3)\n\nRome never fell.\n \nBy the end of the Twentieth Century AD, although not *complete* master of the world, her dominions were vast, and her military, economic and technological superiority went unquestioned. Rome’s earthly hegemony secure,  the Empire began turning their vision skyward…\n \nIt is now AD 2129, and Roman scientists have unlocked the secrets of interstellar travel. With the invention of *Quam Celerius Lucem* (QCL) Drives, Roman vessels have established Colonia Proxima Centauri, a habitable world populated by primitive barbarians who were easily overcome.   Rome’s first encounter with an advanced civilization (the Pomeranii) did not go well.  After a brief and violent war, Rome has just concluded an armistice with the canine-like aliens.  An initial exchange of technology and diplomats is about to take place, and it is likely that Rome and the Pomeranii will soon become allies, joining forces against a far more serious threat:  the Formix. \n \nJust as the crew of the Imperial Roman Warship Stella Nova was about to depart on a diplomatic mission to the Pomeranii home system, the old Emperor died.  Almost immediately, legions on Proxima Centauri hailed their governor, Marcus Labienus Crassus, as Emperor.  This illegal act immediately triggered a civil war, the first the Empire has suffered in two centuries.  As one of the few ships in the sector still loyal to the true Emperor, Stella Nova was forced to flee.\n \nJoin the crew of Stella Nova as they ferry the royal heir of the Pomeranii to his homeworld, then attempt to fight their way back to friendly territory in a desperate attempt to keep the traitor Crassus from marching on Rome!\n\n**IMPORTANT:** This is a fairly complex game.  Luckily for you, there's a Player Guide which will explain everything you need to know!  Find it here:  https://drive.google.com/file/d/0BzHfdwJCJsJcTHZPWDRDbGZua1k/view?usp=sharing\n \n\n**Any Questions?*  email me at tacronicus.cornelius@gmail.com",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-06-02 00:25:39 UTC",
        "comment": "**PROLOGUE. ON BOARD THE IMPERIAL ROMAN WARSHIP *STELLA NOVA.* PROXIMA CENTAURI SYSTEM.** Tiberius Valerius Lupus stared at the tactical plot for a moment, watched the red diamonds advance. And to think hed been hoping for some good news Their tactical situation was poor and their options were severely limited. If he were to maximize their chances at passing through the *stella porta* he would minimize their ability to fight. No maneuverability, almost no weapons systems, the list of hindrances was short but brutal. EW, start jamming and set all countermeasures to automatic. Nav, make all preparations for stella porta transit. Helm, you are free to make our passage as soon as youre able. Best possible speed. The ship was as ready as shed ever be. Agrippina and Sextus had stabilized the *stella porta* so that it was as good as it was going to get. Little Brutus, ordered Lupus, Take control of launching the probe. Fire it when you determine the optimal employment window. Acknowledged, Captain, replied the computer. Helm, ordered Lupus, all ahead flank speed. Activating the 1MC, he said, All hands, this is the Captain. We are proceeding into the star gate. Brace yourselves; theres no knowing what things will be like on the other side. If this is like other transits, well all be a bit foggy in the head once we exit the gate at our destination. I need each and every one of you to bring yourselves round as quickly as you can, and be ready to respond instantly to orders. Stella Nova was now beginning to accelerate, albeit sluggishly, towards the star gate. Diverting the ships power to optimize the gates stability had left precious little in reserve to actually drive the ship forward. The squadron sent from the would-be Emperor Marcus Labienus Crassus had something of their own to say about Lupus' plan. They were under strict orders to stop *Stella Nova* at any cost, and were about to prove that they took their mission *quite* seriously. Captain, theyve launched a full salvo. Marcus Cornelius Victors terse words hung over their heads like the Sword of Damocles. Eight missiles inbound, tracking true. Time to impact: 41 seconds. Our aft mass drivers are failing to charge fully. Defensive fire doubtful. There we go, Little Brutus announced almost musically, its tone of voice the result of its human interaction algorithm attempting to inject a note of airy cheerfulness into a very tense situation. Probe away. In Sick Bay, Doctor Vespillo tightened the grip on the arms of her chair. Teeterius Farge, tilted his head upward, sniffing the air tentatively. At his action station, Augustus Corenthus Tellethus looked around at his men. \"Steady on, boys,\" the Primus Pilus said reassuringly. \"Nothing we haven't been through dozens of times. See you on the other side.\" *He hoped.* In the ship's Combat Information Center, Contubernalis Gaius Caelius listened as the CIC Watch Officer kept up a steady chatter of tactical updates with the Bridge. Caelius was amazed at the man's competence and calmness, hoping that someday soon he too could have something of that air about him. Then his mind returned to the fact that this time four weeks ago, he had been a clerk (a *clerk,* not a Contubernalis, for crying out loud!) on the staff of the man who now claimed the Imperial Purple for his own. A man whose fleet was, at this moment, trying to kill them all. In engineering, Agrippina Euphemia rechecked her calculations one last time, painfully aware that the fate of all her shipmates was about to be determined by the validity of her as yet untested hypotheses. Sextus Arius crossed himself, saying, *Procedamus in nomine domini. * Then, in an instant, the star gate collapsed in on itself and vanished in a brilliant flash of blue-white light, taking *Stella Nova* with it. A few seconds later, the flights of missiles, now bereft of any target, detonated harmlessly in the nothingness."
    },
    {
        "game_pid": "qh4m34",
        "story_name": "The Lemures of Mars",
        "post_title": "*“Inquietis mortuis vident nobis, etiam ex sepulchra.”*\n\"The restless Dead watch us, even from the grave.\"\n            *--Etruscan Proverb*\n\n\n**ANNO DOMINI MMXCVI. **\n\nIt is the year 2096 AD.  Six months earlier, Rome established her first permanent colony on the planet Mars.   They named it *Campus Martius* (the Field of Mars), and claimed the entire planet in the name of the Senate, the People, and the Emperor of Rome.  The would-be conquerors this barren alien world are made up of colonists, explorers, scientists, legionaries and administrators.  \n\nThe colony, beset by disaster and hardship from its very outset, is finally beginning to settle down, getting on--at last--to the business of becoming self-sufficient.\n\nThen one day, a team of geologists searching for sources of water stumbled onto unmistakable evidence which not only threw *Campus Martius* into a state of turmoil, but sent tremors reverberating back to Earth, to Rome, and shaking the very foundations of human history.\n\nThe Romans were not the *first* to dwell upon the Red Planet.\n\n*Not by eighty million years...*\n\n**The Rules can be found here-->** https://drive.google.com/file/d/0BzHfdwJCJsJcWjVUYlE1Q3EtSjg/view?usp=sharing\n\n*Don't be intimidated by the rules!  They exist to assist you in character creation, and to give you some background information on the \"alternate history\" world we're using in the game.*\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-07-18 15:35:15 UTC",
        "comment": "**CAMPUS MARTIUS. TWO DAYS AFTER THE DISCOVERY. ** Sextus Agrippa Strabo gazed out the window of his office at the bleak, eternal Martian landscape. The late afternoon sun caused the sands of the Arcadia Plains to cast a reddish hue over his pale face and whitened hair. The news that a team of his explorers had discovered unambiguous evidence of an ancient alien civilization on Mars had set all of Earth afire with excitement, if not turmoil. *Not alien, * Strabo corrected himself. On Mars, the *Romans* were the alien civilization. These long-dead beings with their longish, harsh facesthe *Martians*--were the native species of this planet. As Propraetor of the Roman colony on Mars, Strabo had been hand-picked by the Emperor to lead this expedition to establish *Colonia Planetia Martius,* or Campus Martius (the Field of Mars) as it was commonly known. After his four year tour as head of the colony, he would return to Earth, where his election as Consul was virtually assured. And that was *before* the discovery. Nowwell, he would almost certainly be elected Consul a second, third, and fourth time. After that, *Princeps Senatus* and eventually Censor would not be out of reach. That was absolutely as high as a man not a member of the Imperial family could rise! He thought back on the rather amazing teleconference, which had just concluded an hour earlier. Both the Emperor and the Pope endured the long and tedious time lags inherent in any live conversations between Earth and Mars in order to speak directly with himself, Father Eusebius (the Papal Nuncio to the colony), andof coursethe co-discoverers of The Face: Ismene Julii Gaius and Secundus Varrus. The questions they had asked Circe (as Ismene preferred to be known) and Varrus had been insightfuland not a little probing. Once the explorers had been excused, the Emperor had expressed the concernsheld by himself and the Holy Fatherabout the social, political and religious implications of this discovery, along with their potential to spawn societal upheaval on the home world. Yet, at the end of it all, the Emperor had decided to make the discovery known to the entire world. Soon, the news transmissions from Earth would be full of the news. Despite Strabos misgivings, there was a news conference scheduled for the morning. He only hoped Circe and Strabo were up for the challenge. Despite the tremendous news, there were (of course!) the seemingly mundane (yet vitally critical) aspects of day-to-day colonial life. Some of the crops being grown in the agro-domes were not producing quite the yield that had been projected by the agronomists back on Earth. That was certainly a concern. Yet he was confident that the unlikely duo of Drusilla Al-Andalus (the colonys physician and veterinarian) and Demeter (a Vestal, for all love!) would already be hard at work, assisting the biologists and botanists to come up with a viable solution to the dilemma. Thenthere was the grim and unpleasant business regarding the Cupro woman. A saboteur planted among the colonists by New Beijing, Lucia Cupro had nearly succeeded in destroying Romes mission to Mars, and half a dozen colonists had died as a result. She had been found out, just in the nick of time, but the effects of her sabotage had nonetheless been devastating. She had been found guilty of capital crimes, and her execution was looming. Sextus Agrippa Strabo was nothing, if not a political animalyet he was not without compassion. Decimus Calpurnius Flavius, former captain of the *Aries* (which had been partially and intentionally disassembled upon landing in order to convert it into an integral part of the colony complex), was chafing to oversee Cupros execution, and Strabo was inclined to let him do soproviding the steady and reliable Optio, one Canus Murdoch, accompanied him. Strabo had given Murdoch discrete orders to ensure that the whole unfortunate but necessary affair was carried out with as much dignity and charity as the occasion would allow. Following the conclusion of the VTC with Rome, Father Eusebius had mentioned that he was going to visit the prisoner, offering to hear her confession and offer *extreme unction* if she was inclined to receive it. Despite her status as an enemy of Rome, Strabo hoped that she would At that point, Sextus Agrippa Strabo realized that he needed a drinkbadly. He resolved to visit *The Sign of Phobos,* the colonys lounge cum taverna. Valeria Minor Poplicola, a patrician woman of not inconsiderable standing, was amazingly insightful and knowledgeableas well as quite discreet. He could share some aspect of his burdens with her in complete confidence. For her part, Valeria could would alsoas she always didgive him some sense of the Colonys mindset in the wake of all these tumultuous developments."
    },
    {
        "game_pid": "tmhge0",
        "story_name": "We Who Are About to Die...",
        "post_title": "When the Emperor died, a civil war broke out between two rival claimants to the Imperial Purple.\n\nYou backed the wrong side.\n\nNow you're here.  As a Roman, you understand all too well the ancient dictum *Vae victis,* woe to the vanquished.  Some things never change.\n\nNot even in the 22nd Century.\n\nMany of the losers were given parole or amnesty.  Others were tried and executed outright.\n\nNot you.  *You're special.*\n\nAlong with a score of other conspirators and rebels, you've been selected to undergo trial by combat in the Arena.  If you manage--somehow--to survive seven days of combat, your death sentence will be commuted to lifetime exile on some asteroid mining camp or a distant colony, perhaps on Titan.\n\nIf you don't, well...*vae victis.*",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-05-27 05:23:43 UTC",
        "comment": "Jie Junlong gazed down at the brightly lit Italian peninsula which was currently filling the porthole of his ship on what would be its last orbit before departing Earth. That he was a high-ranking member of the Chinese politburo meant he was afforded a luxury cabin making for a very comfortable passage to Colonia Proxima Centauri; that pleased him greatly. That the ship which would take him to the furthest-flung human colony was a Roman vessel named the *Hierusalem* irked him no end. He was starting off on an official state voyage--a good will tour--to meet with Rome's newly elected Senior Consul, but he could *only* make said voyage aboard a *Roman* ship. Chinese vessels had not been granted landing rights at the colony as of yet, which was one of the top items on his agenda. Not that he'd be negotiating from a position of strength. China (or *Sina,* as the Romans called it) had not negotiated from a position of strength with Rome for nearly two centuries. The Politburo had, of course, been very eager for that all to change, and they had launched a major effort to take advantage of the delightful chaos brought about by the Roman civil war to do just that. Marcus Labienus Crassus, the man New Beijing had been secretly backing, had assured them that once he had assumed the Purple, many spheres of influence would have been renegotiated, and many of the geopolitical realities of the current world order would have been *reordered* more in China's favor. First on the list (and verbally agreed to by Crassus) would have been a formal end to Nippon's status as \"Friend and Ally of the Roman People.\" *That* would have started the ball rolling for Chinese re-expansion into the Oceanus Pacificus. China had, of course agreed to recognize Crassus as the rightful Emperor, and had been prepared to cause all sorts of destabilizing mischief on Earth, reigniting a cold war with Rome, discrediting Claudius IX, and setting the stage for, well...*everything.* Crassus' devastating raid on the Roman colony sprawling across the face of Titan had severely rocked the Senate's confidence in Claudius, visibly weakening the new Emperor's grip. Then came Saturninas. Rather than remaining ensconced on the Palatine Hill, Claudius had embarked in the Roman invasion fleet and accompanied it to the Proxima system, where it won a stunning victory. Within a mere ninety minutes of making the jump, just about every ship in the Crassian fleet had either been destroyed or captured. Marcus Crassus had fallen on his sword, and that was that. Nothing had changed. If anything, the Romans had become even more arrogant. Two days after the election, Gallus had--with the Emperor's blessings--extended a formal invitation for the *Sinensi* to send a delegation to Proxima Centauri, ostensibly for the purpose of opening up a trade route, but also to rub their noses in the fact that Rome was still firmly in control of all her possessions. And, speaking of *firmly in control*, Jie's thoughts were yanked back to the news vid playing on his cabin entertainment display. Some Roman anchorman was going on breathlessly about their so-called \"Victory Games\" which were to begin the next day. *Another blatantly overstated bit of Roman self-congratulatory propaganda,* he thought to himself. Jie felt a slight jolt as *Hierusalem* began her burn to leave orbit. The inertial dampeners quickly compensated and the sensation of acceleration was barely discernible. He reached for a cigarette, wondering if he had brought enough for the journey. Drawing deeply and exhaling slowly Jie absent-mindedly stared at the screen. *\"...That's right, Johannes. Hrodan has become the big story of these games, and they don't even begin until tomorrow evening!\"* \"*Hardly surprising, Martinus! It's not every day you get a sentient non-human competing in the arena. In fact, it's never happened before!\" * *\"Right again! And, as our new allies the Pomeranii have warned us, this Hrodan is one tough customer! I mean, just look at those stats! Strength like, well like I don't know like what. Look at those numbers...\" * \"Sir? You'll have to put that out.\" Jie's eyes left the screen and came to rest on the neatly dressed steward standing at the entrance to his cabin. \"No smoking five minutes either side of an engine burn. The rules are in your passenger brochure.\" *A brochure printed only in Latin,* Jie thought bitterly to himself. It would have never occurred to his hosts to have anything printed inn Mandarin, or any other language. That you understood Latin well enough to communicate with Romans was simply *assumed.* \"Yes, of course,\" Jie agreed, answering the steward in the approved language as he snubbed out the cigarette. \"'When in Rome...',\" he added smiling mirthlessly as he did so. \"Thank you, Mr. Junlong,\" replied the steward, forcing himself to appear pleasantly amused at the *Sinensi's* feeble attempt at humor. If only he had a denarius for every time he heard a foreigner use *that* tired old maxim.. Rising from his leather chair, Jie Junlong walked over to the liquor cabinet and poured himself a large tumbler of golden brown liquid. Earth was no longer visible from his porthole; the angles weren't right. \"So, here I am,\" he said to himself. \"A man from China: travelling from a Roman world to *another* Roman world orbiting a distant Roman star aboard a Roman ship as a Roman sports program touted Roman games celebrating another Roman victory ushering in another century or two of presumed Roman dominance... A true believer in both the Party and his nation's greatness, Jie Junlong nonetheless admitted dejectedly to himself that the Mandate of Heaven wasn't going to be realized any time soon."
    },
    {
        "game_pid": "y1kgkv",
        "story_name": "The Twilight War",
        "post_title": "#AUGUST 1945\n\nThe war was over.  \n\nJust three days earlier, the Japanese Empire had formally surrendered in a ceremony aboard USS *Missouri.*  In a recorded message, Emperor Hirohito ordered all Japanese soldiers and sailors to cease fighting and to lay down their arms.\n\nNot all of them listened.  Throughout the Pacific, Japanese strongholds that had been bypassed in Nimitz's \"island hopping\" campaign had remained untouched.  No longer capable of being supplied by land or sea, the Allies had simply allowed them to wither.  In the weeks after VJ Day, small naval task forces combed the Pacific, landing on bypassed islands and urging the Japanese holdouts to come out of their caves and be repatriated with their homeland.\n\nThere was some resistance.  Some Japanese, their hearts still alive with the *bushido* spirit, would refuse to surrender, and would remain in the jungles for decades to come.\n\nThere was one island in the Marshalls, however, where the Marines were greeted by their former enemies with a mixture of terror and joy.  There were only four of them, and they kept insisting--*begging*--that they be removed from the island before nightfall.\n\nNearly seventy five years later, the details of what happened on Agrihan Island are still classified...",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2017-09-05 07:22:55 UTC",
        "comment": "#PRELUDE ##Agrihan Island, 13 September 1945 Captain Ichiro Hashimoto sat on the beach, his gaze fixed westward where the sun was low on the horizon. Clouds had been building up throughout the day and now, at this late afternoon hour, the sun was bursting from behind the clouds in a manner which reminded Hashimoto of his nation's flag. *His defeated nation.* Their battle flag was a representation of the Rising Sun, Nippon itself. But this, Hashimoto mused, was the *setting sun.* How appropriate. They had picked up the transmission from Tokyo on the 18th of August. Hashimoto and his men were shocked and astounded to hear the voice of the Emperor *himself,* ordering all fighting men to cease hostilities. Some of his men, most notably his second in command, Lieutenant Hideki Kenji, stubbornly held out hope that the order meant that the Allies had capitulated, or at least had agreed on a conditional end to the war...one which left some, at least, of Japan's empire intact. But it was a pipe dream. Kenji had listened in expressionless silence when the next broadcast from Tokyo detailed the terms of the surrender being worked out. Hashimoto, who had a rather good command of the English language, had dialed into the American's Armed Forces Radio broadcasts to learn more. There had been some sort of bomb of unimaginable power which, after being dropped on his homeland twice, had persuaded the Imperial government to capitulate. Two weeks ago, a lone B-29 had flown low over Agrihan Island, dropping leaflets reiterating the fact that hostilities were over, and detailed the procedures to follow when American forces eventually arrived at their location to accept their surrender. *They couldn't arrive soon enough.* If they had any hope of surviving the curse that was stalking them, killing them off one by one, the Americans had better arrive soon. His thoughts were disturbed by the sound of a man screaming from within a darkened hut at the edge of the treeline. Hashimoto gave a long sad sigh. Even if the Americans arrived this evening, it would be too late for Kenji. \"All is in readiness, Captain.\" Sergeant Nakamura, ever the proper soldier, saluted stiffly as he delivered the news. \"Sir, we can wait no longer. It is almost sunset, and Lieutenant Kenji is calling for you.\" He had a task to perform. Hashimoto entered the hut, his eyes taking a few moments to adjust to the gloom. Kenji could no longer tolerate sunlight, and his final days had been spent in perpetual shadow. Hideki Kenji sat kneeling on a tatami mat, stripped to the waist and glistening with sweat, the wound on his neck clearly visible. Before him lay an unsheathed sword. Next to the sword sat a ceremonial cup of sake, a drink meant to cheer the heart of a samurai as he prepared to step from this life into the next. The sake remained untouched. The only drink which would slake Kenji's thirst could no longer be found in a bottle. From his kneeling position, Kenji bowed to his superior officer, deeply and formally. He lost his balance, putting out a trembling arm to keep him upright. Hashimoto regarded Kenji for a moment. He was a mere shell of his former self. The suffering he endured over these last three days since his wounding by that obscene thing which had once been a man had left him in an increasing state of agony, relieved only temporarily during the hours of darkness. They had all seen it all happen before. Too many times. All of them--even Hideki Kenji--knew what was going to happen once the sun set. As it was doing now. The lower limb of the sun touched the horizon, turning the Pacific into a sea of blood. \"Hideki, I shall write your family, telling them of your honorable death,\" Hashimoto assured him. \"*Honorable,* Captain Hashimoto?\" Hideki shot back through gritted teeth, struggling to hold back the thing which was taking control of his body. \"This is no *banzai* charge,\" he spat, a tear escaping from eyes that were beginning to turn black. \"*Very* honorable,\" Hashimoto assured him. \"Before the enemy can triumph, you will do what many another samurai has done before you. Be at peace.\" \"Captain!\" Sergeant Nakamura's voice was urgent. \"The sun.\" \"I am...ready.\" Lieutenant Kenji picked up the sword, holding it in front of him with as steady a hand as he could manage. Hashimoto, his own sword in hand, positioned himself behind his lieutenant. Sergeant Nakamura stared at Kenji--what was left of him--in growing dread. The whites of his eyes were almost entirely black now, iris and pupil...all black. His gritted teeth appeared to be growing sharper before Nakamura's very eyes. Kenji gave a gutteral roar and plunged the blade into his abdomen, grunting involuntarily in pain. Black eyes staring vacantly, he began to pull the embedded blade laterally through his abdomen. Uttering a roar of his own, Captain Hashimoto swung his *katana* with a mighty downward stroke. Lieutenant Hideki Kenji's headless body slumped forward, peaceful at last. \"Quickly now,\" Hashimoto ordered. \"No time to spare.\" His men bore the body to a waiting grave, placing it in its final resting place quickly. The head was buried a good fifty meters distant. Why the surviving members of the garrison had adapted this practice, nobody quite understood, but neither did anyone question it. Prudence seemed to dictate doing just so. Twilight was fading as the last shovelful of sand was slapped down onto the grave. \"Defensive perimeter,\" Hashimoto ordered. \"You all know the drill.\" Quickly and quietly, the soldiers climbed into a circle of foxholes arranged in a tight ring on the beach. Fires had been lit at a range of fifty meters in a semicircle facing the jungle. If anything emerged from the dense undergrowth, they'd have at least a few moments to engage it--them--before their position was overrun. Casting one last glance to seaward in the hopes of seeing lights from approaching ships, Captain Hashimoto was once again disappointed. As he refocused his gaze in the direction of the menacing jungle, he wondered if the new bomb the Americans had developed would work against...*them.*"
    },
    {
        "game_pid": "ghsses",
        "story_name": "The Martian Uprising",
        "post_title": "All *hell* is breaking loose on Mars.\n\nRome established her first permanent colony on Mars in A.D. 2095 with plans to build a thriving settlement and building a stepping stone for the Empire's eventual conquest of the stars.\n\nThe only trouble was...*the Martians had a much different concept of who should be conquering whom.*\n\nIt is the year 2096 AD.  One day not long after the colony had been constructed,  a team of geologists searching for sources of water stumbled onto unmistakable evidence which not only threw *Campus Martius* into a state of turmoil, but sent tremors reverberating back to Earth, to Rome, and shaking the very foundations of human history.\n\nThe Romans, it turned out, were not the *first* to dwell upon the Red Planet.\n\nAnd now the Martians had been roused.  The last of their kind had vanished eighty million years earlier, of course, their essences preserved by the mysterious Green Cube.  And, as rotten luck would have it, said Cube has made it possible for the Martians to begin possessing the bodies of dead Romans, re-occupying the corpses and bioforming them into something quite capable of living in the harsh conditions on the planet.  \n\nThe Martians need more human corpses to \"repurpose\" for their own use.  That shouldn't be a huge problem.  Once they've killed all the colonists, all they have to do is wait for the resupply ship, due to arrive from Earth next week...\n---------------------------\n\"The Martian Uprising\" is the sequel to \"The Lemures of Mars\" ( https://storium.com/game/the-lemures-of-mars/act-3/scene-1  ), the final installment of the \"Romans In Space: Campus Martius\" series.\n\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-12-16 13:21:06 UTC",
        "comment": "He didn't know that Rome had made him a bishop. And even if the congratulatory message from the Vatican hadn't been absorbed by the electromagnetic cloud enveloping Mars and blocking all communications from Earth, his elevation to the Bishopric would have been the last thing on is mind at the moment. The man struggling to survive a massive coronary attack needed his full attention. Father Eusebius moved around the various pieces of medical equipment as he sprinkled the bed of Sextus Agrippa Strabo with holy water, chanting the words of the *asperges me.* As he did so, Dr. Al-Andalus ordered her staff to withdraw to a respectful distance while the Papal Nuncio continued with the rite. Putting his ear close to Strabo's lips, he heard the man's confession. As Father Eusebius gave the stricken man absolution, the words of the prayer were obscured by the rhythmic beeping of the heart monitor. And yet, fragments of the ancient prayer still drifted into the ears of those waiting to speak with the first Roman Governor of Mars. *\"Dmine sancte, Pater omnipotens, aetrne Deus, te fidliter deprecmur, ut accipinti fratri nostro sacrosanctum Corpus Dmini nostri Jesu Christi Fillii tui...\" * The Vestal Virgin, a pagan and unlikely friend of Fr. Eusebius, clasped her hands in an attitude of respect for what was now--and had been for eighteen centuries--the dominant and official Religion of the Empire. Beside her stood a patrician woman whose family name was well known in the circles of Imperial power back on Earth. Next to her, a geologist repeated the Sign of the Cross over is own head, shoulders, and torso every time the priest made it over the still form of their hapless governor. \"...*tam crpori quam animae prost ad remdium sempitrnum: Qui tecum vivit et regnat...\" * Two men stood apart from the first group. Their chiseled features and precise postures identified them as *viri militaribus*: military men. The senior of the two, wearing the uniform of a *Navis Praefectus* in the Imperial Roman Navy, stared straight ahead, his countenance betraying nothing. The other, an *Optio* in the Roman Army, watched the rites intently. Two visible scars on his face hinted at the presence of several others hidden under his uniform tunic. Occasionally his eyes left the scene playing out around the sickbed to regard the superior officer standing slightly ahead of him and to his left. Although his eyes rested only momentarily on the Captain, in that brief moment they were able to betray their owner's contempt for the man likely to take command of the Colony while Strabo recovered. *If* he recovered. Father Eusebius continued with the ritual, anointing Strabo with the *Oleum Infirmorum .* During the minutes which followed, each of the prominent members of *Campus Martius* (\"The Field of Mars\" as the colony informally referred to itself) had time to ponder the chain of unlikely events which had brought them all to this moment in time and space. For some, the events of the last year had blurred together. For others, each turning point stood out sharply: the media frenzy accompanying their departure from the Syene launch complex in Aegyptus, the tedium of the long interplanetary flight, the nearly disastrous computer glitches (induced, as it turned out by a saboteur among their number), the capture of the Chinese agent who had been surgically modified to assume the false identity of one \"Lucia Cupro.\" When the squadron of three colony ships finally entered Martian orbit, things had gone from bad to worse: the crash landing of the colony ship *Anchises* with its attendant loss of life, building materials and precious supplies. The desperate struggle to survive on limited rations and damaged equipment. Then there was the excitement accompanying the discovery of water in the ice caves under the Arcadian Plain. That water had meant that the colony's long term viability was assured...or so they had thought. Shortly after the discovery of frozen water, other things had been discovered in the cave as well. Sinister things. Sculptures and artifacts of impossible antiquity offered stark and disturbing proof that Mars had been the home of an advanced civilization over eighty million years before man had emerged upon the Earth. And the Cube...that mysterious green block of ice from which emanated energy of a type never before encountered. It was at about that time that the enemy agent Cupro had been executed and buried in the frozen patch of Martian tundra which served as the colony's graveyard. *But she had not remained dead.* Some unknown force--the Cube, most Romans thought--had served to reanimate her. Even now, the corpse of Lucia Cupro, possessed by the spirit of a long-dead Martian, roamed somewhere outside the pressurized hull of *Campus Martius.* And she...*it*...was not alone. Five other Roman graves lay empty, their former occupants now respawned Martians as well... *\"Benedicat te omnipotens Deus, Pater, et Flius, et Spritus Sanctus. Amen.\" * Fr. Eusebius' final blessing yanked them all back to the present. Kissing his purple stole as he removed it from his shoulders, he walked towards the group. In answer to their unspoken question, he simply shook his head. Whether his reply meant, \"he won't last long\" or \"I simply don't know,\" none of them could tell. \"The Propraetor will see you all,\" Eusebius said. \"First however, Captain Flavius, he wishes to see you. In private.\" Once the others had withdrawn, Decimus Calpurnius Flavius approached Strabo's bed. Assuming that the governor's weakened condition left him unable to speak loudly or clearly, he bent close over the prone form. He was surprised by the speed with which Strabo's hand shot upwards, clutching the material of Flavius' tunic with unexpected strength. \"Flavius, you son of a bitch!\" he growled. \"Leadership of this Colony falls to you while I am thus indisposed, and God help us all for it! By the Mass, if you allow your hubris to run amok and jeopardize all we've worked for, so help me, I'll...\" The machine behind Strabo had been beeping with increasing urgency, and the accompanying oscilloscope trace looked more like a sampling from a seismograph than a heart monitor. The remainder of Strabo's words were lost in a spasm of coughing."
    },
    {
        "game_pid": "z9ky0r",
        "story_name": "Formicae Delendae Sunt!",
        "post_title": "##Once again, Rome is beset by war.  But this time, the fighting will take place among the stars. \n \nSetting: The story is an alternate history/science fiction drama which takes place in the 22nd Century AD. It is the sequel to \n[We Who Are About to Die (A Romans in Space Adventure](https://storium.com/game/we-who-are-about-to-die/chapter-4/scene-6)\n\nRome never fell.\n \nBy the end of the Twentieth Century AD, although not *complete* master of the world, her dominions were vast, and her military, economic and technological superiority went unquestioned. Rome’s earthly hegemony secure,  the Empire began turning their vision skyward…\n \nIt is now AD 2131.  Some decades earlier, Roman scientists unlocked the secrets of interstellar travel. With the invention of *Quam Celerius Lucem* (QCL) Drives, Roman vessels have established Colonia Proxima Centauri, a habitable world populated by primitive barbarians who were easily overcome.   Rome’s first encounter with an advanced civilization (the Pomeranii) did not go well.  After a brief and violent war, Rome concluded an armistice with the canine-like aliens.   Rome and the Pomeranii soon became allies, joining forces against a far more serious threat:  the Formix. \n\nFollowing their victory in what the Senate formalized as the Formic War, Rome settled into a brief period of peace.  To celebrate both his ascent to the Imperial Purple, the victory in the civil war which preceded it, and the victory over the Formix, the Emperor Marcus Orestes Claudius staged a months long series of gladiatorial games like none seen in Rome's long history.  But even as the games reached their climax, the Roman frontier was breached by a force of Formic ships which appeared at a previously unknown jump point just beyond Pluto's orbit.\n\nThe Second Formic War was about to begin.  \n \n\n\n**IMPORTANT:** This is a fairly complex game.  Luckily for you, there's a Player Guide which will explain everything you need to know!  Find it here:  \n\nhttps://drive.google.com/file/d/1p0AG8nJCdqrIeYHE1feHXEfVdbTx8toj/view?usp=sharing\n \n\n**Any Questions?*  email me at tacronicus.cornelius@gmail.com",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2021-09-04 19:02:02 UTC",
        "comment": "#Prologue: Aboard the Roman Imperial Ship Sicilia #Enroute to Intercept FROM: IMPERIAL FLEET HEADQUARTERS TO: IMPERIAL WARSHIP SICILIA SUBJ: EMERGENCY ORDERS PROCEED AT BEST SPEED VICINITY OF PLUTO. UNKNOWN SHIPS DETECTED. ASSUMED HOSTILE FORMIX INVESTIGATE. ENGAGE IF ID CONFIRMED. Primus Tertius Athanasius scoffed as he read the emergency orders flashed onto the comms panel. Orders confirmed, Captainfor what its worth. Sitting in the command chair, *Navis Praefectus* Ioannes Paulus glanced up from his own screen to regard his Executive Officer. Nothing we didnt already know, but at least now we have authority to engage. Time to intercept? Ninety minutes, Sir. Paulus did the math in his head. 90 minutes to intercept, 30 minutes to engagewho was he kidding? Theyd be lucky if they lasted ten minutes against them. Five hours for the light from the battle to reach Earth. He glanced at the chronometer. Theyd know in six and a half hours that Task Group 40 had died nobly for the Senate and People of Rome. Itd be around 0600 when the Junior Consul saw the results. Then hed have the singular privilege of briefing the battles outcome to the Senate when they convened promptly at 0900. He thought of his old roommate from the Imperial Star Academy. Tiberius Valerius Lupus hadnt graduated at the top of their class, but he had certainly proven himself when and where it counted. Lupus had always been a couple of steps ahead of the rest of them career-wise. First in their class to cruise to Proxima Centauri, first to become Primus aboard a warship, first get commandand sure as *hades* first in their class to achieve Senatorial rank, let alone the Consulship. *Well, old chum* Paulus thought to himself, *I shall be first to shake hands with the Ferryman. Ill have beaten you to something at last!* Paulus smiled sardonically to himself. Very few believed in the old religion of Republican Rome, lost in the mists of time before it had become the City of Peter and Paul. *First to the Pearly Gates* would have been a far more apt description, but the old vernacular had held on in Roman speech, even if the old pagan religion had faded. Selecting the *Loqui Inter Naves* (Talk Between Ships, or TBS), he waited a moment for the other two captains to join him on the circuit. Why do you think theyre here, Primus? In their minds, are they continuing the previous war, or has some genius at Proxima Centauri or beyond managed to kick open their anthill again? Athanasius shrugged. Ill make one last inspection of the weapons crews. Make sure theyre in fighting trim. Make it quick, Paulus said after him as he exited the bridge. Pressing the transmit button on TBS, he said, All ships, Task Group 40, this is *Sicilia,* over. *Liguria*, over. *Cisalpina,* over. *Sicilia,* the fifth ship in the *Trireme* class, was accompanied by two smaller *Bireme* class ships, the *Liguria* and *Cisalpina.* His task group was a versatile mix of ships well-suited to picket duty, but against a large force like this one, they had little chance of success. The task group was off-station, headed for a scheduled refueling evolution at Orbital Station Neptune, and had been just an hour away from docking when their sensors had picked up light announcing the arrival of the Formic fleet. There wasnt supposed to be a jump point in that portion of the Kuiper belt, so it hadnt been actively patrolled. They had already been in the Sol system three hours before Task Group 40 was even aware they were here. Paulus had turned the group around as soon as they had received the sensor data. Nine ships exhibiting strong blue shift. They were definitely headed toward the inner solar system. Task Group 40 had been on this intercept heading for nearly eleven hours now at a speed of 0.2c, or two tenths the speed of light. It didnt feel like they were traversing over 37,000 Roman miles every second, but space was vast. They were burning their fuel at an excessive rate; even if they survived the engagement they wouldnt have sufficient reserves for a direct burn back to Neptuneor anywhere. The best they could hope for would be to insert themselves into a long parabolic descent towards Jupiter in the hopes that tankers from Titan would rendezvous with them. *If they survived.* Task Group 40, standby for engagement orders. Johannes tapped a control which transmitted the combat formation theyd be using along with a set of pre-programmed maneuvers and firing commands. Things would happen too quickly at the merge, and the resulting clash would be over in a fraction of a second. Humans simply couldnt react swiftly enough; it had to be left to the computers. After the merge, hed assess the resulting geometry, damage dealt to the enemy, and the damage status of his own force. Hed then calculate a re-engage vector to bring them back around for another pass. Both ships acknowledged receipt. He continued, Right now our combined closure rate is 0.44c, way too fast to get any hits. Four minutes prior to the merge, well execute a swing ship maneuver, and brake down to 0.1c. If the Formix keep going, well get more hits on them but will have a devil of a time catching them in a tail chase. If the bugs decelerate as well, then well have a good fight on our hands. Athanasius was back on the bridge, listening to Paulus as he finished his transmission. Sounds like a solid battle plan, Captain, except for one thing. Oh really? Paulus could not conceal his annoyance. Whats that? Im not sure that the bugs even *have* hands. The tension on the bridge broke as several of the watch guffawed out loud. Paulus made a pantomime of hurling his data tablet at his executive officer, his scowl momentarily lifting as he did so. #THE PRAESIDIUM, ROME. #0604 HOURS. The huge imaging array which orbited Earth at a distance of 300,000 miles fed a constant stream of imagery back to the command center as the photons arrived. Despite being the best optics mankind had at its disposal, the participants in a battle which had commenced hours earlier were images large enough to identify as ships and ascertain their general class, but lacked much more detail than that. Digital encrypted datalinks from each ship in Task Group 40, arriving concurrent with the optical information, filled in the rest of the story. As the two groups of specks plunged towards each other in the optical feed, the datalinks provided detailed information on the enemy fleet as well as the status of each ship. At the merge, the optical feed had suddenly become cluttered with numerous bright flashes of light. A heartbeat later, the two groups of specks were opening again. Instead of 9 Formic ships, there were now 7. An expanding cloud of debris marked all that remained of Task Group 40. The datalinks had failed before the onboard computers could compute and transmit any significant enemy battle damage assessment. The Tribune of the Watch stared at the displays. *Deus misereatur eorum*, he muttered, crossing himself. Regaining his composure he began the task of analyzing the engagement in an attempt to learn as much from the battle as could be determined. The others in the room turned from the display and regarded the togate man standing among them. Consul Tiberius Valerius Lupus had seen enough. Nodding to those around him, he exited the command center. Outside, a car waited to take him to the Senate house. Sirens blaring and lights flashing, the Praetorian motorcycle guard cleared the traffic ahead of him as his sedan sped toward the Capitoline Hill."
    }
]