[
    {
        "game_pid": "se8jv2",
        "story_name": "Mass Effect: The Halcyon Initiative",
        "post_title": "** Looking for New Players! **\n\nWhilst Commander Shepherd is traversing the galaxy in a quest to find the Collectors and ensure that the galaxy continues on, The Galactic Council has approached a group of experts to ensure that some of the lesser threats in the galaxy can be dealt with in a quiet, and efficient, manner. However, as with everything in the galaxy, things are not so simple. When disastrous events occur and connections begin to form between these routine missions and a wider, much graver threat… What will you do to save the Galaxy?",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-10-09 20:59:27 UTC",
        "comment": "Halcyon Initiative Helo-Class Cruiser Hope, or HC-1 Hope for short, continued to cut a fine line through the vast emptiness of Batarian space. The ship was slightly smaller than the previous Normandy class vessel that the standard across the Systems Alliance fleet. The Helo-Class Cruiser was a joint project between the Turian and Human council members to combine the added agility of human fleets to the brute-strength and toughness of Turian designs. So far, only one Helo-Class Cruiser Hope had been completed to adequate designs and had immediately been commissioned to the Halcyon Initiative. A powerful element zero core powered three versatile engines that continued to burn an icy blue against the blackness of space. The interior was an authoritarian mixture of metallic silver surfaces and smoothed white plastics. The ship was fully outfitted with all that was required for a covert mission squad. A small Medbay and research room that took up a tiny space at the rear of the ship. A large engineering bay complete with prison cells and armoury that would provide them with most of the technology and weapons required to overcome their foes. A large crew deck and command module that took up the majority of the ships prow, the sparkling holographic projector showed the galactic survey standard map and tracked their progress towards their target, a minuscule system deep in Batarian space, as a yellow line blinking occasionally. The initial summons from the Galactic Council had been an odd thing, a discrete message sent over omnitool or, in some cases, a dataslate passed across a crowded room from an unknown associate. The Halcyon Initiative had been formed soon after the 'Incident' on the Citadel Commander Shepherd had saved the Council from the horrors of a rogue spectre and an enormous unknown ship that appeared to have corrupted those who work with it. Now Commander Shepherd had gone. Died and reborn with Cerberus, he could be an unknown entity either working with the Illusive Man to save the galaxy or merely to be a pawn of a 'human-focused' near-terrorist group. Commander Shepherd had never failed them before, but, they need an alternative to solve mysteries and questions that had risen from the attack. Spectres couldn't be used, they would draw too much attention and would be limited to the Galactic Council races. The Halcyon Initiative would be 'connected' to the Galactic Council in the most loose sense of the word. They would consult with the Galactic Council for missions and assistance but, if captured or killed in the field, they were a rogue group looking for answers in dangerous times. Hope continued to speed through the bleakness on course to a small Batarian colony on Vana. The Galactic Council had received credible intel that a Batarian outpost on the colony had been investigating Geth AI components to assist in Batarian ships VI's. It was of utmost priority that the outpost was investigated and decommissioned. It had been a rushed job, gathering the necessary fighters from across the galaxy to fight for the greater good whilst on the clock against Batarian neglect of Galactic law. The crew needed to time to adapt and trust each but, unfortunately, that would be on the front-line of their first mission..."
    },
    {
        "game_pid": "cpqkvr",
        "story_name": "Starbase 4012-B",
        "post_title": "##Tuesday 19th May 15:05 2161 -Gaia Prime Communications Centre##\n\n    Urgent  Communication – Earth Defence Force\n\n    Unknown problem affecting all major systems – current oxygen levels dipping, public unrest rising, research and medical offline. \n\n    Urgent maintenance required to restore vital circuits. Send assistance as we don.... **breakes down**\n\n    Starbase 4012-B    \n\nThe last communication from Starbase 4012-B, on the furthest reaches of humanities influences into the void, made for grim reading at the Gaia Prime Communications Centre.   Humanity had come vast distances in the past century. From the birth of commercial space-flight to the construction of vast star bases to survey and harvest rare materials, humanity had achieved it all – or so everyone thought. Humanity now reached across three separate solar systems, the fledgling steps towards a space empire, with several colonies including Mars, Gaia, Harkonen and Killandur flourishing from the fresh waves of colonists eager to explore life outside of humanities cradle – Earth. \n\nStarbase 4012-B was the latest star base to join the Sol Federation’s arsenal of advanced mining and survey stations dotted throughout the vast galactic unknown to study and collect new materials for humanity. Starbase 4012-B was entirely self-sufficient, requiring only a minimal crew to assist with the utility cyborgs that maintained the base, and was meant to begin a new wave of expansion into further reaches of space previously inaccessible due to supply. One year since the coronation of 4012-B as the pinnacle of humanities technological advance, however, Gaia received a garbled message amongst the usual correspondence received from around the Sol Federation. 4012-B was in trouble. Immediately after, 4012-B went radio-silent for the first time since completion.\n\nThe Sol Federation’s response was immediate, if there was an unknown fault with 4012-B it needed to be highlighted to command quickly before the expansion rolled out across new frontiers. A formidable crew was recruited from across the Federation to investigate the cause of any interference or repair issues with Starbase 4012-B as well as report back to the Federation if any militaristic contact had been established. The Sol Federation still lived in fear of contact with a vastly superior and dominant race whilst humanity was still in its infancy.\n\nThe crew was placed aboard *SF Spectrum*, a *Miami* class research vessel, and entombed in cyro-chambers for the long hyperdrive to 4012-B. It has been three months since the Sol Federation sent the crew out into the unknown – with a satisfying hiss the AI onboard began to warm the cyro-chambers back to life...\n\n***\n\nWelcome to Starbase 4012-B a space-horror in the vein of Alien or Dead Space. I am looking for a 5 or 6 man crew consisting of an Engineer, Scientist, Medic, 2 Soldiers and a Operations Command *(Taken by Flax)*. Any questions please message me!\n\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-09-09 10:02:14 UTC",
        "comment": "The SF Spectrum continued to scythe silently through the vast chasm of space on its constant bearing. The Miami class frigate was near the pinnacle of Sol Federation technology and was pride of place amongst the new wave of ships being sent further and further into unknown space. Starbase 4012-B was on the outermost cusp of federation space, the first of its kind in self-sustainable, long-term habitable space stations that the federation hoped would become the standard for galactic expansion. Until humanity cracked the code that allowed for faster than light travel, cryogenics and self-sustainable vessels were the only options to conquer the titanic distances of the void. The SF Spectrum was a relatively small vessel by tonnage comprising of the main crew deck, a small medical and research lab, command section and hull. The hull was currently filled with a wide variety of Sol Federation standard replacement parts and numerous crates of supplies. The SF Spectrum continued on its set course due to the careful diligence of the ships artificial intelligence, codenamed Kelvin, who had ensured the ships safe passage next to the Ghaziabad neutron star. The electrically blue and white star bathed the ship in brilliant light and danced off the many metallic panels on the outer hull of the SF Spectrum. The missions goal, Starbase 4012-B, was currently seventy-two hours away so, as per protocol, Kelvin began the process of awakening the crew. Within the white and blue cyrochamber, the silence was broken by a loud metallic hiss as the various chemicals and nutrients flooded the cyrotubes to awaken the crew. The small, white tiled room adjoined the medical labs and was dominated by the six cylindrical tubes that housed the crew in stasis. Seventy-two hours had been allocated by the Sol Federation to allow the crew to re-acclimatise to the Spectrum and reassess changes to mission parameters since they entered into stasis two months earlier. Starbase 4012-B was a fully functioning city in space essentially, complete with water reclamation, botanic gardens, self-sustaining economic and industrial bases to allow a population of nearly three thousand to easily survive so far away from the comfort of Earth. It was also designed to be used as a staging centre for further colonial ventures to nearby terran-friendly planets in the sector. Starbase 4012-B, like all Sol Federation starbases, followed a strict code of law despite being entirely self-sufficient. In an era of unknowns, especially the eternal fear of extra-terrestrial contact, each starbase was required to send a broadcast back to Gaia with the latest updates and situational reports. Starbase 4012-B had now been silent for three months and tensions were fraying within federation command, no-one knew or wanted to guess what could have happened this far away from the centre of humanity. Starbase 4012-B had been a hot bed of scientific and political gossip since its establishment. Multiple reports had been filed acknowledging several habitable planets within its sensor range and that early mining expeditions to the numerous asteroids and gas giants had found bountiful supplies for future expansion. It was a vital asset and the crew, now dozily awakening from cryogenic slumber, had been assembled from the best in the federation. Each was uniquely suited to their role on-board and, despite only having a brief introductory meeting and mission overview before cryogenic sleep, knew each other on reputation alone. The white and aluminium cryogenic pods slowly ascended into a vertical position on the wall, essential to save space on the ship, and icy fog cascaded out of the seam around the glass observational port. The glass and aluminium panel slid up and each of the crew stepped nervously out onto the grated floor, clothed only in a modesty-saving medical gown. In the main crew hall, which was dominated by a computer console in a pentagonal shape covered in dials and screens, a stack of the latest updates and reports from the Sol Federation were stacked neatly. Good Afternoon, a polite British accent filled the air, it had been decided by Sol Federation regulations that British was the politest announcing voice, Crew of the Spectrum, it currently sixteen forty-five galactic standard time. We are on track and on course for docking with Starbase 4012-B in seventy one hours and forty minutes. All correspondence from the Sol Federation is prepared in the crew hall, are there any ill effects from the cryogenics?"
    },
    {
        "game_pid": "ec5kr3",
        "story_name": "One Last Adventure",
        "post_title": "The year is 1931, the world is in the midst of hitherto unknown political and economic turmoil. The stage is set for redemption. When the letter from Lord Kingsley arrived at your office – you couldn't believe your luck. An expedition to a far flung locale in search of a vaunted local treasure seems almost too good to be true – especially given your reputation. The collection of explorers and 'experts' summoned to Lord Kingsley's estate were in desperate need of redemption. Bankruptcy, outrage, theft. Slanderous terms and whispered conspiracies followed each explorer around the globe with vicious intensity. Lord Kingsley, however, required not the best explorers in the world but those who would not waver from his quest. Redemption was a powerful motivator and Lord Kingsley, with his wealth and influence, knew the explorers would relish his backing to clear their name. He also knew, like anyone with an addiction, that these explorers would want to scratch the itch with One Last Adventure...",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-04-08 12:30:11 UTC",
        "comment": "The crisp, white gravel of the manor driveway crunched loudly under the procession of black Bentleys. It was a beautiful day, deep within the Oxfordshire countryside, and the sun beamed unashamedly through the few wispy white clouds that hung in the sky. Within each individual Bentley, some of the most disregarded and shamed former world experts in their fields sat uncomfortably awaiting the reason for their summons. Within the last few weeks, Lord Kingsley had sent numerous letters to each of them. Repeatedly demanding their presence at his personal manor for an urgent proposal. Despite their best efforts to ignore the calls of the aristocrat, eventually the money and influence offered by the man led each reclusive figure to return from the shadows. In view of their returned agreement to attend, Lord Kingsley had dispatched chauffeurs and chartered planes to each individually. Luxury exuded from the journey; fine Italian upholstery, the silent murmur of a fine-tuned British engine and a fine Scottish malt placed within a metallic ice bucket in case any attendee felt the urge to calm their nerves. Lord Reginald Kingsley observed the cloud of dust kicked up by the procession from one of the many ornate windows. The manor was an opulent Georgian affair, orange stone and granite set a stark contrast to the English greenery, it stood within several acres of private land owned by Lord Kingsley. Around the many hallways of the Kingsley manor, ancient relics and famous masterpieces shared pedestals and wall-space with family portraits. The Kingsley name was synonymous with adventure and exploration, several of Reginald's predecessors had been involved in various adventures around the globe. Now, however, the interconnected nature of global life seemed to offer few chances of adventure for Lord Kingsley to attach his esteemed name too. He ran an ageing hand across his forehead, pinching just above the nose, a thin veneer of sweat visible of his brow beneath a thicket of grey hair. He adjusted his thick-rimmed glasses as a light knock emanated from one of the large oak doors. Come in, he said calmly, walking away from the window towards two large green sofas. The door creaked open, and a stunning beauty entered the room. Lady Regina Kingsley entered the room with a poised swagger, wearing a scintillating green dress that made Lord Kingsley's face flush with indignation. Don't, she snapped coolly as she joined him on the sofa. This adventure is everything to me Father, I am not risking anything. Neither can you, after everything I have been through. Lord Kingsley bit his tongue, she took every opportunity to undermine him, even in private. They may not accept the offer, he said hesitantly, pouring himself a neat sherry and sipping it gently. Lady Regina turned to face him. She was a magnificent beauty for her age, sparkling blue eyes, buxom brown hair in delicate curls and an hourglass figure that many would kill for. She clicked open an ornate silver cigarette case and retrieved a single smoke before light it in a haze of greying mist. They most certainly will... she paused, eyes narrowing. You have all the influence in the world to these people father I am part of that deal. I want to not only see the world but experience it. I don't want to be just another woman left by the wayside. She took a long drag on the cigarette, taking a furtive glance out the window towards the approaching motorcade. I wish you wouldn't, Lord Kingsley replied half-heartedly. He already knew he had lost his once innocent and obedient daughter to the influences of age and hormones but it still pained him that she so blatantly disregarded him. Let us see how the meeting goes shall we? He sighed, standing beside his elegant daughter at the window as the procession of cars crunched up to the manor courtyard. (-) (-) (-) Downstairs, in an elegantly tiled reception room. Butler Walter Smythe's immaculate black shoes clacked methodically across the black and white tiles. He had no interest in allowing these suspected criminals and blacklisted socialites within the hallowed halls of the Kingsley Manor without his standard, brash introduction. He opened the large, ornate oak doors in unison as the cars pulled up to the marble staircase. He moved out on the pristine entranceway as each invited guest escaped their magnificent Bentley's. He spread his gloved hands wide Why should I allow you entrance to the Kingsley 's? I have heard much about your past failings I have no interest in your bringing that shame to our home."
    },
    {
        "game_pid": "yxjbnb",
        "story_name": "St Cernunnos",
        "post_title": "The *Vent léger* has finally set sail – the well-known ex-military airship has been repurposed for a government funded colonial project to an unclaimed island off the eastern coast of Africa. The age of expansion and technological revolution was circulating the globe and France’s territory continued to expand each day to compete with the ever-dominant British Empire and the rising influence of German, Belgian and Russian colonial adventures. Whilst the colonial project may have been approved and funded by the French government, make no mistake, the island was not backed by the French regime until it was an established, sustainable colony. They would receive supplies sporadically when requested from the French mainland but these would be inconsistent until the island had a decent port or airship mast.  The Earth, the fertile plain that had harboured and raised humanity from the dawn of time was no longer unconnected and infinite, the land was running out and the Empire needed to compete with its rivals.\n\nExpedition leader, and self-appointed Mayor, Cyril Berlioz had scouted the best of France for noted explorers, scientists, builders and soldiers to help assist him in his expedition, however, this expedition came with a cost. The French government, in return for their limited assistance, requested that the island can also be used to remove any political dissidents and convicts to earn their penance far from France’s continental shores. Without the funds, the expedition would never have occurred and Cyril had no option but to accept. St Cernunnos, as the island had been named by the French explorer that found it, was named after an ancient Gaulic God of fertility and prosperity – roughtly fifty miles from the Somali coast. It was lauded as an oasis and a prime candidate to be a trading hub within the Indian Ocean. \n\nIt has been four days since you boarded the *Vent léger* in Marseilles and set sail for the island with all your worldly possessions and supplies provided by the French Government. The Captain, Nathan Arceneaux, is a distinguished military captain and in a rush to see you and supplies safely left on the island of St Cernunnos. \n\nIt remains to be seen, however, whether the darkness that stalks the island is ready to welcome your colonial adventures…\n\n(-) (-) (-)\n\nApplication: I have made a few basic cards, but any applicants may feel free to create any new cards that they desire. I would like pictures either real or drawings for all cards! \n\nPremise: Steampunk, semi-historical world surrounding a colonial start up on a far flung island chain off the African coast in the early 1910s. The technology will be slightly more steampunk and slightly ahead of it’s time but nothing too outlandish – heavy card plays will be needed due to lots of extra assets and goals.\nUnderneath all this, however, a lurking mysterious threat is watching, waiting for the colony to be established…\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2017-03-01 15:49:17 UTC",
        "comment": "The Airship *Vent lger* was buffeted slightly by a crosswind and the Captain ably rebalanced the various brass propellers on each side of the large wooden brass hull. The journey felt, for most, to have been taking an age but the weather had held until recently blazing sun on most days and only the occasional windswept day to break the repetition. The launch party had been twenty days prior, the Emperor had made sure it was a hushed affair. He did not want to boast to the world that France was continuing to expand its influence in the Indian Ocean before the colony collapsed in failure and misery he would announce the success of the colony venture once he *knew* that the colony was flourishing. Whilst some local, Marseilles, press was allowed to interview and photograph some of the prominent guests aboard the *Vent lger*; the Emperor ensured that no one was there to see the convicts and exiles board the airship during the dead of night. Once aboard the ship, however, the convicts and exiles were not imprisoned in the brig or forced out of earshot this journey and colony would be their penance and their sentence they were now free amongst the other inhabitants of the *Vent lger* prior to the journey. It was plain to see that many distrusted or despised their new fellow colonists on the journey and many of the ex-convicts spent their time together towards the rear of the main cabin playing poker under the watchful eyes of the military trained aboard. Insurrection was always a threat and the Captain had reiterated after launch that any attempt to circumvent the Emperors will would lead to a swift execution. It was early afternoon, so most of the colonists were milling around the cavernous main cabin which stretched the length of the airship. The glass ceiling allowed them to see the hefty dirigible above them, connected by heavy copper cables to the main deck, and the Indian Sun illuminated the main cabin brightly. Katia Dufresne, the ships cook, was ably constructing the afternoon buffet in the far corner of the room her small but efficient kitchen emanating the delicious smell of bouillabaisse through the cabin. It seemed like all days previous had been an incoherent blur of orders from Mayor Berlioz and Captain Arceneaux to check, and then re-check, the limited supplies that the Emperor had given the expedition and assist with general maintenance of the aging airship. This blustery afternoon, however, the Captain and Mayor seemed predisposed to leave the colonists be and, for the first time on the airship, the colonists had more than a few rushed minutes to really introduce themselves and their hopes for the colony. Despite all the work, boredom was commonplace amongst the colonists also. The main cabin had some battered board games, cards and dice which the ex-convicts mainly used to crudely gamble and a vast collection of second-hand books for them to read, however, being trapped on the airship was soon becoming intolerable for many aboard. At the helm of the ship, where the glass ceiling curved downwards towards the hull to allow them a clear perspective of the route in front of them, stood the two most important figures aboard the *Vent lger*. Beside the brass ships wheel, Captain Arceneaux stood frowning down at the choppy sea that was barely obscured by a few wispy clouds. Captain Arceneaux was an intimidating figure, stood bolt upright with one of his aged hands firmly clasped around the ships wheel, he had a greying beard that that matched his precision haircut. He had seen battle many times in service of the French Empire and, it was plain to see, that being tasked with delivering a colonial mission was considerably beneath him. The legend of him evading Russian flak fire to drop bombs on St Petersburg had been the talk of France less than twenty years ago and now he found himself having to evade the faint wind that blew across the ocean. He was eager to return to France and prepare for the inevitable, as many at home saw it, war with Britain. Roughly eighteen hours til we reach our destination, the Emperor will be pleased, thats an entire day ahead of schedule. He spoke confidently, staring at his companion. Beside him, only slightly shorter than the Captain, Mayor Cyril Berlioz smiled broadly and pulled out a miniature telescope to comb the horizon with. This is most fortuitous news, Captain Arceneaux, Cyril said loudly as he collapsed the telescope once more, a little disappointed that the island was not yet in view. Cyril was a man filled confidence and spirit, the son of a well-respected and revered industrialist back in Marseille; Cyril has been ordained the task of establishing the colony by the Emperor a real chance to make his own name in the Empire. Cyril was, perhaps, a little ostentatious and arrogant in conversation but was a much more approachable character when compared to the indomitable Captain. Cyril turned to the bustling main cabin and announced Less than twenty-four hours colonists and our new lives commence!"
    },
    {
        "game_pid": "0h6de0",
        "story_name": "ESF  Conatus",
        "post_title": "**Looking for new characters!**\n\nThe year is 2183 and humanity is at the breaking point. It has been hundred years since the governments of Earth finally accepted that their actions over decades and, in some circumstances, centuries had stripped Mother Earth of her fertility, her resources and her longevity. Industrialisation, Urbanisation, Globalisation and Overpopulation were four words that humanity had celebrated as a sign of humanities strength. Humanity had conquered the Earth from the animals that they had hunted to near extinction or enslaved for humanities gain.  The governments of the world, united in a central body named the Earthen Space Force, announced that the Earth was no longer sustainable or salvageable. The oceans were dying, the temperature was rising and overpopulation was causing diseases to rapidly spread and mutate beyond medical control. \n\nIt has been eighty years since the largest Atlantic hurricane in living memory destroyed New York City in its entirety and ushered in a new wave of ecological and environmental disasters that pillaged the land and murdered millions.  It had been seventy-five years since the behemoth *Lazarus* Space Station had been constructed and inhabited for the sole focus of the Earthen Space Force’s colonial program. It had been sixty years since Lian Shu Bei had perfected a faster than light warp drive to allow exploration and colonisation beyond the meagre boarders of the solar system. Humanity, during this period, began to flock to the common goal of seeing that Earth would not become just another graveyard in a vast, empty galactic void. Conversely those who though that humanity had blown it’s chance, religious and environmental zealots especially, began to protest the ESF and it’s ‘grand’ mission stating that humanity cannot be allowed to spread its failure across worlds not destined for humanity.  \n\nIt has been thirty years since the three sister colony ships had been laid down, culminating in the largest engineering project ever endeavoured upon by humanity. ESF *Conatus* ‘Endeavour’, ESF *Spera* ‘Hope’ and ESF Prosperitas ‘Prosperity’ were to be three, concurrent, missions to nearest habitable stars by a renown collective of scientific minds. It had been twenty years since the last major war between the factions of Earth as the United Americas, and their allies the Eurasian Federation and African Incorporation battled with the Pan-Asian Collective and Oceanic Conclave for control of dwindling resources and deep reservations about the funding and mission of the Earthen Space Force. The war lasted five years, killed millions and changed virtually nothing about the Earthen Space Force or its mission merely adding fuel to the fire of distrust around the ESF and humanities right to the galaxy.\n\nIt has been ten years since the *Hygleon Pandemic* of 2173 that nearly killed two billion of Earth’s dwindling population. A fast-acting, particularly virulent strain of tuberculosis that could not be treated with traditional methods that threatened to end life on Earth before the intervention of ESF researchers with an emergency vaccine. Some accused the ESF of creating the Pandemic to fuel panic and investment in the colonisation program but it was never proved. It is now one week before departure aboard the ESF *Conatus* and some of the best and brightest, Commanders, Scientists, Doctors, Engineers, Media Experts and Security Specialists have been allocated to the first ship to leave Sol Space. The air is thick with tension as many threats from the Oceanic Conclave that an attack is imminent on the *Conatus* have the colonists and ESF spooked. Will the *Conatus* make its way into the unknown only those aboard will be able to tell…\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-07-06 14:11:49 UTC",
        "comment": "The ESF Conatus was once believed to be a pipe-dream and an impossible project by the many doubters of the Earthen Space Force (ESF). After nearly thirty years of uneasy co-operation from the five major power-brokers on Earth, impossibility had finally faded into reality. Conatus may have been the first to be fully completed, aside from some last minute alterations and tests, but her sister ships the Spera and Prosperitas were only months away from their scheduled departure dates. At a staggering thirty-thousand tonnes, the Conatus was the second largest man-made space vessel behind the ESFs flagship the Arafa and easily dwarfed many of the other freighters and corvettes used in conventional space travel near-Earth. Visible through the many panoramic plas-steel glass viewing screens of the Command Deck, many thousands of miles below them, the Earth continued to slowly rotate beneath their gaze. The Earth, humanities cradle for generations and millennia, was finally beginning to show the wear and tear that humanity had brought upon her. The last eighty years had reaped devastation upon humanity in the form of overpopulation, natural disasters, war and famine hitherto unimagined by human minds. The Earthen Space Force was an organisation that no government on Earth wanted to answer to and yet, without it, they all knew that humanity was simply sitting in its grave waiting from the undertaker to shovel the soil upon them. Untold manpower, resources and equipment had been funnelled into the ESF from all corners of the globe at great cost to those on the Earth, garnering more hatred from the bureaucracy in the sky. Even now, mere days away from the launch of the Conatus, the five destroyer-class military vessels, one each from the factions on Earth, remained in orbit of the construction facility. They cautiously awaited the successful launch whilst also prepared to blow the Conatus, and each other, out of the sky if any faction betrayed the other. For now, however, they remained on their secondary duty of screening and processing colonists from each area of Earth before they boarded the main vessel. Terrorism, and the threat of terrorism, was on the rise from various religious, ecological and Earth-First movements who believed that humanity had its chance with Earth and had to make it work there rather than fail again on another planet. The Lazarus Space Station, as it had been called for nearly eighty years, nearly fully encased the Conatus. The numerous mechanical arms continued to silently glide over the ship, inspecting for any minor faults and finalising all aspects of the ship to its detailed specifications. Several small shuttles, ferrying approved colonists from the destroyers to the Conatus, weaved through the multitude of arms with ease and brought aboard the last remaining colonists needed to bring the colonial total up to the approved level of three thousand. Just beside the Lazarus, another colossal space station orbited the Earth; the Praetorium as it was called by the Earthen Space Force was the control hub for the colonial missions and served as ESF Headquarters off-planet. It housed the highest ranks of ESF personnel, to avoid the various threats now found on Earth to the ESF, and was where a large part of the research into the cure for the *Hygleon Pandemic* was completed. Aboard the Conatus, the ship was bustling with activity in anticipation of the launch which was now less than forty eight hours away. Despite all the careful forethought and planning for the ESF project, they were still slightly behind schedule. Colonists were still boarding, which should have been completed the previous day, but on the whole the project seemed to be ready for the original departure time. The heads of each department had been quietly ushered to the Command Deck of the Conatus prior to the official launch briefing that was scheduled for later that day. The Command Deck was an impressive and commanding site, a mixture of brilliant white, aquamarine and glistening silver seemed to coat every surface and fixture. One side of the large deck was a multi-panelled plas-steel panoramic window for the Captain and crew to see out into the void of space. During FTL, several incredibly strong zinc-tungsten alloy panels would slide down over the windows like a hardened shell. The entire deck was open-plan, feeling airy and spacious to all who entered but was dominated by a two tier dais that housed the Captains chair and the various departmental control panels and personal consoles. A magnificent black leather chair dominated the top dais surrounded by a veritable nest of high tech equipment that relayed vital data to the Captain at all times. Currently, however, the chair remained empty, eerily stagnant and still amongst the chirping computers and holograms. Each department head had a similar, if significantly smaller, chair on the first raised dais below the Captain, each complete with personalised system computers relevant to their area of the ship. River Cavanaughs terminal, for example, was busily analysing security forces allocation around the ship and relaying it to a holographic image of the ship on her desk it acknowledged that security for the mean time was centred around colonial intake centres on the third and fourth decks. Reaghan Carters dais seemed particularly quiet compared to the other departmental heads, however, in a far corner of the Command Deck the state of the art Media Centre housed her private office and studio. The ESF required regular broadcasts back to the Praetorium and watered-down broadcasts for the Earthen News Network to bolster support and morale back on Earth. In times of emergency, the ESF hoped there wouldnt be, Miss Carter would act as an Emergency Communications Officer or ECO. Along the wall, between the multiple consoles that monitored key systems, four framed photographs dominated the white-tiled wall. First showed the iconic Times Square under two foot of water, the gigantic skyscrapers that once dominated the city in worsening states of degradation and disrepair. The second showed a desolated series of fields in Ethiopia, once one of the breadbaskets of the African Incorporation, after soaring temperatures and decreasing rainfall had reduced the once plentiful corn and wheat fields to husks. The third showed the intense overcrowding of Hong Kong within the Pan-Asian Collective, buildings upon buildings - blocking out the sun and showing the languid squalor of those unfortunate to live within the corporate mega-complexes. The final image showed the aftermath of Hurricane Osmond, a rare Atlantic hurricane that swept westerly across the ocean and slammed into Lisbon, one of the many high-class resorts of the Eurasian Federation. Devastated buildings, collapsed highways and an infinite view of destruction from across the globe was meant to galvanise the crew behind the ESF. Each head of department slowly arrived to the Command Deck, they acknowledged each other with a polite nod or brisk handshake. They all knew of each others reputations prior to their posting on the Conatus but, due to the fervent nature of finalising their departments on the ship, had rarely gotten the chance to socialise as a Command Unit. The frosted glass doors automatically parted and a green light above the door notified the group that those entering had successfully cleared the mandatory security checks. A pair of well known faces entered into the room, the Captain of the Conatus, Mustafa Vatarawala, and the Earthen Space Forces Commander Wilma Lindholm. Captain Vatarawala was the pride of the Pan-Asian Collectives Fleet and was on the mission due to the threat of the Pan-Asian Collective and Oceanic Conclave withdrawing from the colonial venture if they were not represented in senior Command. He was in his early forties, stoutly built, and sported a thick black goatee over his dark-olive skin. He was in full ESF Command Dress with several commendations and medals from the last war on Earth pinned predominantly below his Captains badge. He could barely contain the mild distain he felt towards the Heads of Department not heralding from his alliance back on Earth they may have lost the war and uneasy peace may reign over Earth once more but Mustafa didnt forget it easily. His emerald green eyes were dull and impassive as he cautiously surveyed each of the group before he began to speak in a thick Iranian accent. Welcome, he spoke loudly and his voice seemed to cool the air on the Command Deck much more efficiently than the air conditioning. This is just an informal meeting for us all the get to know each other prior to the official launch later today. I know for some of you that you have been aboard for months but, he gestured around the room where there were still technicians ensuring everything was correctly installed as you can see we have all been busy ensuring the Conatus is ready for launch. I am Captain Mustafa Vatarawala, victor of the Battle of Tehran and one of the most esteemed commanders in the Pan-As He stopped suddenly and looked at Commander Lindholm whose lips had turned to a very thin, pink line. Anyway, he carried on less passionately I am here to guide us to what could be our new home. I am hoping that our time together will be uneventful and smooth. He stopped and gestured with an open hand for Commander Lindholm to step forward. Commander Lindholm was slightly older than the Captain, her sandy blonde hair giving the faintest impression that it was soon to turn silver. Everyone on board knew of the Commanders rigorous attitude towards rules and regulations, everything had to be perfect on the Conatus, it had been her lifes work to make humanity see that space was their only escape and now she was mere days away from her plan coming to fruition. She was a slender woman and had thick squared glasses housing her icy blue eyes. It is currently, she flicked her wrist to show a high-tech silvery blue watch less than thirty-nine hours to launch and despite some minor setbacks everything should be ready for our scheduled departure. She approached the various images of destruction hanging on the wall and took a small sigh This informal meeting will also be a chance for me to get to know you prior to your launch, I of course know of your reputations and admire you all as masters in your respective fields but, throughout this mission, I shall be your ESF contact. She took a sip of water from one of the many arranged glasses prepared for the official launch party later that afternoon. Lets make sure that the launch party goes off without a hitch, she said calmly as she approached the group of departmental heads"
    }
]