[
    {
        "game_pid": "wsfrps",
        "story_name": "Lights, Camera, Action: Take Two",
        "post_title": "The decade: the 1950s. The place: Hollywood, California. The years following the conclusion of the Second World War have brought about a new golden age of American cinema. Hollywood hosts dozens of top notch film studios, each one churning out classics and masterpieces at a seemingly impossible pace.\n\nThis is not the story of one of those studios. This is the story of American Entertainment.\n\nIn the first half of the decade, American Entertainment seemed like they were on track to rival any studio in Hollywood. *The Green Tide*, widely considered the studio's best release, earned three Oscars and widespread acclaim. It was a masterpiece. American Entertainment raked in unexpectedly huge profits, and the struggling studio was finally back on sound financial footing.\n\nSadly, the next few years presented more trying times for the studio. Their next few major features failed to gain the same sort of acclaim as *The Green Tide*, and the profits began to dwindle.\n\nSome said the studio was a victim of its own success, having tried to do too much too soon. Others said they had lost their vision, lacking the same creative spark after parting ways with *The Green Tide*'s controversial and eccentric director. Others blamed this reversal of fortunes on the pervasive controversial themes in the studio's work, always skirting the line of acceptability and risking drawing the ire of Congress.\n\nWhatever the reasons why, American Entertainment was once again teetering on the edge. They needed a hit. Would lightning strike twice? Could they produce another film for the ages? Or would they be proven a one hit wonder, unable to replicate the successes of the past? Only time would tell.\n\nOOC Notes:\n\nThis is a sequel to Lights, Camera, Action, a story from last year. Here is a link for easy reference:\n\nhttps://storium.com/game/lights-camera-action\n\nThis game will contain a mix of returning characters from the previous story and some new faces. For those creating new characters, you are welcome to write custom strength, weakness, and subplot cards.\n\nStrict historical accuracy is not required. Feel free to play a character of any gender or race in any role.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-03-01 03:35:24 UTC",
        "comment": "The past five years had changed much at American Entertainment. Profits from *The Green Tide* had allowed the studio to refurbish their entire operation. The once struggling studio had been able to afford the latest equipment and finally outfit their offices in true Hollywood style, with few expenses spared.\n\nYet not everything had changed. The offices at studio three remained the heart of American Entertainment. In the same room where *The Green Tide* was first conceptualized, the studio's creative team was once again due to meet to pitch their ideas for their next big project.\n\nThough the remodeling made the space seem a far cry from the smoky, crumbling office of yesteryear, there was more than a pinch of the old creeping sense of urgency and worry in the air. After the huge success of *The Green Tide*, many of the principles involved had gone on to seek other work.\n\nMercurial director Norman Morris had refused to sign on for another feature, instead drifting from studio to studio producing a series of increasingly surreal films. Frankie Polk, having shed his formerly wholesome image, was now a teenage heartthrob and budding action star, a favorite of the big name studios. Even Sissy D'Angelo-Masters, still studio owner, had started taking a much more hands off role in the day to day management, a factor to which many attributed the decline of the studio.\n\nAfter *The Green Tide*, the studio had produced a series of films which, while occasionally making back their production costs, failed to bring in anything like the money or critical acclaim of their timeless classic. Now the funds were drying up, and that new state of the art equipment purchased five years ago wasn't quite so state of the art anymore. The studio needed a hit, and they needed it badly.\n\nAnd so, they gathered on a hot summer evening to dream up their next movie. There was Bobbi Jamison, the studio's long-contracted screenwriter, the one major player to have stayed with American Entertainment through thick and thin. Then there was her unrelated namesake, J. W. Jamison, the studio's most recently hired director.\n\nThen, there was the cast. Including them in these pitch meetings was now something of an American Entertainment tradition. Ben Rose and Katherine Chao were new faces to American Entertainment, but Sissy was taken with both of them. On one of her rare visits to the studio, she expressed confidence that the two Jamisons would find the right project for their talents, signing them to contracts before the feature was decided upon.\n\nThen there was the return of an old familiar face: Arthur Preston, star of *The Green Tide*. It had been years since he set foot on the premises of American Entertainment. Ever since his Oscar win, he'd been one of Hollywood's most in demand leading men. The studio just hadn't been able to afford the soaring salary he commanded now. Yet nevertheless, here he was.\n\nIt was, perhaps, not the best time for an emotional reunion. This was to be a business meeting, after all. There would need to be introductions and pleasantries, but at the end of the night they were supposed to have an idea for a film. A daunting task."
    },
    {
        "game_pid": "9gvjy4",
        "story_name": "See You, Space Cowboy",
        "post_title": "The year is 2271 AD. After finally developing a reliable method of faster than light travel, humanity has spread throughout the galaxy and settled on hundreds of worlds. While many of these have established some semblance of order, with governments and cultures of their own, many more are practically lawless, a whole new wild west frontier.\n\nNo effective galaxy wide law enforcement organization of any kind exists. There are millions of places on hundreds of worlds for criminals and outlaws to hide from the grasp of authorities on the more established worlds. When particularly infamous criminals go on the run, the standard practice is for agencies to put out bounties for their capture and leave the matter up to freelancers.\n\nBounty hunting can now be a very lucrative career for those with the skills and bravery to pursue it. Most bounty hunters operate in small groups, usually a single spaceship or a few traveling together. Some have grown very wealthy by capturing high profile criminals, now hunting their quarries with the latest in military equipment and the most advanced models of starships.\n\nThe crew of the *Albatross* are not one of those wealthy, sophisticated crews. The *Albatross* itself is a thoroughly outdated model, originally built as a cargo hauler rather than any kind of fighter craft. The crew have thus far barely managed to eke out a living by picking up petty criminals with minor bounties. Food, fuel, and maintenance have eaten up pretty much all their funds.\n\nStill, things could always change. It only takes one big capture to make the big time. There are always bad guys to catch and people willing to pay. Maybe one day they'll find the score they need to turn everything around.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-12-08 04:20:31 UTC",
        "comment": "It was supposed to be an easy job.\n\nThe crew of the *Albatross* had gotten a very promising tip from an old contact that owed one of them a favor. He knew where to find the Red Star Gang, a trio of small time smugglers recently turned to piracy. According to their source, they'd set up a hideout in the ruins of a crashed Eridani Dominion battlecrusier in the dunes of Ayao, a sparsely inhabited and lawless desert world outside the borders of any major galactic government.\n\nThe Eridani authorities were offering reasonably hefty bounties for all three of the Red Star Gang: fifty thousand NuCreds apiece, plus an additional fifty thousand as a bonus if all three were brought in alive. That kind of payday could keep the crew fed and the ship fueled for the better part of a solar year.\n\nThey came up with a simple plan: swoop down out of orbit right above the derelict ship, disable the pirates' own spacecraft with a few quick shots from the *Albatross'* dorsal autocannon, then threaten the entire gang into surrendering without a fight. Easy.\n\nSadly, the tipster neglected to mention that the Red Star Gang had gotten some of the old wrecked battlecruiser's ship-to-ship weapons back online.\n\nThe *Albatross* had barely entered Ayao's atmosphere when a powerful plasma bolt ripped through the hull. It was hardly the worst damage the ship had suffered in its troubled existence, but it was enough to take the autocannon offline and force an emergency landing about half a kilometer from the pirate base. The crew was lucky enough to endure the bumpy landing with nothing worse than a few bruises and scrapes.\n\nThe Red Star Gang didn't seem inclined to let the *Albatross* get away with minor damage. Only a few seconds after the landing, a deafeningly loud explosion rang out just a few dozen meters from the craft, blasting a new crater into the dunes and spraying the hull with a shower of sand.\n\nThe explosion was followed by crazed laughter from one of their targets: Bartholomew Reinoff, better known as 'Bloody Bart', one of the Red Star Gang. A former mercenary demolitions expert, he was toting some sort of massive rocket launcher that looked like it was originally meant to be strapped to a vehicle rather than wielded by a single individual. He was shouting something that was probably some sort of taunt or threat, but was impossible to hear over the din of the explosion.\n\nThe noise only grew worse as some sort of heavily modified UltraCycle tore out of the hideout hangar, making a beeline for the *Albatross* seated atop it was their second target: Carlotta Enkov, 'Crazy Carly'. Carly was a former military scout, now serving as pilot for the gang. Ignoring the explosions ringing out throughout the dunes, she sped forward towards the *Albatross* and began wildly firing bullets from her cycle-mounted submachine gun, aiming for structural weaknesses in the downed craft.\n\nThere was as of yet no sign of Ayako Kasumi, the supposed leader of the gang. That wasn't surprising, but it was worrying. 'Shadow' was their infiltration specialist, a stealthy hacker rumored to have previously been employed as a spy for one military agency or another. She was probably relying on the other two to serve as a distraction while she got in position to do real damage.\n\nThe *Albatross* had lost the element of surprise and the use of their most powerful weapon, but they still had their wits and numerical superiority. They'd make it through this okay. Right?"
    },
    {
        "game_pid": "5gmymb",
        "story_name": "Heroes of Champion City",
        "post_title": "The year is 2070 AD. Since the early 2020s, the world has been changed by the appearance of individuals with abilities beyond those of normal humans. People with command over fire and ice, people with the power to read and control minds, people who flew through the air and shrugged off gunfire. Individuals with a seemingly endless variety of powers appeared in greater and greater numbers all across the world.\n\nSome of these people were the products of science, either granted powers by accident or through intentional human experimentation. Others were simply born with their abilities with no obvious explanation. Scientists continue to debate the source of these abilities, with no clear consensus having yet been reached.\n\nWhatever the source of these superpowered individuals, it was only a tragically short amount of time before many of them turned to crime. So-called 'supervillainy' became a worldwide epidemic as non-powered law enforcement proved helpless to stop this new breed of criminal.\n\nFortunately, just as many powered individuals proved willing to step up and defend their communities against this menace. Vigilantes took to the streets in costumes and masks, fighting against criminals that law enforcement was unable to stop. While these individuals were highly controversial at first, governments worldwide began to realize that powered crime fighters were the only ones capable of protecting the public in this new age.\n\nThus began the careers of the first superheroes. Government agencies began to offer official sponsorship to certain heroes who had proven themselves as defenders of their communities. Teams of powered individuals increasingly replaced mundane law enforcement in cities across the globe. Most major urban centers now have at least one officially recognized team of heroes tasked with defending the people against all manner of villainy. Many of them still wear costumes like the vigilantes of old out of respect for tradition.\n\nOf course, not all 'heroes' have taken on the role of a crime fighter out of a selfless desire to do good. Powered individuals are still in short supply, and government agencies will pay handsomely to get the best of the best on their side. Corporations increasingly offer sponsorship to superhero teams, placing their logos on their costumes and equipment in exchange for large cash contributions. Superheroes feature prominently in many major national advertising campaigns. Some of the most prominent heroes are among the most wealthy and famous people alive today. This includes the Justice Squad, the famed protectors of Champion City, a metropolis on the east coast of the United States\n\nYou aren't one of those heroes. You have no corporate sponsors. You have no government contract. You are what many might call a 'C-list hero'. You probably have a day job of some sort, and might just be scraping by to make ends meet. Still, the Justice Squad can't be everywhere in Champion City. You might just be doing what you can to stop petty street crime for now, but who knows? The opportunity to make it into the big leagues might be right around the corner.\n\nOOC INFORMATION:\n\nI'm aiming to tell a sort of 'classic' superhero story here. It won't be a hundred percent dark and gritty, but it won't be entirely comedic or silly either. Think Batman: The Animated Series as an example of the sort of tone here. There will be plenty of action scenes battling supervillains and other criminals, but there will also be non-action based scenes dealing with the other difficulties of life as a superhero.\n\nFeel free to draw from classic superhero tropes. Capes, masks, and silly costumes are fine. Backstories can range from tragic to mildly ridiculous. Secret identities are common in the setting, and you can feel free to have both a 'hero name' and a regular name.\n\nAll characters will start as unaffiliated 'C-list' heroes who are unconnected with an established team or organization. They will be given a reason to start working together fairly quickly in the first scene.\n\nPlease include some description of your character's powers and abilities in your application, along with a brief origin story to explain how they got them.\n\nI will be looking for a group of 3-6 players. Scenes will vary in length, but I am aiming for at least one move from everybody every three days or so. If you need longer, no big deal. That's just what I'm aiming for.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-09-20 17:03:03 UTC",
        "comment": "It's a beautiful day in Champion City. Nice cool weather, bright clear skies, air pollution levels rated as safely breathable. As the sun rises over the ocean, everything seems calm, peaceful, and tranquil despite the constant bustle of city life.\n\nSadly, the tranquility is not to last. Vidscreens and radios across the city have their broadcasts interrupted by an urgent news bulletin.\n\nA frightened looking woman in a trench coat speaks into a microphone. \"This is Maria Hernandez reporting live for CNX News from outside the ToyTime Superstore in downtown Champion City.\" The sound of gunfire can be heard behind her, accompanied by flashes of light from inside the store.\n\n\"It appears that that the infamous criminal Thomas Tinker, AKA the Toymaster, has launched some sort of an assault here. We have reports he has taken several children hostage. At this point we don't know if his intent is to demand a ransom, or...\"\n\nThe Toymaster is a name familiar to anyone who follows the news in Champion City. He's a criminal who uses an army of sophisticated automatons disguised as children's toys to carry out his evil schemes. It's unclear whether he actually has any real superpower allowing him control over these 'toys', or whether he's simply a deranged genius inventor of sorts. In the past he has generally limited his activities to robbery and burglary. Hostage taking is a new one.\n\nA SWAT officer dressed in full riot gear steps into the frame, shouting something at the reporter. He's too far from the microphone for his words to be intelligible.\n\nThe camera begins to move away from the store as the sound of gunfire intensifies. \"We're being told we have to move back. Apparently some sort of machines are advancing out of the store and engaging with CCPD SWAT forces. We will continue to bring you coverage via CNX news drones.\"\n\nThe reporter continues to speak into the microphone as she dashes down the street. \"With the Justice Squad out of state to assist in the battle against the forces of Scythe in Metro City, it's unclear whether non-powered law enforcement will be able to deal with this situation effectively.\"\n\nThe reporter pauses, frowning and touching her earpiece. \"I've just gotten word that Mayor Fitzcurtis is calling for assistance from any and all freelance powered individuals. A bounty is being offered for the capture of Thomas Tinker...\"\n\nAnd that's the cue to come and save the day.\n\nThe situation at ToyTime is chaotic. A small army of little green toy soldiers have been pouring out of the front entrance. Somehow, despite their diminutive size, they've been outfitted with actual working firearms. The bullets are small, but there's enough of them being fired to leave SWAT pinned down behind their armored van. Officers pop up from behind cover to return fire every so often, but there are simply too many of the little green men for them to handle without assistance.\n\nInside the store, a group of crying children can be seen near the back wall. They're surrounded by a squad of very creepy looking Victorian dolls. The dolls hold squirt guns that look to be filled with some sort of horrible bubbling green acid, just waiting to open fire on the first do-gooders to try to make a rescue attempt.\n\nThere's no sign of the Toymaster himself. Not yet, anyways. There must be hundreds of places he could be hiding inside the massive store, and searching for him could be dangerous. It's almost impossible to tell at a glance which toys on the shelves are harmless and which might be his sinister minions hiding in plain sight.\n\nThe CNX News drones arrive before the heroes do. They're little more than cameras attached to whirling helicopter blades, flying about to try to get the best angle on the chaos. Whatever's going to happen, it's going to be broadcast live."
    },
    {
        "game_pid": "aak3cr",
        "story_name": "Cyber Cops: The Night Shift",
        "post_title": "The year is 2122. A series of political and economic disasters throughout the course of the twenty first century have led to the decline and disintegration of nearly all major governments. Governance is almost exclusively local now, and the real power is held by the massive global corporations which control most of the world's economy.\n\nThe San Francisco bay area is no exception to these trends. There is no longer any United States to speak of, nor is there a functioning State of California. Tiny municipal governments do their best to keep things in order, but the MegaCorps headquartered in the city make all the important decisions.\n\nThe bay area is a place where the divisions between rich and poor are extremely stark. Corporate executives live in gleaming luxury skyscrapers, enjoying the incredible luxuries of twenty second century life. The poor are left to languish in the slums, dangerous and squalid places where life is cheap.\n\nIn San Francisco, money is everything. If you can afford something, you can have it. If you can't, you're out of luck. Justice is no exception. Law enforcement is now entirely handled by private corporations. If you want a crime solved, you need to pony up the creds to get it handled. If you can't afford it, it's your problem.\n\nLaw enforcement and security services for the area are almost exclusively handled by Olympus Security Services, one of the corporations which dominates the city. They provide everything from patrol services to criminal investigation. They don't come cheap, but their detectives have a reputation as second to none.\n\nOOC Information:\n\nThis story aims for the style of a gritty noir detective tale in a cyberpunk setting. All characters will be investigators of one type or another working for Olympus Security Services.\n\nI am looking for about five or so players. Please be prepared to make moves every couple days. Characters who go more than a week without any activity or any advance notice may be retired.\n\nIdeally I'd like to have a group of diverse characters with different natures, strengths, weaknesses, and subplots. Feel free to either use the ones provided or create your own.\n\nThere will likely be NSFW content in this story, including violence, sexual content, and profanity.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-11-05 14:49:34 UTC",
        "comment": "The night shift. It starts at ten in the evening, ends at six in the morning. It's either the best or the worst shift to be on, depending on how you look at it. The world has changed a great deal over the past centuries, but one constant has endured: horrible things always happen at night.\n\nIt's nearing midnight when the first major call of the evening goes out. A crew of five investigators are gathered up at the Central Precinct and loaded up into an OSS transport to go out on a call. The transports are all automated these days, which allows for the investigators to pay attention to their briefing along the ride.\n\nCommander Ashworth, supervisor to Central's night shift investigators, provides the briefing over the transport's video feed. He looks tired and irritated. He always looks tired and irritated. He spends a moment reviewing a datapad in his hands before he speaks.\n\n\"Okay. Looks like this is probably a homicide call. Body found in an alley off McAllister. Signs of foul play. Victim is a female in her early twenties. The body was found and called in by a local, should still be at the scene.\"\n\n\"Our client for this one is the Greater Civic Center Residential District. They're BronzeShield Plan subscribers.\" BronzeShield was the cheapest security plan OSS offered to residential areas. No patrols, no automated or live security, no investigations for petty offenses. Just about the only service covered under BronzeShield was limited investigation into serious crimes. Emphasis on limited.\n\n\"So, let's have a look at their time balance for the month...\" Commander Ashworth frowned at his datapad again. \"... Looks like you're budgeted for... ninety minutes on this one. No overtime, no equipment allowances.\"\n\nNinety minutes to solve a homicide and make an arrest. It was an absurd time limit, really. Commander Ashworth just shrugged. \"Do your best. If you can find the guy and make an arrest, great. If not, well... maybe GCCRD will think about upgrading to SilverShield when their contract is up for renewal. Ashworth out.\"\n\nThe video feed cut out just as the transport stopped at the alleyway entrance. The narrow alley was poorly lit, snaking between an old donut shop and a run down 'capsule living' residential building. The whole place was littered with trash and filth. It smelled like the kind of place the homeless tended to use as a restroom.\n\nThe victim was slumped by a dumpster, face down on the pavement in a pool of blood. Blonde, likely early twenties, very much on the thin side. Judging from her clothing and the neighborhood, it seemed likely she was a prostitute.\n\nStanding by the body was another woman in similar attire, with green hair and violet eyes, almost certainly resulting from low level biological modification. She kept making horrible sobbing sounds, but no tears came. Loss of the ability to cry was a common side effect of cheap black market BioMods like hers. She seemed to freeze up when she caught sight of the transport.\n\nThere were no other obvious witnesses around, though those willing to pay for window units in the capsule building might have been in a position to see something, if any of them were home, awake, and paying attention.\n\nThe donut shop seems to be equipped with a security camera over the back entrance as an attempt to deter would-be burglars. If it's actually working, it might have caught footage of some of what happened here. Of course, the donut shop is closed for the night and won't be opening again until far more than the ninety minutes the team is budgeted for. Still, it might be possible to hack the camera remotely, or break into the shop to find the footage.\n\nWhatever the investigators were going to do, they were going to need to do it fast if they were going to have any chance of figuring out what happened here. The clock is already ticking."
    },
    {
        "game_pid": "vrjtdw",
        "story_name": "Defenders of Champion City",
        "post_title": "The year is 2070 AD. Since the early 2020s, the world has been changed by the appearance of individuals with abilities beyond those of normal humans. People with command over fire and ice, people with the power to read and control minds, people who flew through the air and shrugged off gunfire. Individuals with a seemingly endless variety of powers appeared in greater and greater numbers all across the world.\n\nSome of these people were the products of science, either granted powers by accident or through intentional human experimentation. Others were simply born with their abilities with no obvious explanation. Scientists continue to debate the source of these abilities, with no clear consensus having yet been reached.\n\nWhatever the source of these superpowered individuals, it was only a tragically short amount of time before many of them turned to crime. So-called 'supervillainy' became a worldwide epidemic as non-powered law enforcement proved helpless to stop this new breed of criminal.\n\nFortunately, just as many powered individuals proved willing to step up and defend their communities against this menace. Vigilantes took to the streets in costumes and masks, fighting against criminals that law enforcement was unable to stop. While these individuals were highly controversial at first, governments worldwide began to realize that powered crime fighters were the only ones capable of protecting the public in this new age.\n\nThus began the careers of the first superheroes. Government agencies began to offer official sponsorship to certain heroes who had proven themselves as defenders of their communities. Teams of powered individuals increasingly replaced mundane law enforcement in cities across the globe. Most major urban centers now have at least one officially recognized team of heroes tasked with defending the people against all manner of villainy. Many of them still wear costumes like the vigilantes of old out of respect for tradition.\n\nOf course, not all 'heroes' have taken on the role of a crime fighter out of a selfless desire to do good. Powered individuals are still in short supply, and government agencies will pay handsomely to get the best of the best on their side. Corporations increasingly offer sponsorship to superhero teams, placing their logos on their costumes and equipment in exchange for large cash contributions. Superheroes feature prominently in many major national advertising campaigns. Some of the most prominent heroes are among the most wealthy and famous people alive today. This includes the Justice Squad, the famed protectors of Champion City, a metropolis on the east coast of the United States\n\nYou aren't one of those heroes. You have no corporate sponsors. You have no government contract. You are what many might call a 'C-list hero'. You probably have a day job of some sort, and might just be scraping by to make ends meet. Still, the Justice Squad can't be everywhere in Champion City. You might just be doing what you can to stop petty street crime for now, but who knows? The opportunity to make it into the big leagues might be right around the corner.\n\nOOC INFORMATION:\n\nI'm aiming to tell a sort of 'classic' superhero story here. It won't be a hundred percent dark and gritty, but it won't be entirely comedic or silly either. Think Batman: The Animated Series as an example of the sort of tone here. There will be plenty of action scenes battling supervillains and other criminals, but there will also be non-action based scenes dealing with the other difficulties of life as a superhero.\n\nFeel free to draw from classic superhero tropes. Capes, masks, and silly costumes are fine. Backstories can range from tragic to mildly ridiculous. Secret identities are common in the setting, and you can feel free to have both a 'hero name' and a regular name.\n\nYou are welcome to use either the provided cards for natures, strengths, weaknesses, and subplots, or to create your own custom cards. Feel free to add art.\n\nAll characters will start as unaffiliated 'C-list' heroes who are unconnected with an established team or organization. They will be given a reason to start working together fairly quickly in the first scene.\n\nPlease include some description of your character's powers and abilities in your application, along with a brief origin story to explain how they got them.\n\nI will be looking for a group of 3-6 players. This is a reboot of a story which ran last year. Feel free to look it up if you'd like, but it may spoil plot points from some early scenes.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-12-17 21:17:06 UTC",
        "comment": "It was a beautiful day in Champion City. Nice cool weather, bright clear skies, air pollution levels rated as safely breathable. As the sun rose over the ocean, everything seemed calm, peaceful, and tranquil despite the constant bustle of city life.\n\nSadly, the tranquility was not to last. Vidscreens and radios across the city had their broadcasts interrupted by an urgent news bulletin.\n\nA frightened looking woman in a trench coat spoke into a microphone. “This is Maria Hernandez reporting live for CNX News from outside the ToyTime Superstore in downtown Champion City.” The sound of gunfire could be heard behind her, accompanied by flashes of light from inside the store.\n\n“It appears that that the infamous criminal Thomas Tinker, AKA the Toymaster, has launched some sort of an assault here. We have reports he has taken several children hostage. At this point we don’t know if his intent is to demand a ransom, or…”\n\nThe Toymaster wass a name familiar to anyone who follows the news in Champion City. He was a criminal who used an army of sophisticated automatons disguised as children’s toys to carry out his evil schemes. It was unclear whether he actually possessed any real superpower allowing him control over these ‘toys’, or whether he was simply a deranged genius inventor of sorts. In the past he had generally limited his activities to robbery and burglary. Hostage taking was a new trick for him.\n\nA SWAT officer dressed in full riot gear stepped into the frame, shouting something at the reporter. He was too far from the microphone for his words to be intelligible.\n\nThe camera began to move away from the store as the sound of gunfire intensifids. “We’re being told we have to move back. Apparently some sort of machines are advancing out of the store and engaging with CCPD SWAT forces. We will continue to bring you coverage via CNX news drones.”\n\nThe reporter continued to speak into her microphone as she dashed down the street. “With the Justice Squad out of state to assist in the battle against the forces of Scythe in Metro City, it’s unclear whether non-powered law enforcement will be able to deal with this situation effectively.”\n\nThe reporter paused, frowning and touching her earpiece. “I’ve just gotten word that Mayor Fitzcurtis is calling for assistance from any and all freelance powered individuals. A bounty is being offered for the capture of Thomas Tinker…”\n\nAnd that was the cue to come and save the day. With the Justice Squad preoccupied, this was a golden opportunity for the city’s less famous heroes. It was a chance for not only a sizable financial reward, but to show what they could do in front of the media and law enforcement. Plus, children’s lives were at stake. What could be more important?\n\nThe situation at ToyTime was chaotic. A small army of little green toy soldiers had been pouring out of the front entrance. Somehow, despite their diminutive size, they had been outfitted with actual working firearms. The bullets were small, but there were enough of them being fired to leave SWAT pinned down behind their armored van. Officers popped up from behind cover to return fire every so often, but there were simply too many of the little green men for them to handle without assistance.\n\nInside the store, a group of crying children could be glimpsed near the back wall. They were surrounded by a squad of very creepy looking Victorian dolls, holding squirt guns that looked to be filled with some sort of horrible bubbling green acid, just waiting to open fire on the first do-gooders to try to make a rescue attempt.\n\nThere was no sign of the Toymaster himself. Not yet, anyways. There were hundreds of places he could be hiding inside the massive store, and searching for him was certain to be dangerous. It was almost impossible to tell at a glance which toys on the shelves were harmless and which might be his sinister minions hiding in plain sight.\n\nThe CNX News drones arrived before the heroes did. They were little more than cameras attached to whirling helicopter blades, flying about to try to get the best angle on the chaos. Whatever was going to happen, it was going to be broadcast live to the entire city."
    },
    {
        "game_pid": "rc0epq",
        "story_name": "Heroes of Champion City",
        "post_title": "The year is 2070 AD. Since the early 2020s, the world has been changed by the appearance of individuals with abilities beyond those of normal humans. People with command over fire and ice, people with the power to read and control minds, people who flew through the air and shrugged off gunfire. Individuals with a seemingly endless variety of powers appeared in greater and greater numbers all across the world.\n\nSome of these people were the products of science, either granted powers by accident or through intentional human experimentation. Others were simply born with their abilities with no obvious explanation. Scientists continue to debate the source of these abilities, with no clear consensus having yet been reached.\n\nWhatever the source of these superpowered individuals, it was only a tragically short amount of time before many of them turned to crime. So-called 'supervillainy' became a worldwide epidemic as non-powered law enforcement proved helpless to stop this new breed of criminal.\n\nFortunately, just as many powered individuals proved willing to step up and defend their communities against this menace. Vigilantes took to the streets in costumes and masks, fighting against criminals that law enforcement was unable to stop. While these individuals were highly controversial at first, governments worldwide began to realize that powered crime fighters were the only ones capable of protecting the public in this new age.\n\nThus began the careers of the first superheroes. Government agencies began to offer official sponsorship to certain heroes who had proven themselves as defenders of their communities. Teams of powered individuals increasingly replaced mundane law enforcement in cities across the globe. Most major urban centers now have at least one officially recognized team of heroes tasked with defending the people against all manner of villainy. Many of them still wear costumes like the vigilantes of old out of respect for tradition.\n\nOf course, not all 'heroes' have taken on the role of a crime fighter out of a selfless desire to do good. Powered individuals are still in short supply, and government agencies will pay handsomely to get the best of the best on their side. Corporations increasingly offer sponsorship to superhero teams, placing their logos on their costumes and equipment in exchange for large cash contributions. Superheroes feature prominently in many major national advertising campaigns. Some of the most prominent heroes are among the most wealthy and famous people alive today. This includes the Justice Squad, the famed protectors of Champion City, a metropolis on the east coast of the United States\n\nYou aren't one of those heroes. You have no corporate sponsors. You have no government contract. You are what many might call a 'C-list hero'. You probably have a day job of some sort, and might just be scraping by to make ends meet. Still, the Justice Squad can't be everywhere in Champion City. You might just be doing what you can to stop petty street crime for now, but who knows? The opportunity to make it into the big leagues might be right around the corner.\n\nOOC INFORMATION:\n\nI'm aiming to tell a sort of 'classic' superhero story here. It won't be a hundred percent dark and gritty, but it won't be entirely comedic or silly either. Think Batman: The Animated Series as an example of the sort of tone here. There will be plenty of action scenes battling supervillains and other criminals, but there will also be non-action based scenes dealing with the other difficulties of life as a superhero.\n\nFeel free to draw from classic superhero tropes. Capes, masks, and silly costumes are fine. Backstories can range from tragic to mildly ridiculous. Secret identities are common in the setting, and you can feel free to have both a 'hero name' and a regular name.\n\nYou are welcome to use either the provided cards for natures, strengths, weaknesses, and subplots, or to create your own custom cards. Feel free to add art.\n\nAll characters will start as unaffiliated 'C-list' heroes who are unconnected with an established team or organization. They will be given a reason to start working together fairly quickly in the first scene.\n\nPlease include some description of your character's powers and abilities in your application, along with a brief origin story to explain how they got them.\n\nI will be looking for a group of 3-6 players. This is a reboot of a story which ran last year. Feel free to look it up if you'd like, but it may spoil plot points from some early scenes.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-12-16 02:24:15 UTC",
        "comment": "It was a beautiful day in Champion City. Nice cool weather, bright clear skies, air pollution levels rated as safely breathable. As the sun rose over the ocean, everything seemed calm, peaceful, and tranquil despite the constant bustle of city life.\n\nSadly, the tranquility was not to last. Vidscreens and radios across the city had their broadcasts interrupted by an urgent news bulletin.\n\nA frightened looking woman in a trench coat spoke into a microphone. “This is Maria Hernandez reporting live for CNX News from outside the ToyTime Superstore in downtown Champion City.” The sound of gunfire could be heard behind her, accompanied by flashes of light from inside the store.\n\n“It appears that that the infamous criminal Thomas Tinker, AKA the Toymaster, has launched some sort of an assault here. We have reports he has taken several children hostage. At this point we don’t know if his intent is to demand a ransom, or…”\n\nThe Toymaster wass a name familiar to anyone who follows the news in Champion City. He was a criminal who used an army of sophisticated automatons disguised as children’s toys to carry out his evil schemes. It was unclear whether he actually possessed any real superpower allowing him control over these ‘toys’, or whether he was simply a deranged genius inventor of sorts. In the past he had generally limited his activities to robbery and burglary. Hostage taking was a new trick for him.\n\nA SWAT officer dressed in full riot gear stepped into the frame, shouting something at the reporter. He was too far from the microphone for his words to be intelligible.\n\nThe camera began to move away from the store as the sound of gunfire intensifids. “We’re being told we have to move back. Apparently some sort of machines are advancing out of the store and engaging with CCPD SWAT forces. We will continue to bring you coverage via CNX news drones.”\n\nThe reporter continued to speak into her microphone as she dashed down the street. “With the Justice Squad out of state to assist in the battle against the forces of Scythe in Metro City, it’s unclear whether non-powered law enforcement will be able to deal with this situation effectively.”\n\nThe reporter paused, frowning and touching her earpiece. “I’ve just gotten word that Mayor Fitzcurtis is calling for assistance from any and all freelance powered individuals. A bounty is being offered for the capture of Thomas Tinker…”\n\nAnd that was the cue to come and save the day. With the Justice Squad preoccupied, this was a golden opportunity for the city's less famous heroes. It was a chance for not only a sizable financial reward, but to show what they could do in front of the media and law enforcement. Plus, children's lives were at stake. What could be more important?\n\nThe situation at ToyTime was chaotic. A small army of little green toy soldiers had been pouring out of the front entrance. Somehow, despite their diminutive size, they had been outfitted with actual working firearms. The bullets were small, but there were enough of them being fired to leave SWAT pinned down behind their armored van. Officers popped up from behind cover to return fire every so often, but there were simply too many of the little green men for them to handle without assistance.\n\nInside the store, a group of crying children could be glimpsed near the back wall. They were surrounded by a squad of very creepy looking Victorian dolls, holding squirt guns that looked to be filled with some sort of horrible bubbling green acid, just waiting to open fire on the first do-gooders to try to make a rescue attempt.\n\nThere was no sign of the Toymaster himself. Not yet, anyways. There were hundreds of places he could be hiding inside the massive store, and searching for him was certain to be dangerous. It was almost impossible to tell at a glance which toys on the shelves were harmless and which might be his sinister minions hiding in plain sight.\n\nThe CNX News drones arrived before the heroes did. They were little more than cameras attached to whirling helicopter blades, flying about to try to get the best angle on the chaos. Whatever was going to happen, it was going to be broadcast live to the entire city."
    },
    {
        "game_pid": "20czz4",
        "story_name": "The Dragon and the Griffin",
        "post_title": "For three decades, the once peaceful Kingdom of Alavorn has been torn apart by civil war. Upon the death of the beloved King Sagaron of the House of the Griffin, the powerful House of the Dragon declared Sagaron's chosen heir illegitimate and unfit for the crown, putting forward their own purported heir to the throne. The other great noble houses of the realm chose their sides, and the land descended into chaos and war.\n\nAfter thirty years of bloody battle, both houses have finally lost their taste for war. The armies are exhausted, and years of poor harvests have left the country on the brink of famine. If peace cannot be achieved, it seems doom shall come to all of Alavorn.\n\nWith disaster looming, the Dragon and the Griffin have reluctantly agreed to a truce, swearing to call a moot at which all the great noble houses of Alavorn shall finally settle the matter of succession without further bloodshed. Little do they realize that they will soon be faced with an even greater threat than one another.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2018-07-13 04:21:45 UTC",
        "comment": "The moot was to begin on the first day of spring. Though the equinox had long been celebrated as a day of rebirth and renewal, the feeling in Alavorn was tense and grim. A harsh winter and poor harvest had exhausted the grain stores of both House Griffin and House Dragon. Desperate measures had been employed to stave off famine throughout the realm, with nobles employing conscripted soldiers to forage the wilds and granting amnesty to hunters poaching from noble hunting grounds.\n\nThe problem had been made much worse by both feuding houses burning their rival's fields during the preceding harvest season. Both sides claimed the other started the practice, and that their own acts of sabotage were justly deserved retaliation. Whatever the truth, it was now clear to all that the realm would suffer a truly devastating famine unless the kingdom could find peace and return soldiers to the fields for the next season.\n\nDespite the seriousness of the situation, negotiations for the peace moot still took weeks. Both Houses bickered endlessly about the specific terms. The matter of succession would be decided by a vote following a debate, with all noble houses of the kingdom receiving a single vote. Members of both warring Houses would be permitted to wear weapons, but their armies would not be permitted within Manticore lands during the duration of the moot. Even the specific titles announced by the House Manticore herald had to be negotiated, with a reluctant agreement that neither Korvin Azrei nor Princess Aglamella would be announced as royal heir until the vote was held.\n\nAs nobles began to arrive at the Venom Palace in the heart of Manticore lands, they were greeted by Duke Vitoro's best attempts at a feast. Musicians played somber music befitting the occasion. The food shortage meant there would be no beef, pork, or even venison served, with small game birds serving as the best entrees available under the circumstances. There was at least a surplus of wine, served from the very finest reserves in the Manticore cellars.\n\nAs nobles arrived at the unusually somber feast, they were greeted by the host, Duke Vitoro, and his majordomo, Ylessa. Rooms had been arranged for every noble expected to attend the moot, and the gregarious head of House Manticore seemed eager to ensure that his guests had their every need attended to. No business could be tended to until every guest had arrived, and the Duke appeared eager to play the fine host until then.\n\nThe atmosphere was tense. For the younger members of House Griffin and House Dragon, this was the first time they had ever encountered a member of the rival house outside of a battlefield. For those old enough to remember times of peace, the decades of war had long since dulled any memories of camaraderie. Each house claimed one corner of the feast hall, nobles glaring at their enemies between hushed whispers.\n\nThe other major noble houses seemed to have similar plans. Duchess Selosa of House Sphinx seemed keen to explore the Venom Palace's famous library, accompanied by all significant members of her house in attendance. Lord Admiral Korosis of House Kraken and his retainers relaxed by the courtyard fountain, keen on the fresh air.\n\nThe members of House Manticore and their vassals were more spread out throughout the estate, with some of the more social ones making attempts to ingratiate themselves with members of the other houses. Some noted the curious behavior of the normally social Count Atrides of House Basilisk, who seemed unusually nervous. He was helping himself to a bottle of wine in a quiet corner of the feast hall, an unusual diversion for the normally serious and sober count.\n\nThe estate herald shouted over the music, announcing the latest arrival. \"Lady Jade Tiger, Ambassador of Fyduria.\" The ambassador made quite the entrance, wearing silken clothing of her homeland that was still quite scandalous in Alavish court.\n\n\"What is the meaning of this?\" Declis Akatash, a young knight of House Hydra, one of House Dragon's vassals, stormed forward. \"This moot is to decide the future of Alavorn. A foreigner has no business here.\"\n\n\"I am here merely as an observer.\" The ambassador replied, unshaken by the aggressive young man. \"The outcome of these proceedings will no doubt impact my home, after all. Would you not wish to keep abreast of significant developments in Fyduria?\"\n\n\"Silence, witch. Your kinsmen killed my father.\" The young man from House Hydra spat. \"I demand that she be ejected from this estate at once!\"\n\nA few nobles took note of the disturbance, but most seemed keen on continuing their own conspiring. The events of the next few hours would prove critical to the future of their nation."
    },
    {
        "game_pid": "aeschm",
        "story_name": "Mithril Chef",
        "post_title": "The realm of Alavorne is home to a wide variety of nations and peoples: the elven kingdoms of the forests, the merfolk of the lakes and rivers, the warring tribes of orcs and ogres in the deserts, and many, many more. These diverse groups worship an equally diverse pantheon of Gods and Goddesses. Some pay homage to gods of war and the hunt, others worship deities of healing and music. Only one deity is revered by virtually all people of Alavorne: Flavoran, God of Food, Cooks, and Brewers.\n\nLove of food is universal in Alavorne. Though every culture has their unique culinary traditions, each has their own way of revering the art of making delicious and beautiful meals. Like many deities, Flavoran is represented on the mortal plane through a small number of chosen followers, a respected elite revered as living saints. These are the Mithril Chefs, the four greatest culinary geniuses in the land, masters of their individual culinary techniques.\n\nAfter a lifetime dedicated to the art of cooking, one of the four has recently passed away. Now a new Mithril Chef must be found to fill the ranks. The remaining three have sent out a call far and wide, inviting all notable chefs from across the land to journey to the sacred Culinary Cathedral to join a culinary competition intended to find the next Mithril Chef. Those who take on the challenge will find their cooking skills tested against the greatest competitors the land has to offer. Only one can emerge as the next Mithril Chef.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2020-03-26 22:15:21 UTC",
        "comment": "The first day of the competition has arrived. Chefs of all kinds from every corner of the land have traveled great distances to be here at the Culinary Cathedral, some enduring dangerous journeys through untamed lands just to have the chance to participate in this once in a lifetime event. The courtyards and gardens of the cathedral are packed to the brim with cooks of all kinds, some trying to mingle and make new friends, others engaged in last minute preparations as they waited for their names to be called. The largest group crowded into the balconies with a view of the dining hall, eager for a glimpse at the Mithril Chefs as they began tasting the first dishes of the day.\n\nThe cathedral's acolytes greeted each new arrival, explaining how the first day would proceed. Each prospective competitor would be called into the cathedral kitchens to prepare a meal for the three Mithril Chefs. All they needed to do was impress at least one of the three, then they would be permitted to move on to the formal ritual competition. Today there were no real restrictions, each prospect was allowed to choose a dish that best showcased their unique talents.\n\nThe legendary kitchens of the Culinary Cathedral, with their unrivaled array of magical and mundane equipment and ingredients, stood open to those seeking to compete. Only the rarest items, those deemed sacred by the Mithril Chefs, were off limits. For some competitors, this was their first chance in life to cook using such fresh, high quality ingredients. The Culinary Cathedral lived up to its reputation in every way, a veritable paradise for anyone with a love of food and the art of cooking.\n\nFor those who were not prepared for the challenges ahead, the paradise could quickly turn into a place of defeat and humiliation. The first contestant of the morning was a proud dwarven man who introduced himself as the personal chef to the Mountain King of Kar'Dohl, a wealthy and cultured kingdom. Grinning confidently, he presented the chefs with three identical plates. \"This morning I have for you mountain ox ribeye steaks, fried deep cave potatoes, and a roasted medley of exotic vegetables.\" The chef stood back and crossed his arms, clearly expecting the chefs to be impressed.\n\nFirst to taste was Mithril Chef Llyranin, a centuries-old elven chef with a reputation as a perfectionist. He could abide no mistakes in culinary technique, however minor. Today was no exception. \"You've overcooked this by at least a minute.\" He said, frowning with disappointment after his first bite. \"Overcooked and underseasoned, I'm afraid.\"\n\n\"I didn't want to overpower the flavor of the meat.\" The dwarf answered defensively.\n\nLlyranin raised an eyebrow, unimpressed. \"Proper seasoning brings out the flavor. It enhances, not overpowers. This does neither.\"\n\nThe dwarf's disappointment was obvious, but he maintained his composure as he looked to the next chef to taste his creation. Goldensprig, the gnome Mithril Chef was known for her creativity. It was said that she never cooked the same meal twice, and that she was impressed by the new and novel. She looked bored by what the dwarf had brought her. \"I mean it's... fine. Really. I wasn't so bothered by the light seasoning. But... it's steak, potatoes, and vegetables. We've all seen this a million times by now, haven't we? Mithril Chefs have to push the boundaries, they have to add a little artistry to their dishes. This looks like something I could find at a restaurant in any major mountain city.\"\n\nNow truly worried, the dwarf looked to his last hope: the river nymph Mithril Chef, Water Lily. Water Lily was as beautiful and graceful as all her people, and her expression of that beauty and grace was in her food. She taught her disciples that a food's visual appeal was just as important as its taste, and was known for going to great lengths to plate dishes in novel and captivating ways. She looked just as unimpressed by the dish before her as her colleagues. \"You've chosen beautiful ingredients, but your presentation is lackluster. You've just piled potatoes and vegetables on the plate. It's all so crowded and messy. It's very disappointing.\"\n\nThe dwarf looked stunned. \"But...\"\n\n\"It doesn't look like you'll be participating in the contest.\" Llyranin cut him off. There was no time to waste on such a busy day. \"Thank you for making your pilgrimage here. Goodbye.\"\n\nWith that, the first prospect departed, disappointed. This set off murmurs of worry among the spectators at the balcony. If such an accomplished and esteemed chef, one who worked for royalty, could be denied a spot in the contest, this day was going to be harder than they'd expected. There was a nervous tension in the air as they waited for the cathedral's acolytes to call forward the next competitor."
    },
    {
        "game_pid": "rqn68f",
        "story_name": "Magic, Steel, and Blood",
        "post_title": "The Empire of Goltannia: a bastion of order and justice in a chaotic, savage world. Ruled by the benevolent, wise, and powerful Emperor Goltannus, this land of goodness and righteousness has brought civilization to the uncivilized and has protected those who have no other protection. There is truly no greater realm in which to live.\n\nThat is what the official imperial propaganda says. The more cautious citizens of Goltannia would never dare to disagree. After all, those who would dare to suggest that the Emperor or his loyal servants are anything less than correct in all things tend to disappear into the realm's many, many imperial prisons. There is no tolerance for sedition in Goltannia.\n\nNor is there tolerance for witchcraft, thievery, worshiping the \"wrong\" god, evading the imperial draft currently in effect, or any number of other entries on the long, long list of offenses against the empire. Those who disobey soon find themselves in chains, forced to toil in endless labor to help keep the massive imperial army properly supplied.\n\nAs many suffered under the emperor's brutal reign, whispers of rebellion began to spread. Could those who had been oppressed for so long finally seize the opportunity to rise up and seize the freedoms they had been so long denied? Only time would tell.\n\n** OOC Information **\n\nThis is a somewhat dark fantasy story about a small group struggling against a massive evil empire. However, the characters are not necessarily idealistic and righteous. They may be working against the empire for purely selfish reasons, to gain power for themselves, or just acting out of good old fashioned revenge.\n\nAt the start of the story, all characters are incarcerated in one of the empire's many prisons/dungeons/labor camps. Please provide an explanation for how and why they were taken prisoner along with your character description. If you'd like it to be a secret, feel free to let me know in private messages or comments on the character page.\n\nI'm looking for a group of between three and five players. As with all my games, this one is LGBT friendly. No word limits, past tense preferred. Pre-made cards have been provided to offer some suggestions, but please feel free to write your own custom nature, strength, weakness, and subplot cards.\n\nHere are some notes on the setting to provide background and character ideas:\n\n** Races **\n\nThe Emperor and all nobility in Goltannia are human. Elves, dwarves, and other nonhuman races are found throughout the empire, but they are very much second class citizens. Owning land is prohibited for most nonhumans and they face systemic discrimination.\n\nThe Empire has just completed a years-long conquest of dwarven territory and is currently at war with a large elven kingdom. Consequently, elves and dwarves are regarded with particular distrust. Just being suspected of sympathizing with the Emperor's enemies can be enough to get someone imprisoned.\n\n** Religion **\n\nThe Emperor claims to be a direct descendant of Goltan the Just, a powerful god of civilization and order. As such, while the existence of other gods is acknowledged, worship of Goltan is the only approved religion within the empire.\n\nSometimes authorities turn a blind eye to rites associated with certain gods and goddesses who are regarded as part of Goltan's pantheon, but other faiths are strictly forbidden. Practicing the wrong religion can result in imprisonment, particularly if someone is suspected of actually spreading illegal teachings.\n\n** Magic **\n\nMagic exists throughout the world and can be mastered through diligent study, though some are born with greater innate talents for it than others. According to his propaganda, the Emperor himself is among the world's most powerful wielders of the arcane.\n\nThere are several varieties of magic. Some use it to bend the elements to their will. Others employ it to heal wounds and illnesses. Others can use it to see glimpses of the future or faraway places. Some say magic can even raise the dead. Most who practice magic tend to focus on a particular aspect, as it is nearly impossible to master a wide variety of spells.\n\nOnly the nobility and officially sanctioned imperial magi in service to the army are permitted to practice magic. For all others, the practice of magic is considered witchcraft, a very serious crime.\n\n** Crime **\n\nThe Goltannian justice system can be incredibly harsh. Long prison sentences are common even for minor offenses like petty theft. The system is also corrupt, allowing the wealthy and those who have the Emperor's favor to escape punishment for much more serious offenses.\n\nPart of the reason for these harsh laws is that prisoners are employed to keep the economy of the empire functioning. With a large portion of the empire's able bodied youth drafted into mandatory military service, prisoners are used as labor in the mines and fields, keeping the military supplied.\n\nOne small merciful side effect of this policy is that the death penalty is rarely used. After all, a dead man cannot provide valuable labor. Execution is generally limited to those deemed too dangerous to keep alive, such as powerful magic users or leaders of treasonous plots.\n\n** The Military **\n\nA military draft has been in effect across the Empire for the past five years. All able bodied individuals between the ages of sixteen and thirty are required to serve in the military. Nobles are exempt from this service, as are those wealthy enough to afford a rather substantial payment.\n\nAttempting to evade the draft or desertion from military service typically results in a lengthy imprisonment.\n\n** Last Comments **\n\nFeel free to message me with any questions. Special thanks to all the writers in both previous Dark Reapers stories. While this game does not take place in the same universe, the tone is very much inspired by those games.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-04-08 05:34:20 UTC",
        "comment": "It began like any other day in the empire's dungeons. The prisoners were woken well before dawn, pulled from their cramped cells and stuffed into equally cramped wagons to be hauled off to their day's labor. All the while the watchful eyes of the guards were upon them, ready to unleash their particularly harsh brand of discipline at the first sign of trouble.\n\nIt soon became apparent that something was different today. Normally it only took a few minutes for the prisoners to be brought to their work site. On good days, they toiled in the fields outside the prison walls, taking the place of farmers drafted into the imperial military. On bad days they suffered in the dark and dusty mines in the nearby hills, backbreaking labor in near total darkness.\n\nToday, the wagons were taking them someplace else. Someplace further. A trip that should have taken minutes instead dragged on for hours. The chains and manacles placed on the prisoners for the journey were incredibly uncomfortable over such lengthy travel. Any questions posed to the guards were either ignored or met with threats.\n\nIt was nearly midday when the wagons finally stopped and the prisoners were pulled out into the sun. They were in the hills above a picturesque valley, with a river stretching on below.\n\nA tall tower on a hilltop ahead was the only notable landmark in the area. It had a strange construction, with wide arches and struts that seemed to serve no obvious architectural purpose. To those familiar with such things, it seemed like the sort of building which might have been designed to channel arcane energy. The stonework was old, and looked to be in poor repair.\n\nTwenty prisoners were gathered in front of the tower, now surrounded by the prison guards. A familiar yet unexpected figure emerged from the front wagon: Warden Kroel, the prison's master. He smiled cruelly as he looked over the confused group of inmates.\n\n\"We have a little change of pace today.\" The Warden began. \"A special assignment in service to the Emperor. You should all count yourselves lucky for being selected.\"\n\nThe Warden pointed towards the crumbling tower. \"This is the former residence of the traitorous warlock and thief known as Isander. He was found guilty of no less an offense than theft from the imperial family itself.\"\n\n\"The Emperor, in his wisdom, was willing to show mercy to even a man as foul as this, if only he would return that which he stole. Yet the fool would not, and he paid with his life.\"\n\n\"Imperial mages have identified this as the place where he was hiding the item he stole from the Emperor. Your task is to retrieve it.\"\n\nOne of the prisoners, a dwarven woman with a suspicious scowl, spoke up. \"What? Can't the army do that? Or your guards? Why us?\"\n\n\"Because it's a wizard's tower.\" Grumbled an elf standing nearby. \"Probably full of traps and magic. Or worse. It's a suicide mission. They think we're expendable.\"\n\n\"Screw that.\" The dwarf spat. \"Take me back to the mines.\"\n\nThe warden gestured to a guard standing near the dwarf, who promptly struck her in the back of her head with the hilt of his sword. The dwarf swore loudly in response.\n\n\"I can see motivation is going to be an issue.\" Warden Kroel remarked, sounding amused. \"Well, you will all be pleased to know that there will be a reward. A substantial reward, in fact. By special imperial decree, I am authorized to offer clemency to those who retrieve the emperor's stolen property. Your sentences will be substantially reduced if you meet with success. Why, you could be home with your families tomorrow.\"\n\nMany of the prisoners seemed quite impressed with this offer, their eyes lighting up with hope. Others were clearly skeptical. There was always some catch to offers like these whenever the empire was involved.\n\n\"The item in question is a purple crystal, about the size of a man's thumb. It glows faintly.\"\n\nThe elf raised an eyebrow. \"Glows? So it's magical? What does it do.\"\n\n\"You needn't concern yourself with that.\" Kroel responded. \"Just find it and bring it to me. Now, we'll be breaking you into groups to search the tower. We expect it will be more efficient that way.\"\n\n\"Of course we'll be removing your chains. I'm sure I don't need to remind any of you what the penalties for attempting escape are. We will be watching the tower very closely while you conduct your searches.\"\n\nThe guards began assembling the prisoners in small groups, keeping a close eye as they approached to unchain them. The elf spoke out again. \"Wait. You're just unchaining us and sending us in there? You know it's going to be dangerous. Aren't you going to give us... I don't know. Weapons? Supplies?\"\n\nThe Warden laughed dismissively. \"You think I'm going to give weapons to the likes of you? How foolish do you think I am?\""
    },
    {
        "game_pid": "m2127w",
        "story_name": "Lights, Camera, Action",
        "post_title": "The decade: the 1950s. The place: Hollywood, California. The years following the conclusion of the Second World War have brought about a new golden age of American cinema. Hollywood hosts dozens of top notch film studios, each one churning out classics and masterpieces at a seemingly impossible pace.\n\nThis is not the story of one of those studios. This is the story of American Features.\n\nAmerican Features is the smallest of the small independent studios, just a handful of creative professionals with a passion for film. They work with minimal staff and resources on an embarrassingly inadequate lot. Yet still, they keep coming back day after day.\n\nThey all have their reasons for being there. Some are on the infamous Hollywood blacklist, victims of the anti-communist witch hunt who have been forced to work under a pseudonym. Some are artists who have never found their audience, with creative visions that just don't seem to suit the popular demand. Some are brand new to the film industry, desperate to break into show business however they can.\n\nWhatever their individual reasons, this group of eclectic individuals has come together to make a movie. With the studio's finances looking dire, it could well be their last picture eve unless they turn a profit. For the employees of American Features, it might just be their last big chance to make it big.\n\nIt won't be easy. Making a major motion picture is a difficult undertaking under the best of circumstances. Making a picture with a group of questionable talents, next to no budget, and while under scrutiny from overzealous government agents? That could be almost impossible.\n\nOOC Notes:\n\nInspired by *Ed Wood* and the struggles of other independent Hollywood film makers during the era of the Hollywood blacklist.\n\nI am looking to make this a very strongly character focused and character driven story, and will be keeping the group small in order to maintain that focus. I'll probably take four or five characters. No more than one director, producer, or writer. We can have multiples in the other roles. If you want to have a more specific role which isn't listed, feel free to write your own nature card.\n\nYou are welcome to write custom strength, weakness, and subplot cards.\n\nStrict historical accuracy is not required. Feel free to play a character of any gender or race in any role.\n\nI'm aiming for one scene a week, but it might go a little faster or slower depending on how much is going on in each scene. Please be prepared to make at least two or three moves a week if possible. No worries if you need a bit of a break, though it will be appreciated if you let the rest of the group know in advance.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-03-21 23:45:38 UTC",
        "comment": "It's been a rough year for American Independent. Their last major feature, *Escape From Planet Robot*, was a dismal bomb. The picture didn't even recoup half of what it cost to make. For a time, it seemed all but certain that the studio was going to fold, closing their doors for good and ending the story of yet another small independent Hollywood film studio.\n\nYet, it was not to be. With the acquisition of the studio by Sheryl 'Sissy' D'Angelo-Masters, American Entertainment had enough funding to finance one final feature. The budget would be minimal, and it was all but certain that the studio would close its doors for good unless they managed to turn a profit. Still, there was a chance. That was more than they seemed to have a month ago.\n\nSo, on a cloudy January morning, American Entertainment's new studio head called together their best remaining talents for a meeting in her office next to Studio Three. Studio One, of course, had been unusable since the unfortunate fire during the filming of *I Married a Swamp Monster*. And Studio Two, well... the less said about what happened to Studio Two, the better.\n\nSo, the group met in the Studio Three Office, a cramped, smoky, and dimly lit space. There was, of course, 'Sissy' D'Angelo-Masters herself, seated behind her weathered old oak desk. She'd called together the best talents still available to American Entertainment to work out a concept for their project, their possibly final attempt to keep the studio afloat.\n\nThere was, of course, Arthur Preston. They didn't even have a concept yet, much less a script, yet he'd already been taken under contract and guaranteed a role as the leading man. He was by far the most famous actor willing to work with the troubled studio, an asset that they would need to make the most of if they were to have a chance at success. Sissy had insisted on taking him under contract.\n\nThen there was Norman Morris, already contracted to serve as the feature's director. Talented, hardworking, and willing to work for the pittance that American Entertainment could afford to pay a director. True, he'd never directed a full feature himself, but he'd done admirable second unit work on a number of successful features. Surely they could overlook his... oddities in exchange for his experience.\n\nThen there was their screenwriter, Roberta \"Bobbi\" Jamison. She'd never been properly credited in a film before, but those in the know realized that she was the real creative genius behind many of Indomitable Studios' best recent films. Now given creative free reign and a chance at a proper credit, they could only hope she would rise to the occasion.\n\nLast, but certainly not least, was child star Frankie Polk. Frankie had a reputation as being difficult to work with, even more so than your typical child actor. His tantrums had gotten so bad that the heads of several major studios had sworn off working with him. Still, he drew in the crowds, and was willing to work cheap. American Entertainment couldn't pass up the chance to hire him. Frankie, along with his parents and agents, were also invited to the meeting.\n\nThe purpose of today's assembly was simple. This group needed to decide what, exactly, this picture they were going to film would be all about. This wasn't the time to flesh out the details of the plot. That would be Bobbi's job. They just needed to decide on a genre, some basic concepts, a hook to draw in the crowds. Any of them could make a pitch for an idea they were passionate about, though Sissy would ultimately be the one to make the final call. She was the one with the checkbook, after all.\n\nThere were many possibilities. With Arthur Preston on board, a western would be an obvious choice. Arthur had made a name for himself as a star in several successful westerns, and Hollywood was close enough to the beautiful vistas of Monument Valley to make a location shoot feasible enough.\n\nThat certainly wasn't the only option, though. The studio still had some props, sets, and costumes which survived the various disasters of *Escape From Planet Robot*. Science fiction pictures tended to draw on the crowds. The same could be said for horror movies. Universal's monster movies had enjoyed tremendous success.\n\nOr the studio could try something a little more ambitious and intellectual. Mystery melodramas, usually starring brooding detective types, the kinds of movies that pretentious film critics might call 'film noir', had achieved a fair amount of success recently. American Entertainment could try to cash in on that trend.\n\nOf course, this was a new creative team. They could always try something even bolder and less expected, diving fully into an artistic vision which no one would expect.\n\nWhatever they were going to do, they needed to decide today. Every day the studio went without another picture released, they were bleeding money. Now was the time for everyone to throw out whatever ideas they had, and for a decision to be made about just what sort of film they would be making together."
    },
    {
        "game_pid": "p0gvc8",
        "story_name": "Leaders of a New World",
        "post_title": "In the year is 2274 AD, the governments of Earth were on the brink of total collapse. The planet had suffered a series of devastating disasters brought on by global climate changes. As the polar ice caps melted away almost entirely, the sea level rose dramatically, swallowing up entire coastal cities. Incredibly intense 'superstorms' ravaged surviving communities. Agriculture became all but impossible.\n\nWith food in short supply and the human population dwindling, those in control of what government infrastructure remained came to a grim conclusion: Earth was doomed. The survivors pooled what resources remained to fund the construction of half a dozen space ships, the pinnacle of human technology and engineering, massive vessels designed to travel to other star systems.\n\nThough spaceflight technology had advanced to the point where interstellar travel was possible, it would not be easy, fast, or simple. No method to surpass the speed of light had ever been discovered, and vessels the size of colony ships would have to travel considerably slower, relying mostly on momentum and drift to conserve fuel.\n\nSix of these ships were constructed, each to be occupied by a hundred thousand people who volunteered to try to carry humanity's legacy forward. Given the length of the journey ahead, it was impossible to do anything but the most rudimentary scans of possible habitable planets in nearby star systems. The colony ships had to set out into the dark of space without even knowing for certain whether they'd find a world they could safely inhabit. The colonists would be placed in an experimental form of cryogenic suspension, aging them minimally over the decades-long voyage. They'd be traveling too far to even communicate with Earth again, truly leaving everything behind for good.\n\nThis is the story of one of those ships, the colony ship *Hercules*. They were bound for Epsilon Eridani e, a rocky world believed to be earthlike and just 10.5 light years from home. The *Hercules* was placed under the command of Captain Lin Heng, a beloved and almost universally respected leader and humanitarian. Captain Heng did more than almost anyone to keep humanity together in Earth's final years. To assist Captain Heng, a group of officers, experts in a variety of fields and disciplines, were selected to advise her and manage different aspects of the colony project.\n\nUnfortunately, the *Hercules* met with disaster before it could ever benefit from Captain Heng's leadership. A catastrophe during the voyage claimed her life along with the lives of dozens of other colonists. Now it would be up to her officers, intended only as advisers and experts in their own fields, to provide the colony with the leadership it would need to survive and thrive. Would it be possible for them to reconcile their ideas for humanity's future and find a way to move forward? Or would the colonists turn out to have just jumped from one doomed world to another?\n\nOOC Information:\n\nThis game will use an experimental format I am currently using in one of my other games. The player characters will often be in conflict with each other and will often be pursuing their own agendas. This is a game of intrigue and scheming. You are strongly encouraged to let your subplot drive your character’s actions. Plotting with your fellow players is certainly encouraged, but plotting against them is also encouraged. It will be necessary to form coalitions to work with characters of different views and backgrounds in order to accomplish much.\n\nFor an example of the format I intend to use, please take a look at this game: https://storium.com/game/the-royal-council\n\nAll player characters in this game will be colony officers who now have to make leadership decisions which will effect the fate of the colony as a whole. Many of the challenges in this game will not be traditional obstacles with strong and weak outcomes, but will only be resolved when a majority of the colony leadership council agrees on a single course of action. Challenges with strong or weak outcomes will generally only be used to effect the exact outcomes of the 'vote' challenges, which will require a majority in support of any particular outcome.\n\nThe *Hercules* has a diverse, international crew. Feel free to have a character of any race, gender, national origin, religion, or sexual orientation in any role. Futuristic automatic translation software makes lack of a common language a complete non-issue.\n\nThere will be a cap of five characters for this game. I intend to leave applications open for a few days. I will be trying to pick characters with a strong variety of backgrounds and goals, so take a look at other submissions and try to come up with something unique. No more than one character for each nature will be accepted, and I will try to avoid taking multiple characters with the same subplots. Feel free to create your own nature, strength, weakness, and subplot cards in addition to those provided. Make sure your application discusses both your background prior to being chosen for the colony ship and a description of the role you were chosen for. Please include an avatar image with your application.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-10-07 14:20:19 UTC",
        "comment": "Being revived from a lengthy cryogenic suspension was not unlike waking up after being under the influence of anesthetic. Everything felt vaguely unreal as the officers exited their life pods, needing a moment to get their bearings. Their muscles felt weak and sore, though probably not as bad as they should feel after decades of near total motionlessness.\n\nThe calm, reassuring voice of the ship's Multipurpose Artificial Intelligence Administrator (usually referred to as 'Maia') spoke out once they were on their feet. \"Good morning. The Earth date is August 21, 2364.\" They'd been in suspension for over ninety years. \"Cryogenic revival protocol has been successfully executed. Please follow the illuminated lights to assist you in reaching the bridge.\"\n\nA path lit up to guide the officers to their destination. Along the way, it became obvious that something was wrong. The view ports did not show an alien world, but the darkness of space stretching out ahead. This was not right. No one except Captain Heng was supposed to be revived from suspension until the ship had landed on Epsilon Eridani e.\n\nOnce the five officers had assembled on the bridge, Maia spoke again to clarify the situation. \"Greetings. We are currently in orbit around the colony world. Orbital scans and drone probes indicate that the intended planet has a breathable atmosphere and conditions capable of supporting human life. Gravity is approximately 0.96 the strength of Earth's, and temperature variance falls within acceptable limits.\"\n\n\"Unfortunately, I must report an incident which occurred during transit. Approximately thirty seven years, two months, five days, and seven hours ago, the *Hercules* collided with an unknown foreign object moving at a high velocity. This object caused a hull breach which briefly compromised life support systems. Repair protocols were able to seal the breach and restore full functionality. Unfortunately, the breach led to the deaths of one hundred and thirty four colonists, including Captain Lin Heng.\"\n\nMaia, lacking the emotional sensitivity to realize the gravity of what she just revealed, did not dwell on this point. She just continued right along with the business at hand. \"According to the colony charter, in the event of the Captain's death or incapacity, the Captain's authority is to be shared equally by those officers at the next level of the ship's hierarchy. Accordingly, this means that Stephen Sinclair, Simon Recolte, Tero Tupasela-Uusitalo, Hwang Seong-Hye, and Doctor Harold Mortimer are now the executive officers of this colony ship. I shall respond to any directive from three or more of you as if it came from the Captain.\"\n\nThe bridge's monitors began to hum to life, illuminating the previously dimly-lit bridge. \"You have been revived now to carry out the first task which Captain Heng was to complete: the selection of a landing site at which to establish the new colony. After thorough scanning and probing of the planet, I have identified three possible sites which appear to be the closest matches to my parameters for an ideal human colony. You will need to select one before I can initiate landing protocol.\"\n\nThe monitors now displayed an image from the planet below. It's a wide open field, covered in plant life that almost resembles grass with an oddly purple sort of coloration. Glimpses of creatures of some kind could be seen in the images, quadrupeds with thick, scaly hides shifting through the grass. A roaring river could be glimpsed cutting through the prairie.\n\n\"This is potential landing site A. Closest Earth analog: Rio Gallegos, Argentina. Temperature varies between 8.4 and 27.9 degrees Celsius. Advantages: preliminary analysis suggests the soil in this area is rich in nutrients which should support crop samples carried from Earth. Agricultural projects will be easily supported. Weather is within comfortable ranges. Presence of freshwater river will provide easily filtered drinking water. Disadvantages: Abundance of native life forms. Data is insufficient to determine whether or not these life forms could pose a danger to colonists. This site appears to lack any significant deposits of metals, mineral resources, or other materials necessary for large scale manufacturing or construction projects.\"\n\nThe monitors shifted again. This time, they showed a sandy white beach, with a beautiful blue ocean lapping at the shore. A few plants resembling palm trees could be seen above the tide line, heavy with some sort of bulbous purple fruit.\n\n\"This is potential landing site B. Closest Earth analog: Nassau, Bahamas. Temperature varies between 18.2 and 36.1 degrees Celsius. Advantages: Inland areas suitable for agricultural production. Lack of large native animal life forms. Warm weather will reduce need to rely on artificial heating. Analysis suggests the area is likely to be considered aesthetically pleasing by colonists. Disadvantages: This site is located on a relatively small island. Aquatic transportation to other land areas will be necessary to expand colony substantially. Rainfall is frequent and abundant. Lack of metals and mineral resources. Energy-intensive desalination may be required to obtain drinking water during dry periods.\"\n\nThe monitors changed their displays again. This time, they show a hilly expanse blanketed in snow. It was a somewhat surprising image after the more inviting images in the previous two displays. There were no signs of native life.\n\n\"This is potential landing site C. Closest Earth analog: Anchorage, United States. Temperature varies between -17.1 and 13.2 degrees Celsius. Advantages: Analysis shows this region contains abundant deposits of iron, copper, tungsten, titanium, and other mineral resources which could greatly aid in construction and manufacturing initiatives. Geological scanning further shows massive deposits of petroleum, located close enough to the planetary surface so as to be easily extracted. This could provide a reliable source of energy once the *Hercules'* fuel cells are depleted. Disadvantages: This site is not suitable for traditional agricultural programs due to the cold climate. The colony will need to rely on the ship's heated atrium for the production of food, which may not be adequate given the size of the colony. Cold temperatures and heavy snowfall may be unpleasant to the colonists.\"\n\nThe monitors now changed, showing images from each site side by side. \"Once a selection is made, landing protocols can be initiated immediately. Once we have landed, I will proceed with the revival of the remainder of the colonists. As a reminder, lack of fuel resources will render the *Hercules* unable to lift off again once it has landed. Please inform me if I can be of any further assistance prior to the initiation of landing protocols.\"\n\nJust like that, the officers were thrown into command and left with what might be the most critical decision to be made to ensure their new colony's future. The fate of Captain Heng was enough of a shock, but now this? It would be up to them to make a decision and prepare for what lay ahead."
    },
    {
        "game_pid": "nmwg35",
        "story_name": "The Royal Council",
        "post_title": "The Kingdom of Versaillia is one of the great powers of the Old World, a realm of both wealth and military might. For decades, the Kingdom has been at war with the Avalon Empire, their neighbor and seemingly eternal rival. Battles were fought across both Versaillia and Avalon, and as far away as their distant colonies in the New World.\n\nNow, after a decisive Versaillian victory in the battle of Alais, a treaty has been signed to bring an end to the long conflict. People across both lands rejoice at an end to the bloodshed. Unfortunately, this victory came at great cost. King Larvane XI, the beloved and respected ruler of Versaillia, passed away only a few weeks after the peace treaty was signed, after a wound he received in battle became infected.\n\nKing Larvane's heir, Crown Princess Elaia, is just barely twelve years old. Though she will be crowned Queen shortly, crown law calls for a regency to lead the kingdom until her sixteenth birthday. Rather than appoint a single regent, King Larvane chose five individuals to act as a council to guide his daughter and lead the kingdom during this tumultuous time. The new regents have been sent missives and asked to gather at the Palace of Mirrors in Luteia, to prepare for the difficult task of leading the realm in the days ahead.\n\nWith the long war at an end and the Kingdom's beloved ruler dead, Versaillia faces a period of deep uncertainty. Nobles plot and scheme, looking for ways to achieve influence over the royal heir and the newly formed regency council. The people talk of disgruntled peasants threatening to revolt, protesting the high taxes brought by the war. Others claim that the king's death was not brought on by a mere war wound, but was the result of poisons or dark magic. Still others whisper that such may be the price the king paid in a dark pact to ensure victory over Avalon. Things often are not as they appear in the Palace of Mirrors.\n\nOOC Information:\n\nThis game is a modified version of an earlier experimental game. The player characters will often be in conflict with each other and will often be pursuing their own agendas. This is a game of Machiavellian intrigue and plotting. You are strongly encouraged to let your subplot drive your character's actions. Plotting with your fellow players is certainly encouraged, but plotting against them is also encouraged. It will be necessary to form coalitions to work with characters of different views and backgrounds in order to accomplish much.\n\nAll player characters in this game will be members of the regency council. Many of the challenges in this game will not be traditional obstacles with strong and weak outcomes, but will only be resolved when a majority of the council agrees on a single course of action. Challenges with strong and weak outcomes will generally only reward strong results with additional information to be used in deciding the best course of action.\n\nVersaillia, while oppressive in many regards, practices absolute primogeniture. The sexes are essentially equal. Please feel free to play a character of any gender in any role.\n\nThis is a low fantasy setting. Magic and fantastic creatures exist, but are exceedingly rare. Most people are uncertain about what is real and what is mere legend when it comes to the supernatural. Versaillia is loosely inspired by pre-revolutionary France, so assume a late 18th century level of technology.\n\nThere will be a cap of five characters for this game. I intend to leave applications open for a few days. I will be trying to pick characters with a strong variety of backgrounds and goals, so take a look at other submissions and try to come up with something unique. Feel free to create your own nature, strength, weakness, and subplot cards in addition to those provided. Please include an explanation for why your character was chosen for the regency council as part of your application. Please include an avatar image with your application.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-09-24 23:31:00 UTC",
        "comment": "The king was buried on a grey autumn morning, with a light rain falling from the sky. The streets surrounding the royal cemetery were packed with mourners, many openly weeping at the sight of the casket and the accompanying procession conveying the monarch to his final rest.\n\nThere was always a period of national mourning when a Versaillian king died. To appear unmoved by the passing of a monarch would be unseemly. One could tell by the mood in the air that this was something more than mourning for appearances' sake.\n\nLarvane XI was truly beloved by his people. He had brought decisive victory in battle over the Versaillians' most hated rivals, and given his life in the effort. One could be all but certain that history would remember him as more than a king. History would remember him as a national hero.\n\nIn his final hours, the king had sent missives and made clear his wishes as to the matter of his succession. His sole surviving child, Crown Princess Elaia, was barely twelve years old. Crown law calls for a regent to be appointed until the reigning monarch reaches the age of sixteen. In the past, a single individual had generally been appointed to this post.\n\nIt surprised many when Larvane chose to break with this tradition. Rather than a single regent, five were announced. They would serve as a ruling council for the next four years. Some members of this council came as little surprise to the public. Others were shocking, and led some to question whether the rumors of dark magic influencing the king might have had some truth to them.\n\nThere was Duc Dionis De Varre, possibly the most wealthy and powerful man in the kingdom outside of the royal family. Many had speculated he would be chosen as regent prior to the announcement of a council, given his influence, staunch loyalty to the crown, and experience in administering a prosperous duchy.\n\nThe appointment of Cardinal Hastings of Ascher was similarly unsurprising. The Grand Church held tremendous influence over Versaillia, and Larvane was always known as a pious man. Cardinal Hastings was ambitious and influential. Some whispered that he might even be a candidate for Grand Exarch, if he remains in good health when the current head of the Church passes.\n\nThe appointment of Lord Commander Archibald Grant to the regency council was, perhaps, more surprising. Though none could doubt his brilliant tactical mind and the crucial role his leadership played in victory over Avalon, he had long been rumored to hold radical political views. Many suspected him of sympathizing with the agitators and would-be rebels whose activities were a constant nuisance in the capital. Some even whispered speculations that he may have had some role in the king's demise.\n\nSir Aelyth Rainey was another surprising choice. Though she held the honorary title of knight, she was not a landed noble and had more experience with battle than matters of administration. Still, she was another national hero, and few doubted the wisdom of her inclusion.\n\nThe most surprising announcement of all was the appointment of Venn Stelbrakk to the regency council, a man more commonly known by the nickname 'Grey Eyes'. Stelbrakk was a mere commoner without title to his name. His origins were a topic of wide speculation, with many rumoring that he was not even a native Versaillian. Still, he was a man of great power and wealth, wealth he had used to help ensure victory over Avalon by forming a mercenary company that joined the war at a crucial juncture. It was widely speculated that the inclusion of a commoner was meant to placate the increasingly loud calls for greater power to be placed in the hands of the lower classes. Time would tell whether it would prove effective.\n\nWhile the nation continued mourning, there was no time for the newly appointed council to wait before assuming their duties. The royal guard escorted them directly from the funeral to the Palace of Mirrors, where they were met by Armande Demarais, the Royal Cupbearer. Armande was a trusted associate of the king's, mostly charged with day to day management of the palace and the adjoining estates.\n\nEach member of the council was granted an expansive suite at the palace as their new home. Princess Elaia was secluded in mourning in the royal bedchamber which had been her father's. The chamber which had served as the main war room during the conflict with Avalon had been converted into a chamber for the council to meet and conduct business in. The massive round table was still covered in maps and charts, all drawn over with possible battle plans.\n\nBefore dinner, the council gathered in their chambers for their first meeting. \"Lords and Lady Regent, if I may...\" Armande spoke as the regents entered. \"... Forgive me, I am certain there are many matters you must discuss, but I believe there is one issue that must be addressed immediately. The coronation.\"\n\nWhile Elaia will not rule with full authority until her sixteenth birthday, crown law calls for her to be coronated as Queen as soon as possible. A missive has already been sent to request the presence of the Grand Exarch, who has traditionally crowned the monarch of Versaillia.\n\n\"I must express my concerns.\" Armande continued. \"I realize that by tradition our kings and queens have always been crowned in Notre Nuit Cathedral, with a public procession both from and to the palace. I am concerned for Elaia's safety.\"\n\n\"While the period of mourning has calmed things somewhat, there has been much agitation in the capital in recent weeks. Food prices have been high ever since the war began, and we have had disturbances which have come dangerously close to riots at times. And... there are still those who whisper that certain parties... may have attempted to hasten the King's death.\"\n\nA brief flicker of sorrow crossed Armande's face, and he paused before he continued. \"Exposing the princess to the public appears to be simply too dangerous to me. If you but give the word, I can certainly make arrangements for the coronation to take place in the grand hall here at the palace. It would certainly be more secure.\"\n\nArmande bowed his head as he stepped towards the exit. \"I must see to preparations for dinner, and I fear I have taken much of your time already. Please let me know when you have reached a decision, and I shall make preparations.\"\n\nArmande is almost certainly right in that holding a coronation at the palace, without a public procession, would be much safer than the traditional cathedral ceremony. Still, it might send the public the message that the new queen is weak and fearful, or that the council themselves are.\n\nOthers might also take the inference that having a coronation at the palace might be intended to signal that the new Queen views her authority as above that as the church. Some might view the move as being less than pious.\n\nThis was, perhaps, a smaller matter than many of the grand issues of state that the council would soon need to tackle. Still, it was a decision that needed to be made right away. The kingdom could not go without a crowned monarch for long."
    },
    {
        "game_pid": "7z746x",
        "story_name": "The Foretold King",
        "post_title": "For fifty years, the once peaceful and prosperous Kingdom of Morcalia has suffered under the cruel tyranny of Agranox the Red, a powerful dragon. He destroyed the armies, devoured the royal family, reduced the temples and the mage's guild to rubble, and demanded ludicrous tributes of treasure and livestock from those who survived his rampage.\n\nThis was a dark time, but many found hope in a prophecy given by the oracles of old, just before the collapse of the kingdom. This prophecy foretold a hero would rise to dispel the evil plaguing the land, a young man of incredible courage and skill. Wielding a holy sword wreathed in blue flame, this hero would slay the dragon, restore peace, and become the new King of Morcalia.\n\nThe prophecy has now come to pass. Kalben the Brave, once a simple peasant lad, quested to find the sword of legend. Knowing no fear, he ventured into the lair of the dread dragon and slew it himself. The people rejoiced and immediately declared him king.\n\nOf course, the prophecy never said what sort of king the foretold hero would be. Kalben is still a very young and inexperienced man with virtually no formal education and a limited understanding of the world beyond heroic adventuring. If he was to achieve the same success in ruling as he achieved in adventuring, he would need the assistance of his stalwart companions and advisers.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2019-04-20 03:39:00 UTC",
        "comment": "The first months after King Kalben's coronation were filled with activity. Morcalia had been ravaged by decades of draconic tyranny, and much was in need of restoration. Respect for the gods, magic, and just laws needed to be brought back to the realm. The economy, devoted with almost singular purpose to the generation of treasure for Agranox, needed to be put back in working order. A functioning military needed to be built from the ground up. The reborn kingdom needed to re-establish relations with their neighbors and find new informants at home and abroad.\n\nYet of all the monumental tasks heaped upon the king's inner circle, it was Maru Ten-Handed whose work the King took the most interest in during the first days of his reign. The realm's Chief Engineer had been given the monumental task of restoring the Keep of Light, the heart of the ravaged royal castle of old Morcalia. While much work remained to be done to bring the structure back to its former glory, the workers under Maru's command had at least managed to restore and re-open the keep's south wing, home to the great hall, throne room, and royal chambers.\n\nThe new King marked this success with an appropriately auspicious occasion. He would hold court for the first time in the new hall, inviting petitioners of all sorts to bring matters of importance before him. By morning the hall was already packed not only by those with legitimate business for the monarch, but also spectators who had simply come to witness history.\n\n\"Wow. There certainly are a lot of them.\" Kalben remarked to his advisors as he took his new throne, wearing a golden crown reclaimed from the dragon's hoard. \"Who seeks an audience today?\"\n\nThe question was answered by Jimm Vellumscritch, a young scribe and scholar who now found himself employed as the king's herald. Most of his duties seemed to involve reminding the King of his duties and schedule. \"You have several important petitioners this morning, Your Highness. A woman who claims to be a priestess of Lerune has been here since dawn. There are several members of the city watch seeking direction about which of Agranox's laws regarding unlicensed herbalism and alchemy remain in effect. Oh, and the bookbinder's guild has sent a representative to discuss tariffs on Llyranian paper.\"\n\nThe King leaned heavily on one arm of his throne, already looking bored. Jimm pressed on. \"Personally, I would recommend beginning with Count Beldar of Steelridge.\" The herald indicated a short man with a long beard, flanked by a small retinue of retainers. \"A blizzard prevented him from attending your coronation, but he has made the long journey from the border to pledge his fealty to you in person.\"\n\nKalben stared at the Count, looking confused. \"Is he a dwarf? I thought Morcalia didn't have any dwarven nobles.\"\n\nJimm looked uncomfortable. \"A marriage was arranged between the Count's grandmother and a member of the Kar'Dohl royal family as part of a diplomatic resolution to a border dispute. It is a... sensitive subject. I would advise not dwelling on it.\"\n\n\"Nonsense!\" The King practically shouted. \"I love dwarves! They build such nice things. Castles, swords, all lovely. But...\" The King grinned, leaning forward. \"I want to hear from *her* first.\"\n\nKalben pointed out a young, pretty woman in the crowd, dressed in the style currently popular among the city's merchants. She looked surprised and nervous to be singled out.\n\n\"Oh, yes. She's... er...\" Jimm quickly flipped through his scrolls and scrolls of notes, trying to jog his memory. Kalben did not wait.\n\n\"You there! Yes, you! Come forward. I shall hear your petition.\"\n\nThe nervous young woman stepped before the throne and dropped into a curtsy. \"Thank you, Your Highness.\" She said, voice barely above a whisper.\n\n\"Speak up. No reason to be afraid.\" Kalben continued with a beaming smile. \"Who are you?What would you ask of me?\"\n\nThe woman wrung her hands nervously. \"My name is Aurelia Forgespark. Lady Sebile hired my father to craft armor for your horse.\"\n\n\"Ah, yes! Very important!\" Kalben shot Sebile a grin. \"Excellent choice.\" He winked before looking back to Aurelia. \"How does the work go?\"\n\n\"W... well, Your Higness... my father worries about an adequate supply of materials.\" She continued. \"As you know, the dread dragon had a powerful lust for gold. He demanded more and more of my father's work and supplies, and now we have almost none left. A suit of armor for a warhorse will require a significant supply of gold. I wished to ask... well, since Agranox essentially stole our livelihoods, could we have the gold he took back?\"\n\nKalben considered this. \"Well, that makes sense. The dragon stole from all the people of Morcalia. I suppose it should be given back.\"\n\nThis was an alarming train of thought. Morcalia's new monarch currently lacked the infrastructure to collect taxes or secure other income, and the kingdom remained too ravaged to have much to supply. Agranox's treasure hoard was, in effect, the entirety of the royal treasury. If Kalben started giving it away, there would be little left for badly needed projects.\n\n\"But I suppose I should confer with my advisors in my chambers before I formally proclaim my answer. We shall...\"\n\n\"Your Highness, please! A moment!\" The priestess Jimm had pointed out earlier made her way to the front of the throne. Jimm looked concerned. \"My lady, please wait until the King summons you-\"\n\n\"I will hear her petition.\" Kalben declared, setting another worrying precedent.\n\n\"Thank you, Your Highness.\" The priestess' passion was obvious as she spoke, driven by her faith to be so audacious as to demand the king's attention. \"I have come to make a request. I understand it is your intention to restore the High Temple of Aox?\"\n\n\"Yes, of course.\" Kalben answered. \"Aox blessed me with the power to slay the dread Agranox. The restoration of His temple shall be my foremost priority once the Keep of Light is rebuilt.\"\n\n\"A truly noble aim, Your Highness.\" The Priestess replied. \"And Aox is certainly worthy of such worship. Yet I pray you will not repeat the mistakes of old Morcalia and disrespect the other Gods and Goddesses which reign over our land. Aox makes the sun shine over us, but the sun would shine over barren lands if not for Lerune's blessing on our fields. I propose the temple be restored as a place where all may worship freely, to whatever God or Goddess they choose.\"\n\nThe crowd murmured, scandalized. \"She wants to worship others in the high holy place of Aox, our patron God? Blasphemy!\" Someone proclaimed, loud enough to be heard through the hall.\n\nKalben seemed less bothered by the notion. \"An interesting suggestion.\" Rather than his advisors, he looked to the nervously fidgeting Aurelia. \"What do you think of it?\"\n\n\"M... me?\" The girl stammered, put on the spot. \"I... well... I'm told my great grandfather kept a shrine to Hevex, God of Smiths and Artisans, before Agranox outlawed such things. Maybe we could worship him in the High Temple?\"\n\n\"Well, you've given me something to think about.\" Kalben said, rising from his throne. \"I shall confer with my council. Oh, and lunch! It seems like it should be time for lunch, yes?\"\n\nKalben and his inner circle departed the throne room, leaving behind a visibly irritated Count Beldar. Those nearby could hear the Count grumbling in annoyance about being made to wait.\n\nMinutes later all were gathered around a table in Kalben's chambers. The King munched on a turkey leg, feet up on the table. \"So, what's everyone thinking? It's going rather well so far, wouldn't you all say?\"\n\nJimm sighed audibly."
    },
    {
        "game_pid": "sjrjra",
        "story_name": "Leaders of the New World",
        "post_title": "In the year is 2274 AD, the governments of Earth were on the brink of total collapse. The planet had suffered a series of devastating disasters brought on by global climate changes. As the polar ice caps melted away almost entirely, the sea level rose dramatically, swallowing up entire coastal cities. Incredibly intense 'superstorms' ravaged surviving communities. Agriculture became all but impossible.\n\nWith food in short supply and the human population dwindling, those in control of what government infrastructure remained came to a grim conclusion: Earth was doomed. The survivors pooled what resources remained to fund the construction of half a dozen space ships, the pinnacle of human technology and engineering, massive vessels designed to travel to other star systems.\n\nThough spaceflight technology had advanced to the point where interstellar travel was possible, it would not be easy, fast, or simple. No method to surpass the speed of light had ever been discovered, and vessels the size of colony ships would have to travel considerably slower, relying mostly on momentum and drift to conserve fuel.\n\nSix of these ships were constructed, each to be occupied by a hundred thousand people who volunteered to try to carry humanity's legacy forward. Given the length of the journey ahead, it was impossible to do anything but the most rudimentary scans of possible habitable planets in nearby star systems. The colony ships had to set out into the dark of space without even knowing for certain whether they'd find a world they could safely inhabit. The colonists would be placed in an experimental form of cryogenic suspension, aging them minimally over the decades-long voyage. They'd be traveling too far to even communicate with Earth again, truly leaving everything behind for good.\n\nThis is the story of one of those ships, the colony ship *Hercules*. They were bound for the fifth planet orbiting the star Epsilon Eridani. It was a rocky world believed to be earthlike and just 10.5 light years from home. The hopeful colonists nicknamed the new world \"Gaia\". The *Hercules* was placed under the command of Captain Lin Heng, a beloved and almost universally respected leader and humanitarian. Captain Heng did more than almost anyone to keep humanity together in Earth's final years. To assist Captain Heng, a group of officers, experts in a variety of fields and disciplines, were selected to advise her and manage different aspects of the colony project.\n\nUnfortunately, the *Hercules* met with disaster before it could ever benefit from Captain Heng's leadership. A catastrophe during the voyage claimed her life along with the lives of dozens of other colonists. Now it would be up to her officers, intended only as advisors and experts in their own fields, to provide the colony with the leadership it would need to survive and thrive. Would it be possible for them to reconcile their ideas for humanity's future and find a way to move forward? Or would the colonists turn out to have just jumped from one doomed world to another?\n\nOOC Information:\n\nThis story will be focused on political scheming in a science fiction setting. The player characters will often be in conflict with each other and will often be pursuing their own agendas. This is a game of intrigue and scheming. You are strongly encouraged to let your subplot drive your character’s actions. Plotting with your fellow players is certainly encouraged, but plotting against them is also encouraged. It will be necessary to form coalitions to work with characters of different views and backgrounds in order to accomplish much.\n\nAll player characters in this game will be colony officers who now have to make leadership decisions which will effect the fate of the colony as a whole. Many of the challenges in this game will not be traditional obstacles with strong and weak outcomes, but will only be resolved when a majority of the colony leadership council agrees on a single course of action. Challenges with strong or weak outcomes will generally only be used to effect the exact outcomes of the 'vote' challenges, or to obtain additional information.\n\nThe *Hercules* has a diverse, international crew. Feel free to have a character of any race, gender, national origin, religion, or sexual orientation in any role. Futuristic automatic translation software makes lack of a common language a complete non-issue.\n\nThere will be a cap of five characters for this game. Applications will be open for a few days. I will be trying to pick characters with a variety of backgrounds and goals, so take a look at other submissions and try to come up with something unique. No more than one character for each nature will be accepted, and I will try to avoid taking multiple characters with the same subplots. Feel free to create your own nature, strength, weakness, and subplot cards in addition to those provided. Make sure your application discusses both your background prior to being chosen for the colony ship and a description of the role you were chosen for.\n\nThis is a relaunch of an older game from the very early days of Storium. Though you can look up the prior incarnation of the game if you'd like, I'd encourage applicants not to. It could potentially spoil plot developments from the early game.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-06-09 01:34:22 UTC",
        "comment": "Being revived from a lengthy cryogenic suspension was not unlike waking up after being under the influence of anesthetic. Everything felt vaguely unreal as the officers exited their life pods, needing a moment to get their bearings. Their muscles felt weak and sore, though probably not as bad as they should feel after decades of near total motionlessness.\n\nThe senior officers were among the last to enter suspension, having remained awake until it was assured that automation could handle the remainder of the lengthy interstellar voyage. Still, the effects would take some time to shake off entirely.\n\nThe calm, reassuring voice of the ship’s Multipurpose Artificially Intelligent Administrator (usually referred to as ‘Maia’) spoke out once they were on their feet. “Good morning. The Earth date is August 21, 2364.” The officers had been in suspension for over ninety years. At least they were in better shape than they'd have been if they had stayed awake the entire time.\n\n“Cryogenic revival protocol has been successfully executed. Please follow the illuminated lights to assist you in reaching the bridge.”\n\nA path lit up to guide the officers to their destination. Along the way, it became obvious that something was wrong. The view ports did not show the surface of an alien world, but the darkness of space stretching out ahead. This was not right. No one except Captain Heng was supposed to be revived from suspension until the ship had landed on their new world.\n\nSome reassurance was provided by glimpses of the planet in the distance. From orbit, their new home was a mix of wide blue oceans, green and brown landmasses, and fluffy white clouds. Were it not for the continents being entirely wrong shapes, one might mistake the planet for Earth.\n\nOnce the five officers had assembled on the bridge, Maia spoke again to clarify the situation. “Greetings, *Hercules* senior officers. We are currently in orbit around the colony world. Orbital scans and drone probes indicate that the intended planet has a breathable atmosphere and conditions capable of supporting human life. Gravity is approximately 0.96 the strength of Earth’s, and temperature variance falls within acceptable limits.”\n\n“I must report an incident which occurred during transit. Approximately thirty seven years, two months, five days, and seven hours ago, the Hercules collided with an unknown foreign object moving at a high velocity. This object caused a hull breach which briefly compromised life support systems. Repair protocols were able to seal the breach and restore full functionality. Unfortunately, the breach led to the deaths of one hundred and thirty four colonists, including Captain Lin Heng.”\n\nMaia, perhaps lacking the emotional sensitivity to realize the gravity of what she just revealed, did not dwell on this point. She just continued right along with the business at hand.\n\n“According to the colony charter, in the event of the Captain’s death or incapacity, the Captain’s authority is to be shared equally by those officers at the next level of the ship’s hierarchy. Accordingly, this means that Doctor Misao Ukiyo, Felicity Cross, Park Joong Ki, Verlaine de Vere, and Victor Waller are now the executive officers of this colony ship. When three or more of you are in agreement on any command, I will respond to it as if it were a directive from the Captain.”\n\nThe bridge’s monitors began to hum to life, illuminating the previously dimly-lit room. “You have been revived from cryogenic sleep early in order to carry out the first task which Captain Heng was to complete: the selection of a landing site at which to establish the new colony.\" \n\n\"We have been in orbit for approximately thirty nine Earth days. This has provided me sufficient time to conduct a full survey of the planet's surface. After thorough scanning and probing, I have identified three possible landing sites which appear to be the closest matches to my parameters for an ideal human colony. You will need to select one before I can initiate landing protocol.”\n\nThe monitors now displayed an image from the planet below. The screens showed a wide open field covered in plant life resembling grass with an oddly purple sort of coloration. Glimpses of creatures of some kind could be seen in the images; quadrupeds with thick, scaly hides shifting through the grass. A roaring river could be glimpsed cutting through the prairie. Hills in the distance suggested that this location was in the middle of a vast valley.\n\n“This is potential landing site A. Closest Earth analog: Rio Gallegos, Argentina. Temperature varies between 8.4 and 27.9 degrees Celsius. Advantages: preliminary analysis suggests the soil in this area is rich in nutrients which should support crop samples carried from Earth. Agricultural projects will be easily supported. Weather is within comfortable ranges. Presence of freshwater river will provide easily filtered drinking water. Although additional studies will be necessary to confirm, preliminary analysis suggests that native plant life will be both edible and nutritious to the colonists.\"\n\n\"Disadvantages: Abundance of native life forms. Data is insufficient to determine whether or not these life forms could pose a danger to colonists. This site appears to lack any significant deposits of metals, mineral resources, or other materials necessary for large scale manufacturing or construction projects. No obvious resources for the development of energy beyond the fusion reactor of the *Hercules*.”\n\nThe monitors shifted again. This time, they showed a sandy white beach, with a beautiful blue ocean lapping at the shore. A few plants resembling palm trees could be seen above the tide line, heavy with some sort of bulbous purple fruit. A mountain peak could be seen inland as the audio broadcast the calming splash of a waterfall.\n\n“This is potential landing site B. Closest Earth analog: Nassau, Bahamas. Largest of several islands in an archipelago. Temperature varies between 18.2 and 36.1 degrees Celsius. Advantages: Inland areas suitable for agricultural production. Lack of large native animal life forms. Warm weather will reduce need to rely on artificial heating. Mild volcanic activity and fast flowing river provide potential sources of hydroelectric and geothermic energy. Analysis suggests the area is likely to be considered aesthetically pleasing by colonists.\" \n\n\"Disadvantages: This site is located on a relatively small island. Aquatic transportation to other land areas will be necessary to expand colony substantially. Rainfall is frequent and abundant. Strong winds. Lack of metals and mineral resources. Energy-intensive desalination may be required to obtain drinking water during dry periods.”\n\nThe monitors changed their displays again. Now they showed a hilly expanse blanketed in snow. There were rugged cliff faces and steep slopes, with a few stony crags poking out past the deep cover of icy snow. It was a somewhat surprising image after the more inviting images in the previous two displays. There were no signs of native life.\n\n“This is potential landing site C. Closest Earth analog: Anchorage, United States. Temperature varies between -17.1 and 13.2 degrees Celsius. Advantages: Analysis shows this region contains abundant deposits of iron, copper, tungsten, titanium, and other mineral resources which could greatly aid in construction and manufacturing initiatives. Geological scanning further shows massive deposits of petroleum, located close enough to the planetary surface so as to be easily extracted. Combined with potential mineral resources for sustained fusion, this location offers the greatest potential for developing energy.\"\n\n\"Disadvantages: This site is not suitable for traditional agricultural programs due to the cold climate. The colony will need to rely on the ship’s heated atrium for the production of food, which may not be adequate given the size of the colony. Cold temperatures and heavy snowfall may be unpleasant to the colonists.”\n\nThe monitors now changed, showing images from each site side by side. “Once a selection is made, landing protocols can be initiated immediately. Once we have landed, I will proceed with the revival of the remainder of the colonists. As a reminder, lack of fuel resources will render the Hercules unable to lift off again once it has landed. Please inform me if I can be of any further assistance prior to the initiation of landing protocols.”\n\nJust like that, the officers were thrown into command and left with what might be the most critical decision to be made to ensure their new colony’s future. The fate of Captain Heng was enough of a shock, but now this? It would be up to them to make a decision and prepare for what lay ahead."
    },
    {
        "game_pid": "wqgp6e",
        "story_name": "Dance of the WarMechs",
        "post_title": "The realm of Sardonia is a land of castles, knights, magic and monsters, a world where rival kings and queens struggle for land and power. These struggles are inevitably decided by the WarMechs, giant ancient weapons of unfathomable destructive power. The secrets of the WarMechs' origins and the techniques used to create them have been lost to history. Those who possess the few that remain have the power to defeat entire armies on their own, to shape the world's course as they see fit.\n\nTwo mighty powers, the peaceful Kingdom of Karrasine and the expansionist Empire of Eltreyla, stand on the brink of war. With terrible battle looming, the Queen of Karrasine has summoned her loyal knights and their WarMechs to an emergency council. Little do they know that more than a mere territorial dispute lies ahead. Soon these knights will find themselves thrust into a conflict which will decide the future of their entire world. ",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2020-05-17 03:37:56 UTC",
        "comment": "It had been some time since the five knights of Karrasine were together in one place. Their duties kept them in different parts of the kingdom. While two or three might meet from time to time, it took an extraordinary event for all of them to assemble. On this day it took no less than a summons from the Queen herself, directing the entire group to report to the royal castle.\n\nThe summons was foreboding, if not entirely unexpected. Relations with the Empire had been steadily deteriorating for years, marred by intermittent hostilities and incidents, but the last few months had seen a particularly sharp decline. Thus far there had not been a formal declaration of war or a full scale invasion, but most citizens of the kingdom feared that those were not far off.\n\nSuch a development would certainly be cause for fear. The Empire's WarMechs outnumbered Karrasine's more than two to one. Even the most loyal and patriotic of Karrasine's citizenry knew that the kingdom's chances to prevail in war were slim, if not entirely nonexistent. Under the grim cloud of looming war, the knights of Karrasine assembled at the castle.\n\nAfter their WarMechs were safely secured in the castle armory, the royal herald escorted the knights to the throne room, where Queen Korrine and her heir were waiting for them. Most of the usual court was not in attendance, with the exception of Lord Voltran, the Commander of Karrasine, the general in charge of all the kingdom's non-WarMech military forces.\n\nThe Queen got straight to the point. \"I apologize, but we must forgo the formalities I would normally greet you with. I have summoned you to address a matter of grave importance, and time is of the essence. Emperor Arthorian is on his way here, along with several imperial knights.\"\n\n\"What?\" This was clearly news to Voltran, who could not conceal his alarm. The Queen raised her hand to silence him.\n\n\"The Emperor insists this is purely a diplomatic visit. A peace summit, to resolve the issues between our two nations without the need for bloodshed. I trust no one here is foolish enough to believe that. He is looking for a pretext to invade our home, and he is hoping this visit will give him one.\" The Queen went on, grim.\n\n\"Your Majesty...\" Voltran scowled, shaking his head. \"You cannot mean... is he arriving by WarMech?\"\n\n\"He is.\" Korrine answered, grim. \"Him and his retinue. It is an intentional provocation, but no doubt he hoped I would refuse. That would be the sort of insult he could spin into the excuse he is looking for.\"\n\nVoltran shook his head again, looking on the verge of panic. \"Your Majesty, he could begin his invasion straight away. Foreign WarMechs, here at our capital! He'd be in prime position to strike!\"\n\nThe Queen was silent for a moment before she continued. \"Emperor Arthorian is a ruthless man with grand ambitions. But I do not believe he is so without honor that he would launch his attack while visiting under a flag of peace. That would be a step beyond his actions so far. More likely he seeks to use this visit as a pretext for a later invasion. He probably intends to make some unreasonable demand.\"\n\n\"But what if he doesn't?\" Voltran was doing a poor job of concealing his fear. \"What if he does intend to strike at us? The risk of having foreign WarMechs in the capital...\"\n\n\"That is why I have called the kingdom's knights.\" Korrine answered. \"You will, of course, be prepared should the Eltreylans prove to have less than honorable intentions. Your presence will also be a reminder of our strength, in the hopes that Arthorian might yet be convinced to depart from the reckless course he has set upon.\"\n\nVoltran was clearly still uneasy, but did not dare question the queen further.\n\n\"We will not play into his hands and give him the excuse he wants.\" Korrine continued. \"We will welcome him and his retinue as our guests and treat them with respect. I expect all of you to be on your best behavior.\" The Queen's gaze lingered on the Heliana at those words, perhaps as a warning.\n\nThe warning gaze then shifted to Chamomile. \"We all have grievances with the Eltreylans. I know that some of you have suffered terribly at their hands, and that you have not received your due justice. I ask that in the name of the kingdom you have pledged yourselves to, and in the names of the innocents who would die in war, you put those grievances aside for this day. We must--\" The Queen was cut off by a low rumble that shook the floor.\n\nVoltran's eyes widened. \"An attack?\"\n\nKorrine shook her head. \"Our visitors.\"\n\nThe Queen led the way to the castle ramparts. There, they saw the source of the tremors: a WarMech larger than any in Karrasine, nearly as massive as the castle itself. The earth shook with every step it took. Several of the castle guards could not help but gape in awe. Korrine did not allow herself to show fear. \"The Behemoth. Of course Arthorian brought it. Typical of him.\"\n\nThe gargantuan WarMech stopped just short of the castle gates. This close, the knights could see the other WarMechs it carried upon its back, a terrifying array of combat machines in every possible configuration. They descended one by one, leaping from the Behemoth's back, so that their pilots could disembark. Counting the Behemoth, they numbered a full dozen in all.\n\nDespite the sheer size of the Behemoth, the eye was immediately drawn to one of the machines it carried: the sleek white and gold WarMech known as Excalibur, the supposedly invincible WarMech of Arthorian himself. Something about it had a terrifying aura. It moved with authority and purpose.\n\nAfter the riders exited their WarMechs, they met Queen Korrine, her heir, and her knights at the castle gates. Emperor Arthorian was an imposing man, his very presence carrying a sort of dread aura of malevolence, even if some of his retinue stood even taller. The gates opened to allow the delegation inside.\n\n\"Emperor Arthorian.\" Queen Korrine bowed her head slightly, a greeting she reserved only for equals. \"Welcome to Karrasine. We have prepared a banquet to welcome you and your guests.\" Korrine's gaze narrowed slightly as she looked over the Eltreylan WarMech pilots. \"... I only count eleven. I hope everyone is well.\"\n\n\"Sir Carbin the Diamond is attending to domestic matters in His Excellency's stead while the Emperor travels abroad.\" The explanation came not from Arthorian, but from Lady Lancelle the Silver, who stood at the fore of the group. She was perhaps the only Eltreylan who would be familiar to every knight of Karrasine, being the Empire's official envoy to the realm.  \"While we appreciate your hospitality, I believe the Emperor would prefer if we got straight to--\"\n\nArthorian cut Lancelle off simply by raising a hand. The Silver Knight looked to him, studied his face for a moment, then nodded. \"... We will partake of the banquet you have prepared before we proceed to negotiations.\"\n\n\"Hey! Alright! Karrasine food!\" The loud and boisterous Sir Sarreth the Topaz seemed genuinely excited at the prospect. \"Which way to the feast hall?\"\n\nAnd so, the knights of Karrasine found themselves in a truly bizarre situation: feasting with the knights of their kingdom's greatest enemy, breaking bread and drinking with pilots who, by all indications, they would soon meet on the field of battle. In all likelihood many of those seated at the banquet table would kill others at that same table within weeks, perhaps days. Yet this afternoon they were supposed to treat each other as honored guests and hosts. The situation was surreal.\n\nKorrine and Arthorian sat at opposite ends of the table, each eating in silence. The other knights had been seated such that the Eltreylans and Karrasinians were forced to mingle, the groups mixed together.\n\nGawan the Gold and Zaheris the Onyx sat closest to the Emperor, the former evidently trying to quietly convey something to his rumored father and the latter sitting in the same stony silence as the Emperor. Though Zaheris never removed his armor or spoke a word, he did keep looking down the table. More than once, Haku had the unnerving sensation of the Onyx knight watching them.\n\n\"Ahahahah! Delicious!\" Sarreth's enthusiasm for the meal only grew when the food was unveiled. The man had a voracious appetite, wolfing down turkey legs and whole loaves of bread in big greedy bites. Even his fellow Elreylans looked a touch disgusted by his display of gluttony.\n\nOthers were less interested in the food. \"This is what passes for a royal banquet in Karrasine?\" Lady Perca the Platinum scoffed, pushing her plate away. \"I don't eat peasant food. Doesn't this castle have anything for a more refined palate?\"\n\n\"They're barbarians. What did you expect?\" Lady Trista the Emerald growled, eyeing the nearest Karrasinian with contempt. She took a steak knife and stabbed her pork chop with worrisome vigor. \"I don't even know what we're doing here. This trip is a waste of time. We're better at them at anything important. Bigger army, bigger WarMechs, better pilots. They should just start groveling now.\"\n\nLady Bediva the Amethyst ended up seated directly across from Chamomile. She stared straight at the Knight of Earth as she ate. \"I hear you have developed an excellent reputation as a pilot.\" She said, voice flat. \"It is good to hear you have made use of your abilities.\" There was just a tiny hint of an infuriating smile on her lips.\n\nOne of the Eltreylans was unable to hide her fear. Lady Kay the Citrine, the youngest of the delegation, eyed the Karrasinians with scarcely concealed terror. \"They're enemies of the Empire. I've never seen them in person before. Are we really safe here? What if they do something?\"\n\n\"Relax.\" Lady Lamora the Ruby reassured Kay, a somewhat lecherous grin on her face as she eyed the Karrasinians for entirely different reasons. \"They're harmless. They wouldn't dare do anything while we're here on a peace mission. Besides, some of them aren't bad looking. Maybe we can have a little fun while we're here...\"\n\n\"That's not appropriate...\" Kay murmured, barely audible.\n\nElsewhere at the table, Sir Borse the Bronze, the giant pilot of the gargantuan Behemoth, largely ignored the Karrasinians in favor of quiet conversation with Lady Galahanna the Sapphire. Those who followed the intrigues of the imperial court knew the two were rumored to be lovers, and there was something vaguely protective about the way Borse loomed over his dining companion.\n\nThe only member of the Eltreylan delegation who seemed interested in attempting any actual diplomacy was Lancelle, who wasted no time trying to start a serious discussion with the nearest Karrasinian. \"It is a shame such unfortunate rumors about our Emperor circulate in your lands. He wants nothing but to bring about a new age of peace and prosperity by unifying the world. Surely we can all agree that is a worthy goal?\"\n\nThe hall was full of lively conversation, but there was no mistaking it for any kind of celebration. The air was thick with tension and foreboding. Everything felt on the brink of disaster."
    }
]