[
    {
        "game_pid": "sc5dgw",
        "story_name": "Rushbrooke Hall",
        "post_title": "Suffolk, 1813.  Rumour has it that the large and imposing Rushbrooke Hall, empty for six years since the death of Sir Charles Davers, has finally been purchased by a wealthy lord.\n\nAll of the local village is alight with gossip.  But who could this lord be?  And is it true that there will be society and dancing once more at Rushbrooke?\n\n--\n\nThis is a Jane Austen style game, taking place in Regency-era England.  Think manners, rather than monsters.  Romance!  But also witty banter, social satire and good writing.\n\nWe have a Wiki for collaboration, Regency resources, and world building. \n\n*Would prefer if pre-made character types and strengths/weaknesses were used but if you have any idea, let me know.*",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-03-17 23:24:43 UTC",
        "comment": "In all of the history of Bury St. Edmunds there had never been a day as anticipated as the 13th of May, 1813 .  The great Theatre Royal, designed by the esteemed architect William Wilkins, would finally open to the public with the opera *Artaxerxes*, after many years of difficulties and thousands of words in local newspapers about wasted funds and wayward investors.  But more importantly, it was known that this was the day when the new owners of Rushbrooke Hall would finally arrive to occupy it, and when the townspeople of Rushbrooke and Bury St. Edmunds could at last lay to rest their curiosity about the identities of their new neighbours.\n\nThose lucky few who had been able to obtain a ticket to this first showing of *Artaxerxes* after waiting outside for nearly an hour, were led into what seemed no less than a luxurious palace, far beyond anything that had ever been constructed in the town before.  The booths and stage were draped with sumptuous red fabrics, the ceilings foliated with plaster scrolls and ivy in gold leaf, and the walls adorned with Italianate scenes in cameo, depicting angels, knights, and troubadours.\n\nInto one of the prettiest boxes arrived Mr. Jarvis, a well-regarded local squire, and his wife.  And behind him followed a smart looking family of five who, unbeknownst to the people of Bury St. Edmunds, were a family named Heywood, these being the very same who had taken the occupancy of Rushbrooke Hall.\n\nNo one noticed them during the show, not even at the interval.  But after the opera, Mr. and Mrs. Jarvis stood in the foyer of the Theatre Royal with General Heywood, who supported himself with a crutch. He had lost a leg in the Wars, although he somehow managed to look dignified just the same.  Beside him were his daughters Christiana and Arabella, and their governess until recently, Henrietta Mae Collinsworth. They chatted as General Heywood's son John and his brother Gabriel went to retrieve the carriage.  Young Miss Arabella, nearly sixteen years old, took Henrietta's arm.\n\n\"To think we live here now, Henrietta!\" she exclaimed, looking at the faces of the people around her. \"Suffolk is so different from Surrey.  Do you think they will like us here?\"  She was raven haired, bright-eyed and pretty for her age, a stark contrast to her elder sister who was fair and drawn and dignified.\n\n\"Oh look!\" Mr. Jarvis exclaimed to his companion. He was a jolly fellow, bald and stout, and old friend of General Heywood's from his school days. \"There is Lord Cowley! We must go say hello. He is with his daughter who is near enough in age to your own girls. Hello, hello!\"  Mr. Jarvis waved at the Baron, who he had known for many years.\n\n\"And there,\" Mrs. Jarvis said with an air of conspiracy to Arabella and her sister, before pointing to a dark and well-dressed man walking down the staircase, \"is Mr. Waldegrave, who is our local vicar, but also the brother of... well, you'll never guess!\"\n\n\"Tell us!\" Arabella practically begged, gripping tighter to Henrietta Mae's arm. \n\n\"An Earl, of course! Very important. You see, we may be country dwellers out here in Bury St Edmunds, but we have our share of *important* people!\"  Mrs. Jarvis looked very proud, as if she herself had invented Mr. Waldegrave's father and Lord Cowley herself. \"We are so happy to have you here, my dears. Your father is so well respected by everyone, you know.\"\n\n\"And who is that?\" Arabella nodded at a handsome and well-dressed man standing by the entrance. \"Is he important?\"\n\nMrs. Jarvis squinted. \"Hm. He's a Scotsman, I think.  I don't know much about him.  Come, shall we talk to Mr. Waldegrave while we wait for your brothers?\"  She began to tug the girls and Henrietta Mae towards the young vicar."
    },
    {
        "game_pid": "jjpfc3",
        "story_name": "Audley End",
        "post_title": "It is 1813. The country estate of Audley End is one of the finest in Essex and currently inhabited by the honourable Lord Richard Bonneville, Baron of Braybrooke, along with his wife and three children - all of marriageable age and considered by many the most eligible in the county.\n\nThis is a Jane Austen style story of romance and manners, set in early 19th century England.  Players will play the children of Lord Braybrooke and his wife, or vistors to the house who are looking to gain - or deflect! - matrimony in the usual arch, but light-hearted Austen style.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-03-08 14:14:22 UTC",
        "comment": "The family of Richard Bonneville, the Baron of Braybrooke, had everything a family of their standing could want-- except, of course, for the matter of the three Bonneville children, all of them of marriageable age and not a single one engaged.\n\nEach of them, perhaps, was a portrait of pride.  Julian, the eldest, had graduated from Oxford four years ago and left his family home at Audley End in Essex to live in London.  But the son was well-known to be obstreperous, and the shame of his father, more interested in gambling and drink than in the affairs of either household or state.  Rumours of his debauchery had reached his father's ears only months after he had left his house, but despite many arguments Julian refused to leave his bachelor's life, marry, and settle into a situation befitting his future title.   Lord Braybrooke had at last issued him an ultimatum - come home now, find a wife, or be disinherited in favour of a cousin who would be a more suitable custodian for his lands and peerage.\n\nThe two Bonneville daughters were another matter.  Theodosia, the elder, had been declared one of society's most admired beauties upon coming out four years before. Now twenty, she had over the years rebuffed each eligible suitor until the offers eventually stopped. Her family found it difficult to understand. Lord Braybrooke, although loathe to lose his favourite child from his home, worried that she would become a spinster, while Lady Braybrooke saw it as the will of a spoilt child that her daughter should think no man good enough to share her life.\n\nEleanor, the youngest, was perhaps the least of their worries, as she was still just eighteen and bonny and well-loved by all who met her. Lady Braybrooke thought her overly spirited, perhaps: too interested in horses and novels and not enough interested in the gentlemen whose attention she had attracted after her coming out the year before.  Principally, both parents worried she would follow the example of her sister, but they may not have thought this, had they at least one other child wed and settled.\n\nThese troubles were daily on the mind of Lady Braybrooke, who on this afternoon in May stood sewing in the drawing room of Audley End with her two daughters, the local clergyman's wife, and Caroline Webb, her niece who had come to stay with the Bonnevilles just two weeks before. The Lady frowned as she thought of her son, then walked to the large picture window to gaze out at the sunny gardens and carriageway beyond, and finally after several minutes turned to pace the floor with her embroidery hoop, piercing the cloth with her needle with each word she spoke.\n\n\"If Julian is coming home today,\" she said, \"I do wish he would hurry. He should have been here four hours ago, doesn't he mind to keep his mother waiting?  And to bring guests as well, when his father has summoned him home on such a serious matter!\"\n\n\"It is to lighten the atmosphere, no doubt,\" said the clergyman's wife, a jolly round woman named Sarah Kirkbride. She sat near the fireplace with her sewing on her lap. \"He knows he is less likely to be scolded with his friends here.  But isn't it nice to have him home and some time with him before the start of any seriousness?  And a hunt will put Lord Braybrooke in good spirits,\" she paused and regarded Lady Braybrooke with a steady gaze, \"All the better for him to ignore some of the nasty accusations that have been laid against your son.\"\n\n\"None of them true,\" Lady Braybrooke sighed and sat down on a chair. On the sidetable was a book of poems, likely left there by her husband or one of her daughters. She placed her embroidery on top of it. The rumours she had heard of her son disturbed her, but she refused to believe them. He was a darling boy.  Headstrong, independent, but also good.  She was sure of it.\n\nThere were a few moments of silence before the grandfather clock against the far wall chimed its echoing chime. Two o'clock. \"Oh, where is Julian!\"  Lady Braybrooke rose again and began to pace the floor."
    },
    {
        "game_pid": "1xgbgt",
        "story_name": "Equinox : First Bonding",
        "post_title": "*\"Something awful has happened in The Reach. We are going to need the best, humans and unicorns, to fight the darkness that is coming...\"*\n\nUen is a fantasy world where the Uen Caval, Bonded unicorn riders, serve as the King’s cavalry, police, law, and roaming justice for the land. The last Queen was murdered, and there are whispers through the ranks of the Uen Caval that something dark is coming…\n\n—\n\nAt The Academy, students train to become Uen Caval until, if they are lucky, they are Chosen by a unicorn through a process called Kyma. Through this process each unicorn also manifests a particular magical talent, gifted to them by the Light. \n\nThis is a short story module to bring five student characters to Bonding and up to their first Training Mission.\n\nThe Wiki, with all of the info about the world is here:\nhttp://www.jaguarmoon.com/pmwiki/pmwiki.php?n=Main.HomePage\n\nYou certainly don't have to read all it, but you might want to skim it before you complete your character creation.\n\nYou might find this one useful, for example, when coming up with character background as it contains a map of Uen and a description of each area:\nhttp://www.jaguarmoon.com/pmwiki/pmwiki.php?n=Main.GeographyOfUen\n\nThere are also some regional stereotypes in this section:\nhttp://www.jaguarmoon.com/pmwiki/pmwiki.php?n=Main.CustomsAndCulture\n\nYour character can be any type of student, any age between 12 and 25, and have been a the Academy for any number of years as long as they are Unbonded.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-10-13 17:42:20 UTC",
        "comment": "**14 Lasgren 376 ADT**\n\nSomething was most definitely afoot.  As the students began to fill The Hall that day  -- clamoring to the large banqueting tables with their chattering voices and clanking bowls, wooden chairs slamming and screeching across the marble floors -- it was clear that something was different.  Everyone spoke a bit louder, a bit faster, the younger ones squirmed in their chairs.  And a single word spread like a gust of wind through the dining hall: *Kyma!*\n\n\"A girl I talked to in the soup line saw the Elders walking Pol and Bha to the Temple!\" Marchie stabbed her spoon forward at Achillea.  It was filled with soup, which slopped down messily into her bowl as she spoke. She was a tall girl, with close-cropped black hair and a crooked smile. She was also Achillea's roommate. \"Isn't Bha a little young for Kyma?\"\n\n\"Four is plenty old to Bond.  I heard Instructor Colea's son Bonded to a colt of three.\"  Amon was nonplussed as he ripped a chunk from his bread and stuffed it in his mouth. He lived in Pender with Achillea and Marchie but on the other side of the hall with the boys.  He was also Marchie's beau, although the three of them had been inseparable since they had arrived together at the Academy five years ago.  \"I, of course, will Bond to a strapping stallion.  Bigger than all of the others with muscles of iron!\"\n\nMarchie frowned. \"You'll Bond to whomever the Light sees fit for you to Bond to, Ratface.\"  She punched him in the arm. \"And don't you forget it!\"\n\n\"Ow!\"  Amon rubbed his arm.  He was dark-skinned, but even Achillea could see there was a bruise. Amon smiled at her. \"She doesn't know her own strength!\"\n\nMarchie ignored him, her eyes following someone or something from across the room. \"Look, Achillea!  There's Hyden over there - look at how he walks! Does he think he's a prince?  Do you think he'll sit by himself again? What do you suppose he's thinking about with that famous pout of his?\"\n\n\"I think most of the ladies love Hyden's pout,\" Amon said jokingly. \"Do you think he'll *ever* Bond, though?\"\n\n\"Please,\" Marchie put down her spoon.  She hadn't taken a single bite since she sat down. \"He's been here for a century.  The only sadder case would be good old Kalamity Kael...\" she stopped herself, \"Oh.  Sorry, Achillea.  I forgot you were friends.  Annnyway,\" she turned back to Amon. \"Who else do you think they'll take to the Temple today?  I heard someone saw Tok rolling around in the South Pasture, but he may have just been itchy...\"\n\n* * * * \n\nMeanwhile, across the hall, a couple of the newer students from Abel sat whispering with excitement. \"By the Light,\" Obin was too excited to eat. He leaned forward towards his friends, \"This is my first Kyma, can you believe it? Maybe I'll be picked!  Wouldn't that be great, Misha?\"  Obin's toffee coloured hair stuck out in three different directions, but that was not unusual.  He hardly ever combed it. Like Misha, he was thirteen but unlike Misha, he had just arrived at the Academy a month before.  \n\n\"Obin, you're like the worst swordsman in our *whole* class,\" said Daric, who was fourteen and had been at the Academy for two years. \"Besides, you can wait until you're like, thirty to Bond.\"\n\n\"Thirty?\" Obin squeaked.\n\n\"Yeah,\" Daric was having fun now. \"Like Kaelyn over there,\" he gestured towards a woman sitting at a table with several of the instructors. \"Or some of those twenties from Zander. Two of them left last month. Gave up.  Light doesn't choose *everyone*, you know.\"\n\nObin sat back and puffed up his chest. \"I know that.  Just the good-hearted. The ones who're supposed to be heroes.  My ma always said that I...\"\n\n\"Oh, forget yer ma!\" Daric threw a roll at him. \"Misha, what do you think?  Any chance this Lizard's ever gonna Bond?\"\n\n* * * \n\nInstructor Colea laid a quiet hand on Kaelyn's. \"Will you come to the Temple with us, child?\" she said, knowing the pain that must be in the young woman's heart. \"The Elders have assembled four so far in Kymar.  It will be a good show, at least.\""
    },
    {
        "game_pid": "qrytm4",
        "story_name": "Equinox : Winding Trails",
        "post_title": "*\"We are certain that Jumran was kidnapped.  You assignment is to find out what happened to him, and to Wick.\"*\n\nThe young unicorn riders of the Silver and Green Class of Uen Caval are travelling to the southern city of Marlake on their first assignment, to find two kidnapped children who mysteriously disappeared while on [Kymassa](http://www.jaguarmoon.com/pmwiki/pmwiki.php?n=Main.AboutUnicorns).  \n\nThis game is a sequel to two previous games, also situated in the world of [Uen](http://www.jaguarmoon.com/pmwiki/pmwiki.php?n=Main.GeographyOfUen):\n[Equinox: First Bonding](https://storium.com/game/equinox-academy)\nand\n[Equinox: Kymassa](https://storium.com/game/equinox-kymassa)\n\n\nThe Wiki, with all of the info about the world is here:\nhttp://www.jaguarmoon.com/pmwiki/pmwiki.php?n=Main.HomePage\n\nMap of Uen and a description of each area:\nhttp://www.jaguarmoon.com/pmwiki/pmwiki.php?n=Main.GeographyOfUen\n\nThere are also some regional stereotypes in this section:\nhttp://www.jaguarmoon.com/pmwiki/pmwiki.php?n=Main.CustomsAndCulture",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-04-27 18:27:31 UTC",
        "comment": "They had been traveling for two days when they encountered them, the prisoner and his captor.  \n\nThe small band of unicorns and riders had left the Academy just after dawn. Lt. Amalon had led them through the crowded streets of Pallahade, through the border farms and across the hilly country west of the King's Lake, until at nightfall they had reached the town of Circlet, located within the river delta that separated Sutherland and Greenlea.\n\nThey had all dined and slept at the local outpost, and Amalon had given them further details about the mission as they sipped from tankards of springwater or darkbeer.   They had been briefed at the Academy, of course. One of the lieutenants from Pallahade West had met them in a cramped meeting room, deep in the basement of Main Hall.\n\n\"This is classified,\" was the first thing she had said, before introducing herself.  She did not smile, but spoke of her role as one of the organisers for their mission, before she continued with the briefing:\n\n\"The Uen Caval have identified a kidnapping ring,\" she had said, \"with cases stretching from Marlake to Pallahade. Over the past two years, nearly a hundred children, including several off-campus Academy students, have disappeared and evidence has pointed to a single group of captors.  Groups of special operatives have already been assigned to this mission across seven different outposts, and the entire operation is being coordinated by [General Corsair](http://www.jaguarmoon.com/pmwiki/pmwiki.php?n=Main.UenCavalHierarchy) of Sutherland.\"\n\nThere had been more, of course.   A dozen failed attempts to capture members of the ring. Two successful attempts that had not yielded any useful information. Descriptions of the victims - all of them under the age of sixteen.  Three of the names were familiar.  [Ada](http://www.jaguarmoon.com/pmwiki/pmwiki.php?n=Main.Ada). [Jumran](http://www.jaguarmoon.com/pmwiki/pmwiki.php?n=Main.Jumran).  [Wick](http://www.jaguarmoon.com/pmwiki/pmwiki.php?n=Main.Wick).  There had been few leads.  They would be investigating one of them.\n\n\"One of you... Periel,\" the lieutenant looked squarely at the girl, \"and Lt. Amalon were both present when the children named Jumran and Wick each disappeared.  We believe, based on [the testimonies of those that were present](https://storium.com/game/equinox-kymassa/act-1/scene-2) that the child named Jumran, at least, was a victim of this kidnapping ring and that the child named Wick, too, was either another victim or party to this attempt.\"\n\nThey were to join a team of Uen Caval operatives already stationed at Groley Pike and were to help them to investigate the area around the wood [where Wick had disappeared](https://storium.com/game/equinox-kymassa/act-1/scene-3).  They were then to travel back to [Dunnigan Mill](https://storium.com/game/equinox-kymassa/act-1/scene-2) to further investigate Jumran's disappearance and the man Wick had reported to have taken him. \n\nFinally, they were to report their findings, separate from the team of operatives from Groley Pike, and complete the journey to Marlake where they would be stationed under Lt. Amalon herself.\n\nPeriel, of course, would be vital to the mission, and several times Lt. Amalon had hinted that Fargaze's talent was also needed in Marlake for some special purpose, although she did not elaborate.  Achillea and Sunspot were also needed - the local healer and his Bonded had retired over a month before, and the city desperately needed fresh talent.  Reacher and Avalanche, meanwhile, were required for a number of community building projects in the south, and Rainstorm's talent had been singled out as \"highly useful\" for patrol.  They would all receive specific training when they reached Marlake.  But for now, they had a single mission: to investigate Jumran's and Wick's disappearance.\n\nThe morning they had left Circlet had been sunny and blue.  It had taken less than two hours to reach the forest and the trip had been pleasant and the going light. Groley was a deciduous wood - leafy and bright and only just turning red and gold with autumn hues.  The trees were pocketed with birds and wildlife, and the air was wet and fresh with the smell of damp leaves and ozone.  The riders rocked from side to side in creaking leather saddles as their unicorns plodded along the trail, ears pricked.  Sometimes they would trot to keep time, sometimes Amalon would call out \"Hai!\" and Fugue would lead them all into a rolling canter, the unicorns' hooves kicking up clods of light-coloured dirt in their wake.  \n\nBut they had been walking at a gentle pace through the wood, the afternoon sun dappling their Bonded's coats with patterns of gold and shadow, when at first they'd spotted him.  Or rather, *them* - the bound prisoner on a brown horse and the second rider, leading him.  The pair were too far away to make out more than their shapes; they were no more than two specks ahead of them on the road.   It was Silk who made first contact.\n\n{{The one leading, he's Uen Caval,}} she sent, {{I just spoke to the mare he's riding and she's --}}\n\nBut Silk did not have a chance to finish her thought.  Five further riders appeared suddenly from the woods ahead of them, on either side of the Uen Caval and his prisoner.  The group watched as they all drew their swords..."
    },
    {
        "game_pid": "gex7d7",
        "story_name": "Equinox : Darkening Skies",
        "post_title": "*\"Dark Magic is alive again in Uen....\"*\n\nThis game is a sequel to [First Bonding](https://storium.com/game/equinox-academy/) and [Kymassa](https://storium.com/game/equinox-kymassa/).\n\nThe Wiki, with all of the info about the world is here:\nhttp://www.jaguarmoon.com/pmwiki/pmwiki.php?n=Main.HomePage\n\nMap of Uen and a description of each area:\nhttp://www.jaguarmoon.com/pmwiki/pmwiki.php?n=Main.GeographyOfUen\n\nThere are also some regional stereotypes in this section:\nhttp://www.jaguarmoon.com/pmwiki/pmwiki.php?n=Main.CustomsAndCulture",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-05-19 00:53:54 UTC",
        "comment": "*One for the castle.*\n*Two for the keep.*\n*Three for the darkness.*\n*And four to weep.*\n\n-- Uenese children's skipping rhyme\n\n* * *\n* * *\n\n<<We’re lost.>>\n\n[Lt. Brayden]( https://storium.com/game/equinox-kymassa/act-1/scene-1) rubbed his left thigh.  The muscle was sore, but he had little choice but to continue riding.  His Bonded was right.  He did not recognize this landscape.\n\nPalemoon shook her mane.  She was one colour, the lightest blue, and she cut a ghostly figure against the dark of the woods.  It was evening, and the night would be upon them soon. She snorted. <<What do we do now?>>\n\n<<The Outpost can’t be far.  Can you find the Relay?>>\n\nThe mare was silent for a moment. <<No.  Too far.  But the road… the road must lead somewhere.  If not to Harcastle then to somewhere with an inn…>>\n\n<<…where we can get directions.>> Brayden smiled,  <<You are ever sensible.>>\n\n<<One of us has to be.>>\n\nFor a moment the only sound was the plodding of Palemoon’s hooves on soft earth.  <<Brayden?>> she asked at last.\n\n<<Yes, love?>>\n\n<<What do you think is in the parcel that the Commander gave you?>> Palemoon had stopped now. Her ears swivelled back towards her rider, awaiting the answer to her question. \n\nBrayden ran one hand along the pommel of her saddle.  The leather was beginning to crack.  << I didn’t think it was my place to ask.  I didn’t ask about the [parcel I carried to her from Danver](https://storium.com/game/equinox-kymassa/act-1/scene-1) either, if you remember. We are but humble messengers. >>\n\nPalemoon stamped one hoof.  <<*I* am not humble.>>\n\n<<Indeed not!>>  Brayden laughed.  <<In fact, I would say that you…>>\n\nBrayden did not finish his sentence.  Instead, he slumped forward in the saddle as Palemoon screamed and danced backward, her ears flattened against her neck. The arrow had flown over her head, and had sunk deep into her Bonded’s heart.\n\n* * *\n\n“You,” [Lt. Arkeroy]( https://storium.com/game/equinox-academy/act-2/scene-4) pointed at Oraisus, “What do you call those boots?  You were supposed to get fur-lined ones from the store rooms.  Do you think you’ll be able to wear those in The Reach?  We only have two days in the midlands, and then it’s a Lightline over to Ilvernoth.  Those fancy boots’ll go right in the slop heap.”  The man grunted. “Lightsakes. Nevermind, it’s too late now.  You’ll be able to get another pair when we arrive. Damn waste, though.”  \n\n{{Yessss,}}  Arkeroy’s [Bonded](https://storium.com/game/equinox-academy/act-2/scene-4), had a proclivity for interjecting at odd moments in eerie whispering mindtones. {{Wasssteful Oraissusss.}} \n\n[Vara](http://www.jaguarmoon.com/pmwiki/pmwiki.php?n=Main.VaraAndAflame) jabbed Misha with her elbow. <That unicorn gives me the ooks.>  It was Vara’s voice via Aflame. <I didn’t know unicorns could be that strange.>\n\n<Vara.> It was [Jarvic](http://www.jaguarmoon.com/pmwiki/pmwiki.php?n=Main.JarvicAndSeeker)’s voice this time. There was warning in his tone. <He’s our commanding officer.  Just eat your dinner and remember that you’re a Uen Caval now.>\n\nVara glared at him, but said nothing.  Instead, she scowled and stabbed at a slice of ham.\n\n\nThey had left the Academy that afternoon, and were to spend the night at [Redforest Outpost](https://storium.com/game/equinox-academy/act-2/scene-6), just north of Pallahade. While the unicorns eavesdropped from the stables, the group of freshly minted Uen Caval Privates sat at a broad oaken table in the center of the small outpost dining room.  In fact, Hyden and Misha had sat at this very table on the last night of their training mission, and it was a comfort, perhaps, that the room retained its same log cabin charm, with a roaring fire at one end and a long lacquered bench laden with bread, meats and fruit on the other.  The air was fragrant with woodsmoke and spices.\n\nUnfortunately, the group had arrived late and had missed the other officers at their mess.  All except one.  \n\n\"So you're here!\"  In the open doorway of the hall stood a dark-haired young man, his mouth a crooked grin. Misha and Hyden recognised him immediately as Alys’s friend, [Nathyn](https://storium.com/game/equinox-academy/act-2/scene-6), and he stepped lightly over the group to grasp Hyden and Misha’s hands.  “I heard that you boys graduated and were headed down here for the night.” He caught Kytira’s eye and turned a bright shade of crimson. “Uh… boys and a girl. That is, woman, uh…”  Nathyn looked down at the floor and rubbed a hand over the back of his head. “Well listen, I wanted to tell you that we’re down a couple of riders for local patrol tonight. Do any of you want to come?”\n\nLt. Arkeroy wiped his mouth with the back of his hand. “Or, you can stay here with me.  I need to talk to the Captain about our travel arrangements, but after that I have a yen for some weapons practice.  I might even be able to teach you a thing or two.” He grinned at Imos. “You look like a strapping lad, Northlighter.  I reckon you’d be up for some fighting, no?”\n\nNathyn grimaced, perhaps himself imagining the prospect of hand to hand combat with the yellow toothed lieutenant. \"Oh,\" he continued, \"I was also meant to tell you that [Private Calabra](https://storium.com/game/equinox-academy/act-2/scene-6) is sorting through the books tonight in the library and she said she could use some help.  Don't know if you knew her at the Academy, but Calabra’s a bit of a specialist in herbal lore. She's accumulated quite a collection.  Captain says all we used to have were Uen Caval manuals here, but I think even Instructor Tiana would be impressed with the library she's amassed.\"  Like them, Nathyn was a recent graduate and his experiences at the Academy for him were still fresh.  “So what do you think?  Do you want to come along with the patrol?”"
    },
    {
        "game_pid": "r51649",
        "story_name": "Random Lake",
        "post_title": "**Applications currently closed.**\n\n\n\n**This is a beginner game for players new to Storium.**\n\nRandom Lake, Wisconsin.  Population 8,594 at the last census.  Home of the Random Lake Rams, the famous Art's Diner cheese bratwurst, and lately... well, some strange happenings.\n\nThis Storium is set in the spring of 1993.  Bill Clinton has just taken office. *Cheers* and *Saved By The Bell* are in their final seasons on TV. The kids in town walk down to the local video store to rent Terminator II on VHS or Mortal Kombat for their Segas.  Parents go to PTA meetings. High School students lounge in the park and drive around the courthouse in their crop tops and letter jackets, while the old folks chat over forkfuls of apple pie at Art's. \n\nBut small town life is not all that it seems.  The local police department is about to uncover the greatest crime in the town's history, and no one in Random Lake will be prepared for what's to come. \n\nThis storium is in the style of *Twin Peaks* or *True Detective*, small town life with a dash of magical realism. There will be no werewolves or vampires here, no faeries or wizards -- and no smart phones or the internet either, unless you're one of those nerdy kids with AOL or Prodigy! All characters will be ordinary human citizens of a small 1990s town with an undercurrent of the otherwordly and esoteric.\n\nI’ll be crafting the story around the characters you create - and don’t be worried about making mistakes! I’m here to help. :-) Please no players with more than 2-3 games under their belt, and players with no game experience will be warmly welcomed. So roll up to the diner counter, grab a plate of pie, and remember - the towels aren’t always what they seem.\n\n**All beginners are welcome, but I do ask that you read the story up to the current point, the Host's Rules, and Game Info before you apply so you can jump in.**  \n(You can see these in the extended game description at the bottom, once you click 'Learn More'.) Hope to see you in Random Lake!",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-05-22 17:18:19 UTC",
        "comment": "**A Quiet House - April 10, 1992 - 8.17pm**\n\nThe first time, they assumed there was something wrong with their television sets. They blamed the electricity, or the signal. It was just a little flicker really, a blip - surely nothing to worry about.\n\nHolly sat in her trailer, sprawled across her dad's old chair; he was out somewhere. Cole was alone on the couch with his [microwaved TV dinner](https://s-media-cache-ak0.pinimg.com/736x/9a/fa/37/9afa3739be33e128c24f0e8780dde938.jpg) on his lap. Louis, Evan, and Felix sat hunched over coffee tables in close-coupled living rooms, while Vivien and Prince sat tucked in bed, eyes fastened to the TV mounted on the wall of the Obermeyers' tasteful, professionally decorated master bedroom.  The picture flickered once, then twice. Outside the moon suffused the window glass with light, while the blurred glow of the television reflected and illuminated the inner pane.  Six pairs of eyes continued to watch in a daze... until the screen flickered for a third and final time, then all at once snapped to black.  Whatever they had been watching - *Seinfeld* or *Home Improvement*,  *Murphy Brown* or *NYPD Blue* - whatever it was, it stopped.  The rooms around them were silent.  Were their televisions broken?  Some began to get up from their seats, but then... in a flutter, the picture leapt to life again.  Sounds and colour, but not from the show they had been watching - from *something else*.  Something they all recognised.  They were looking at an image of Pitcher's Ravine.\n\nPitcher's Ravine used to be Pitcher's Creek, but in the fifties the creek had slowed to a trickle when local farmers had begun diverting it to water their crops.  It loomed in front of them now, cast in darkness - at least five feet deep and covered in underbrush.  Every kid who had grown up in Random Lake knew about Pitcher's Ravine, because almost every kid had been dared at one point or another to go down there.  Every kid knew, you see, that Pitcher's Ravine was *haunted*.  \n\nSometimes people heard voices.  Sometimes they thought they saw a figure out of the corner of their eye.  Nobody *quite* believed it, but everybody had a story anyway.  And those that had been there, if they racked their memories, would remember how eerily silent it was at the bottom of the ravine. No birdsong or insect chorus.  Only the wind rustling through the trees of the woods that lined either bank. The quiet wind.\n\nEven folks new to town had heard of Pitcher's Ravine, and even those who hadn't been there recognised the scene on their TV sets.  There, behind the ravine,were the old train tracks in the moonlight, and there beyond those was the burnt-out hulk of the Opdyke farmhouse.  Everyone knew *that* story too. Eight years ago, nine members of the family killed in the fire. Mrs. Opdyke had been a teacher at the local school.\n\nAs they watched, the scene before them slowly began to move.  The long grasses and thick bushes at the bottom of the creek bed began to sway in the night wind.  For a moment, they wondered if the dark shadow that shifted away from the shape of a large oak on the banks were an optical illusion, a trick of the light.  But then it pointed at them, then at the ravine. \n\n*Come out.*\n\nA ragged whisper, so soft it was barely audible, emanating now from their TV sets... or was it coming from within their own heads?\n\n*Come out!*\n\nAs the voice rasped its command, a sudden tremor shook the air... not an earthquake exactly, but a ripple of movement that discharged through the room like an electric shock.\n\nAnd then, just as abruptly as it had appeared, the image of the ravine was gone.  In its place was *Seinfeld* or *Home Improvement* or *Murphy Brown*.  Laugh tracks once more filled their rooms with sound, but the message they had just been given remained like a beacon in their minds.\n\nSomething wanted them to come to Pitcher's Ravine.\n\n\n* * * * \n\n***Tutorial***\n\nHere's where I give you an instruction on what to do next!  If you have any questions, pop them in the comments box and I'll do my best to answer them. :-)\n\n*Place Cards*\nThe image at the top of the screen is a place card.  You can click on it to get more information about the location of the scene. (In this instance we are starting at your characters' houses and apartments and ending up at the ravine.)\n\n*Individual Challenges / Obstacle Cards*\nThere are two kinds of challenges - Character Cards and Obstacle Cards.  The one with the concentric circles like a target is an obstacle card.\n\nIf you click on the card, you will see a description of the problem at hand and potential outcomes if you play either a strength or weakness card.  Sometimes they also show results for neutral outcomes, but we'll talk about those later!\n\nIn this instance, you each have to get to the ravine on your own. Therefore, you each get the same challenge, but separated individually - so you can decide upon your own outcome.  We'll do a group challenge later.\n\n*Strength & Weakness Cards*\n\nWhen you play your move, select the challenge with your name on it.  You can then choose to play either a strength or a weakness card on your challenge (don't use your subplot cards yet!).  Leave the wild cards alone for now.  We'll get to those later.\n\nIf you play a strength card, use the strong outcome as a guide for your move.  If you play a weakness card, use the weak one.\n\n**Linking**\n\nDid anybody notice Cole's 1990s vintage TV dinner?  ;-) Linking is optional, but if you want to show a picture of something for effect, or a embed a song to create mood, or if you want to reference anything at all, you can create a link like this:\n\n[text] (url)   <--- except with no space between the two.\n\nPeople don't tend to over-use this in Storium as it can break flow, but it's an option if you want it!\n\n*Your Homework*\n\nAddress a challenge in your next move with a strength or weakness card from your hand.  The title of the strength or weakness card should be the theme of, or at least strongly seed, your move. Again, don't use a subplot card or a wild card - we'll talk about those soon!  Make sure to use the outcomes on the challenge card to guide your moves.\n\nMoves should be written in 3rd person, past tense, with a focus on writing to establish your character's personality.  Look to write at least three paragraphs, or more... and by more, I mean as much as you like!  Some games have word limits, but this is not one of them. :-)\n\nA good game goes at pace, so we'll give ourselves 3-4 days for this move unless anyone has any qualms.  Happy writing!"
    }
]