[
    {
        "game_pid": "g1xtnv",
        "story_name": "Sanctuary",
        "post_title": "#It's the End of the World...\nIt was really and truly the end of the world. You were standing outside - as were most inhabitants on planet earth - and you were watching the sun ... explode ... or at least that's what it looked like. The end of the world would be sudden and it would be complete. You could tell immediately. \n\nYet, when there should have been death and then *nothing*, there was instead a very hard ground, a deep thirst, and a deep hunger. Somehow, some way, you are the last humans to exist... and you don't know where you are or *why* you were spared.\n\n##The Plot \n\nSanctuary begins with a group of seemingly random people from all walks of life from anywhere on 21st century earth who end up transported away a moment before an extinction-level event. They find themselves in an empty, but completely stocked city somewhere unknown (but definitely not earth). Together, you must figure out where you are, why you're there, and what you're supposed to do next. You'll also all discover along the way that there's a lot more to you than you know. \n\nYou'll find out through the course of play that you're actually descendants from a creator race that once had the power to create and walk through worlds. Where you've been taken is a Sanctuary for your kind that you teleported to when a failsafe in your genes pulled you off earth. \n\nYou'll learn that you can go into an inner world where you'll meet your soul echo (see the glossary below) and be able to explore and build in a whole other world. Simultaneously, you and the other last of your kind must find a way to live now that you're the last of your kind. \n\nThere is no major plot for this game at present. This is very much a 'sandbox' game, where you'll get to explore and add to the world as you learn who you are and how to use your newly discovered abilities. I'll take cues on what might be interesting to explore through your roleplay, and build plots around that. If things slow down, I'll introduce something dramatic to get them rolling again, and so on... I don't foresee a real 'end' to this game per se. \n\n##Character Creation Notes\n\nBack in the 21st century, you were really good at one or two things, better than even exceptional humans. The Strength cards reflect pretty broad aspects of what you might shine at over others. \n\nIt may have been your primary job, or you may have been an air conditioning technician who could flawlessly reproduce Picassos in her spare time. \n\nI made the Nature, Strength, and Weakness cards in a fairly generic manner so you can fill in the blanks. Occupations are essentially grouped by what type they are, and weaknesses can be read in many different ways. \n\nFeel free to make your own assuming they follow the follow the general theme that I've established, but I'd rather people mainly use the cards. \n\nIf you're not the first in, take a look at the other characters and try not to overlap *too* much. Some overlap is okay, but if we've got four of basically the same character it's gonna be goofy. :)\n\n##NSFW Notes\nI'm cool with fading to black or ... not ... so just know there might be some sexy times. \n\n##Narrator Notes\nIn this game, you'll be playing two characters (eventually). The first character is your main character, who you create just like normal. Your second character will be a character made by you, but then handed off and played by someone else in the game. This phase of the game will come later on, and the narrator will guide everyone through what we'll be doing, but just be aware at some point you will have two characters to play!\n\nDue to the nature of this game, you should also be up to playing a character you won't have any hand in creating. :) \n\nI prefer games to move at a relatively fast clip, like collaborative side documents for conversations and one-on-ones, and prefer players who are communicative about what they want to see, who they want to play with, what kinds of things they want to do, where they want to take their character, and who work with other players to create dynamic character connections and interesting scenes. \n\nTo that end, we'll be employing Google Hangouts chat to keep in touch with each other and have quicker convos than can happen in the comments section in the game. Please drop me your email address in your character comments so I can add you to the chat. \n\nI also like players who are good with expanding on the world's mythology and story by adding pieces to the world itself through their play. Don't rely on me to tell you what everything looks like or how everything works. This is very much your world to play in, change, add to, and so on... \n\nLastly, do please use third person past-tense!\n\n##Game Glossary\n\n**Kismet** - The unit of 'power currency' to do anything in the outer or inner worlds. In the inner worlds, Kismet literally creates matter. It can be used to create anything the Creator can imagine - buildings, complex machinery, plants, animals, even other people... though that can come with certain... complications. You'll be able to build things or create natural features that generate Kismet for you in the inner world even when you're away. \n\nKismet is created in the outer world through character development and completing various goals. It can also be transferred from one person to another via touch. Kismet will be represented in game as cards to make it easy to pass them around. \n\n**The Outer World** - The outer world is the regular real life world we interact with all the time. There's no guarantee that it's the \"real\" world, but it is the one that you were born in and you generally regard as reality. \n\n**The Inner World** - Through various methods, one can go unconscious in the outer world, only to wake up in the inner world. While you have some power in the outer world, you have much more in the inner world. Here, you can literally create anything you can imagine. At advanced levels, you'll even be able to visit each other's inner worlds. \n\n**Soul Echo** - Your conscious self had no idea you were one of the Creators, but locked away in your subconscious all this time you've had an echo of yourself that *did* know. When you enter your inner world for the first time, you'll meet your subconscious self as a manifestation in the form of a person that was created from what you find to be pleasant, comforting, trustworthy, and helpful. \n\nYour soul echo will be played by another player (or sometimes the narrator if said player is away). You'll collaborate on scenes in Google Docs together (with the narrator) and post chunks at a time when you want to interact with your inner world. Your soul echo intuitively knows the kinds of things you need to do to grow your inner world and - in turn - your power, but may not know everything right away, may be a little flighty, or may need to be asked a specific question in order to remember an answer. \n\nWhen the time comes, you will create your Soul Echo just like another character, then you'll hand it off to another player to interpret and play. You - in turn - will get someone else's echo to play. \n\n***\n\n##[Game Mechanics Reference Document](https://docs.google.com/document/d/1a3TGxi7Dff2IV9ntthRHM739yXhUqSvczVCiAqVAYbQ/edit?usp=sharing)",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-06-17 06:55:00 UTC",
        "comment": "#At Least You're Still Breathing...\n\nThere it was, the end of the world... happening right before your very eyes. Humanity didn't get a chance to ruin their own planet, didn't get a chance to blow themselves out of the sky, didn't even get a chance to leave that lonely blue marble. \n\nThat was it, the gig was up, there was no more earth... just like that. You expected to burst into flames and disintegrate within seconds, but instead you saw a bright flash of light, had a strange, stomach-lurching sensation - like all your atoms were moving individually at great speed for a great distance, had a brief sense that you 'landed' somewhere, then you blacked out. \n\nWhen you came to, you realized quickly a few things: \n\nFirst, you were not, in fact, dead. You were hungry, thirsty, and waking up on cold, hard, terribly uncomfortable paving stones. You felt like you hadn't eaten or had anything to drink in *days*. That, and the lingering effects of however you traveled here have left you light-headed and a bit weak. \n\nSecond, you were not, in fact, on Earth. This became clear to you when you opened your eyes, found yourself flat on your back, and looked up to see a colorful sea of stars and space that looked nothing at all like the sky anywhere on Earth. \n\nThird, there were other people around you, and you were all coming to at the same time. \n\n***\n\n##The Area\n\nYou awaken in the center of a large, round area paved with perfectly laid - and perfectly *clean* - red, brick paving stones. The temperature is a moderate and steady 72 degree fahrenheit, you appear to be in a large park with plenty of trees, paths, and foliage, and towering in a circle around the outside of the park are enormous - at least 200 feet tall - statues made of a shiny, slick stone so black and so reflective, it reflects the stars on the other side of the atmospheric shield. \n\nThe statues themselves are of towering figures wrapped in cloaks with the hoods pulled low over their faces, their hands clasped together, and their heads bent.\n\nThe atmospheric shield above you occasionally flickers with a run of electricity, letting you know that its there. It also emits a light glow. At the moment, it's lighting the place up to be around twilight - or morning, it's hard to tell. \n\nAt the center of your immediate area is a large fountain with fresh water flowing from jets. At four equidistant points around the fountain there are large holographic displays that read 'WELCOME TO SANCTUARY' at the top with 'TOWN DIRECTORY' underneath it. The city appears to be mostly round with spoke-like streets spanning the radius of the inner circle. \n\nThe directory shows where each of you are - precisely - with little green dots over it's holographic map. The map itself shows each of the main four roads leading off into districts: \n\nShopping District\n- Visitor's Center\n- Apparel\n- Groceries\n- Transportation\n- Etc...\n\nCommunity District\n- Library\n- Hospital\n- School\n- Travel Center\n- Sports Arena\n- Community Pool\n- Fitness Facilities\n\nBusiness District\n- Lab Space\n- Workshops\n- Studio Space\n\nEntertainment District\n- Games\n- Video\n- Restaurants\n- Game Halls\n- Bars\n\nThe streets have no other names other than their generic designations as 'Entertainment', 'Business', 'Community', etc... the whole thing looked like a blank slate and, in fact, if anyone attempts to interact with the map, they will find they can zoom in and out, look at where individual buildings are, and change the name of anything on the map. \n\nAccording to the directory, the time is: \nTwilight\n\nThere doesn't appear to be any finer 'time' being kept than that. \n\nOn your person you have whatever clothing you were wearing when the world ended, and whatever belongings you might have had on your person. "
    },
    {
        "game_pid": "y4jvfw",
        "story_name": "Sanctuary: Campion's Inner World",
        "post_title": "##Note: This is a side-game for [Sanctuary](https://storium.com/game/sanctuary--2).\n\n***\n\n#It's the End of the World...\nIt was really and truly the end of the world. You were standing outside - as were most inhabitants on planet earth - and you were watching the sun ... explode ... or at least that's what it looked like. The end of the world would be sudden and it would be complete. You could tell immediately. \n\nYet, when there should have been death and then *nothing*, there was instead a very hard ground, a deep thirst, and a deep hunger. Somehow, some way, you are the last humans to exist... and you don't know where you are or *why* you were spared.\n\n##The Plot \n\nSanctuary begins with a group of seemingly random people from all walks of life from anywhere on 21st century earth who end up transported away a moment before an extinction-level event. They find themselves in an empty, but completely stocked city somewhere unknown (but definitely not earth). Together, you must figure out where you are, why you're there, and what you're supposed to do next. You'll also all discover along the way that there's a lot more to you than you know. \n\nYou'll find out through the course of play that you're actually descendants from a creator race that once had the power to create and walk through worlds. Where you've been taken is a Sanctuary for your kind that you teleported to when a failsafe in your genes pulled you off earth. \n\nYou'll learn that you can go into an inner world where you'll meet your soul echo (see the glossary below) and be able to explore and build in a whole other world. Simultaneously, you and the other last of your kind must find a way to live now that you're the last of your kind. \n\nThere is no major plot for this game at present. This is very much a 'sandbox' game, where you'll get to explore and add to the world as you learn who you are and how to use your newly discovered abilities. I'll take cues on what might be interesting to explore through your roleplay, and build plots around that. If things slow down, I'll introduce something dramatic to get them rolling again, and so on... I don't foresee a real 'end' to this game per se. \n\n##Character Creation Notes\n\nBack in the 21st century, you were really good at one or two things, better than even exceptional humans. The Strength cards reflect pretty broad aspects of what you might shine at over others. \n\nIt may have been your primary job, or you may have been an air conditioning technician who could flawlessly reproduce Picassos in her spare time. \n\nI made the Nature, Strength, and Weakness cards in a fairly generic manner so you can fill in the blanks. Occupations are essentially grouped by what type they are, and weaknesses can be read in many different ways. \n\nFeel free to make your own assuming they follow the follow the general theme that I've established, but I'd rather people mainly use the cards. \n\nIf you're not the first in, take a look at the other characters and try not to overlap *too* much. Some overlap is okay, but if we've got four of basically the same character it's gonna be goofy. :)\n\n##NSFW Notes\nI'm cool with fading to black or ... not ... so just know there might be some sexy times. \n\n##Narrator Notes\nIn this game, you'll be playing two characters (eventually). The first character is your main character, who you create just like normal. Your second character will be a character made by you, but then handed off and played by someone else in the game. This phase of the game will come later on, and the narrator will guide everyone through what we'll be doing, but just be aware at some point you will have two characters to play!\n\nDue to the nature of this game, you should also be up to playing a character you won't have any hand in creating. :) \n\nI prefer games to move at a relatively fast clip, like collaborative side documents for conversations and one-on-ones, and prefer players who are communicative about what they want to see, who they want to play with, what kinds of things they want to do, where they want to take their character, and who work with other players to create dynamic character connections and interesting scenes. \n\nTo that end, we'll be employing Google Hangouts chat to keep in touch with each other and have quicker convos than can happen in the comments section in the game. Please drop me your email address in your character comments so I can add you to the chat. \n\nI also like players who are good with expanding on the world's mythology and story by adding pieces to the world itself through their play. Don't rely on me to tell you what everything looks like or how everything works. This is very much your world to play in, change, add to, and so on... \n\nLastly, do please use third person past-tense!\n\n##Game Glossary\n\n**Kismet** - The unit of 'power currency' to do anything in the outer or inner worlds. In the inner worlds, Kismet literally creates matter. It can be used to create anything the Creator can imagine - buildings, complex machinery, plants, animals, even other people... though that can come with certain... complications. You'll be able to build things or create natural features that generate Kismet for you in the inner world even when you're away. \n\nKismet is created in the outer world through character development and completing various goals. It can also be transferred from one person to another via touch. Kismet will be represented in game as cards to make it easy to pass them around. \n\n**The Outer World** - The outer world is the regular real life world we interact with all the time. There's no guarantee that it's the \"real\" world, but it is the one that you were born in and you generally regard as reality. \n\n**The Inner World** - Through various methods, one can go unconscious in the outer world, only to wake up in the inner world. While you have some power in the outer world, you have much more in the inner world. Here, you can literally create anything you can imagine. At advanced levels, you'll even be able to visit each other's inner worlds. \n\n**Soul Echo** - Your conscious self had no idea you were one of the Creators, but locked away in your subconscious all this time you've had an echo of yourself that *did* know. When you enter your inner world for the first time, you'll meet your subconscious self as a manifestation in the form of a person that was created from what you find to be pleasant, comforting, trustworthy, and helpful. \n\nYour soul echo will be played by another player (or sometimes the narrator if said player is away). You'll collaborate on scenes in Google Docs together (with the narrator) and post chunks at a time when you want to interact with your inner world. Your soul echo intuitively knows the kinds of things you need to do to grow your inner world and - in turn - your power, but may not know everything right away, may be a little flighty, or may need to be asked a specific question in order to remember an answer. \n\nWhen the time comes, you will create your Soul Echo just like another character, then you'll hand it off to another player to interpret and play. You - in turn - will get someone else's echo to play. \n\n***\n\n##[Game Mechanics Reference Document](https://docs.google.com/document/d/1a3TGxi7Dff2IV9ntthRHM739yXhUqSvczVCiAqVAYbQ/edit?usp=sharing)",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-07-21 19:06:59 UTC",
        "comment": "#Your Inner World\n\nWhen you step into your Inner World for the first time, you find yourself standing in the middle of about an acre of *nothing*. You cannot tell what you're standing on for your feet are covered in thick fog that goes up to your knees. You cannot tell what there would be for sky, for about fifteen feet above you, that same thick fog obscures what might be beyond.\n\nThe only other thing here is your Soul Echo. \n\n##Soul Echoes\n\nYou just came into existence, which is a curious sensation. You remember nothing before this moment, though somehow you know perfectly well what's been happening lately. You are aware of the world ending, getting sent to Sanctuary, all of the information Hypatia gave out, even that you are a Soul Echo. \n\nThere are many other things you know, though some of those things are hard to reach or impossible to get to. You're aware that your ability to access those things has to do with the fact that your existence is tied to your creator's. With time and improvement, you'll be able to access all of those fuzzy little details.\n\nYou know the person standing before you as the one who created you. They seem familiar, like you've seen them every day for years and years, even though you were just born a few seconds ago. You know their name, where they came from, and you can access some of their memories if you focus. \n\nAt present, you're standing in the same field of fog and nothing as your Creator. This, you know, is your home, and you are dependent upon your creator to make it habitable for you. They'll need to set the environment of the world you inhabit (beach, forest, city, something other than 'nothing'), and they'll need to provide you with shelter. \n\nOutside of the cleared area, you know the fog is *dangerous*. There are monsters and nightmares lurking within that terrify you senselessly at the moment. You feel, like accessing the information in your brain, like that terror can only be resolved by your Creator, but they are not strong enough to do so, yet. If they attempt to go beyond the cleared area, you must prevent them from doing so lest there be dire consequences for the both of you. \n\n##Obstacles\n\nWhen playing cards on obstacles in your Inner World, there will be some obstacles that are there just so you can spend Kismet to build something, and some obstacles that are there for you to play on normally. I'll indicate on the obstacle which is which. \n\nBecause you can only play three cards in a scene, I'll only be putting one playable box on the Kismet obstacles. *Don't* play any cards on these. Add a note in parentheses of how much Kismet you're spending, and I'll take it out of the running total I'm keeping (I don't want to try and handle Kismet cards in both worlds, so we'll just be keeping track by hand, then discarding the difference in the Outer World scene). \n\nEach of the non-Kismet obstacles will have at least two cards to be played on them. That's so the Soul Echo as well as the Creator can play on those cards. \n\n**Your New Home (Normal)**: Time to get to know your Soul Echo and create your first things! First impressions count. Your Soul Echo has a mind of their own. \n\nYour world doesn't even come with a default environment, so you'll have to create something. Maybe you're on a tropical island, maybe you're on Mars, maybe you're in a totally created world. It costs no Kismet to change how the ground, sky, and general environment appear in your world. Feel free to be as creative as you like. \n\n**Build A Home (Kismet)**: Your Soul Echo will be staying here all the time. They're in your subconscious and are actually aware of what you're doing when you're not with them. They have the same basic needs any person does, however. You'll want to provide them with a place to live, which will also double as your own home away from home. Where you can go and relax while you're in your Inner World. \n\nKeep in mind, your Soul Echo can and will have opinions of their own about their environment and where they're staying. Create something they don't like, and they're not going to be happy, which will likely make them less helpful and more annoying. Piss them off, and they'll do whatever they can to make your life miserable. How you manage this is up to you, and you'll have to manage the relationship carefully. \n\nWhen you create a building, you can also automatically create everything *in* that building (furniture, food, etc...) so long as nothing is Kismet generating. \n\n**Create a Kismet-Generating Object (Kismet)**: You'll want to create an object of some sort (a building or an item) that can generate Kismet so you have a more steady supply of the stuff. \n\nFor items, you'll need to actually use the thing to get the Kismet. Some examples of these might be a musical instrument that generates Kismet when you play it, tools that create Kismet when you're working with them, or a surfboard that generates Kismet when you surf. \n\nBuildings or environmental features generate Kismet on their own once a day, all you'll need to do is go into your Inner World and harvest what's there. They can hold about 3 days worth of Kismet before no more can be made. Some examples of Kismet-generating buildings or environmental features might be: A waterfall, a windmill, a farm (or garden), a river, a storm, etc... \n\n***\n\n#Current Kismet: 30"
    },
    {
        "game_pid": "dc7pr3",
        "story_name": "Sanctuary: Alyson's Inner World",
        "post_title": "##Note: This is a side-game for [Sanctuary](https://storium.com/game/sanctuary--2).\n\n***\n\n#It's the End of the World...\nIt was really and truly the end of the world. You were standing outside - as were most inhabitants on planet earth - and you were watching the sun ... explode ... or at least that's what it looked like. The end of the world would be sudden and it would be complete. You could tell immediately. \n\nYet, when there should have been death and then *nothing*, there was instead a very hard ground, a deep thirst, and a deep hunger. Somehow, some way, you are the last humans to exist... and you don't know where you are or *why* you were spared.\n\n##The Plot \n\nSanctuary begins with a group of seemingly random people from all walks of life from anywhere on 21st century earth who end up transported away a moment before an extinction-level event. They find themselves in an empty, but completely stocked city somewhere unknown (but definitely not earth). Together, you must figure out where you are, why you're there, and what you're supposed to do next. You'll also all discover along the way that there's a lot more to you than you know. \n\nYou'll find out through the course of play that you're actually descendants from a creator race that once had the power to create and walk through worlds. Where you've been taken is a Sanctuary for your kind that you teleported to when a failsafe in your genes pulled you off earth. \n\nYou'll learn that you can go into an inner world where you'll meet your soul echo (see the glossary below) and be able to explore and build in a whole other world. Simultaneously, you and the other last of your kind must find a way to live now that you're the last of your kind. \n\nThere is no major plot for this game at present. This is very much a 'sandbox' game, where you'll get to explore and add to the world as you learn who you are and how to use your newly discovered abilities. I'll take cues on what might be interesting to explore through your roleplay, and build plots around that. If things slow down, I'll introduce something dramatic to get them rolling again, and so on... I don't foresee a real 'end' to this game per se. \n\n##Character Creation Notes\n\nBack in the 21st century, you were really good at one or two things, better than even exceptional humans. The Strength cards reflect pretty broad aspects of what you might shine at over others. \n\nIt may have been your primary job, or you may have been an air conditioning technician who could flawlessly reproduce Picassos in her spare time. \n\nI made the Nature, Strength, and Weakness cards in a fairly generic manner so you can fill in the blanks. Occupations are essentially grouped by what type they are, and weaknesses can be read in many different ways. \n\nFeel free to make your own assuming they follow the follow the general theme that I've established, but I'd rather people mainly use the cards. \n\nIf you're not the first in, take a look at the other characters and try not to overlap *too* much. Some overlap is okay, but if we've got four of basically the same character it's gonna be goofy. :)\n\n##NSFW Notes\nI'm cool with fading to black or ... not ... so just know there might be some sexy times. \n\n##Narrator Notes\nIn this game, you'll be playing two characters (eventually). The first character is your main character, who you create just like normal. Your second character will be a character made by you, but then handed off and played by someone else in the game. This phase of the game will come later on, and the narrator will guide everyone through what we'll be doing, but just be aware at some point you will have two characters to play!\n\nDue to the nature of this game, you should also be up to playing a character you won't have any hand in creating. :) \n\nI prefer games to move at a relatively fast clip, like collaborative side documents for conversations and one-on-ones, and prefer players who are communicative about what they want to see, who they want to play with, what kinds of things they want to do, where they want to take their character, and who work with other players to create dynamic character connections and interesting scenes. \n\nTo that end, we'll be employing Google Hangouts chat to keep in touch with each other and have quicker convos than can happen in the comments section in the game. Please drop me your email address in your character comments so I can add you to the chat. \n\nI also like players who are good with expanding on the world's mythology and story by adding pieces to the world itself through their play. Don't rely on me to tell you what everything looks like or how everything works. This is very much your world to play in, change, add to, and so on... \n\nLastly, do please use third person past-tense!\n\n##Game Glossary\n\n**Kismet** - The unit of 'power currency' to do anything in the outer or inner worlds. In the inner worlds, Kismet literally creates matter. It can be used to create anything the Creator can imagine - buildings, complex machinery, plants, animals, even other people... though that can come with certain... complications. You'll be able to build things or create natural features that generate Kismet for you in the inner world even when you're away. \n\nKismet is created in the outer world through character development and completing various goals. It can also be transferred from one person to another via touch. Kismet will be represented in game as cards to make it easy to pass them around. \n\n**The Outer World** - The outer world is the regular real life world we interact with all the time. There's no guarantee that it's the \"real\" world, but it is the one that you were born in and you generally regard as reality. \n\n**The Inner World** - Through various methods, one can go unconscious in the outer world, only to wake up in the inner world. While you have some power in the outer world, you have much more in the inner world. Here, you can literally create anything you can imagine. At advanced levels, you'll even be able to visit each other's inner worlds. \n\n**Soul Echo** - Your conscious self had no idea you were one of the Creators, but locked away in your subconscious all this time you've had an echo of yourself that *did* know. When you enter your inner world for the first time, you'll meet your subconscious self as a manifestation in the form of a person that was created from what you find to be pleasant, comforting, trustworthy, and helpful. \n\nYour soul echo will be played by another player (or sometimes the narrator if said player is away). You'll collaborate on scenes in Google Docs together (with the narrator) and post chunks at a time when you want to interact with your inner world. Your soul echo intuitively knows the kinds of things you need to do to grow your inner world and - in turn - your power, but may not know everything right away, may be a little flighty, or may need to be asked a specific question in order to remember an answer. \n\nWhen the time comes, you will create your Soul Echo just like another character, then you'll hand it off to another player to interpret and play. You - in turn - will get someone else's echo to play. \n\n***\n\n##[Game Mechanics Reference Document](https://docs.google.com/document/d/1a3TGxi7Dff2IV9ntthRHM739yXhUqSvczVCiAqVAYbQ/edit?usp=sharing)",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-07-21 18:41:47 UTC",
        "comment": "#Your Inner World\n\nWhen you step into your Inner World for the first time, you find yourself standing in the middle of about an acre of *nothing*. You cannot tell what you're standing on for your feet are covered in thick fog that goes up to your knees. You cannot tell what there would be for sky, for about fifteen feet above you, that same thick fog obscures what might be beyond.\n\nThe only other thing here is your Soul Echo. \n\n##Soul Echoes\n\nYou just came into existence, which is a curious sensation. You remember nothing before this moment, though somehow you know perfectly well what's been happening lately. You are aware of the world ending, getting sent to Sanctuary, all of the information Hypatia gave out, even that you are a Soul Echo. \n\nThere are many other things you know, though some of those things are hard to reach or impossible to get to. You're aware that your ability to access those things has to do with the fact that your existence is tied to your creator's. With time and improvement, you'll be able to access all of those fuzzy little details.\n\nYou know the person standing before you as the one who created you. They seem familiar, like you've seen them every day for years and years, even though you were just born a few seconds ago. You know their name, where they came from, and you can access some of their memories if you focus. \n\nAt present, you're standing in the same field of fog and nothing as your Creator. This, you know, is your home, and you are dependent upon your creator to make it habitable for you. They'll need to set the environment of the world you inhabit (beach, forest, city, something other than 'nothing'), and they'll need to provide you with shelter. \n\nOutside of the cleared area, you know the fog is *dangerous*. There are monsters and nightmares lurking within that terrify you senselessly at the moment. You feel, like accessing the information in your brain, like that terror can only be resolved by your Creator, but they are not strong enough to do so, yet. If they attempt to go beyond the cleared area, you must prevent them from doing so lest there be dire consequences for the both of you. \n\n##Obstacles\n\nWhen playing cards on obstacles in your Inner World, there will be some obstacles that are there just so you can spend Kismet to build something, and some obstacles that are there for you to play on normally. I'll indicate on the obstacle which is which. \n\nBecause you can only play three cards in a scene, I'll only be putting one playable box on the Kismet obstacles. *Don't* play any cards on these. Add a note in parentheses of how much Kismet you're spending, and I'll take it out of the running total I'm keeping (I don't want to try and handle Kismet cards in both worlds, so we'll just be keeping track by hand, then discarding the difference in the Outer World scene). \n\nEach of the non-Kismet obstacles will have at least two cards to be played on them. That's so the Soul Echo as well as the Creator can play on those cards. \n\n**Your New Home (Normal)**: Time to get to know your Soul Echo and create your first things! First impressions count. Your Soul Echo has a mind of their own. \n\nYour world doesn't even come with a default environment, so you'll have to create something. Maybe you're on a tropical island, maybe you're on Mars, maybe you're in a totally created world. It costs no Kismet to change how the ground, sky, and general environment appear in your world. Feel free to be as creative as you like. \n\n**Build A Home (Kismet)**: Your Soul Echo will be staying here all the time. They're in your subconscious and are actually aware of what you're doing when you're not with them. They have the same basic needs any person does, however. You'll want to provide them with a place to live, which will also double as your own home away from home. Where you can go and relax while you're in your Inner World. \n\nKeep in mind, your Soul Echo can and will have opinions of their own about their environment and where they're staying. Create something they don't like, and they're not going to be happy, which will likely make them less helpful and more annoying. Piss them off, and they'll do whatever they can to make your life miserable. How you manage this is up to you, and you'll have to manage the relationship carefully. \n\nWhen you create a building, you can also automatically create everything *in* that building (furniture, food, etc...) so long as nothing is Kismet generating. \n\n**Create a Kismet-Generating Object (Kismet)**: You'll want to create an object of some sort (a building or an item) that can generate Kismet so you have a more steady supply of the stuff. \n\nFor items, you'll need to actually use the thing to get the Kismet. Some examples of these might be a musical instrument that generates Kismet when you play it, tools that create Kismet when you're working with them, or a surfboard that generates Kismet when you surf. \n\nBuildings or environmental features generate Kismet on their own once a day, all you'll need to do is go into your Inner World and harvest what's there. They can hold about 3 days worth of Kismet before no more can be made. Some examples of Kismet-generating buildings or environmental features might be: A waterfall, a windmill, a farm (or garden), a river, a storm, etc... \n\n***\n\n#Kismet Available: 35"
    },
    {
        "game_pid": "91x8dt",
        "story_name": "Sanctuary: Seodhna's Inner World",
        "post_title": "##Note: This is a side-game for [Sanctuary](https://storium.com/game/sanctuary--2).\n\n***\n\n#It's the End of the World...\nIt was really and truly the end of the world. You were standing outside - as were most inhabitants on planet earth - and you were watching the sun ... explode ... or at least that's what it looked like. The end of the world would be sudden and it would be complete. You could tell immediately. \n\nYet, when there should have been death and then *nothing*, there was instead a very hard ground, a deep thirst, and a deep hunger. Somehow, some way, you are the last humans to exist... and you don't know where you are or *why* you were spared.\n\n##The Plot \n\nSanctuary begins with a group of seemingly random people from all walks of life from anywhere on 21st century earth who end up transported away a moment before an extinction-level event. They find themselves in an empty, but completely stocked city somewhere unknown (but definitely not earth). Together, you must figure out where you are, why you're there, and what you're supposed to do next. You'll also all discover along the way that there's a lot more to you than you know. \n\nYou'll find out through the course of play that you're actually descendants from a creator race that once had the power to create and walk through worlds. Where you've been taken is a Sanctuary for your kind that you teleported to when a failsafe in your genes pulled you off earth. \n\nYou'll learn that you can go into an inner world where you'll meet your soul echo (see the glossary below) and be able to explore and build in a whole other world. Simultaneously, you and the other last of your kind must find a way to live now that you're the last of your kind. \n\nThere is no major plot for this game at present. This is very much a 'sandbox' game, where you'll get to explore and add to the world as you learn who you are and how to use your newly discovered abilities. I'll take cues on what might be interesting to explore through your roleplay, and build plots around that. If things slow down, I'll introduce something dramatic to get them rolling again, and so on... I don't foresee a real 'end' to this game per se. \n\n##Character Creation Notes\n\nBack in the 21st century, you were really good at one or two things, better than even exceptional humans. The Strength cards reflect pretty broad aspects of what you might shine at over others. \n\nIt may have been your primary job, or you may have been an air conditioning technician who could flawlessly reproduce Picassos in her spare time. \n\nI made the Nature, Strength, and Weakness cards in a fairly generic manner so you can fill in the blanks. Occupations are essentially grouped by what type they are, and weaknesses can be read in many different ways. \n\nFeel free to make your own assuming they follow the follow the general theme that I've established, but I'd rather people mainly use the cards. \n\nIf you're not the first in, take a look at the other characters and try not to overlap *too* much. Some overlap is okay, but if we've got four of basically the same character it's gonna be goofy. :)\n\n##NSFW Notes\nI'm cool with fading to black or ... not ... so just know there might be some sexy times. \n\n##Narrator Notes\nIn this game, you'll be playing two characters (eventually). The first character is your main character, who you create just like normal. Your second character will be a character made by you, but then handed off and played by someone else in the game. This phase of the game will come later on, and the narrator will guide everyone through what we'll be doing, but just be aware at some point you will have two characters to play!\n\nDue to the nature of this game, you should also be up to playing a character you won't have any hand in creating. :) \n\nI prefer games to move at a relatively fast clip, like collaborative side documents for conversations and one-on-ones, and prefer players who are communicative about what they want to see, who they want to play with, what kinds of things they want to do, where they want to take their character, and who work with other players to create dynamic character connections and interesting scenes. \n\nTo that end, we'll be employing Google Hangouts chat to keep in touch with each other and have quicker convos than can happen in the comments section in the game. Please drop me your email address in your character comments so I can add you to the chat. \n\nI also like players who are good with expanding on the world's mythology and story by adding pieces to the world itself through their play. Don't rely on me to tell you what everything looks like or how everything works. This is very much your world to play in, change, add to, and so on... \n\nLastly, do please use third person past-tense!\n\n##Game Glossary\n\n**Kismet** - The unit of 'power currency' to do anything in the outer or inner worlds. In the inner worlds, Kismet literally creates matter. It can be used to create anything the Creator can imagine - buildings, complex machinery, plants, animals, even other people... though that can come with certain... complications. You'll be able to build things or create natural features that generate Kismet for you in the inner world even when you're away. \n\nKismet is created in the outer world through character development and completing various goals. It can also be transferred from one person to another via touch. Kismet will be represented in game as cards to make it easy to pass them around. \n\n**The Outer World** - The outer world is the regular real life world we interact with all the time. There's no guarantee that it's the \"real\" world, but it is the one that you were born in and you generally regard as reality. \n\n**The Inner World** - Through various methods, one can go unconscious in the outer world, only to wake up in the inner world. While you have some power in the outer world, you have much more in the inner world. Here, you can literally create anything you can imagine. At advanced levels, you'll even be able to visit each other's inner worlds. \n\n**Soul Echo** - Your conscious self had no idea you were one of the Creators, but locked away in your subconscious all this time you've had an echo of yourself that *did* know. When you enter your inner world for the first time, you'll meet your subconscious self as a manifestation in the form of a person that was created from what you find to be pleasant, comforting, trustworthy, and helpful. \n\nYour soul echo will be played by another player (or sometimes the narrator if said player is away). You'll collaborate on scenes in Google Docs together (with the narrator) and post chunks at a time when you want to interact with your inner world. Your soul echo intuitively knows the kinds of things you need to do to grow your inner world and - in turn - your power, but may not know everything right away, may be a little flighty, or may need to be asked a specific question in order to remember an answer. \n\nWhen the time comes, you will create your Soul Echo just like another character, then you'll hand it off to another player to interpret and play. You - in turn - will get someone else's echo to play. \n\n***\n\n##[Game Mechanics Reference Document](https://docs.google.com/document/d/1a3TGxi7Dff2IV9ntthRHM739yXhUqSvczVCiAqVAYbQ/edit?usp=sharing)",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-07-21 18:50:29 UTC",
        "comment": "#Your Inner World\n\nWhen you step into your Inner World for the first time, you find yourself standing in the middle of about an acre of *nothing*. You cannot tell what you're standing on for your feet are covered in thick fog that goes up to your knees. You cannot tell what there would be for sky, for about fifteen feet above you, that same thick fog obscures what might be beyond.\n\nThe only other thing here is your Soul Echo. \n\n##Soul Echoes\n\nYou just came into existence, which is a curious sensation. You remember nothing before this moment, though somehow you know perfectly well what's been happening lately. You are aware of the world ending, getting sent to Sanctuary, all of the information Hypatia gave out, even that you are a Soul Echo. \n\nThere are many other things you know, though some of those things are hard to reach or impossible to get to. You're aware that your ability to access those things has to do with the fact that your existence is tied to your creator's. With time and improvement, you'll be able to access all of those fuzzy little details.\n\nYou know the person standing before you as the one who created you. They seem familiar, like you've seen them every day for years and years, even though you were just born a few seconds ago. You know their name, where they came from, and you can access some of their memories if you focus. \n\nAt present, you're standing in the same field of fog and nothing as your Creator. This, you know, is your home, and you are dependent upon your creator to make it habitable for you. They'll need to set the environment of the world you inhabit (beach, forest, city, something other than 'nothing'), and they'll need to provide you with shelter. \n\nOutside of the cleared area, you know the fog is *dangerous*. There are monsters and nightmares lurking within that terrify you senselessly at the moment. You feel, like accessing the information in your brain, like that terror can only be resolved by your Creator, but they are not strong enough to do so, yet. If they attempt to go beyond the cleared area, you must prevent them from doing so lest there be dire consequences for the both of you. \n\n##Obstacles\n\nWhen playing cards on obstacles in your Inner World, there will be some obstacles that are there just so you can spend Kismet to build something, and some obstacles that are there for you to play on normally. I'll indicate on the obstacle which is which. \n\nBecause you can only play three cards in a scene, I'll only be putting one playable box on the Kismet obstacles. *Don't* play any cards on these. Add a note in parentheses of how much Kismet you're spending, and I'll take it out of the running total I'm keeping (I don't want to try and handle Kismet cards in both worlds, so we'll just be keeping track by hand, then discarding the difference in the Outer World scene). \n\nEach of the non-Kismet obstacles will have at least two cards to be played on them. That's so the Soul Echo as well as the Creator can play on those cards. \n\n**Your New Home (Normal)**: Time to get to know your Soul Echo and create your first things! First impressions count. Your Soul Echo has a mind of their own. \n\nYour world doesn't even come with a default environment, so you'll have to create something. Maybe you're on a tropical island, maybe you're on Mars, maybe you're in a totally created world. It costs no Kismet to change how the ground, sky, and general environment appear in your world. Feel free to be as creative as you like. \n\n**Build A Home (Kismet)**: Your Soul Echo will be staying here all the time. They're in your subconscious and are actually aware of what you're doing when you're not with them. They have the same basic needs any person does, however. You'll want to provide them with a place to live, which will also double as your own home away from home. Where you can go and relax while you're in your Inner World. \n\nKeep in mind, your Soul Echo can and will have opinions of their own about their environment and where they're staying. Create something they don't like, and they're not going to be happy, which will likely make them less helpful and more annoying. Piss them off, and they'll do whatever they can to make your life miserable. How you manage this is up to you, and you'll have to manage the relationship carefully. \n\nWhen you create a building, you can also automatically create everything *in* that building (furniture, food, etc...) so long as nothing is Kismet generating. \n\n**Create a Kismet-Generating Object (Kismet)**: You'll want to create an object of some sort (a building or an item) that can generate Kismet so you have a more steady supply of the stuff. \n\nFor items, you'll need to actually use the thing to get the Kismet. Some examples of these might be a musical instrument that generates Kismet when you play it, tools that create Kismet when you're working with them, or a surfboard that generates Kismet when you surf. \n\nBuildings or environmental features generate Kismet on their own once a day, all you'll need to do is go into your Inner World and harvest what's there. They can hold about 3 days worth of Kismet before no more can be made. Some examples of Kismet-generating buildings or environmental features might be: A waterfall, a windmill, a farm (or garden), a river, a storm, etc... \n\n***\n\n#Current Kismet: 25"
    },
    {
        "game_pid": "a5eh3g",
        "story_name": "Sanctuary: Ian's Inner World",
        "post_title": "##Note: This is a side-game for [Sanctuary](https://storium.com/game/sanctuary--2).\n\n***\n\n#It's the End of the World...\nIt was really and truly the end of the world. You were standing outside - as were most inhabitants on planet earth - and you were watching the sun ... explode ... or at least that's what it looked like. The end of the world would be sudden and it would be complete. You could tell immediately. \n\nYet, when there should have been death and then *nothing*, there was instead a very hard ground, a deep thirst, and a deep hunger. Somehow, some way, you are the last humans to exist... and you don't know where you are or *why* you were spared.\n\n##The Plot \n\nSanctuary begins with a group of seemingly random people from all walks of life from anywhere on 21st century earth who end up transported away a moment before an extinction-level event. They find themselves in an empty, but completely stocked city somewhere unknown (but definitely not earth). Together, you must figure out where you are, why you're there, and what you're supposed to do next. You'll also all discover along the way that there's a lot more to you than you know. \n\nYou'll find out through the course of play that you're actually descendants from a creator race that once had the power to create and walk through worlds. Where you've been taken is a Sanctuary for your kind that you teleported to when a failsafe in your genes pulled you off earth. \n\nYou'll learn that you can go into an inner world where you'll meet your soul echo (see the glossary below) and be able to explore and build in a whole other world. Simultaneously, you and the other last of your kind must find a way to live now that you're the last of your kind. \n\nThere is no major plot for this game at present. This is very much a 'sandbox' game, where you'll get to explore and add to the world as you learn who you are and how to use your newly discovered abilities. I'll take cues on what might be interesting to explore through your roleplay, and build plots around that. If things slow down, I'll introduce something dramatic to get them rolling again, and so on... I don't foresee a real 'end' to this game per se. \n\n##Character Creation Notes\n\nBack in the 21st century, you were really good at one or two things, better than even exceptional humans. The Strength cards reflect pretty broad aspects of what you might shine at over others. \n\nIt may have been your primary job, or you may have been an air conditioning technician who could flawlessly reproduce Picassos in her spare time. \n\nI made the Nature, Strength, and Weakness cards in a fairly generic manner so you can fill in the blanks. Occupations are essentially grouped by what type they are, and weaknesses can be read in many different ways. \n\nFeel free to make your own assuming they follow the follow the general theme that I've established, but I'd rather people mainly use the cards. \n\nIf you're not the first in, take a look at the other characters and try not to overlap *too* much. Some overlap is okay, but if we've got four of basically the same character it's gonna be goofy. :)\n\n##NSFW Notes\nI'm cool with fading to black or ... not ... so just know there might be some sexy times. \n\n##Narrator Notes\nIn this game, you'll be playing two characters (eventually). The first character is your main character, who you create just like normal. Your second character will be a character made by you, but then handed off and played by someone else in the game. This phase of the game will come later on, and the narrator will guide everyone through what we'll be doing, but just be aware at some point you will have two characters to play!\n\nDue to the nature of this game, you should also be up to playing a character you won't have any hand in creating. :) \n\nI prefer games to move at a relatively fast clip, like collaborative side documents for conversations and one-on-ones, and prefer players who are communicative about what they want to see, who they want to play with, what kinds of things they want to do, where they want to take their character, and who work with other players to create dynamic character connections and interesting scenes. \n\nTo that end, we'll be employing Google Hangouts chat to keep in touch with each other and have quicker convos than can happen in the comments section in the game. Please drop me your email address in your character comments so I can add you to the chat. \n\nI also like players who are good with expanding on the world's mythology and story by adding pieces to the world itself through their play. Don't rely on me to tell you what everything looks like or how everything works. This is very much your world to play in, change, add to, and so on... \n\nLastly, do please use third person past-tense!\n\n##Game Glossary\n\n**Kismet** - The unit of 'power currency' to do anything in the outer or inner worlds. In the inner worlds, Kismet literally creates matter. It can be used to create anything the Creator can imagine - buildings, complex machinery, plants, animals, even other people... though that can come with certain... complications. You'll be able to build things or create natural features that generate Kismet for you in the inner world even when you're away. \n\nKismet is created in the outer world through character development and completing various goals. It can also be transferred from one person to another via touch. Kismet will be represented in game as cards to make it easy to pass them around. \n\n**The Outer World** - The outer world is the regular real life world we interact with all the time. There's no guarantee that it's the \"real\" world, but it is the one that you were born in and you generally regard as reality. \n\n**The Inner World** - Through various methods, one can go unconscious in the outer world, only to wake up in the inner world. While you have some power in the outer world, you have much more in the inner world. Here, you can literally create anything you can imagine. At advanced levels, you'll even be able to visit each other's inner worlds. \n\n**Soul Echo** - Your conscious self had no idea you were one of the Creators, but locked away in your subconscious all this time you've had an echo of yourself that *did* know. When you enter your inner world for the first time, you'll meet your subconscious self as a manifestation in the form of a person that was created from what you find to be pleasant, comforting, trustworthy, and helpful. \n\nYour soul echo will be played by another player (or sometimes the narrator if said player is away). You'll collaborate on scenes in Google Docs together (with the narrator) and post chunks at a time when you want to interact with your inner world. Your soul echo intuitively knows the kinds of things you need to do to grow your inner world and - in turn - your power, but may not know everything right away, may be a little flighty, or may need to be asked a specific question in order to remember an answer. \n\nWhen the time comes, you will create your Soul Echo just like another character, then you'll hand it off to another player to interpret and play. You - in turn - will get someone else's echo to play. \n\n***\n\n##[Game Mechanics Reference Document](https://docs.google.com/document/d/1a3TGxi7Dff2IV9ntthRHM739yXhUqSvczVCiAqVAYbQ/edit?usp=sharing)",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-07-21 19:03:38 UTC",
        "comment": "#Your Inner World\n\nWhen you step into your Inner World for the first time, you find yourself standing in the middle of about an acre of *nothing*. You cannot tell what you're standing on for your feet are covered in thick fog that goes up to your knees. You cannot tell what there would be for sky, for about fifteen feet above you, that same thick fog obscures what might be beyond.\n\nThe only other thing here is your Soul Echo. \n\n##Soul Echoes\n\nYou just came into existence, which is a curious sensation. You remember nothing before this moment, though somehow you know perfectly well what's been happening lately. You are aware of the world ending, getting sent to Sanctuary, all of the information Hypatia gave out, even that you are a Soul Echo. \n\nThere are many other things you know, though some of those things are hard to reach or impossible to get to. You're aware that your ability to access those things has to do with the fact that your existence is tied to your creator's. With time and improvement, you'll be able to access all of those fuzzy little details.\n\nYou know the person standing before you as the one who created you. They seem familiar, like you've seen them every day for years and years, even though you were just born a few seconds ago. You know their name, where they came from, and you can access some of their memories if you focus. \n\nAt present, you're standing in the same field of fog and nothing as your Creator. This, you know, is your home, and you are dependent upon your creator to make it habitable for you. They'll need to set the environment of the world you inhabit (beach, forest, city, something other than 'nothing'), and they'll need to provide you with shelter. \n\nOutside of the cleared area, you know the fog is *dangerous*. There are monsters and nightmares lurking within that terrify you senselessly at the moment. You feel, like accessing the information in your brain, like that terror can only be resolved by your Creator, but they are not strong enough to do so, yet. If they attempt to go beyond the cleared area, you must prevent them from doing so lest there be dire consequences for the both of you. \n\n##Obstacles\n\nWhen playing cards on obstacles in your Inner World, there will be some obstacles that are there just so you can spend Kismet to build something, and some obstacles that are there for you to play on normally. I'll indicate on the obstacle which is which. \n\nBecause you can only play three cards in a scene, I'll only be putting one playable box on the Kismet obstacles. *Don't* play any cards on these. Add a note in parentheses of how much Kismet you're spending, and I'll take it out of the running total I'm keeping (I don't want to try and handle Kismet cards in both worlds, so we'll just be keeping track by hand, then discarding the difference in the Outer World scene). \n\nEach of the non-Kismet obstacles will have at least two cards to be played on them. That's so the Soul Echo as well as the Creator can play on those cards. \n\n**Your New Home (Normal)**: Time to get to know your Soul Echo and create your first things! First impressions count. Your Soul Echo has a mind of their own. \n\nYour world doesn't even come with a default environment, so you'll have to create something. Maybe you're on a tropical island, maybe you're on Mars, maybe you're in a totally created world. It costs no Kismet to change how the ground, sky, and general environment appear in your world. Feel free to be as creative as you like. \n\n**Build A Home (Kismet)**: Your Soul Echo will be staying here all the time. They're in your subconscious and are actually aware of what you're doing when you're not with them. They have the same basic needs any person does, however. You'll want to provide them with a place to live, which will also double as your own home away from home. Where you can go and relax while you're in your Inner World. \n\nKeep in mind, your Soul Echo can and will have opinions of their own about their environment and where they're staying. Create something they don't like, and they're not going to be happy, which will likely make them less helpful and more annoying. Piss them off, and they'll do whatever they can to make your life miserable. How you manage this is up to you, and you'll have to manage the relationship carefully. \n\nWhen you create a building, you can also automatically create everything *in* that building (furniture, food, etc...) so long as nothing is Kismet generating. \n\n**Create a Kismet-Generating Object (Kismet)**: You'll want to create an object of some sort (a building or an item) that can generate Kismet so you have a more steady supply of the stuff. \n\nFor items, you'll need to actually use the thing to get the Kismet. Some examples of these might be a musical instrument that generates Kismet when you play it, tools that create Kismet when you're working with them, or a surfboard that generates Kismet when you surf. \n\nBuildings or environmental features generate Kismet on their own once a day, all you'll need to do is go into your Inner World and harvest what's there. They can hold about 3 days worth of Kismet before no more can be made. Some examples of Kismet-generating buildings or environmental features might be: A waterfall, a windmill, a farm (or garden), a river, a storm, etc... \n\n***\n\n#Current Kismet: 40"
    },
    {
        "game_pid": "zgvtnb",
        "story_name": "Sanctuary: Jill's Inner World",
        "post_title": "##Note: This is a side-game for [Sanctuary](https://storium.com/game/sanctuary--2).\n\n***\n\n#It's the End of the World...\nIt was really and truly the end of the world. You were standing outside - as were most inhabitants on planet earth - and you were watching the sun ... explode ... or at least that's what it looked like. The end of the world would be sudden and it would be complete. You could tell immediately. \n\nYet, when there should have been death and then *nothing*, there was instead a very hard ground, a deep thirst, and a deep hunger. Somehow, some way, you are the last humans to exist... and you don't know where you are or *why* you were spared.\n\n##The Plot \n\nSanctuary begins with a group of seemingly random people from all walks of life from anywhere on 21st century earth who end up transported away a moment before an extinction-level event. They find themselves in an empty, but completely stocked city somewhere unknown (but definitely not earth). Together, you must figure out where you are, why you're there, and what you're supposed to do next. You'll also all discover along the way that there's a lot more to you than you know. \n\nYou'll find out through the course of play that you're actually descendants from a creator race that once had the power to create and walk through worlds. Where you've been taken is a Sanctuary for your kind that you teleported to when a failsafe in your genes pulled you off earth. \n\nYou'll learn that you can go into an inner world where you'll meet your soul echo (see the glossary below) and be able to explore and build in a whole other world. Simultaneously, you and the other last of your kind must find a way to live now that you're the last of your kind. \n\nThere is no major plot for this game at present. This is very much a 'sandbox' game, where you'll get to explore and add to the world as you learn who you are and how to use your newly discovered abilities. I'll take cues on what might be interesting to explore through your roleplay, and build plots around that. If things slow down, I'll introduce something dramatic to get them rolling again, and so on... I don't foresee a real 'end' to this game per se. \n\n##Character Creation Notes\n\nBack in the 21st century, you were really good at one or two things, better than even exceptional humans. The Strength cards reflect pretty broad aspects of what you might shine at over others. \n\nIt may have been your primary job, or you may have been an air conditioning technician who could flawlessly reproduce Picassos in her spare time. \n\nI made the Nature, Strength, and Weakness cards in a fairly generic manner so you can fill in the blanks. Occupations are essentially grouped by what type they are, and weaknesses can be read in many different ways. \n\nFeel free to make your own assuming they follow the follow the general theme that I've established, but I'd rather people mainly use the cards. \n\nIf you're not the first in, take a look at the other characters and try not to overlap *too* much. Some overlap is okay, but if we've got four of basically the same character it's gonna be goofy. :)\n\n##NSFW Notes\nI'm cool with fading to black or ... not ... so just know there might be some sexy times. \n\n##Narrator Notes\nIn this game, you'll be playing two characters (eventually). The first character is your main character, who you create just like normal. Your second character will be a character made by you, but then handed off and played by someone else in the game. This phase of the game will come later on, and the narrator will guide everyone through what we'll be doing, but just be aware at some point you will have two characters to play!\n\nDue to the nature of this game, you should also be up to playing a character you won't have any hand in creating. :) \n\nI prefer games to move at a relatively fast clip, like collaborative side documents for conversations and one-on-ones, and prefer players who are communicative about what they want to see, who they want to play with, what kinds of things they want to do, where they want to take their character, and who work with other players to create dynamic character connections and interesting scenes. \n\nTo that end, we'll be employing Google Hangouts chat to keep in touch with each other and have quicker convos than can happen in the comments section in the game. Please drop me your email address in your character comments so I can add you to the chat. \n\nI also like players who are good with expanding on the world's mythology and story by adding pieces to the world itself through their play. Don't rely on me to tell you what everything looks like or how everything works. This is very much your world to play in, change, add to, and so on... \n\nLastly, do please use third person past-tense!\n\n##Game Glossary\n\n**Kismet** - The unit of 'power currency' to do anything in the outer or inner worlds. In the inner worlds, Kismet literally creates matter. It can be used to create anything the Creator can imagine - buildings, complex machinery, plants, animals, even other people... though that can come with certain... complications. You'll be able to build things or create natural features that generate Kismet for you in the inner world even when you're away. \n\nKismet is created in the outer world through character development and completing various goals. It can also be transferred from one person to another via touch. Kismet will be represented in game as cards to make it easy to pass them around. \n\n**The Outer World** - The outer world is the regular real life world we interact with all the time. There's no guarantee that it's the \"real\" world, but it is the one that you were born in and you generally regard as reality. \n\n**The Inner World** - Through various methods, one can go unconscious in the outer world, only to wake up in the inner world. While you have some power in the outer world, you have much more in the inner world. Here, you can literally create anything you can imagine. At advanced levels, you'll even be able to visit each other's inner worlds. \n\n**Soul Echo** - Your conscious self had no idea you were one of the Creators, but locked away in your subconscious all this time you've had an echo of yourself that *did* know. When you enter your inner world for the first time, you'll meet your subconscious self as a manifestation in the form of a person that was created from what you find to be pleasant, comforting, trustworthy, and helpful. \n\nYour soul echo will be played by another player (or sometimes the narrator if said player is away). You'll collaborate on scenes in Google Docs together (with the narrator) and post chunks at a time when you want to interact with your inner world. Your soul echo intuitively knows the kinds of things you need to do to grow your inner world and - in turn - your power, but may not know everything right away, may be a little flighty, or may need to be asked a specific question in order to remember an answer. \n\nWhen the time comes, you will create your Soul Echo just like another character, then you'll hand it off to another player to interpret and play. You - in turn - will get someone else's echo to play. \n\n***\n\n##[Game Mechanics Reference Document](https://docs.google.com/document/d/1a3TGxi7Dff2IV9ntthRHM739yXhUqSvczVCiAqVAYbQ/edit?usp=sharing)",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-07-21 18:59:05 UTC",
        "comment": "#Your Inner World\n\nWhen you step into your Inner World for the first time, you find yourself standing in the middle of about an acre of *nothing*. You cannot tell what you're standing on for your feet are covered in thick fog that goes up to your knees. You cannot tell what there would be for sky, for about fifteen feet above you, that same thick fog obscures what might be beyond.\n\nThe only other thing here is your Soul Echo. \n\n##Soul Echoes\n\nYou just came into existence, which is a curious sensation. You remember nothing before this moment, though somehow you know perfectly well what's been happening lately. You are aware of the world ending, getting sent to Sanctuary, all of the information Hypatia gave out, even that you are a Soul Echo. \n\nThere are many other things you know, though some of those things are hard to reach or impossible to get to. You're aware that your ability to access those things has to do with the fact that your existence is tied to your creator's. With time and improvement, you'll be able to access all of those fuzzy little details.\n\nYou know the person standing before you as the one who created you. They seem familiar, like you've seen them every day for years and years, even though you were just born a few seconds ago. You know their name, where they came from, and you can access some of their memories if you focus. \n\nAt present, you're standing in the same field of fog and nothing as your Creator. This, you know, is your home, and you are dependent upon your creator to make it habitable for you. They'll need to set the environment of the world you inhabit (beach, forest, city, something other than 'nothing'), and they'll need to provide you with shelter. \n\nOutside of the cleared area, you know the fog is *dangerous*. There are monsters and nightmares lurking within that terrify you senselessly at the moment. You feel, like accessing the information in your brain, like that terror can only be resolved by your Creator, but they are not strong enough to do so, yet. If they attempt to go beyond the cleared area, you must prevent them from doing so lest there be dire consequences for the both of you. \n\n##Obstacles\n\nWhen playing cards on obstacles in your Inner World, there will be some obstacles that are there just so you can spend Kismet to build something, and some obstacles that are there for you to play on normally. I'll indicate on the obstacle which is which. \n\nBecause you can only play three cards in a scene, I'll only be putting one playable box on the Kismet obstacles. *Don't* play any cards on these. Add a note in parentheses of how much Kismet you're spending, and I'll take it out of the running total I'm keeping (I don't want to try and handle Kismet cards in both worlds, so we'll just be keeping track by hand, then discarding the difference in the Outer World scene). \n\nEach of the non-Kismet obstacles will have at least two cards to be played on them. That's so the Soul Echo as well as the Creator can play on those cards. \n\n**Your New Home (Normal)**: Time to get to know your Soul Echo and create your first things! First impressions count. Your Soul Echo has a mind of their own. \n\nYour world doesn't even come with a default environment, so you'll have to create something. Maybe you're on a tropical island, maybe you're on Mars, maybe you're in a totally created world. It costs no Kismet to change how the ground, sky, and general environment appear in your world. Feel free to be as creative as you like. \n\n**Build A Home (Kismet)**: Your Soul Echo will be staying here all the time. They're in your subconscious and are actually aware of what you're doing when you're not with them. They have the same basic needs any person does, however. You'll want to provide them with a place to live, which will also double as your own home away from home. Where you can go and relax while you're in your Inner World. \n\nKeep in mind, your Soul Echo can and will have opinions of their own about their environment and where they're staying. Create something they don't like, and they're not going to be happy, which will likely make them less helpful and more annoying. Piss them off, and they'll do whatever they can to make your life miserable. How you manage this is up to you, and you'll have to manage the relationship carefully. \n\nWhen you create a building, you can also automatically create everything *in* that building (furniture, food, etc...) so long as nothing is Kismet generating. \n\n**Create a Kismet-Generating Object (Kismet)**: You'll want to create an object of some sort (a building or an item) that can generate Kismet so you have a more steady supply of the stuff. \n\nFor items, you'll need to actually use the thing to get the Kismet. Some examples of these might be a musical instrument that generates Kismet when you play it, tools that create Kismet when you're working with them, or a surfboard that generates Kismet when you surf. \n\nBuildings or environmental features generate Kismet on their own once a day, all you'll need to do is go into your Inner World and harvest what's there. They can hold about 3 days worth of Kismet before no more can be made. Some examples of Kismet-generating buildings or environmental features might be: A waterfall, a windmill, a farm (or garden), a river, a storm, etc... \n\n***\n\n#Current Kismet: 20"
    }
]