[
    {
        "game_pid": "raff3h",
        "story_name": "School for Scorchery.",
        "post_title": "##*Dragon and sorcery game - fun but serious. *\n*No established canon to worry about.  Drop in any time.*\n\n---\n\n\nCharacters are be student spell-users learning their art, and in particular how to handle their dragons at a specialist University!\n\nThe University usually takes students in their mid-teens but no real age limits on characters.\n\n\n**I would want any player to tell me if I need to adjust to increase their access or inclusion.**",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2023-06-16 16:41:19 UTC",
        "comment": "The new intake of students assembled in the Great Hall.\n\nFrom a distance, because of the way the Basilisk University perched near the top of a hill, it appeared to be on its own in the middle of nowhere.\n\nBut it was not so.  A short walk down the hill took you to the bustling town of Cindring, nestling in the valley.  It was not a big town, but it was vibrant.  And it was not unknown to the King.\n\n\n---\n\nBasilisk University of Cindring was revered by many.  \n\nTo enter through its gates was to be assured a career amongst the magical classes.  It prided itself on failing none.  \n \nOf course, in its history some had been expelled, but that really was a situation of last resort.\n \nOne either *Graduated*, or *Finished*.\n \nTo *Finish* from Basilisk University was to be declared ready to serve on the staff of one of the great wizards or military.  Even one who could not themselves learn to master magic could still make themselves useful in some profession and capacity.\n \nHowever, to ***Graduate*** from Basilisk University, to be declared a *Doyen of Dragons*, or a *Baccalaureate of Basilisk* -that was honour indeed.\n\nA **Doyen** would leave with their own dragon, and would be able to serve their King as an autonomous master of magic use, and dragon husbandry.  \n\nA **Baccalaureate of Basilisk** would be qualified to join the Guild of Magicians, and serve in a dragon squadron - although they would not leave with a dragon of their own.\n \nThe students came from all walks of life … all had passed the exacting entrance interview.  All were believed to have the right potential.\n\n\n---\n\n\nEach of the students had to encounter Mallaidh Macbridei.\n\nShe was a formidable woman.  Many grew to respect her, but all feared her.  She ensured good order was kept around the University.  She would give each student their key, and show them on a plan where they would find their room.\n\nExactly what her job title was, no-one quite knew.  She was an institution in and of herself.  She patrolled the corridors, and one did as she said.  But one might also turn to her in a time of trouble.\n\nShe greeted each with warmth, but had a firm warning for those who would venture into the town below the University.  And there was the rub - she had cultivated a way of speaking which was hard to follow;\n\n\"The townsfolk are able and honest, but do not appreciate chaotic behaviour. This is our amplitude, and that is ancient. Bethink this at all times. You are apery Basilisk University aback you go there, and allegation do abolishment to accompany abashing on us. Absolutely, you allegation enhance accordance amidst borough and University. \nWho knows aback you may allegation to be able admired in the borough? So behave consistently in a way that will accompany you acclaim. \nShould you misjudge what that agency - ask for admonition afore arch on action, or be accessible for afterwards-accoutrement.\"\n\nHer expression showed that she hoped she had made herself perfectly clear."
    },
    {
        "game_pid": "c5pb3s",
        "story_name": "School for Scorchery",
        "post_title": "##*Dragon and sorcery game - fun but serious. *\n*No established canon to worry about.  Drop in any time.*\n\n---\n\n\nCharacters are be student spell-users learning their art, and in particular how to handle their dragons at a specialist University!\n\nThe University usually takes students in their mid-teens but no real age limits on characters.\n\nRead the opening scene for more info!\n\n**I would want any player to tell me if I need to adjust to increase their access or inclusion.**",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2021-12-28 16:02:22 UTC",
        "comment": "The new intake of students assembled in the Great Hall.\n\nFrom a distance, because of the way the Basilisk University perched near the top of a hill, it appeared to be on its own in the middle of nowhere.\n\nBut it was not so.  A short walk down the hill took you to the bustling town of Cindring, nestling in the valley.  It was not a big town, but it was vibrant.  And it was not unknown to the King.\n\n\n---\n\nBasilisk University of Cindring was revered by many.  \n\nTo enter through its gates was to be assured a career amongst the magical classes.  It prided itself on failing none.  \n \nOf course, in its history some had been expelled, but that really was a situation of last resort.\n \nOne either *Graduated*, or *Finished*.\n \nTo *Finish* from Basilisk University was to be declared ready to serve on the staff of one of the great wizards or military.  Even one who could not themselves learn to master magic could still make themselves useful in some profession and capacity.\n \nHowever, to ***Graduate*** from Basilisk University, to be declared a *Doyen of Dragons*, or a *Baccalaureate of Basilisk* -that was honour indeed.\n\nA **Doyen** would leave with their own dragon, and would be able to serve their King as an autonomous master of magic use, and dragon husbandry.  \n\nA **Baccalaureate of Basilisk** would be qualified to join the Guild of Magicians, and serve in a dragon squadron - although they would not leave with a dragon of their own.\n \nThe students came from all walks of life … all had passed the exacting entrance interview.  All were believed to have the right potential.\n\n\n---\n\n\nEach of the students had to encounter Mallaidh Macbridei.\n\nShe was a formidable woman.  Many grew to respect her, but all feared her.  She ensured good order was kept around the University.  She would give each student their key, and show them on a plan where they would find their room.\n\nExactly what her job title was, no-one quite knew.  She was an institution in and of herself.  She patrolled the corridors, and one did as she said.  But one might also turn to her in a time of trouble.\n\nShe greeted each with warmth, but had a firm warning for those who would venture into the town below the University.  And there was the rub - she had cultivated a way of speaking which was hard to follow;\n\n\"The townsfolk are able and honest, but do not anatomy able to chaotic behaviour. This is our amplitude, and that is ancient. Bethink this at all times. You are apery Basilisk University aback you go there, and allegation do abolishment to accompany abashing on us. Absolutely, you allegation enhance accordance amidst boondocks and University. \nWho knows aback you may allegation to be able admired in the boondocks? So behave consistently in a way that will accompany you acclaim. \nShould you misjudge what that agency - ask for admonition afore arch on action, or be accessible for afterwards-accoutrement.\"\n\nHer expression showed that she hoped she had made herself perfectly clear."
    },
    {
        "game_pid": "ac4gtt",
        "story_name": "Golems and Trolls.",
        "post_title": "##*Fantasy Game.  For people who want to get on with it! Spell-casting, diplomacy and adventure.*\n**Underlying story with a lot of scope for player story-telling.**\n\n---\n\n\nThis is intended to be a fast game, ***for players who want to get on with it***.  We will start as soon as we have some characters, and new players will be welcome to join as we go.\n\nNew players welcome - and as such, when I say it is fast, that is the broad aim, but we will go at the pace  of the players.  Have a go and I will guide you - or ask questions in the lobby (or PM me)\n\nIt is a fantasy theme in a unique game universe with no canon to worry about. Spell-casting, diplomacy and adventure.  A proper story but not too serious with scope for humour.\n\n---\n\nThe Land is called Pucia.  Pronounced Puck-ia by the Birdfolk and Puce-ia by the Glass Golems.  The Rubber Trolls call it Puke-ia.\n\nAfter a time of uneasy peace, tensions have risen between the Glass Golems and the Rubber Trolls is on the verge of breaking out.  As a player, you have the opportunity to shape huge amounts of the back story and the way magic works in this land.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2022-01-06 18:15:32 UTC",
        "comment": "The first pale strands of sunlight began to creep across the valley.\n\nCrows cried out across the sky.\n\nIrregular calls.\n\n\nThose who listen to the skies regularly get to know the sound of the crows.  Short regular bursts is good news.  They have seen nothing out of the ordinary.  But irregular calls are a warning.  Something is out of place.\n\nAll round the valley, from mountains to forests to meadows, those who were awake at this hour and knew these calls looked across at its source.\n\nThe River Trill.  More specifically, the Cedar Bridge.  One of the bridges that allowed Birdfolk to travel from Krannik to smaller settlements such as Kaliw and Groon.  \n\nNormally, the water would twinkle under the bridge.\n\nNot this morning.  Something was blocking the light.\n\nIt was not hard to guess what - and for sure, there were plenty who would be quick to speculate.\n\nTrolls had taken up residence under the bridge.\n\nProbably Ruggorshar and Pimicle.  They were always up to cause trouble, with their mud-minded hangers on.\n\nThis was *disruptive*.\n\nDisruptive, and needless - the wolves were growing in number, and the trolls could have focused their energies on eating them and so keeping everyone happy.\n\nIt was disruptive to the *Birdfolk*.   They would be reluctant to use the bridge, so trade and communications would be inconvenienced and delayed.  This would lead to more calls for trolls to be pushed further back to the other side of the mountains, which would annoy the trolls and cause tension and tit-for-tat \"incidents.\"\n\nIt was disruptive to the *Golems*.  In truth, it was probably to spite the Golems that the bridge had been occupied.  \n\nIf the Golems did nothing, the Trolls would take more and more liberties until they achieved a reaction.  \n\nYou could see how it might play out.  In the end a Birdperson might go missing. Trolls would be blamed.  Golems would be condemned for failing to act sooner.\n\nAnd of course - they, the Golems, were constructed to stand against \"the darkness\".  What is the point of them, the cry would be, if they do nothing?\n\nYet, let the Golems act, and just see what happens.  As soon as Golems were to protest, or move in, or do *anything* in fact, the Troll chiefs would make noise.  Complain of unfounded allegations, telling lies, jumping to conclusions.\n\n\nBack and forth the arguments would go, until arguments become incidents, incidents become stand-offs.  \n\nAnd stand-offs become war.\n\nAnd it was *disruptive* to the *Trolls*.\n\nRuggorshar was as manipulative as Pimicle was vicious.\n\nIf the Troll chiefs let any perceived slight pass without making a rumpus, Ruggorshar will whip up discontent.  The Chiefs have become soft, he would say; they are giving ground to the Golems, they have signed a pact with the Birdfolk, they have abandoned their people.  Stirring the pot, weakening unity in the hope of gaining from despair.\n\nSo, the Troll Chiefs have to defend the indefensible, whilst trying to smooth things over - as any escalation will just give Ruggorshar another chance to magnify their perceived failures, and move closer to the day when he topples them from their leadership."
    },
    {
        "game_pid": "k0zf2t",
        "story_name": "Neo-Elysia (A Cyberpunk Adventure)",
        "post_title": "####A Cyberpunk adventure\n\nIn the sprawling, neon-soaked metropolis known as *Neo Elysia*, the future has arrived with a stark division between the haves and the have-nots. \nEnhanced individuals, or “Mods,” have become the new elite, possessing cybernetic enhancements that grant them extraordinary abilities, from hacking neural networks to manipulating reality itself. Ordinary citizens, referred to as “Basics,” struggle to survive amidst the towering skyscrapers, poverty-stricken slums, and lawless alleys of the city.\n\nYou, a group of unlikely allies, find yourselves drawn into the intricate web of the city. Each of you possesses a unique enhancement, granting you an edge in a city teeming with both promise and peril. As Mods, your abilities are in high demand, making you the go-to for a variety of shadowy figures and corporations looking to manipulate the city’s power dynamics....\n\n\n---\n\nGlossary / summary of key terms.\n\n---\n\nThere is no external canon to worry about, here I set out some key terms you might see.\n\n** “Sy”, which is short for “SynapTech” (short for Synaptic Technology).** Similar in this game world to an app - and in particular a means by which those with skills can be assigned tasks by those with the means to pay...\n\n**W!SHLIST** and **t@$K** are examples.\n\n**Wishes** are tasks from W!SHLIST (the most prominent Sy.\n**Angels** are the agents fulfilling Wishes.\n**Task Runners** are agents of t@$K.\n\nWishes/ tasks are often ranked a bit like this:\n1 Tinker (bell)\n2 Doc\n3 Wizard\n4 Genie\n5 Demi-God\n\nRankings earned by achieving on t@$K:** Kilobyte, Megabyte, Gigabyte, Terabyte **\n\nRankings on **W!SHLIST** are based on angels ets; such as Disciple, Seraphim, Cherubim, Archangel.\n\nOther Sy's tend to go for things like pagan gods etc.\n\nThe Sy's need to be *seen* to be legal - but have their ways of facilitating illegal transactions.\n\n\n\n\n ",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2023-09-27 11:06:46 UTC",
        "comment": "---\r\n\r\n---\r\n\r\n##**Neo Elysia's Urban Divide: A Social Hierarchy in the City**\r\n\r\n\r\n---\r\n\r\n---\r\n\r\n\r\nNeo Elysia is a city divided not only by its gleaming skyscrapers but also by a stark social hierarchy that shapes the lives of its inhabitants. This divide is symbolised by distinct zones within the city, each with its own rules and challenges.\r\n\r\n\r\n**1. The Upper Echelons - The Privileged Elite**\r\n   - *Location:* High above the city, the wealthy elite reside in luxurious penthouses and high-tech residences, basking in the comfort of their cyber-enhanced lifestyles.\r\n   - *Lifestyle:* The Upper Echelons enjoy unparalleled access to advanced technology, impeccable security, and extravagant entertainment. Weapons are considered a status symbol and are prominently displayed as decor.\r\n   - *Use of Weapons:* Weapons are primarily ornamental, reserved for displays of power and prestige. Discharging a weapon here is a grave offence, usually leading to severe consequences.\r\n\r\n\r\n**2. The Middle Ground - The Struggling Enhanced (Mods)**\r\n   - *Location:* Between the opulence of the elite and the desperation of the slums lies the Middle Ground, where Mods with aspirations dwell.\r\n   - *Lifestyle:* These Mods work tirelessly to pay for their enhancements, hoping to ascend to the Upper Echelons. Their lives are characterised by constant competition and ambition.\r\n   - *Use of Weapons:* While weapons can be carried, they are expected to be used only in self-defence. Mods are caught in a perpetual struggle for status and advancement.\r\n\r\n\r\n**3. The Conurbation - A Blend of Rich and Poor**\r\n   - *Location:* This area sits at the heart of the city, representing a transitional zone between wealth and poverty.\r\n   - *Lifestyle:* Here, a mix of the rich and poor coexist. While some enjoy relative comfort, others struggle to make ends meet. The Conurbation hosts bustling markets, entertainment venues, and a diverse population.\r\n   - *Use of Weapons:* Carrying weapons is common, but discharging them should be limited to acts of self-defence. The Conurbation serves as a melting pot of culture and commerce.\r\n\r\n\r\n**4. The Outer Fringes - Facing Poverty and Lawlessness**\r\n   - *Location:* Moving away from the city centre, the Outer Fringes witness a rise in poverty and a decline in order.\r\n   - *Lifestyle:* Residents here face economic hardships, limited access to technology, and basic amenities. Survival is a daily struggle.\r\n   - *Use of Weapons:* In the Outer Fringes, weapons are readily used for both protection and aggression. Law enforcement is scarce, and vigilante justice is common.\r\n\r\n\r\n**5. The Wastelands - A Desolate, Lawless Abyss**\r\n   - *Location:* Beyond the city's boundaries lies the desolate Wastelands, a harsh and lawless territory.\r\n   - *Lifestyle:* The Wastelands are characterised by extreme pollution, an absence of law, and a return to a primitive existence. Those who venture here do so at their own peril.\r\n   - *Use of Weapons:* In the Wastelands, weapons are a way of life, essential for survival in a hostile environment. Conflict and chaos reign supreme.\r\n\r\n\r\nThe Urban Divide of Neo Elysia paints a vivid portrait of societal inequality, where the haves and have-nots are separated by both physical and metaphorical barriers. As your characters navigate these zones, they will encounter diverse challenges, choices, and opportunities, each contributing to the rich tapestry of the cyberpunk narrative."
    },
    {
        "game_pid": "2t8sws",
        "story_name": "New Start",
        "post_title": "*We wandered off like children in the woods*\n*And let the searchers come but never find us*\n*Tried to make a life among the trees*\n*While your dreams collected planes and cars and cities*\n\n*You slipped away from me while I was sleeping*\n*To climb the tallest oak and see the lights*\n*Your dissatisfaction gave you questions*\n*Do you remember what the city sounded like?*\n\n-----------------------------------------\n\nThe characters in this game are determined to start  a new life, back to nature, in a fruitful jungle.\n\nLife is good.\n\nKey to the story is that the island they move to is an absolute paradise.  However, when the characters sleep, they dream.\n\nAnd when they dream, their heads get filled with memories, aspirations, fears.\n\nGradually, the more they dream, the dreams affect them, and push them towards going to a different life.\n\nThe dreams are subtle, but like an enemy.\n\nSome realise what is happening, others do not.\n\n**Can they keep their community together?**\n\n--------------------\n\nRotating narration is available but you only narrate if you are comfortable with it, and you will be supported if you are new to it.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2019-11-24 21:15:58 UTC",
        "comment": "*It was surreal, like a dream.*\n\n*Moving through airports and bus terminals, hailing taxis - it was normal, commonplace. But today it felt different. Like the last day in a school or office you had attended for years.\nToday was the last day of normal. Everything, everyone they knew would be left behind.*\n\nA dozen times they checked their phones for the time, or for messages - to remember they no longer carried phones. They were going off grid. The time was something you got from public clocks. The news you got from newspapers. And it was the last day of even that.\n\n>They had stumbled on a website blog by a Marvin Winters.  He claimed to have found the perfect island to start a new, back to nature life.  Free from the strains of modern living.\n\n>Apparently he had been all set to change his life for ever - but his father had fallen ill at the eleventh hour.  He just felt he should nurse and bury his father before leaving.\n\n>But all the details were still there, and Winters still logged on from time to time.  Perhaps ironically, then, it was the power of the internet that facilitated a group of strangers to plan a new life absent of all the trappings of modern technology and life.  Maybe it took the internet to bring together people who on their own could not embark upon such a radical plan, but whose locations were too disparate to ever have assembled any other way.\n\nThey reached the dock at last. Each, from their respective locations; disparate, as we have noted.  One by one they assembled, at the appointed place, putting a face to an internet presence.\n\nThe diesel fumes and rancid smell of dirty seawater was a reminder of just why they were doing this.\n\n**New Eden.** A deserted yet fruitful island, off an almost equally unpopulated coastline. \nUnspoiled and abundant - fertile soil, a rich palette of beneficial plants, and no harmful insects away from the coast. The pictures had been stunning.\n\nThe planning had been so intense, and the objective so sought after, that there was no headspace for second thoughts.\n\n>Marvin had worked out how to get there in secret. A ship would be chartered for a route which would go near enough past the island that a landing craft could be secretly launched to get the group there. Not even the captain of the ship would know - as far as they were concerned they were taking the group from A to B. \n>The group would keep themselves to themselves so he would not even notice them gone. He would arrive at B without some  passengers. He was already paid, and a message would be waiting for him to say all was well, so that would be the end of that.\n\nThe captain welcomed them. They were ushered aboard and showed them to the passenger lounge.\n\nThey settled down with a last lunch of convenience food and packaged drinks, and began to properly introduce themselves to each other; why they had finally committed to the trip, what their plans were for the practicalities of life on the island."
    },
    {
        "game_pid": "tkcpfp",
        "story_name": "New Eden",
        "post_title": "*We wandered off like children in the woods*\n*And let the searchers come but never find us*\n*Tried to make a life among the trees*\n*While your dreams collected planes and cars and cities*\n\n*You slipped away from me while I was sleeping*\n*To climb the tallest oak and see the lights*\n*Your dissatisfaction gave you questions*\n*Do you remember what the city sounded like?*\n\n-----------------------------------------\n\nThe characters in this game are determined to start  a new life, back to nature, in a fruitful jungle.\n\nLife is good.\n\nKey to the story is that the island they move to is an absolute paradise.  However, when the characters sleep, they dream.\n\nAnd when they dream, their heads get filled with memories, aspirations, fears.\n\nGradually, the more they dream, the dreams affect them, and push them towards going to a different life.\n\nThe dreams are subtle, but like an enemy.\n\nSome realise what is happening, others do not.\n\n**Can they keep their community together?**\n\n--------------------\n\nRotating narration is available but you only narrate if you are comfortable with it, and you will be supported if you are new to it.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2022-09-04 19:35:38 UTC",
        "comment": "It was surreal, like a dream.\n\nMoving through airports and bus terminals, hailing taxies - it was normal, commonplace.  But today it felt different.  Like the last day in a school or office you had attended for years.\n\nToday was the last day of normal.  Everything, everyone they knew would be left behind.\n\nA dozen times they checked their phones for the time, or for messages - to remember they no longer carried phones.  They were going off grid.  The time was something you got from public clocks.  The news you got from newspapers.  And it was the last day of even that.\n\n---\n\nEach of them had stumbled across an intriguing blog.\n\nSomeone called Marvin Winters had found a beautiful, fertile island which had no people on it, and which was not claimed by any government or state.  He had been making plans to live there. Then, his father fell seriously ill just before he was due to make the trip, and he no longer felt able to go. \n\nThe details were still there.  A small group of website visitors had corresponded via the blog, and made the decision to go.\n\nThe island itself was fairly near the coast of a very remote region of mainland - quite where was revealed on a strictly need-to-know basis.\n\n\nEach had their own reasons for finally committing to the trip.\n\nThere were some rules to going. No-one outside of the group could be told. Contact with the outside world would only spoil things - and apart from that there were tax and regulatory rules for any activity like this, even if money is not exchanged. It was just too complicated if the authorities knew.\n\nMobiles had to be left behind, to avoid them being tracked.\n\n\nMarvin had worked out how to get there in secret. A ship would be chartered for a route which would go near enough past the island that a landing craft could be secretly launched to get the group there. Not even the captain of the ship would know - as far as they were concerned they were taking the group from A to B. The group would keep themselves to themselves so he would not even notice them gone. He would arrive at B without passengers. He was already paid, and a message would be waiting for him to say all was well, so that would be the end of that.\n\n---\n\nThey reached the dock at last.  One by one they assembled, at the appointed place, putting a face to an internet presence.\n\nThe diesel fumes and rancid smell of dirty seawater was a reminder of just why they were doing this.  \n\nNew Eden.  A deserted yet fruitful island, off an almost equally unpopulated coastline.  Unspoiled and abundant - fertile soil, a rich palette of beneficial plants, and no harmful insects away from the coast.  The pictures had been stunning.  \n\nThe planning had been so intense, and the objective so sought after, that there was not headspace for second thoughts.\n\nThe captain welcomed them, and they were ushered aboard and showed them to the passenger lounge.\n\nThey settled down with a last lunch of convenience food and packaged drinks, and began to properly introduce themselves to each other, and start to discuss the practicalities of live on the island."
    },
    {
        "game_pid": "tk3s21",
        "story_name": "Dimensional Freefall --- a Dr Who game",
        "post_title": "A sci/fi time travel adventure loosely based on the British TV series Doctor Who, without a need for canon knowledge.\n\n---\nThis game is nearing the end, but I have the lobby open so newcomers can make contact and get signposted to a suitable game.\n\n---\n\n\nhttps://www.youtube.com/watch?v=zETK7aQhc_E\n\nThis is a fast paced game, played in a welcoming way to meet the needs of each player.\n\n*If you think you might like to play, better to try out than miss out...*\n\n---\n\n##Leaders from across the galaxy are planning to build a taskforce to take the fight to the daleks for once and for all.\n\n##Peace at any cost?  Is any price worth paying for peace?  What is going to far? And if you create a force that can drive out the greatest threat, how do you prevent that becoming the threat once the evil it was designed to counter is gone?\n\n##Even as these decisions are grappled with, democracy is under threat in unexpected ways, and there are other troubling developments....\n\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2021-04-16 09:42:21 UTC",
        "comment": "####Click to see image in full\n\n---\n\n\n\n**It is 3038.**\n\nThe Earth Empire has crumbled as a cohesive political force.\n\nIn its wake came a certain freedom.  But also uncertainty.\n\nEarth’s contribution to the Galactic community was not as fantastic as they sometimes allowed themselves to believe.  Human sneakiness sometimes gave them an edge over the wisdom or inventiveness of other species, and allowed them to circumnavigate the will of brute aggression.  But of course that by no means meant that everything they did with their influence was uncompromisingly beneficial.  Quite possibly why their Empire eventually fell.\n\nOne thing Earth did do well, however, was conferences.  Their great gift to the cosmos.  Wonderful melting pots of social etiquette, good coffee, and strangely flavoured vol-au-vents.\n\nNathan Smoltz’s Conference Badge making company -  Intergalactic Badge Services - had ridden high on the buoyant intergalactic conference business - and came crashing down when Earth’s Empire became a spent force.  No one was happier than Nathan when the Galactic Federation started to cumulate, bringing with it as it did a series of meetings, congresses, and conferences.\n\nA new golden age of badge making was being ushered in.\n\nStill, he was a bit jittery.\n\nThis was a big conference, and a big event.\n\nThe Alpha Centaurians were nice enough but a bit...well, creepy.  They were various hues of green, quite tall, and notable by the single, large eye that dominated their bulbous heads, also marked by thick blood vessels.  They looked, he thought, a bit like vertical caterpillars, with several tentacle-like arms terminating in claws.  They were very keen that everything went smoothly.\n\nAt the last minute, as Nathan saw it, he was asked not only to prepare the badges, but also ensure only the right people came in, give directions, and keep everyone moving.\n\nThe Alpha Centaurians were very proud of their cultural heritage.  The whole event was to be hosted in what seemed like a great art gallery, with winding corridors displaying great works of art, little ante-rooms housing portfolios of poetry, and three “listening rooms” where music would be performed to help delegates unwind.  In Nathan’s opinion, they would *need* to unwind, after getting half-lost wandering around it all.\n\nIt was arranged over 5 floors (of great architecture, let it be noted) with the reception and food court at the entrance level, the main conference hall on the first floor, the suites of delegates on the second floor, some break-out meeting rooms on the third floor, two theatres and two listening rooms on the fourth floor, and on the fifth floor was the grandest of the listening rooms and some more suites for guests.  Everywhere was a maze of corridors to maximise the opportunities to display art, with alcoves boasting sculptures.  Grand stairways went up from either side of the reception, with lifts strategically arranged around the place to provide more opportunities for artistic displays.\n\n*“The Xlanthius delegation is already here -as are the Ice Warriors.  The Malcassairo’s have only just confirmed so they are not on the official list but should be welcomed”* purred Hecto Shellac, the Alpha Centarian giving Nathan most of his orders.  Their voice was feminine to Nathan's ears, but that was just his human perspective.\n\n*\"Treat the observer from Peladon patiently,\"* they continued,  *\"we are hoping they will join us formally...steer the Draconians and Thoros-Beta Mentors to the top floor please... ah, look, I will write it down for you, so you know who goes where.”*"
    },
    {
        "game_pid": "b84zvy",
        "story_name": "House of Reiley!",
        "post_title": "#Who dares play *The House of Reiley?*\nThe most tyrannical game show in the Universe…\nThe product of a media company with deep pockets and shallow ethics, The House Of Reiley attracts contestants across space - and time.  Sometimes desperate, sometimes seeking fame at any cost - always pitted against a pitiless host.\nThe prize - do well, and you could be living the life of Reiley!  A huge cash prize, the chance of other sponsorships or media deals: or at the very least the elimination of your money worries or even a pardon from a criminal sentence.\nBut the chance of the prize comes at a price. Maybe humiliation, maybe facing terrible fears. And never really being sure how far it would go - could you be in real danger?\nJust how far will the desperate go to win?\nAnd just how far will the sinister host go to entertain his degenerate audience?\n\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2023-10-09 18:40:34 UTC",
        "comment": "####Phesteh\n\n-----------------------\n\n\n\n##The House of Reiley - Hotel\n\nThe production company behind The House of Reiley certainly knew how to look after their contestants - like the valuable assets they were! They were treated like minor royals.\n\nPlush apartment rooms like a top hotel were provided in a complex which by a network of corridors was linked to the filming studio itself.  Food, drink - even wardrobe and makeup.  Everything necessary for both a comfortable stay and appearance on the show.  \n&nbsp;\n&nbsp;\n\nA few of the winning contestants came back this way, too.\n&nbsp;\n&nbsp;\n\n\nThe TVs in the rooms streamed all the various shows of Moriscomb Media, the parent company of *Reiley Mayhem*.\n&nbsp;\n\nIn the run up their appearance on the show, Phesteh, styled “contract manager” talked them through everything they needed to know.  He was a rather epicene man, who wore rather too much baby oil on his face for a man of his age.\n&nbsp;\nHe gave them a quick reference guide to the rules, whilst advising them that they did not strictly apply.\n&nbsp;&nbsp;\n*“These are the official rules.  They are a good guide to what will happen, but they are only a guide.  You get to pick a room each time - free choice.  One of the studio managers will give help if you need it.  Usually you play alone, but sometimes you are up against another contestant - but I am sure you have seen the format.  On screen it will look like Reiley is with you all the time - the reality is he has a lot to get through, and your appearances will be quickly edited.  We usually do you in batches of three as that is easier, but sometimes we will hook you up with other contestants if that helps with the game narrative.  Don’t take any risks you don’t want to, it's your choice - if you could just sign these disclaimers. If anything bad happens it’s all insured, but you can’t claim more than ten thousand drachmas - more than that and you need to make your own insurance arrangements, okay?\"*\n&nbsp;\n&nbsp;\n&nbsp;\nHe rattled on before they had time to take it all in.\n\n&nbsp;\n&nbsp;\n&nbsp;\n\"*Now I have to tell you about the prize money.  On that side you will be well looked after - I mean, that’s why people come on the show.  It says that you pay a hundred drachmas - provided you play by the rules and see the game through its normal run you don’t have to pay anything, whether you win or not.  If you quit outside of the rules or we have to dismiss you then you will owe that amount.*\"\n\n&nbsp;\n&nbsp;\nDrachmas?\n&nbsp;\n&nbsp;\n\n*\"The drachma is a volatile currency.  Volatile in a good way.  It’s likely to go up - your final prize fund will be very generous.  But should the currency collapse, we have that covered.  Anything past the fifth challenge and you are sure of a small fortune in your local currency.  There will be other deals along the way - you might get sponsorships, or other opportunities.  Under the contract we get a cut of anything that spins off from the show.”*\n\n*\"Here are your Pass cards.  You can use them twice during the competition...\"*\n\n&nbsp;\n&nbsp;\n&nbsp;\n\nOnce that had all been rushed through, they were ushered into the green room, got camera ready, and ushered out into the main studio.  Stage hands were all around, making sure everything and everyone was in the right place at the right time.\n&nbsp;\n\n&nbsp;\n\n&nbsp;"
    },
    {
        "game_pid": "7rg0sm",
        "story_name": "New Start: New Eden",
        "post_title": "*We wandered off like children in the woods*\n*And let the searchers come but never find us*\n*Tried to make a life among the trees*\n*While your dreams collected planes and cars and cities*\n\n*You slipped away from me while I was sleeping*\n*To climb the tallest oak and see the lights*\n*Your dissatisfaction gave you questions*\n*Do you remember what the city sounded like?*\n\n-----------------------------------------\n\nThe characters in this game have started a new life, on an idyllic island.  They are determined to start  afresh, back to nature, in a fruitful jungle.\n\nLife is good.\n\nKey to the story is that the island they move to is an absolute paradise.  However, when the characters sleep, they dream.\n\nAnd when they dream, their heads get filled with memories, aspirations, fears.\n\nGradually, the more they dream, the dreams affect them, and push them towards going to a different life.\n\nThe dreams are subtle, but like an enemy.\n\nSome realise what is happening, others do not.\n\n**Can they keep their community together?**\n\n--------------------\n\nRotating narration is available but you only narrate if you are comfortable with it, and you will be supported if you are new to it.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2020-02-13 13:07:05 UTC",
        "comment": "##Base camp, New Eden\n\nThe group made their way through a range of terrain.  Jungle, woods, bush, and what the map called farmland, which did indeed look fertile and ready for use, and indeed which had various cultivated plants already growing on it.\n\nThere were snags - thickets to cut through, rivers to work around - even a wasp nest to avoid!  However, they made it, at last, to *base camp*.\n\nFelix was delighted with everything about base camp.\n\nIt was of course very basic - almost an anti-climax from the beauty of what they had seen en route. \n\nFlat, even coarse grass with a few tiny shelters. \n\nSierra noted the grass was the sort which would be hard wearing and not grow too long - like an outdoor carpet.\n\nBut it meant it was a blank canvas. They could do what they wanted here. There was enough shelter for everyone to have sufficient privacy in the short term, and in the longer term they could build better homes. Perhaps cabins - maybe even tree houses!\n\nIn all directions there was greenery of different hues - forest, jungle, scrubland. Mountains ranged where they had not explored yet. \n\nFelix spoke to others excitedly about the great waterfall and lake which the website said was nearby. There was still so much to find, he told the others.\n\nThe farm would need a lot of work - but there was already growing yam, arrowroot, potatoes, plus some berries and bananas. June also found a lime tree!\n\nThere would be enough food for some decent carbs, and there were also some bushes of fragrant herbs which would change the taste. \n\nAccording to the blog, many food plants were available nearby - it was a question of foraging in the short term, and cultivating and taking cuttings longer term.\n\nFelix also found a little cache of tools. A couple of saws wrapped in an oiled cloth. But also there were some more rudimentary wood cutting tools, made from bits of stone - like flint tools, though he was not sure it was technically flint. Some had been bound into wooden handles.\n\n“Guys, I think I can see what we need to do here. You see these modern tools? They will help break the back of big cutting jobs. But we should use them sparingly, and maintain them well, so they do not break or become useless. Once a job is started, and it is possible to use these more basic tools, we should use them instead, as they can be replaced. We do the tough work with the best, and then it will be easy to finish with the primitive! It’s a bit like me and my glasses. I am keeping my “real” ones for best - whenever I do anything that may risk them, I will try to use my replacements.”\n\n\n\n---\n\nThey were happy.  There was so much to be hopeful about, and all the signs were that this would really work.\n\nHowever, they had their doubts.  Of course they did.\n\nSome thought about those they had left behind; or worried if everyone would work properly together and do what was best for themselves - and each other.  Maybe they could help steer the society towards having some sort of order.\n\nAs they rested, they reflected on their journey.  The flights from various places to get to the port: then the journey by ship - and at last the covert escape by boat.\n\nAmazingly, they had actually done it!  They realised that now the time was to get to know one another properly, and plan for the future.  Maybe first, they needed to truly understand themselves."
    },
    {
        "game_pid": "bavg91",
        "story_name": "Clawback",
        "post_title": "\n\n\n\n\n##Superhero game.  Distant past.\n\n---\n\nThe orange smoke clears.\n\nThe soothsayer repeats their mantra of old - but this time there are new elements.\n\nThe Elders gather, and discuss its meaning.  Revered scrolls are consulted.\n\n\nAt last a course of action is agreed upon.\n\nA great evil is to cast its shadow across the land.\nCertain *Champions* are the only ones who can defeat it.\n\nUsing ancient magic - the components for which were obtained at great cost - the *Champions* are summoned.\n\nThey are clawed back.\n\n---\n\n##This game is a collaboration between @Nicklien,  @CaptainParty and @Bexja.\n \nAll players will participate in its direction.\n\n\nYou can adopt a known character, or create your own.\n\nWe are not overly obsessed with canon; you may take whatever backstory works for your character.\n\n\nWe will build the game together.\n\n\nIn the story, characters from modern times find themselves summoned back in history.  A prophesy has said they are the only ones who can destroy a great evil.\n\nA challenge for the characters is that they will be received as demi-gods.  Will this poison their egos?\n\n---\n\nMany Storium games slow down after the first couple of scenes.... this game is designed to be 2-3 scenes long, with the opportunity to continue in a sequel for those who wish to...\n\n\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2022-01-22 16:46:12 UTC",
        "comment": "The orange smoke cleared.\n\nThe soothsayer repeated their mantra.\n\nThey had gathered, once more, to *meet minds*.  To combine the consciousness of their most gifted.\n\nTo one was given words.  To another visions.  Another yet, feelings.\n\nThe Soothsayer took all, and worked it into a message.\n\n*Shadows deepen.  Shadows dark.*\n*The end of what we know.*\n*Terror that may not be matched, except by some*\n*To be born in the time of the fourth magma surge *\n*Where The Valley Star looks down*\n*Where Kings lay their heads*\n*As the great Orb makes its seventh approach*\n*The terror that comes makes way the path*\n*For its own destruction*\n*Make haste, bring the ones*\n*Down the path, who may end the suffering*.\n\n\nThe one known as the Onyx spoke, after carefully scratching the words onto a bark.\n\n\"The message has changed again!  Before it was only one who could save - one who must be brought - but now it is *some*.  Now the *ones* must be brought!\"\n\nThe one known as the Keeper cut in.\n\"But now the message gives more as to when they will be born!  Interpret, please!  Name the date and the place.\"\n\nThe *one who had walked the deserts* spoke, his voice cracked in earnestness and frustration.\n\n\"I have camels ready! Only tell me where I must go!  It is destiny - I must only find the spot, and I can lead them to where they must be!\"\n\n*She of calms* shook her head in confused despair.\n\n\"This journey is not one that camels may make!  The magma surge - now there is reference, to the Valley of Kings.  That would be...\"\n\nShe shook her head again at the impossibility.\n\n\"The *message* must be wrong!  Surely we mis-interpret - or there is still more to come.  We must meet to hear it again, there must yet be more.  The timing, it makes no sense.\"\n\n*Dragonblood* spoke firmly but calmly.\n\"The interpretation is sound. By my calculation, the reference to the Orb confirms it.  The seventh approach - that would be around the time of the fourth surge, if the Valley of the Kings reference is correct, and I believe that it is.  But do not despair.\"\n\n\"Don't despair!\" shrieked *The Spice Mage*.  \"But our salvation is to be born ...  many generations into the future!  Other prophesies have the day of our doom as very soon!  How can those born in the future aid us!\"\n\n\"But look,\" urged *Dragonblood*, \"It also says\n*The terror that comes makes way the path*\n*For its own destruction*\nThe messages have never led us astray before.\nThere are other prophesies of Champions coming from another time.  They may be born in the future, but still come to our aid.\"\n\n\"It is hopeless,\" *Golden Oyster* insisted.\n\"Our power is not that strong.  Not in our lifetimes has *time* been manipulated!  And I believe the stories of such thing are just myth - tricks by our forefathers by those hungry for power!\"\n\n\"Not myth!\" insisted *Dragonblood*, his level temper for once showing signs of cracking.\n\"It is a power forgotten, but not beyond us.  The scrolls show the way.  Yes, it is beyond our reach now - but the shadows will open the way!  The shadows have links to the future.  By coming here, they will open the way.  *We* may tap into *their* power and use it against them - to bring the heroes who will save us!  Why would the messages come, if they do not bring us hope?\"\n\n\"Well then, we must read the scrolls,\" said *The one who runs with the river*. \n\"Read the scrolls, and find the way.  Time may be manipulated, as you say - but still it marches!\"\n\n---\n\nThe Champions spoken of in the message were blissfully unaware of their pivotal role in the past - of the great quest they must serve.\n\nInstead, they got on with their daily lives, thinking only of the cares of their present day...."
    },
    {
        "game_pid": "p58v2q",
        "story_name": "Third Wish.",
        "post_title": "There is no such thing as a free wish.\n\nWhen you make a wish, you always get burned.  Or cheated.  Or it just does not work out the way you expect.\n\nBut what happens to those who get cheated out of their wishes?\n\nSome just go away.  But some brood. Some get bitter.\n\nAnd some get organised.\n\nThere is a secret society, made up of those who have lost out, through unwise wish-making or dishonest delivery.  \n\nThey share their experiences, try to learn and grow from them.\n\nOne day they will make their chance come round again.  They will be granted 3 wishes.   And they will be ready.  They will have water-tight wishes, that get them what they want, and get even for the past...",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2023-04-24 17:06:08 UTC",
        "comment": "*It was a cold winter's night in London, and the city was alive with the sound of hopes and dreams. Amidst the hustle and bustle of the streets, there were many who were wishing for a better life. Some yearned for wealth and prosperity, while others craved love and companionship. But alas, not all wishes come true.*\n\n*In a dimly lit corner of the city, there sat a man named Edward. He was a simple man, with simple desires. All he wanted was a warm meal and a place to lay his head at night. But despite his best efforts, he had never been able to make ends meet. As he trudged through the streets, his stomach growling with hunger, he couldn't help but feel like the world was against him.*\n\n*And then there was Mary. She had always dreamed of finding her soulmate, a man who would cherish her and love her for who she was. But despite her many attempts at love, she had been met with disappointment and heartbreak at every turn. She was beginning to lose hope that she would ever find true love.*\n\n*As the night wore on, Edward and Mary found themselves walking along the same path. They didn't know each other, but there was a sense of camaraderie between them. They were both people who had been let down by life, and they found solace in each other's company.*\n\n*And then something strange happened. As they walked, they stumbled upon a mysterious figure who offered them each a wish. Edward wished for a warm meal and a place to stay, while Mary wished for a true love that would never leave her side.*\n\n*But as the night wore on, they both realized that their wishes had been in vain. Edward's warm meal turned out to be cold, and his place to stay was infested with rats. And Mary's true love turned out to be nothing more than a passing fancy.*\n\n*As they sat together, cold and hungry and alone, they realized that sometimes the things we wish for are not the things we truly need.*\n\n*It was a story that repeated many times, throughout human history.*\n\n*But, sometimes, fools had trusted in magical beings to fulfil their wishes.  Seldom did this end well.*\n\n*Most, if they lived to regret their decision at all, saw themselves as fighting a power that would always be greater than them.*\n\nBut one man refused to accept this fate...\n\n\n----\n\n\n#“Burned by the things you wish for?”\n\n\n\n----\n\nSo read the eye-catching headline of a blog that circulated throughout the vast expanse of the internet. The alluring title captured the attention of many, and soon, small ads began appearing in newspapers across the world, drawing readers to its pages. Some were drawn in by the mere mention of it, while others took a chance and delved deeper into its contents, seeking the secrets it held.\n\nThe topics covered by the blog were both ordinary and fantastical, enough to pique the interest of those who stumbled upon it. But for a select few, the words carried a weight that only they could comprehend. They felt as if they had finally found someone who understood their plight, and the prospect of gaining justice against the elusive creatures that held their fate in their hands.\n\nUnder the name Candent, a figure reached out to these individuals, offering them the chance to band together and achieve retribution for their unfulfilled desires. They exchanged electronic and postal messages, building a camaraderie and trust among themselves until just a mere few received an invitation to gather at an address in Old Hill, Chislehurst, London, England.\n\nOf the few, only a couple dared to arrive at the appointed hour.\n\n\"Candent\" was not disappointed by the no-shows, but more delighted that he had found a pair who truly had the courage to follow through.\n\nBut little did they know, the path they had chosen would be fraught with danger, and the consequences of their actions could prove to be disastrous."
    },
    {
        "game_pid": "6srscz",
        "story_name": "Retaking Elf Mountain",
        "post_title": "Twenty years ago Elf Mountain was taken.\n\nNow it is time to take it back.\n\nIt was home to the purebred Sanate elves, and also their cousins, Mākai elves, commonly known as wood elves.\n\nWithin its heart was the Jinta crystal - huge, running the depth of the mountain, solid on the outside but vibrant with liquid magma coursing through it.\n\nWhile the Sanate elves attended it, it provided the natural energy for crops, creatures and peoples in the surrounding lands to do well and prosper.\n\nThen the Garginoids invaded.  Times before they had been repelled, but this time they were organised and determined.  They seized the mountain, and forced most of the elves out.\nThey thought they could control the Jinta.\n\nThey could stifle it - but they could not fully control it.\n\nThe Sanate elves turned to stone as the Garginoids corrupted its power.\n\nThe Mākai elves, however, were able to escape and make homes elsewhere.\n\nAll over the land, crop yields were high, and deaths from disease increased.  The sky just seemed a little greyer.\n\nThe Garginoids also suffered.  They became unable to reproduce, and struggled to obtain enough food.  Of course, they terrorised nearby villages for resources.\n\nThe average life span of a Garginoid is fifty years.  So, now, twenty years later, it is reckoned safe to return.  The elves have built themselves up and acquired some new friends.  The Garginoids they calculate are now of reduced numbers, and advanced age…\n\nA plot was hatched.  Brave souls set out on the dangerous journey to approach the mountain.\n\nMany fell in their efforts.  However, a bold scout made good progress through some of the treacherous towns of men, finding that where once there was harmony and justice, now there was suspicion and fear.  Hard, even wicked rulers have replaced benign ones; and cruel creatures have moved into the region...\n\nWe now join that scout, as he makes the best alliance he can, to complete his quest...\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2020-01-19 15:48:56 UTC",
        "comment": "Our tale begins in a homely, comfortable tavern, with a fire flickering in the grate.\n\nThis is very good fortune.\n\nHad you joined us several days ago, you would have seen a dwarf, an elf and a halfling in a most unhappy state - trapped beneath their own upturned waggon, sealed in by the silk of a giant spider, and about to be consumed by her hatchlings.\n\nOn that occasion, however, all had not been lost, as it might have first appeared.  By good fortune, a party of halflings and goblins happened along, and saved our friends from a most unpleasant fate.\n\nIt may surprise you to learn that halflings and goblins were associated together.  But these were fallen times.  Elf Mountain was in the hands of the Garginoids - thuggish, unpleasant creatures.  As a result, the Jinta crystal - the true power behind the mountain, and indeed the land - was stifled, unable to radiate its goodness.\n\nThis led to failure of crops, hardening of hearts, and cooling of friendships.\n\nFrom a time of plenty and harmony, the land descended into want and suffering.\n\nAnd so it happened that halflings had to up and leave their homes, and in their hunger and desperation even goblins would work with such, if it meant they could defend a trading operation so as to eek out a living.\n\nIt came to pass therefore that an unlikley grouping of creatures stood by the side of the road leading past Gemchester.\n\nPeriwick - the halfling lead negotiator in a trading partnership with Haldon Blacktoes and a number of other halflings and goblins, forced into an alliance of convenience by their need to survive.\n\nZolon -  a rather disheveled looking Halfling, but secretly a Scout in a mission to retake Elf Mountain.\n\nYotmuck the dwarf - a most ignoble example of his race, worrying currently about the contents of his spoiled waggon\n\nZentha, a most unorganised example of an elven scout.\n\nZolon knew he was at rock bottom.  He had been hurt, and needed treatment.  He knew that even yet, he may not survive.\n\nWith nothing less to lose, he was open about his plans.\n\nThe others there saw it was not a good plan.  But it was a plan where few others exisited; and would represent at least an attempt to deal with an evil could not be left unchecked any longer.\n\nIt was now, or never.\n\nThey were a most unlikely, rag tag bunch. And yet, it dawned upon them, that amongst this assembly was likely to be the core of an attack on Elf Mountain. An attempt to take it back. There was little chance of success. But failure was not an option, and there was unlikely to be a Plan B any time soon.\n\n\nPeriwick had looked at the others and said,\n\n“This is no place to talk. Up this road towards Lime Pass - keep walking about five hours and you will happen upon a tavern. It’s called The Good Frog - a strange name in these times but it is safe.\n\nTake a room there. Give me a day. I will be there in due course, with as many as I can muster, and a means of transport. We will complete the journey. Together.”\n\nYotmuck stepped forward.\n\n“He will not walk. I have not salvaged much from my waggon, but what I have I will trade to fund a carridge or ponies. I will travel with him to the tavern. We will wait for you. I trust you will come good, Periwick.”\n\nYotmuck had helped Zolon to The Good Frog.\n\nPeriwick had made discrete enquiries of others in Gemchester, to see who might be persuaded to join them.\n\n\nAnd, as I started by saying, we find one another in a good tavern, as new allies assemble.\n\nZolon had slept there for several days, as strong medicine helped him heal.\n\nWhen at last he was fully back on his feet, he headed down to the dining area where there was food, and, perhaps more importantly, the assembled group who had elected to join him on his quest."
    },
    {
        "game_pid": "2bf8vv",
        "story_name": "The Emperor's Cast-offs",
        "post_title": "####Comedy\n\n*This game is presented as a chance for people new to Storium to get to grips with things and ask questions, as they find their way to additional games.  You might see this to the end, or it would be acceptable to leave once you are established.*\nI will have less internet access for the coming week - I will respond to you, but my typing may be erratic and short as I am using a portable device.\n\n---\nSo now we are all in trouble.\n\nThe Emperor had new clothes.  Take the old ones to the incinerator, he said.  Such sad rags should not be associated with me.\n\nSo his footman did take them down to the incinerator.\n\nExcept at the incinerator, they said that would be a waste.  Take them to the Royal Housekeeper to make them into blankets for the widows and orphans of the city.\n\nSo the incinerator sweeper did just that and went to the Housekeepers assistant.\n\nBut the Housekeeper's assistant had a better idea.  Those clothes would not make good blankets, and they are worth more intact.  So sell them, and the money can be used to buy more, better things for the poor.\n\nSo they were taken to the Mistress of the Robes, who sold them to a supplier for a bag of gold.\n\nThat supplier sold them on to another merchant, who took them out of town, seeking a great price from the nobility.\n\nNow the Emperor has nothing to wear for the banquet tonight.  So he has sent his messenger to the incinerator, charged with being sure to run and get there before it is too late.  On pain of death.\n\nAs I say, now we are all in trouble.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2021-11-05 17:14:56 UTC",
        "comment": "###Royal City of Heartvale\n\nIt was busy in Heartvale.  \n\nOf course, it always was.  The home of the Emperor, a centre of commerce and diplomacy, a cultural hub - not to mention the focal point of many a trade route.\n\nBut today was special.  A *huge* royal banquet was happening tonight.  There were many visitors - the great and the good from this kingdom and many others besides.\n\nFor all his power and influence, it was an important evening for the Emperor.  A chance for him to show how great and strong and wise he was.  Anything that might challenge the pecking order...that might suggest his grip was failing...this could not be left to chance.  Peace and prosperity was dependent upon the Emperor commanding the respect and confidence of all.\n\nBut there was another buzz starting to grow in the city.  People whispering, one to another.  Shock.  Giggles.  Shaking heads from those who could not, would not believe the stories that were circulating....\n\n\n---\n\n\n###Jennifer Trimm, the Mistress of the Robes, \nwas starting to hear some of those strange stories - just fragments, but she was determined to get to the bottom of them.  \n\nAt first, because she was simply intrigued.\n\nBut then, because she stared to get the uneasy feeling it might affect her...\n\nFor her afternoon break, she had wandered into one of the fancy tea-rooms just near the Palace.  A good place to socialise with the very best in society - and enjoy some excellent cake, and of course the finest tea the town had to offer.\n\nIn whispered conversations, there was cheeky talk ... talk that seemed to involve the Emperor.  Seemed to involve his clothes.  As Mistress of the Robes, that was very close to home ... and she had sold off a bundle of his clothes this very lunchtime ... She had understood that he had purchased some new garments from those merchants who had been to see him.  She had tried to block it, herself, she did not trust him; but you do not argue with the Emperor.  Now what was all this idle talk about his clothes.... and she was in it deep for having sold some of them?\n\n\n---\n\n###Lukas Pal, Royal Messenger.\n\nHe was fast.  That was his job.  But today, he was faster than ever - propelled in no small part by the mighty gust of the (naked, as it happened - but rude to notice) Emperor's yells.  And, indeed, the royal foot.\n\n***\"My clothes! They have gone to the incinerator!  Catch them before they are burned!\"***\n\nHe hesitated, understandably confused.\n\n***“Messenger, go get my clothes back. Or die.”***\n\nSo he scrambled down the corridor, down the stairs, past the butler, pretty much through the footman (and was now wearing some Royal roast dinner)...to the incinerator. \n\nFrantically, he had started pulling things from the flames, and great cost to his fringe and eyebrows, before the incinerator sweeper had managed to get out of him what the problem was.\n\n----\n\n###Anna O'Donnell,  incinerator sweeper \n\n\"Oh no, those clothes were not burned.  They were taken to the housekeeper's assistant, to turn into blankets for the local poor.  Come, I will show you.\"\n\nAnna was duly propelled along by the frantic messenger, passing through a great barrow of leaves and various other refuse that was being wheeled in.\n\n\n---\n\n###Kyle Ackleson, Housekeeper's assistant.\nKyle was surprised to see the messenger and Anna bursting in.  And perturbed that Anna was after the clothes back.  He had thought it was settled that they were surplus to requirements.\n\nGood news - they had not been cut up.\n\nBad news - they were not here, either.\n\n\n---\n\n\n###Walter Lackey, Merchant.\n\nMeanwhile, a merchant stood near the city gates, by the coach-house.\n\nHis plan had been to travel out of town, to find the best possible price for his...latest acquisition.\n\nBut now, that did not seem such a great idea.\n\nFirst of all, there were so many wealthy merchants - and, indeed, fine people from far and wide - pouring through the city gates, he was sure he could make a good profit right here.\n\nBesides that, it was difficult to conceal the sheer opulence of the clothes he had bundled up.  That was getting him some rather...unwanted attention.  He had not really thought the security issue through.  Maybe a quick sale would be wise - before they were taken from him by some gang of ruffians..."
    },
    {
        "game_pid": "3pf5ax",
        "story_name": "The Emperor's Cast-offs. ",
        "post_title": "####Comedy / Panto\n\n*This game is presented as a chance for people new to Storium to get to grips with things and ask questions, as they find their way to additional games.  You might see this to the end, or it would be acceptable to leave once you are established.*\n\nYou have the chance - but not the obligation - to have a go at narrating, as well.\n\nAs with all my games, this is fully inclusive.\n\n---\n\n###So now we are all in trouble.\n\nThe Emperor had new clothes.  Take the old ones to the incinerator, he said.  Such sad rags should not be associated with me.\n\nSo his *footman* did take them down to the incinerator.\n\nExcept at the incinerator, they said that would be a waste.  Take them to the **Royal Housekeeper** to make them into blankets for the widows and orphans of the city.\n\nSo the **incinerator sweeper** did just that and went to the **Housekeepers assistant**.\n\nBut the Housekeeper's assistant had a better idea.  Those clothes would not make good blankets, and they are worth more intact.  So sell them, and the money can be used to buy more, better things for the poor.\n\nSo they were taken to the **Master of the Robes**, who passed them to the **Footwoman**, with instructions to get a good price for them.  She sold them to a merchant for a bag of gold.\n\nThat merchant took them out of town, seeking a great price from the nobility.\n\nNow the Emperor has nothing to wear for the banquet tonight.  So he has sent his **messenger** to the incinerator, charged with being sure to run and get there before it is too late.  On pain of death.\n\nAs I say, now we are all in trouble.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2023-01-10 13:34:09 UTC",
        "comment": "###Royal City of Heartvale\n\nIt was busy in Heartvale.\n\nOf course, it always was. The home of the Emperor, a centre of commerce and diplomacy, a cultural hub - not to mention the focal point of many a trade route.\n\nBut today was special. A *huge* royal banquet was happening tonight. There were many visitors - the great and the good from this kingdom and many others besides.\n\nFor all his power and influence, it was an important evening for the Emperor. A chance for him to show how great and strong and wise he was. Anything that might challenge the pecking order…that might suggest his grip was failing…this could not be left to chance. Peace and prosperity was dependent upon the Emperor commanding the respect and confidence of all.\n\nBut there was another buzz starting to grow in the city. People whispering, one to another. Shock. Giggles. Shaking heads from those who could not, would not believe the stories that were circulating….\n\n\n---\n\n###Royal Messenger.\n\nHe was fast. That was his job. But today, he was faster than ever - propelled in no small part by the mighty gust of the (naked, as it happened - but rude to notice) Emperor’s yells. And, indeed, the royal foot.\n\n***“My clothes! They have gone to the incinerator! Catch them before they are burned!”***\n\nHe hesitated, understandably confused.\n\n***“Messenger, go get my clothes back. Or die.”***\n\nSo he scrambled down the corridor, down the stairs, past the butler, pretty much through the footman (and was now wearing some Royal roast dinner)…to the incinerator.\n\nFrantically, he had started pulling things from the flames, and great cost to his fringe and eyebrows, before the incinerator sweeper had managed to get out of him what the problem was.\n\n---\n\n###Jabber, Incinerator sweeper\n\n“Oh no, those clothes were not burned. They were taken to the housekeeper’s assistant, to turn into blankets for the local poor. Come, I will show you.”\n\nJabber was duly propelled along by the frantic messenger, passing through a great barrow of leaves and various other refuse that was being wheeled in.\n\n---\n\n###Ines, Housekeeper’s assistant.\n\nInes was surprised to see the messenger and Jabber bursting in. And perturbed that Jabber was after the clothes back. She had thought it was settled that they were surplus to requirements.\n\nGood news - they had not been cut up.\n\nBad news - they were not here, either.\n\n\nInes has taken them to Rupert, the Master of the Robes, thinking he would know how to sell them, get a good price, and use that to relive the needy in their poverty.\n\n---\n\n###Rupert, the Master of the Robes,\nwas starting to hear some strange stories - just fragments, but he was determined to get to the bottom of them.\n\nAt first, because he was simply intrigued.\n\nBut then, because he stared to get the uneasy feeling it might affect him…\n\nFor his afternoon break, he had wandered into one of the fancy tea-rooms just near the Palace. A good place to socialise with the very best in society - and enjoy some excellent cake, and of course the finest tea the town had to offer.\n\nIn whispered conversations, there was cheeky talk … talk that seemed to involve the Emperor. Seemed to involve his clothes. As Master of the Robes, that was very close to home … and he had sent the *footwoman* off a bundle of his clothes this very lunchtime … with instructions to sell them for the best possible price, giving her the names of some good contacts... oh, dear!\n\n\nHe had understood that the Emperor had purchased some new garments from those merchants who had been to see him. Rupert had tried to block it, himself -  he did not trust them; but you do not argue with the Emperor.\n\nNow what was all this idle talk about his clothes…. and Rupert was in it deep for having approved the sale of them?\n\n---\n\n###Ida, Footwoman.\n\nShe had only been following orders.  The Master of the Robes had given her a great bundle of clothes and a list of merchants who knew good threads when they saw them ... she was charged with getting as much gold as possible.  And she had.  She had a big bag of gold.  But ... you can not wear gold coins.  And you can not buy clothes fit for an Emperor just like that, even with a fortune in readies..."
    },
    {
        "game_pid": "5wk0xa",
        "story_name": "Frostvale Rifts",
        "post_title": "Long ago, a great war was won by the Alliance of the North against an uprising of wizards.  Peace reigned in the Seven Kingdoms for many years. \n\nThen, the destruction - nay, theft - of the remote town of Frostvale was an ominous sign that the Dark Wizards threatened a return. An unlikely bunch of stalwart heroes responded to the call of Derlin, the then Prince on the Dragon Throne, to uncover the truth behind the destruction and stop the culprits.  Their quest took them into a magical realm and into adventures they could never have imagined.  They returned victorious - restoring Frostvale to its rightful place, and returning with the Wizards to be held account for their deeds.\n\nPeace now seemed assured, with the magical realm destroyed and the Wizards no longer plotting revenge.  Frostvale was a thriving market town once again.  \n\nHowever, not all is calm.  Besides the cut-and thrust of petty rivalries, monsters and magical anomalies began to emerge, and in recent months became more frequent.   Could it be that the magic which once threatened the peace is not entirely consigned to the past?\n\n-------------------------------\n\nThis is a classic fantasy setting (dwarves, elves, wizards and paladins included) -  it is an open world sandbox.\n\nYou are encouraged to write your own cards and to add moves without cards.\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2024-01-16 17:59:08 UTC",
        "comment": "#Frostvale\n##Introduction\n\n---\n\n*Usually, the pictures I use are very intentional and meant to be taken literally.  A little detail just might mean to be there!*\n\n*That's not quite the case with this opening picture.  I do not intend to tie us down to an actual map of Frostvale.  The relative position between places might be important here and there, but on the whole not.*\n\n*The picture above is meant to give an impression, not to be an accurate representation of anything.  (By the way, click on it, and you will see it in full).*\n\n*It's actually 2 images. In the background is an impression of what Frostvale town looks like.  Indeed, in as much as you can make anything out from the banner pic, I always imagine you can see bits of Frostvale, poking out of the trees.*\n\n*In the foreground is a rough map of main walkways.  You see small boats come in on one side - they will be on the other side, too, and it looks like there are some round at the south.  There is a long walkway in the middle, with lots going off, actually, **up**.*\n\n*As I say, it is not a map, and can only begin to give you a picture of what it is like to be in Frostvale.  Take that, and overlay it with a written description....*\n\n---\n\n---\n\nLong ago, Frostvale was a castle.  Defending who from what is not clear, but they built it well.  Four tall towers gave a good view and made an impression on they eye.  Those towers, and most of the walls, were still there.\n\nSo it is, that Frostvale could be seen more as one huge building than a town, though a town it surely is.  The great walls and what would have been battlements now held shops on many levels, as did the towers.  The centre was open, allowing daylight to come into the central part, but every available space had been utilised in some way.\n\nFor as long as can be remembered, its location was important because it offered a resting point on a long waterway (part river, part canal) that linked two very important river networks which were vital to transport and trade.  A series of locks allowed boats to move freely in either direction.  The waterway was wide and deep.  You would have been hard pressed to get a full ship along it (though it had been known, apparently!) but certainly some pretty big boats.  Most however were barge-type vessels loaded with goods; and a few fishers.\n\nRoutes south were not great, but used by some for continuing or joining journeys.  \n\nNorth, there were the mountains.  Huge, and virtually uncrossable.  Nothing much of value was known to be there, though who knows.  There are some dangers in the form of creatures, deep in the mountains, but it was the terrain and climate that posed the greatest risk.  Besides, there was nothing worth crossing them for.  Probably another Kingdom, if you went far enough - though it would be easier by far to go by land and sea another way.  A nation of Kobolds was most likely that way - but much too far to be worth thinking about.\n\nRoundabout, there were a few little hamlets and settlements eking out a living.  Some might supply eggs and other crops to the town.\n\nJust near the town, to either side, are the remains of trading centres that sprang up during the period of Frostvale's ... absence.  They were redundant now, though some continued to live there, and carry on some sort of trade.\n\nBut, those things apart, there was very little sign of other life for a long way in any direction. There were mountains, forests, planes, and the waterway, with the dramatic Falls.  (There was also  a strange building jutting out of the cliff, which was once a church, and was now a prison).\n\nI talked about the *absence* of Frostvale.  Some few years back, the place disappeared.  Totally - leaving just a strange, mighty, black crater where it once stood.\n\nIt had been taken, wholesale, into another dimension.  And through no small effort by a heroic few, in due course, returned.  You might think there would be some physical evidence of its movement.\n\nActually, there was very little.  Frostvale did not go anywhere, physically.  It did not bump or scrape.   While it was gone, some moss, stone, mud and water egressed into the space it once held in this dimension, and when it returned, that was pushed out, with some residual marking.  When it was first taken, a strange black fire appeared to consume it, though this was not so much burning it up as taking it away.  If you knew where to look, you might see little cracks or marks or darkening here or there, but then again, it could just be your imagination...\n\n\nSo let us talk about Frostvale...\n\n---"
    }
]