[
    {
        "game_pid": "0ak72q",
        "story_name": "Crux",
        "post_title": "47 years ago, a wormhole connecting the Milky Way with the Sunflower Galaxy (also known as M63) appeared. Mankind launched a swift and succesful colonization effort, aided in large part by the discovery of two garden planets (Baressia and Arta) within M63.\n\n10 years ago, the wormhole mysteriously disappeared. The hundreds of millions of people residing in colonized M63 were left with no way to contact those in the Milky Way. Though FTL technology had been making steady advancements, it would still take centuries to traverse the distance between the two galaxies.\n\nThe loss of the wormhole, while damaging, was not debilitating to the humans of M63. They’d had ample time to colonize and establish themselves. While some effort was put forth to reestablish communications with the Milky Way, something of greater importance dictated that attention be focused elsewhere.\n\nFour years after the wormhole vanished, humans in M63 made first contact with another sentient species. Contact was made in the form of an attack. The enemy, possessing ships faster and stronger than anything humanity had at its disposal, assaulted a mining platform and several ships nearby. When those dispatched in response to the initial distress call arrived, there was no sign of a battle, no sign of the human vessels *or* the enemy. There was no sign of *anything*.\n\nThis enemy, named the Conflux, began to attack with increasing frequency and alarming efficiency. More ships were lost. More lives were lost, too, all of them without a trace. It was impossible to trace the Conflux back to their point of origin—they were simply too fast. They also had an ability to manipulate temporary wormholes which allowed them to \"jump\" swiftly away if the battle turned against them. As the months passed, it became increasingly apparent that humanity's future in M63 was being severely threatened. For reasons unknown the Conflux had started this war, and it appeared they were going to win it.\n\nThe joint military-security firm known as Sisyphus Armed Forces (SAF) began construction on prototype warships in direct response to the Conflux threat. These prototypes were the Aegis class (named for the ancient Greek word that can mean \"shield\") and the Kopis class (for the ancient Greek term that means \"to cut\" or \"to strike\"). The two were designed to work together in combat. The Aegis, heavily armored, was meant to act as a distraction and was capable of soaking massive amounts of enemy firepower, which allowed the heavily armed Kopis an opportunity to fly directly into enemy ranks and launch an assault. In their first battle against the Conflux, the prototype Aegis and Kopis performed well. So very well, in fact, that SAF began scheduled them for mass production.\n\nA fleet of Aegis-Kopis teams was gradually assembled and sent throughout M63. The tide of the war slowly turned in humanity's favor, but it was clear a complete victory would be impossible until it could be discovered where exactly the Conflux were coming from. Even with the efficient tactics of the Aegis-Kopis warships, there was no current way to track the Conflux to their point of origin. \n\nAnd so it has become a stalemate, with both sides winning some and losing some. No matter how well the new warships have handled the Conflux threat, the enemy is still as unpredictable and deadly as they ever were.\n\nWhich is something you're about to learn for yourself. \n\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-06-23 06:12:05 UTC",
        "comment": "It's a popular misconception that battles conducted in space are noisy. They're not. Proof of this is evident when observing the crew of the *SAF Balmung*. The assault they're mounting takes place in relative silence. The soft roar of the plasma cannons and the muted staccato of the rail guns are of course audible. So too is the faint hiss of the point defense lasers that activate should an enemy fighter get too close. To the crew, these sounds are just background noise. The combat deck of the *Balmung* is quiet to the point of eeriness during battle, with only the crew speaking (if necessary) or the sounding of the ship's warning claxons (should things take an unfortunate turn). *\"Balmung, this is the* Svalinn. *We're in position. Initiate attack when ready.\"* The announcement comes over the secured comm channel shared by the *Balmung* and the *Svalinn*. The *Svalinn*, an Aegis class warship, is named for the legendary shield in Norse mythology which stood before the sun. The ship is about to live up to its namesake by diverting the attention of the Conflux fighters and becoming the sole focus of their weapon's fire. \"Acknowledged, *Svalinn*.\" The voice of the *Balmung*'s commander, Maeve Nickelsen, blares over the comm. The commander is currently stationed in the flight deck, beside Chief Helmsman Molly Li. \"Paris, Helmsman Litake us in.\" Nickelsen, a tall, sturdily built woman, speaks with the easy authority of someone who's held a command position for a long time. The truth of the matter is that this is only the *Balmung*'s third skirmish and that her crew members are still relative strangers to each other. Still, when their commander speaks they listen. The *Balmung*'s stealth system is engaged and it begins to move away from the *Svalinn*. There is a taut silence on the combat deck as the small warship cuts around its Aegis class counterpart and heads directly for the enemy fighters. The fingers on Nickelsen's right hand start drumming rapidly against her thigh. It's the only outward sign of her nervousness. She glances to her right where a man stands silently, dressed in combat fatigues and carrying a military issue pulse rifle. This is Master Sergeant Simon Kennex, a SAF marine and the newest addition to the crew. In Nickelsen's opinion, he's also an entirely unnecessary addition. SAF felt it best to provide some protection for its Aegis and Kopis crews should the worst happen and they are boarded by the enemy. In Nickelsen's opinion, if the *Balmung* is ever boarded by the Conflux there won't be a goddamn thing Kennex can do to prevent the worst from happening. SAF has also begun encouraging its warships to disable and board enemy vessels for the purpose of taking some of the Conflux alive. Nickelsen, having had the great misfortune of personally seeing a Conflux up close, has inwardly decided that she will never subject her crew to that most horrific of experiences. \"Two Conflux Leaners on sensors,\" says Crewman Kennedy from where she's standing at one of the consoles lining the walls of the combat deck. Everyone relaxes a little. \"Leaners\", so named because of their bizarre appearance that makes it seem as though they are always leaning to one side, are the smallest of the enemy's fighting vessels and are relatively easy to dispatch. \"This is it,\" Commander Nickelsen says to her crew. \"I want them both destroyed. Engage.\""
    },
    {
        "game_pid": "pfjxv2",
        "story_name": "Alien vs. Predator: Schism ",
        "post_title": "The *Magellanic Queen* is to transport cruisers what the *Titanic* was to passenger liners. It's massive. It's a marvel of modern engineering. It's luxurious. It's the ship that everyone who's anyone wants to be on. \n\nThe *Magellanic Queen* is also unique in one very special way. The upper hold is meant for the travelers: the rich elite, the middle class who couldn't *really* afford this trip, and the poor average Joes who won their tickets through one of the many intergalactic contests.\n\nThe lower hold, however ... that's the part that's interesting. \n\nIt's meant to store cargo. Any kind of cargo. For the *Magellanic Queen's* maiden voyage, that cargo is livestock. Not just any livestock, though. These creatures are owned by the interstellar corporate giant, Weyland-Yutani.\n\nThe upper and lower holds aren't meant to mix. The passengers of this marvelous cruise ship don't know that beneath them are large, noisy, lumbering herbivores. They aren't meant to know. As far as they're concerned, the *Magellanic Queen* is an instrument of their leisure. As far as Weyland-Yutani is concerned, the *Magellanic Queen* is a cheap and convenient way to get the livestock to one of its fledgling colonies. \n\nWhat nobody knows is that the livestock is infected.\n\nWhat nobody knows is that in a matter of a few short hours, something very bad is going to happen in the lower hold. \n\nWhat nobody can even possibly imagine is that when the Big Bad happens and the captain finally puts out a distress call, it's going to catch the attention of something even worse.\n\nWelcome aboard the *Magellanic Queen*. We hope you enjoy your flight.\n\n***\n**NOTE:** This is based off the Aliens Vs. Predator shared universe. Familiarity with the universe isn’t necessary. I’d like this to be a fairly fast-paced game and aside from a regular cast, I’d love to have a few characters appear for a scene or two before meeting a gory end at either the hands of a xenomorph or a Predator.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-05-20 00:56:12 UTC",
        "comment": "The *Monolith*'s observation deck is just as grandiose as the rest of the ship. It's a massive room paneled in fabricated mahogany. The tiled floors are a glossy, reflective black. At the back of the room is a long bar, its polished surface the same color mahogany as the walls. The observation windows themselves rise floor to ceiling, the tops majestically arched. Along the sides are booth tables where those who don't wish to stand can instead sit to enjoy the view. The *Monolith* is currently positioned right alongside the trajectory of a comet known as Olijan 32y7. In anticipation of seeing the comet up close the observation deck is currently crowded and is on the verge of becoming even more so. Olijan 32Y7 is a long period comet, which means it has an orbital period that can range from 200 to one thousand years. The comet has not made an appearance in this part of space in nearly 700 years. This is the reason why so many have come to watch it pass by. The viewers here in the observation deck come from all walks of life. Not all of them are passengers, though a majority are. Many of them are employed on the ship--engineers, casino workers, cooks, and housemaids. For this event, some of them have been granted special permission to attend the viewing. Those that haven't gotten permission have found a way to be here nonetheless. Synthetic waiters, garbed impeccably in black evening tailcoats and trousers, are wandering throughout the room, smiling at people and offering flutes of expensive (and for this occasion, complimentary) flutes of champagne from the trays they carry. The three bartenders at the bar are busy, as well--there's a demand for the harder kind of booze as well, though those that want it have to pay for it. Minutes pass. The dull roar of many conversations fill the room. Those that are sociable are mingling with those they find interesting, attractive, or are unable to avoid. Those who prefer solitude and quiet have taken up positions that keep them well out of the crowd. When those nearest the observation windows begin to raise their voices in awed appreciation, the crowd surges forward. There is Olijan 32Y7. The nucleus of the comet, with its low albedo, is overlooked in favor of what follows immediately after it. The coma of Olijan 32y7 is a magnificent sight to behold, a massive stream of dust and H20 illuminated by this system's sun. It shines several different shades of blue and violet, the colors scintillating as the comet tumbles into better view of all those standing in the observation deck. After the coma are the tails, one each for dust and gas, both long and glowing white. Olijan 32Y7 is massive. The *Monolith* is situated at a distance far enough away to allow for viewing optimization. Such is the size of the comet, however, that even after several minutes the coma and the tail are still filling the observation windows. Some people are losing interest as time passes; such is the nature of most humans that appreciation in general tends to be short and fleeting. Conversations starts back up. Alcohol begins to flow a little more freely. What better setting for a pleasurable evening than with the backdrop of the beautiful, ethereal tail of the comet as it wheels through space? This is the perfect time for everyone present to mingle, cut loose, and generally revel in being alive."
    },
    {
        "game_pid": "e3npd3",
        "story_name": "Iobates ",
        "post_title": "47 years ago, a wormhole connecting the Milky Way with the Sunflower Galaxy (also known as M63) appeared. Mankind launched a swift and succesful colonization effort, aided in large part by the discovery of two garden planets (Baressia and Arta) within M63. \n\n10 years ago, the wormhole mysteriously disappeared. The hundreds of millions of people residing in colonized M63 were left with no way to contact those in the Milky Way. Though FTL technology had been making steady advancements, it would still take centuries to traverse the distance between the two galaxies. \n\nThe loss of the wormhole, while damaging, was not debilitating to the humans of M63. They'd had ample time to colonize and establish themselves. While some effort was put forth to reestablish communications with the Milky Way, something of greater importance dictated that attention be focused elsewhere. \n\nSix years ago, the Conflux appeared. It was mankind's first encounter with an alien race. It was also nearly their last. The Conflux posessed technology that was a complete enigma to even the brightest of human minds. When they attacked, they devastated and they left nothing behind once they left. Thousands of humans vanished in the aftermath of Conflux raids.\n\nThe threat was dire. A joint security-military firm known as Sisyphus Armed Forces (SAF) began production on two prototype warships. These ships, known as Aegis and Kopis class, suceeded where no other military vessel could succeed. Their creation turned the tide of the war. Fleets of them were deployed throughout colonized M63 and the instances of humans vanishing dropped significantly. \n\nCurrently, most of the galaxy is still centered on the war with the Conflux. However, for those dwelling on the Iobates spaceport, other problems have arisen. Located in the Proetus system on the very fringes of colonized M63, the port is a hub of activity due mainly to its proximity to several large mining operations. For the same reasons, it's also where many black market transactions take place. Iobates has some security in the form of stationed SAF soldiers and a local authority force, but the port is so vast that even their vigilant patrols can't possibly put an end to all things illegitimate that occur there. \n\nLife on the outskirts of colonized space is risky for a number of reasons. The Conflux are known to strike in systems that are isolated from others, such as Proetus. Encounters with raiders--looking to forcibly take precious resource cargo from mining ships and SAF carries both--is common. Living on Iobates is not for the faint of heart or those that lack a sense of adventure. \n\nAnd now things are about to take a different turn. The Conflux is not the only hostile species out there, as those on Iobates are about to discover. And given how great an enemy the Conflux are, can M63's human population survive another threat of that magnitude?\n\n--\n\n**Narrator’s Notes:** Your character will be stationed on the Iobates spaceport. I’m looking for 5-7 players. I’ve created my own cards, but feel free to create your own as long as they’re relevant to the story’s universe. Only one of each nature is needed, so please look at what’s already been submitted when applying.\n\nThis game shares a universe with another game I'm narrating (link: https://storium.com/game/crux). That game focuses on the war with the Conflux while this one will focus on not only first contact made with another species, but the issues of inhabiting a space port in a solar system rife with raiders. If you’d like a better idea of the history of the universe these games are based on, you can find a reference guide here: https://docs.google.com/document/d/1KJWV8AfC8EWxPtu1P3toEc7dms4fJruVkQySxVWYQ5c/pub\n\nThis game won’t necessarily be moving fast, but it will be steady. If you can’t commit to posting **AT LEAST 1-2 times a week**, this may not be the game for you. Additionally, this game will probably contain strong language, violence, and disturbing imagery, so consider yourselves warned.\n\nCharacter selection and gameplay probably won’t start until next week sometime as I’ll be away most of the weekend. **If you submit a character and don’t hear from me immediately, please be patient. :)** \n\n**NOTE: Some natures have already been filled. Natures NOT filled are: Port Medic, Ex-Raider, Merchant and Former Aegis Crewman. I'd REALLY like to have a medic.**\n\nIf you have any questions regarding this story, please feel free to email me at solrhyo@gmail.com.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-07-22 05:45:32 UTC",
        "comment": "4 Bay has the questionable distinction of being one of the most popular places on Iobates. The main reason for this is not that it's aesthetically appealing (it's not), but that it's the main entrance and departure point for anyone visiting the base. So, if you're someone who's been stationed on this floating shithole for any extended period of time and you've exhausted every other line of entertainment available (and there's not many), you may find yourself drawn to the trusted, age old hobby of people watching. And there's no better place on Iobates for this than 4 Bay. 4 Bay is unique from the other hangar bays in a couple of other ways as well, which might be what makes it such a popular place. Because it's where all visitors to the spaceport gain entry, many of the resident merchants have seen fit to set up shop here. Subsequently there's a line of shops and stalls just outside the security checkpoint where newcomers can feel free to waste their money on a wide variety of useless crap. There are food vendors as well, because after spending any amount of time on transport vessel the first thing passengers are going to want is real food (although, calling the meals sold at these stalls \"real food\" is stretching the truth by a mile). Once the passengers make it past the stalls and shops, they can do one of three things. They can head directly into the spaceport proper. They can also choose to wet their whistle by stepping into the Eight-Ball, one of the largest and most popular cantinas on Iobates. Lastly, they can opt to take a stroll down what's commonly referred to as the \"observation deck\". The observation deck is actually a narrow catwalk that connects 4 Bay to 5 Bay. It's also where the locals gather to people watch. On any given day you'll find 10-20 Iobates dwellers on the catwalk, watching passengers disembark from their vessels and while wondering why the fuck anyone would want to come here. 4 Bay is currently very busy. There's something novel happening today--a transport cruiser has arrived. Cruisers differ from vessels in that they're the space adaptation of an Old Earth luxury passenger liner. A *cruise ship*, and it's docking here on a spaceport on the very fringes of colonized M63--a spaceport that, everyone knows, is home to many who are attempting to run or hide from the law, people who have no place better to go, and people who are pretty much the scum of the universe. The hilarity of anyone paying good money to tour Iobates has been the treasured topic of gossip among Iobate's citizens since word of the transport cruiser's arrival came. And so it is that both the vendor strip and the catwalk are crowded with people hoping to catch a glimpse of the idiots who thought that Iobates, out of all the many other marvels of M63, would be a nice place to visit. The transport cruiser has already docked, having cleared the external security scans. The docking clamps have been set in place and now the boarding ramps are rolling out. The cruiser's name is laid out on her sides in grandoise, sweeping letters: *Magellanic Queen*. There's an audible *boom* that echoes throughout 4 Bay as the boarding ramps lock into place against the hull of the cruiser. The catwalk and the vendor strip are abuzz with conversation. The observers on the former are wondering just what kind of travelers will be disembarking. Seniors? Honeymooners? People who could only afford the very cheapest of vacations? At the vendor strip, the store owners are all mentally rubbing their hands together with avaricious glee. A *cruise ship* means business! The three hatches of the *Magellanic Queen* slide open. Passengers begin to spill down the ramps. People on the catwalk lean over to get a closer look at the newcomers. The merchants ensure that their \"Open!\" signs are switched on and are easily viewable. \"Where's the luggage?\" This from someone on the catwalk, attracting some attention to what he's referring to. Although the conveyer has been extended below the cargo hold of the cruiser, the cargo hatch hasn't opened. \"Malfunction, maybe,\" someone else says. There's an explosive sound that jerks everyone's attention back around to the boarding ramps. What the hell was that? And then it sounds again, and again, and again in short order. And that's when people begin to realize that it's gunfire, and that the people disembarking from the *Magellanic Cruiser* have *weapons*, and that they're swarming the security checkpoint-- Claxons begin to sound in 4 Bay. All points of exit automatically seal as a result. The emergency lights high on the walls are flashing yellow, which indicates to everyone familiar with the alert levels of Iobates as to what's just happened-- Raiders."
    },
    {
        "game_pid": "j72mj2",
        "story_name": "The Empyrean Fall  ",
        "post_title": "The nation of Danthes is considered to be the holiest of lands. It is where the God Otarion sends his children, delivering unto his mortal flock the Empyrean rulers. For seven centuries the Empyrean have ruled Danthes. They are men and women born not of this world, but of another realm entirely where the Gods exist.\n\nThe Empyrean are only gifted to the world for a short time. After 40 years of rule, they must forsake their mortal forms and return to the realm of their origin. It is a ritual suicide. This event is known as the Ascendance. After one Empyrean has Ascended, another will appear after eleven days to continue providing Danthes with holy guidance. And so it has happened for several centuries, exactly as it is written in the Vellums of the first Empyrean, Malquin.\n\nThe current ruler of Danthes is the Empyrean Daughter Jaharet. Her rule has been especially blessed; Danthes is thriving. There have been no skirmishes with surrounding nations during her reign. Trade has flourished. The farmlands are bountiful. Such is the serenity and prosperity of Danthes that many imagine Jaharet to be the most favored of all the Empyrean Children.\n\nOn the eve of the fortieth year of her reign, however, the Empyrean Daughter does something unprecedented. She makes a proclamation that stuns the people of Danthes. She will not Ascend. She will remain in mortal form to guide Danthes to a glorious age such as it has never known. Such is the will of her father, she claims, he who is the God Otarion.\n\nThe kingdom is effectively sundered with this announcement. Many support Jaharet’s continued rule, as she is wise, benevolent, and farseeing. There are those that believe she is not as she seems, however, and believe that she invites catastrophe. Foremost among those is the religious order known as Pantheon’s Call.\n\nA war erupts within the capital city of Yistria. Pantheon’s Call marshals its holy forces in an attempt to capture Jaharet and force her to Ascend. Jaharet’s supporters are many, however; she and those loyal to her are able to sequester themselves within a fortified sanctum in the center of the city. Among Jaharet’s followers are several of the city’s most powerful priests and mages, and working in tandem they are able to create a magical ward that the opposing force cannot breach. Such is the nature of the ward that any person marked as a member of the religious order cannot pass.\n\nPantheon’s Call is extremely powerful. It has vast resources to draw from. Its members are among the most renowned and powerful within Danthes. And so, with the use of mages within its ranks, the order begins to scry for individuals that could, with their strengths combined, breach the wards and mount a final assault on Jaharet and her followers.\n\nThis is no simple task. Because of Jaharet’s popularity, a large part of Danthes' population wishes for her to remain as ruler. Anyone attempting to destroy her will be ostracized, reviled, and perhaps even killed. This does not matter to the members of Pantheon’s Call. In order to ascertain that those they choose adhere to the mission, they coerce them into agreeing through threats that could lead to ruin, violence, death … or worse.\n\nThose people they recruit to breach the ward and assassinate Jaharet are from all walks of life. They are warriors. They are merchants. They are scholars and priests and riders.\n\nThey are you.\n\n***\n\n**Please note:** We've already started but I'm looking for one or two more players. Check out the lobby for more info!",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2021-08-03 18:42:49 UTC",
        "comment": "Pantheons Call was thoroughly routed. Emant Harrown, Lord Elect of the religious order, sat tall on his horse outside the gates of Yistria. Behind him were the remnants of the small army he had commanded in the city. Had he but known the declaration Jaharet would make, he would have mustered the entirety of Pantheons Call. But she had taken him by surprisehe and the rest of Danthes. She had exposed herself in that moment for the charlatan she was, an impure soul muddying the holy mantle of leadership she had been gifted. And he and his followers had reacted in the only way they couldthey had attempted to capture the Blasphemer and force her to Ascend. Theyd almost had her. But Jaharet too had followers, men and women devoted to her in a manner that was almost fanatical. Her Empyrean Guard and the sentinels of the Sanctum had joined together to protect her.Theyd bought her precious time so that she and those closest to her could flee to the Sanctum, the holiest of temples located deep in the heart of the city. And from within the Sanctum, some of her protectorsthose clerics and priests and mages that had sided with herhad come together to create a magical ward that no sword or magic at Harrowns disposal could breach. She was impervious now, safe in her cocoon of sorcery. But not for long. The small force Harrown commanded had surrounded the Sanctum. There they would have remained until the whole of Pantheons Call had come to aid them, if it had not been for the unforeseen. Jaharets alliances ran deep and spread far. Not even a day after her announcement was made, a large rebel faction from Morialor had marched into the city. Formidable though Harrown and his men were in battle, they were outnumbered greatly when this rebel group banded together with those loyal to the Empyrean. It was to her credit, Harrown mused now as he stared at the city denied to him, that Jaharet did not order he and his men slain. It was also going to be something she would come to regret most intensely. She had allowed them to fall back and regroup outside the gates. And then she had ordered that all city gates be closed and all its walls manned. The Lord Elect suddenly wheeled his horse around. The beast, a magnificent destrier, snorted as it turned on its haunches. Before him were the remnants of the men hed commanded in the city, all of them looking equally as grim as their leader, all of them sporting the emblem of the Five Eyes somewhere on their clothing, weapons, or shields. Have the men been sent? Harrown asked one of his commanders as he rode past. The commander heeled his horse forward so that it kept pace with the Lord Elects mount. They have, Lord. Harrown mused on this. When the magical aegis went up around the Sanctum, Harrown had known instinctively that breaching it would require some creative thinking. Hed sent word out of the city with swift messengers, instructing those in various outposts throughout the country to scry for certain individuals who were in possession of particular skills. These skills, when brought together and put to use in tandem, would ultimately be the way the ward would fall. And so men had been dispatched, armed and capable, to retrieve these individuals chosen. Harrown knew they would not all come willingly. No, some wouldl resist, which is why certain pressures had been applied to convince them that this task is in their best interests. Of course, some of them would be all too willing to lend their skills to this most righteous of crusades. As Harrown and his men rode away from Yistria, heading south, he carefully considered those that were chosen for this task the Vessanian clansmen that lived outside civilization, whose skills with a horse and bow would provide protection when violence inevitably happens the clever, impious merchant, whose connections and influence would be necessary to navigate through a nation turned hostile against those that would harm Jaharet the willful mage, a risky choice that was green in experience yet vast in untapped power, who would lend her skills to breaching the ward that protects the Empyrean Daughter and the messenger, whose knowledge of Danthes roads, paths, and secret ways would guide them all through a hostile landscape, whose lack of allegiances makes him perhaps the most trustworthy of the lot All of them would be escortedsome perhaps by forceto meet Lord Elect Harrown. And he would impart upon them the absolute necessity of what they must do. He would make certain they realize that they must not fail. Until then, however there were other matters he must attend to. And so it was that he and his men left the Holy City and its untrue ruler behind. *** In other parts of Danthes, paths were altered. Harrowns men sought them out unerringly, their locations revealed through the scrying of Pantheon Calls own priests and mages. One by one they were made to understand that they had no choice in this, that they must obey. And one by one they left their homes, their families, the things that mattered to them to set out on these new blind paths."
    },
    {
        "game_pid": "2xt3ww",
        "story_name": "The Conquerant",
        "post_title": "Heracanth is a nation of conquest. Nestled between mountains and sea, its advantageous location makes it difficult to attack and even harder to invade. Bountiful farmland and plentiful mining has made it a prosperous country, and a significant portion of that wealth has been funneled into the military. The citizens of Heracanth have not known significant hardship in quite some time, aside from the ravages of a terrible wasting disease a decade ago. \n\nHeracanth is not an idle country. The rulers have always kept an eye on the horizon, sending out small and swift fleets of ships from the capital city of Eretra to scout lands both known and unknown for anything that might prove useful. The current ruler is Imperator Trexen, a man of violent appetites. In a less civilized locale, he would be referred to as a warmonger. Because his efforts and aspirations have led to lives of luxury for most of the entire population of Heracanth, he is instead labelled a hero and a visionary. \n\nEleven months ago, a scouting fleet discovered a landmass far to the southeast. Scouting parties sent ashore encountered fertile forests and rolling grasslands rich with wildlife, as well as  a few small farming villages. The local populace welcomed them, fed them, and housed them. They called their land Obarem. When asked if they were interested in trade, the villagers responded positively, which led the scouts to the discovery of the strange and beautiful gemstones mined from deep within Obarem.\n\nHeracanthians were no stranger to such opulence, but the likes of these stones they’d never seen before. The stones were mostly small and always warm to touch. Turning them one way or another revealed flickers of light trapped within, always moving, never the same. The effect was stunning. The natives called the stones “incendium.” The scouts bartered their own goods for several of the stones and returned to their fleets. It took four months to return to Heracanth bearing words and proof of what they’d found. It took Imperator Trexen only three weeks to make the decision to dispatch the bulk of his army to Obarem.\n\n“Invasion” was a word he deemed too callous to use. Instead he referred to his intentions for Obarem as “welcome annexation” with the implication being that the population of Obarem would appreciate their arrival. Most of Heracanth knew the truth of the matter. Most did not care.\n\nSeven months ago, the Imperator dispatched the flagship of his fleet, the *Conquerant.* Barely two years old, the *Conquerant* was the pinnacle of Heracanth’s naval warfare, a stately man o’war that the Imperator himself had commissioned. She had never seen combat and it was deemed there was no better opportunity than now, as by all reports the military might of Obarem was paltry in comparison. The send-off for the *Conquerant* and the rest of the Heracanthian fleet was a day of revelry and festivity. The Imperator made an appearance at the docks, outfitted in his glinting golden ceremonial armor, and gave a rousing speech as his warships sailed southeast behind him. \n\nMonths passed. Messages sent from the fleet were verbose at first. That changed after the invasion began. They became more intermittent, more terse. It was clear things were not going well, that unexpected complications had arisen. Just what those complications were, however, remained unclear. \n\nFinally, a month ago, one final message was received. It read only: *Obarem is unconquerable.*\n\nNo ships have returned save the small sloop carrying that final message. It floated into the shipyard, unmanned. Those who boarded it discovered five bodies all bereft of any signs of disease or wounds. They had lived just long enough, it seemed, for the sloop to return home. \n\nThe Imperator is determined to discover what happened to his navy. The presumed loss of the *Conquerant* vexes him greatly. He has assembled another small feet that will travel to Obarem, comprised of only two ships: the *Elfin Grace*, a sloop, and the *Loyal Medean*, a schooner. The crews have strict orders: survey Obarem’s shorelines from afar, avoid confrontation, discover the fate of the Heracanthian navy. \n\nHowever, there is another mission at hand. The Imperator has assembled a group of skilled and knowledgeable individuals that he has charged with two tasks: the first, to locate the *Conquerant* or what is left of her and the second, to ferret out the source of the Heracanthian navy’s defeat and learn whatever they can about the country and its people in the process. Neither task will be easy and indeed may prove deadly, which is something each of these individuals is acutely aware of. \n\nYou are a member of this group, selected personally by Imperator Trexen himself by merit of your deeds, education, or renown. You are prepared for adventure and even death, all in the name of Heracanth’s enduring glory. \n\n–  \n\n**Please Note:** This setting is somewhat similar to that of the Golden Age of Piracy (17th and 18th centuries). Therefore, ships have cannons and people can use guns (flintlock and volley pistols, musket rifles and blunderbuss) along with melee weapons (cutlass, saber, dirk, dagger). When writing up your character, please tell me what weapon you would prefer (if you want one) with a limit of one ranged, one melee so that I can provide you with the appropriate asset cards. \n\nThis is also a fantasy game, so there *is* magic. I’ve purposefully left that wide open so that you can get creative. Mages, clerics, priests, I welcome them all. However, please keep it within reason – no omnipotent archmages, please. Characters with magic should include their preferred weapon (staff, wand, spellbook, religious medallion, whatever) if they want one so I can make up an asset card. \n\nIf you’d rather make a character that’s less inclined for combat, that’s perfectly fine. Let me know what kind of items they’d be carrying around with them for the purpose of their mission and I’ll be sure to dispense them once we start.\n\nI’ve made up a few cards but feel free to write up your own! \n\n--\n\n**We have already started, but we lost a player. I am looking for 1-2 more to join us. Because we're already underway, it would be beneficial for applicants to catch up on the story. Being as we're only a month in, there isn't too much to read. I'd also recommend checking what characters currently exist!**\n\n\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2021-09-14 19:03:36 UTC",
        "comment": "It was early evening in Heracanth. The descending sun glinted off the stained glass lanterns affixed to posts that line the street, casting an enchanting kaleidoscope pattern of colors upon the ground. The streets and walkways in the main city were all cobblestone, well maintained and accented by immaculately trimmed hedges, flowering shrubs, and elegant statues. Closer to the palace, the streets and paths made of crushed rock and crystal gleamed by light of sun or moon. Heracanth the nation was known far and wide for its power and wealth; Heracanth the city was famed for its order and beauty. The docks, where practicality took precedence over aesthetics, still managed to be somewhat pleasing to the eye. At the end of their shifts the dock managers ensured that all was in order ropes properly coiled, cargo stocked efficiently, docks themselves free and clear of anything that might prove unsightly or an impediment to walking. This evening some extra attention had been paid to the west docks, where a small crowd of people stood waiting. Moored some distance away in the bays deeper water were two ships, the smaller *Elfin Grace* and the larger *Loyal Medean*. Their sails were raised and those waiting at the docks could see signs of activity upon their decks. Three dinghies from both ships were being rowed across the bay, toward the waiting crowd. When they arrived they began to load their passengers and their luggage carefully and one at a time, the seamen within offering their aid to those that needed it. When all were seated the return trip began, some passengers conversing with the rowing officers, others choosing to appreciate the sight of the setting sun reflecting off the waters of the bay. The process of boarding the *Loyal Medean* for all the passengers and their luggage took some time, and when all were finally standing upon her decks, dusk was well under way. Lanterns hanging from the lower masts and attached to the main deck and taffrail illuminated the area in a warm glow. The deck itself was clean and orderly, and standing at attention to greet the new arrivals was a long row of officers. Their uniforms were eye-catching, to say the least, blue and white with bold yellow detailing. Standing in front of them were four other officers, who snapped out a salute the moment the last of the newcomers had boarded. One of them stepped forward. I am Adrian Anaros, he greeted in a rolling baritone that seemed perfect for shouting orders, Captain of the *Loyal Medean*. I welcome you all aboard. Anaros was a large man, wide in the shoulders and thick through the middle without being fat. He wore his fair hair long in typical Hercanthian fashion, tied back with a blue cord. He sported a neatly trimmed beard along his jaw and his deep set green eyes appraised the group before him in a manner that, while not quite jovial, was something close to it. He lifted his hand and made a gesture. The other three officers that had been with him stepped forward. Anaros began the introductions, starting with the dark-haired woman on his right. This is my commander, Valena Ambrose. Ambrose offered the group a small, clipped smile, dipping forward in a half-bow. These, Anaros said, now gesturing to his left, are the captain and commander of the *Elfin Grace* Captain Jilleen Davies and Commander Bravis Desstin. Davies was a tall woman, lean with a sharp, angular face. Despite her somewhat intimidating appearance the grin she gave the group was a welcoming one. Desstin, shorter than her considerably and boasting a thick brown moustache, seemed equally as affable. As you know, Anaros said, well be departing in the morning. The Imperator thought it best we spend this evening getting to know each other as well be travelling companions for the long months ahead. To that end, well be dining together in my quarters. The Imperator sent the cooks from his own kitchen. If any of you have dined at the palace before, you know exactly what kind of feast youre in for. Anaros began to move and beckoned for the passengers to follow. They did so, trailing after him as he walked across the deck toward his quarters. He halted at the door, waving with one arm for everyone to precede him. The interior was quite spacious, with most items shoved off to the side to make room for the large table that divided the room. The table had chairs enough for passengers and commanding officers and had a dark blue tablecloth and precisely arranged place settings. The meal is not yet done, Anaros said as he stepped inside. He continued with a wry smile, Im told the palace cooks find our galley to be somewhat lacking. Until then, I encourage you all to relax and enjoy yourselves. He pointed to a smaller table bolted to one wall that held numerous bottles, glasses, and tankards. Weve wine, whisky, and ale for those that prefer it. I would recommend not over-indulging, however a hangover is not pleasant while at sea. He crossed the room and poured himself a drink, a stream of whisky into a short glass. He held it aloft as he turned to face the group. To our success and safety on this voyage. Please help yourselves, get comfortable, and make your introductions."
    },
    {
        "game_pid": "1dh5vn",
        "story_name": "Halcyon Kept ",
        "post_title": "For 70 years, a war has been waged within the city of Aquarius. The Houses, created as strongholds for the fallen Angellum after the Aura Wars, are constantly vying for dominance. Now only four of the oldest and most powerful Houses remain: Irydthion, Ya Mordül, Kyle, and Halcyon Kept.\n\nThe war between Houses has taken a sudden, unexpected turn. Creatures unlike anything ever seen before have appeared, attacking all Houses without discretion, wielding technology equally as alien. Time is short on all sides. Each House begins to strenghten its military force in response to these new enemies. The race is on to discover the origins of these creatures, and all the while the tensions between Houses continue to mount until the breaking point becomes inevitable.\n\nNavigating through politcal struggles and internal deception, agents from each House discover that the strange creatures are only the newest development in a war so ancient and vast that it dwarfs their comprehension of time. Defeat of this new and deadly enemy is more than any House can handle on its own, and an alliance with the other Houses could be the deciding factor. But can an alliance between four powers with intermingled histories of prejudice and violence even be possible?",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-05-04 04:41:51 UTC",
        "comment": "The Boundary is not an aesthetic structure. It's ugly, made of dull concrete that rises forty feet. It is topped with rolls of razor wire. It wasn't made to be an elegant piece of architecture. It was made to keep the House Wars within House territory, and for that purpose it suffices. The north gate is the most popular transit route between the city and House territory. Despite this fact, it's still heavily fortified. It's manned at all hours by security teams of tenfive men on the House side, five men on the other. Travel through this gate is heartily discouraged by city officials, particularly where civilians are concerned. However, it is still permitted; it is not the duty of the guards to protect individuals from their own stupidity. Supplies are routinely trucked through the north gate. People who dwell in House territorymainly members of the Houses themselvesoften conduct business in the city. There are no real services in House territory save that of the makeshift medical and cybernetics clinics that are strewn throughout. For every other service, the Houses must venture beyond the Boundary. People often gather at the north gate. Tourists flock to it, hoping to catch a glimpse of House activity. Aquarius' news channels station reporters are there often when they catch wind of a skirmish brewing. And then there are the travellers, those willing to pass through the gate into streets left damaged and abandoned by the intensity of the House Wars. These travellers are sometimes just thrill seekers. Some are members of the city's military. Some have legitimate business with the Houses. Some are attending to business that is not in any way legitimate. It is a busy evening now at the north gate. There is a steady stream of vehicles and pedestrians passing through. Sergeant Marek How, officer in charge of the current guard team, is busy checking the papers of a moving van driven by woman whose facial implants give her a decidedly villainous feel. He is used to the sounds of a transient population, motors and horns and the vocal complaints of drivers. What he hears now is different from all of those. It is the high pitched whine of moving machinery, and it is approaching the gate from the House side. Sergeant How instantly has a bad feeling. He turns to stare through the gate, at the line of traffic hoping to exit into the city. The sound is louder now. He ducks his head to speak into the radio attached to his collar, \"Narris, what the hell is that noi\" The last part of his question is drowned out by the sound of gun fire. There is a simultaneous explosion on the other side of the gate. Immediately the sounds of chaos ensue. Drivers on the city side struggle to get out of the gridlock they're encased in. Drivers on the House side are trying to surge forward, through the barricade. And beyond them Sergeant How sees fire and smoke. *What the fuck?* He thinks, backing away, waving to the other guards on his side of the gate. There is no hope of controlling traffic now; all they can do is get themselves out of the way until law enforcement arrives. He steps off the road, narrowly avoiding being struck by a speeding van that has broken through the barricade. He yells a question into his radio and his met by static. The sounds of destruction are much closer now. And then he sees it, the cause of all this. He watches wide-eyed as it wheels into view, crushing vehicles in its path. It is larger than most any other vehicle he has seen. It rolls on three huge wheels with monstrous treads. Through the haze of smoke and fire, Sergeant How sees that it is oddly shaped, sleekly curved and made of pale grey metal. As it passes him he hears the smooth whisper of the wheels, accompanied by the mechanic whine he heard earlier. He also sees something that worries him. He sees the emblem of the House of Kyle painted on its side. He knows instantly what it is. It halts on the city side of the gate. It begins to change shape. The axles are shifting, the wheels rising into the air, and it steadies itself on a tripod of metal appendages. Its round shape splits apart with the sound of hydraulics and the same high whine. It begins to look vaguely man shaped. The small, round nob that has appeared like a head has one glowing blue band across its surfacea sensor strip. More metal appendages are unfolding from within it with an odd grace, and Sergeant How sees that they are not arms. They are massive cannons. Over the radio, the men under his control are screaming questions at him. He fumbles for his radio and gives his answer. \"It's a war machine.\" Everyone has heard about UA's newest military prototype. Nobody to date has seen one, not even the most persistent outlets of the city's media. But the prototype is what is before him now, swivelling on its stand, locating targets and preparing to fire. Sergeant How is no longer thinking about damage control. He is thinking, as the prototype begins to fire weapons that are clearly energy based, that he is not paid nearly enough to deal with shit like this. He is thinking that when all this is over and the dead are being tallied, that UA will deny having sold the prototype to the House of Kyleno, instead, UA will claim it was stolen. The House of Kyle will deny ownership, even though it bears the Kyle emblem. There will be no way for authorities to prove that this attack was intentional, no paper trail, no money to follow. And worst of all, Sergeant How is thinking that the slaughter that is commencing is no accident. It is a trial. The prototype is test firing. The sergeant is now thinking that he needs to get his ass across the street, to the armored barracks where he and his men are stationed when not on duty at the gate. He is thinking that if they were smart, everyone else out in the open would be headed there too. That is the last thought he has. Seconds later he is dead, caught in one of the first shots fired by the UA prototype war machine. It's up to everyone else here to survive."
    }
]