[
    {
        "game_pid": "t97h3s",
        "story_name": "Imitating Life",
        "post_title": "*”Art not only imitates nature, but also completes its deficiencies.”*\n*-- Aristotle*\n\n\nDeep in the heart of the rural South of France, there are people who are…not like you, exactly, so much as similarly unlike anyone else. Almost a century ago, the Abbey was founded. Formerly an abandoned monastery, it now houses a secretive colony of over one hundred carefully selected artists from all over the world. \n\nOf those who go in, many emerge to gain fame and renown, others to teach at well known schools, and still others take paths of their own choosing. Some simply stay, and vacancies are few and far between. Happily, four have recently opened up. You and three fortunate others have been chosen to fill them.\n\nBut all is not as it seems.  Whatever your unique way of perceiving and expressing the world is, be ready to use it. As the Abbey falls into jeopardy, you’ll need what’s always felt a little like magic.\n\n*”Life imitates art far more than art imitates Life.”*\n*-- Oscar Wilde*\n\n[Click here for a map of the Abbey.](https://drive.google.com/file/d/1l7_m3Wu2zKg-_Gj3NxeDhEQIXhuc8xvr/view?usp=sharing)\n\n6/2/22: All non-card images should now have alt text. Unfortunately I can't go back to add it to already played cards. Linked images that aren't described in the text should have a superscript number next to them like this [1], and a corresponding description at the bottom of the post. ",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2019-08-06 03:43:06 UTC",
        "comment": "##*[Village of La Malène](https://www.google.com/maps/place/48210+La+Mal%C3%A8ne,+France/@44.3072821,3.2463764,12z/data=!4m13!1m7!3m6!1s0x12b3a6dd13491957:0x9c18433a455a3b40!2s48210+La+Mal%C3%A8ne,+France!3b1!8m2!3d44.303045!4d3.320135!3m4!1s0x12b3a6dd13491957:0x9c18433a455a3b40!8m2!3d44.303045!4d3.320135)¹, Town Square, Mid day.*\n\nThe balmy breeze of late May in La Malène was expected by those of the four new colony members who had checked the weather ahead of time, while they still had cell coverage or an internet connection. For a village of about 150 residents, it had sounded right. Like it would compliment a peaceful, downright idyllic place.  The weather, however, was the only thing that was as expected.\n\nThe population of the village seemed to have doubled that day, overrun with people who looked largely as if they were from anywhere but here.  Which, as it happened, was exactly where they had come from--all corners of the world and walks of life, coalescing bizarrely in the middle of nowhere. More of them than could be explained, even if the entire Abbey had come to greet the new members personally. While some disappeared down a rougher road, presumably leading to the Abbey still another half hour away, others came in to replace them.  One might suspect it was the first traffic jam in La Malène caused by anything besides a recalcitrant sheep. Any one of the large vehicles could have caused a traffic jam almost anywhere though--bright colors and odd shapes of all textures hung off them, poking out of trucks and protective tarps.\n \nAnd yet, the villagers seemed nonplussed. They walked by the strangers as a New Yorker in Times Square might pass Elmo, the naked cowboy, or any mascot of the general strangeness of humanity.  Whatever was happening, as four perplexed travelers stretched hours and days on planes, trains and automobiles from their legs, one could only assume it had happened before.\n\nWandering across the square from the places their respective cabs had dropped them off, the travelers had only personal items and clothing with them, art supplies and heavy equipment having already been shipped ahead on the colony's dime.  One by one, the travelers spotted and drifted towards an odd group of three by a bench. Their transportation across the last miles to the Abbey, judging by the signs parodying a bored valet’s, complete with names, or in Armand’s case a picture of him lined in a long fringe of neon yarn with a bold, black print spelling out ‘**THIS GUY**’. \n\nDave and Yakov’s joint sign wasn’t quite as thoughtful--whoever had written it had started too far to the right and had to squish the rest of their names in too small spaces towards the end.  A stick figure waved apologetically below the messy writing.  Both of these priceless works were leaned against a sleeping man wearing a mélange of bright colors, one covering his eyes to block light that might interrupt his nap, the other more prominently displayed where it had been propped up against him by the somewhat sulky figure of [a young black man](https://i.pinimg.com/564x/a7/dd/97/a7dd97f8987fad1fc4305f2ca68ade9a.jpg) in faded jeans and paisley dress shirt. He wore three stacked party hats and was trying to hand a fourth to [a woman next to him](https://drive.google.com/file/d/1PEavNDMIo7Y-gHgvSK-mLIH0gOjOjTJ7/view?usp=sharing).  \n\nFor her part, she wore a business suit, smoked with intense concentration, and ignored him. She also held Chi’s sign-- certainly the most beautiful, dark, poetic sweeps of calligraphy making a graceful web of her name.\n\n*¹Link to google map of La Malene location*"
    },
    {
        "game_pid": "a0vypq",
        "story_name": "After",
        "post_title": "#After: A Post-Apocalyptic Fairy Tale.\n***\n\n##Once upon a time…\n\nA world embodying the magics and traditions of old world fairy tales flourished. In spite of its sinister and fantastical nature, many inhabitants managed to live happily over the centuries.\n\nThe population grew exponentially all across the main continent. Technology advanced in the hands of common people, and although the magic defining the core of their existence never diminished, most cultures changed drastically. New systems of governance developed.\n\nAll known peoples coalesced into 3 kingdoms, spanning earth and sea. A great alliance was formed, and Freidan was founded, an incomparably grand city created purely to maintain it.  For unknown reasons, as the world changed, fairies themselves seemed to slowly disappear from it.\n\nBut that is not our story.\n\nNot long ago, the world fell utterly to pieces. Freidan was the last bastion of order until it too toppled into ruin. Mysterious poison had flooded land and sea, the moon had disappeared from the sky, and an immense war had consumed the civilized world in an avalanche of political tensions hastened by conspiracy and powerful enchantments–but the manner of Freidan’s demise was the strangest yet.\n\nThe few survivors of the widespread destruction are now found only in small pockets on a poisoned, shattered world plunged back into the darkest ages of wild magic. But unbeknownst to most, a small mismatched group of strangers is about to set out from the ruins of Freidan on what may be the last adventure of all.\n\nThe End has come, but no one lives happily, or forever it seems.  Yet much endures beyond the telling of a tale--and that's where our story begins.\n\n##...After.\n***",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2018-05-02 02:10:11 UTC",
        "comment": "*“And if they have not died, they are still living happily today.”*\n\n*- The Twelve Tortoises*\n\n***\n\n##The End.\n\nIt came billowing poisonously through the seawater from some untraceable point in the ocean to the northwest, just beyond the Marchen Islands. Sweeping through Werault, it cut a wide, gruesome swath over hundreds of miles of ocean. When it hit the northwestern coast of the Territories, the population fled south and east, but the poison followed, thundering down the coast towards Freidan. The water was undrinkable. Food that grew from it was deadly.\n\nAs the toxin hit Thaler soil, the southerners not only assisted with food drops and supply convoys, they took in refugees from the north. The Alliance held, even as the kingdoms that had created it slowly died.\n\nSoon, the poison riddled the Northern Territories straight through to the opposite coast. Instead of merely fleeing to Thaler, many survivors rebelled against the crown and began a desperate, decentralized invasion of the southern lands. The fight only grew bloodier as Thaler rounded refugees up into internment compounds and fought back. The war and blight moved south, and Thaler was left as poisonous a shambles as the north. Communications from Territories dwindled until even the capital city of Spythra was silent, and Thaler followed suit. Freidan still stood. Well fortified and well stocked, it went relatively unmolested, the only bastion of hope spared by a dying world.\n\nFinally, one night, the moon failed to rise, and didn’t reappear. A few weeks later, the water around Freidan began to clear of the poison. Hopes soared. Days after, the city fell.\n\n***\n\nIt should have ended in blood, should have taken months under siege for Freidan to fall. The starving dregs of Thaler and The North had already been skirmishing outside the city limits, even as they begged for supplies and equipment. There should have been someone to fight, one last battle with the possibility of a merciful victor.\n\nInstead it ended suddenly, in fire and ice, as if the earth had gone to war with the sky. Light and darkness clashed, day and night seeming to fall into a violent rage. First there was searing heat as the sun grew larger and brighter, appearing closer in the sky. Leaves withered, and birds in flight charred and fell. As the blazing temperatures intensified, many below died of heat stroke or immolation. Water boiled sporadically in the lakebeds.\n\nThick black clouds appeared, shedding bullets of hail that shattered on thick sheets of ice and hissed on hot pavement and roiling water. Steam poured over the city, capturing the deadly brilliance of the sunlight and the prongs of lightning, reflecting them in brief, mockingly beautiful rainbows like scattered opals.\n\nWithin hours, the chaos lifted as suddenly as it had fallen. The bitterly cold storms evaporated, and the sun shrank again. Death settled over the ruins.\n\n***\n\nIn the last surviving car of the last Solar Express subway train, dim red emergency lights guttered to life. There were only four passengers, but not an hour ago they had been treated to front row seats during Freidan’s demise. Speeding through the city, darting into the open air at times to see the destruction, then back into in the relative shelter of tunnels below, they had been able to elude the deadly aboveground environment. Of course, the tunnels were only safe until the earth began to shake and crack open. The resulting crash had destroyed every car but the last, leaving its occupants in various states of collapse. \n\nAround them, the world was tinged red, illuminated by the back-up lighting of the damaged train car. Through the windows, a curiously intact stretch of very old tunnel could be seen, caved in on either side of the train car and  lined by large stone bricks covered in dingy peeling paint."
    },
    {
        "game_pid": "2t92z1",
        "story_name": "After",
        "post_title": "After: A Post-Apocalyptic Fairy Tale.\n\n***\n\nOnce upon a time…\n\nA world embodying the traditions of old world European fairy tales flourished. In spite of its sinister and fantastical nature, many inhabitants managed to live happily over the centuries.\n\nBut that is not our story.\n\nThe population grew exponentially. Technology advanced in the hands of common people, and although the magic defining the core of their existence never diminished, most cultures changed drastically. New systems of governance developed.\n\nAll known peoples coalesced into 3 kingdoms, and a great alliance formed, based in one incomparably grand city created purely to maintain it.\n\nIn the end, that city was the last to fall. An immense war consumed everything in an avalanche of political tensions hastened by conspiracy and powerful enchantments.  The few survivors were plunged back into the darkest ages of wild magic untamed by civilization, and found only in small pockets on a poisoned, shattered world.  But unbeknownst to most, a small mismatched group is setting out on what may be the last adventure of all.  \n\nThe End has come, but no one lives happily, or forever.  And that is where our story begins.\n\nAfter.\n\n***\n\nMajor Known Powers:\n\nThe Northern Territories:  Mountains, forests, wilderness.  Cold.  Made up of a group of small kingdoms and territories loosely controlled by one ruler who keeps them functioning and stops major conflicts. Bordered by the Glass Mountains to the north.\n \nThaler (The Southern Kingdom):  Warm, consisting of wastelands, plains and a lot of farmland. THaler controls a lot of the food supply.  Powerful centralized government (before everything went to hell)\n\nWerault (Underwater Civilization):  Werault isn’t exactly a kingdom, just what water dwellers call the ocean, the same way humans might say earth or world.  It’s so big that no one that close to land has ever been to or even heard of the edge, just more settlements farther and farther away.  The people on the shoreline border have a lot of power due to their strategic position near the land.  They have allied with land dwellers to keep them from polluting or over-fishing, and facilitate trade.  They often send selkies as representatives, even sending them to land based schools in Freidan.\n\nFreidan (Diplomatic Central City)—The U.N. of this world, created to maintain the great alliance.  People come to Friedan from all over.  It has a mostly democratic government, mainly consisting of an international counsel made of representatives elected by their homelands, and a “Regent Elect”.  Great minds congregate here to learn and teach away from international tensions.  Friedan is the most technologically advanced place in all the kingdoms.\n\nFairies:  No one knew where they came from or where they disappeared to, but sightings of the reclusive creatures petered out to almost nothing over the centuries until stopping entirely about 50 to 75 years ago.\n\n***\n\nA/N: \n\nWarning:  Fairy tales in their original form are sometimes gruesome and creepy.  While I'm not sure things will get this extreme, one classic punishment you'll find in multiple stories is heating iron shoes red hot and making the Bad Guy dance to death in them  (in the original Snow White, for instance.)  In that respect, the tone of this story will depend a little on the characters I end up selecting, and what the players are comfortable with, but be aware that this is the kind of thing parts might be based on.  Also, it's post-apocalyptic, so that won't help if you're not up for some pretty intense stuff.  On the flip side of that, players should tell me when anything makes them uncomfortable, and I'll do my best to adapt to that.\n\nThis is a game for a max of 6 players.  I'll leave applications open for about a week.  Not first come first serve.\n\nWritten in 3rd person past tense.  I have a tendency to be goofy, so while there will be a certain amount of grittiness, humor is welcome too.  LGBT+ friendly.\n\nCharacters should be 18+ and low or non-powered.  I'll only be accepting  one person with distant fairy heritage.  Because of reasons.  Secret ones.  Shhh.\n\nDo, however, make up your own cards.  Go nuts--remember, this story takes place hundreds of years after the classical fairy tail world, and technology and magic have grown together in a lot of ways.  Of course, the world has all but ended, so technology users may find themselves without  a lot of uses for their abilities.  Shoot me any questions at iris.shreve@gmail.com or this thread in the forums: https://storium.com/forums#/category/lfp/thread/hbxv00",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-09-04 03:30:59 UTC",
        "comment": "*“And if they have not died, they are still living happily today.” \n        -'The Twelve Tortoises' (Collected by Franz Von Schönwerth.  Mid 1800s.)*\n\nThe End.\n\nIt came billowing poisonously through the sea water from some untraceable point just beyond the Vespian Isles.  Sweeping through Werault, it cut a wide, gruesome swath over hundreds of miles of ocean.  When it hit the northwestern coast of the Territories, the population fled east, but the poison followed even as it thundered down the coast towards Freidan.  The water was undrinkable.  Food that grew from it was deadly.  \n\nEven as the toxin hit Thaler soil, the southerners not only assisted with food drops and supply convoys, they took in refugees from the north.  The Alliance held, even as the kingdoms that had created it slowly died.\n\nBut soon, the poison riddled the North straight through to the opposite coast.  Instead of fleeing to Thaler, many survivors rebelled against the crown and began a desperate, decentralized invasion of the southern lands..  The fight only grew bloodier as Thaler rounded refugees up into internment compounds and fought back.  The war and blight moved south, and Thaler was left as poisonous a shambles as the north. Communications from Territories dwindled until even the capital city of Spythra was silent and Thaler followed suit.  Freidan still stood.  Well fortified and well stocked, it went relatively unmolested, the only bastion of hope spared by a dying world.\n\nFinally, one night, the moon failed to rise.  Although the water around Freidan began to clear of the poison afterwards without apparent reason, the moon did not return.  A week later, the city fell.\n\n***\n\nIt should have ended in blood, should have taken weeks under siege for Freidan to fall.  The starving dregs of Thaler and The North had already been skirmishing outside the city limits, even as they begged for supplies and equipment.  There should have been someone to fight, one last battle with the possibility of a merciful victor.\n \nInstead it had ended suddenly, in fire and ice, as if the earth had gone to war with the sky.  Light and darkness clashed, day and night seeming to fall into a violent rage.  It had begun with searing heat from the sun as it grew larger and brighter, appearing closer in the sky.  Leaves withered, and birds in flight charred and fell. As the heat intensified, many below died of heat stroke or immolation.  Water boiled sporadically in the lakebeds.  In the harbor, the bodies of ocean dwelling survivors from Werault washed ashore.\n \nThick black clouds had appeared, shedding bullets of hail that shattered on thick sheets of ice and hissed on hot pavement and roiling water.  Steam poured over the city, capturing the deadly brilliance of the sunlight and the prongs of lightening, reflecting them in brief, mockingly beautiful rainbows like scattered opals.\n\nWithin hours, the chaos had lifted as suddenly as it had fallen.  The bitterly cold storms evaporated, and the sun shrank back into the distance.  Death settled over the ruins.\n\n***\n\nIn the last surviving car of the last operational Solar Express metro train, dim red emergency lights guttered to life.  There were only four passengers, but not an hour ago they had been treated to front row seats for Freidan’s demise.  Speeding through the city, darting into the open air at times to see the destruction, then back into in the relative shelter of tunnels below, they had been able to elude the deadly aboveground environment.  Of course, the tunnels were only safe until the earth began to shake and crack open.  The resulting crash had destroyed every car but the last, rendering its occupants unconscious. \n\nAs the four began to recover slowly, they woke to the dim, red back-up lighting of the damaged train car.  Through the windows, a curiously intact stretch of very old tunnel could be seen, lined by large stone bricks covered in dingy peeling paint."
    },
    {
        "game_pid": "pz2xsd",
        "story_name": "After: game b",
        "post_title": "After: A Post-Apocalyptic Fairy Tale.\n\n***\n\nOnce upon a time…\n\nA world embodying the traditions of old world European fairy tales flourished. In spite of its sinister and fantastical nature, many inhabitants managed to live happily over the centuries.\n\nBut that is not our story.\n\nThe population grew exponentially. Technology advanced in the hands of common people, and although the magic defining the core of their existence never diminished, most cultures changed drastically. New systems of governance developed.\n\nAll known peoples coalesced into 3 kingdoms, and a great alliance formed, based in one incomparably grand city created purely to maintain it.\n\nIn the end, that city was the last to fall. An immense war consumed everything in an avalanche of political tensions hastened by conspiracy and powerful enchantments.  The few survivors were plunged back into the darkest ages of wild magic untamed by civilization, and found only in small pockets on a poisoned, shattered world.  But unbeknownst to most, a small mismatched group is setting out on what may be the last adventure of all.  \n\nThe End has come, but no one lives happily, or forever.  And that is where our story begins.\n\nAfter.\n\n***\n\nMajor Known Powers:\n\nThe Northern Territories:  Mountains, forests, wilderness.  Cold.  Made up of a group of small kingdoms and territories loosely controlled by one ruler who keeps them functioning and stops major conflicts. Bordered by the Glass Mountains to the north.\n \nThaler (The Southern Kingdom):  Warm, consisting of wastelands, plains and a lot of farmland. THaler controls a lot of the food supply.  Powerful centralized government (before everything went to hell)\n\nWerault (Underwater Civilization):  Werault isn’t exactly a kingdom, just what water dwellers call the ocean, the same way humans might say earth or world.  It’s so big that no one that close to land has ever been to or even heard of the edge, just more settlements farther and farther away.  The people on the shoreline border have a lot of power due to their strategic position near the land.  They have allied with land dwellers to keep them from polluting or over-fishing, and facilitate trade.  They often send selkies as representatives, even sending them to land based schools in Freidan.\n\nFreidan (Diplomatic Central City)—The U.N. of this world, created to maintain the great alliance.  People come to Friedan from all over.  It has a mostly democratic government, mainly consisting of an international counsel made of representatives elected by their homelands, and a “Regent Elect”.  Great minds congregate here to learn and teach away from international tensions.  Friedan is the most technologically advanced place in all the kingdoms.\n\nFairies:  No one knew where they came from or where they disappeared to, but sightings of the reclusive creatures petered out to almost nothing over the centuries until stopping entirely about 50 to 75 years ago.\n\n***\n\nA/N: \n\nWarning:  Fairy tales in their original form are sometimes gruesome and creepy.  While I'm not sure things will get this extreme, one classic punishment you'll find in multiple stories is heating iron shoes red hot and making the Bad Guy dance to death in them  (in the original Snow White, for instance.)  In that respect, the tone of this story will depend a little on the characters I end up selecting, and what the players are comfortable with, but be aware that this is the kind of thing parts might be based on.  Also, it's post-apocalyptic, so that won't help if you're not up for some pretty intense stuff.  On the flip side of that, players should tell me when anything makes them uncomfortable, and I'll do my best to adapt to that.\n\nThis is a game for a max of 6 players.  I'll leave applications open for about a week.  Not first come first serve.\n\nWritten in 3rd person past tense.  I have a tendency to be goofy, so while there will be a certain amount of grittiness, humor is welcome too.  LGBT+ friendly.\n\nCharacters should be 18+ and low or non-powered.  I'll only be accepting  one person with distant fairy heritage.  Because of reasons.  Secret ones.  Shhh.\n\nDo, however, make up your own cards.  Go nuts--remember, this story takes place hundreds of years after the classical fairy tail world, and technology and magic have grown together in a lot of ways.  Of course, the world has all but ended, so technology users may find themselves without  a lot of uses for their abilities.  Shoot me any questions at iris.shreve@gmail.com or this thread in the forums: https://storium.com/forums#/category/lfp/thread/hbxv00",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-09-10 19:18:47 UTC",
        "comment": "*“And if they have not died, they are still living happily today.”\n-‘The Twelve Tortoises’ (Collected by Franz Von Schönwerth. Mid 1800s.)*\n\nThe End.\n\nIt came billowing poisonously through the sea water from some untraceable point just beyond the Vespian Isles. Sweeping through Werault, it cut a wide, gruesome swath over hundreds of miles of ocean. When it hit the northwestern coast of the Territories, the population fled east, but the poison followed even as it thundered down the coast towards Freidan. The water was undrinkable. Food that grew from it was deadly.\n\nEven as the toxin hit Thaler soil, the southerners not only assisted with food drops and supply convoys, they took in refugees from the north. The Alliance held, even as the kingdoms that had created it slowly died.\n\nBut soon, the poison riddled the North straight through to the opposite coast. Instead of fleeing to Thaler, many survivors rebelled against the crown and began a desperate, decentralized invasion of the southern lands.. The fight only grew bloodier as Thaler rounded refugees up into internment compounds and fought back. The war and blight moved south, and Thaler was left as poisonous a shambles as the north. Communications from Territories dwindled until even the capital city of Spythra was silent and Thaler followed suit. Freidan still stood. Well fortified and well stocked, it went relatively unmolested, the only bastion of hope spared by a dying world.\n\nFinally, one night, the moon failed to rise. Although the water around Freidan began to clear of the poison afterwards without apparent reason, the moon did not return. A week later, the city fell.\n\n***\n***\n\nIt should have ended in blood, should have taken weeks under siege for Freidan to fall. The starving dregs of Thaler and The North had already been skirmishing outside the city limits, even as they begged for supplies and equipment. There should have been someone to fight, one last battle with the possibility of a merciful victor.\n\nInstead it had ended suddenly, in fire and ice, as if the earth had gone to war with the sky. Light and darkness clashed, day and night seeming to fall into a violent rage. It had begun with searing heat from the sun as it grew larger and brighter, appearing closer in the sky. Leaves withered, and birds in flight charred and fell. As the heat intensified, many below died of heat stroke or immolation. Water boiled sporadically in the lakebeds. In the harbor, the bodies of ocean dwelling survivors from Werault washed ashore.\n\nThick black clouds had appeared, shedding bullets of hail that shattered on thick sheets of ice and hissed on hot pavement and roiling water. Steam poured over the city, capturing the deadly brilliance of the sunlight and the prongs of lightening, reflecting them in brief, mockingly beautiful rainbows like scattered opals.\n\nWithin hours, the chaos had lifted as suddenly as it had fallen. The bitterly cold storms evaporated, and the sun shrank back into the distance. Death settled over the ruins.\n\n***\n***\n\nIn the last surviving car of the last operational Solar Express metro train, dim red emergency lights guttered to life. There were only four passengers, but not an hour ago they had been treated to front row seats for Freidan’s demise. Speeding through the city, darting into the open air at times to see the destruction, then back into in the relative shelter of tunnels below, they had been able to elude the deadly aboveground environment. Of course, the tunnels were only safe until the earth began to shake and crack open. The resulting crash had destroyed every car but the last, rendering its occupants unconscious.\n\nAs the four began to recover slowly, they woke to the dim, red back-up lighting of the damaged train car. Through the windows, a curiously intact stretch of very old tunnel could be seen, lined by large stone bricks covered in dingy peeling paint."
    },
    {
        "game_pid": "fb7p4k",
        "story_name": "After",
        "post_title": "#After: A Post-Apocalyptic Fairy Tale.\n\n##Once upon a time…\n\nA world embodying the magics and traditions of old world fairy tales flourished. In spite of its sinister and fantastical nature, many inhabitants managed to live happily over the centuries.\n\nThe population grew exponentially all across the main continent. Technology advanced in the hands of common people, and although the magic defining the core of their existence never diminished, most cultures changed drastically. New systems of governance developed.\n\nAll known peoples coalesced into 3 kingdoms.  A great alliance was formed, and Freidan was founded, an incomparably grand city created purely to maintain it.\n\nBut that is not our story.\n\nNot long ago, the world fell utterly to pieces. Freidan was the last bastion of order until it too toppled into ruin. Mysterious poison had flooded land and sea, the moon had disappeared from the sky, and an immense war had consumed the civilized world in an avalanche of political tensions hastened by conspiracy and powerful enchantments--but the manner of Freidan's demise was the strangest yet.  \n\nThe few survivors of the widespread destruction are now found only in small pockets on a poisoned, shattered world plunged back into the darkest ages of wild magic.  But unbeknownst to most, a small mismatched group is about to set out from what's left of Freidan on what may be the last adventure of all.  \n\nThe End has come, but no one lives happily, or forever it seems.  And that is where our story begins.\n\n##...After.\n\n***\n\n**Former Major (Known) Powers:**\n\nThe Northern Territories:  Mainly consists of mountains, forests, and wilderness.  Colder as one travels farther north.  Previously made up of a group of small kingdoms, tribes, and territories loosely controlled by a High King or Queen who kept them functioning as a unit and stopped major conflicts. Bordered by the Glass Mountains to the north.  The capital of this kingdom was known as Spythra.\n \nThaler (The Southern Kingdom):  Warm, consisting of plains, a lot of farmland, and wastelands to the far south. Thaler controlled a lot of the food supply.  It had a powerful centralized government based in the capital city of Risan before everything went to hell.\n\nWerault (Underwater Civilization):  Werault wasn’t exactly a kingdom, just what water dwellers call the inhabited ocean, the same way humans might say earth or world.  It’s so big that no one that close to land has ever been to or even heard of the edge, just more underwater settlements farther and farther away.  The Weraulti people on the shoreline border had a lot of money and power due to their strategic position near the land.  They allied with land dwellers to keep them from polluting or over-fishing, and facilitate trade.  They often chose selkies as representatives, even sending them to land based schools in Freidan.\n\nFreidan: Formerly a central city created to facilitate international diplomacy, inhabitants came to Friedan from all over.  It had a mostly democratic government, mainly consisting of an international counsel made of representatives appointed by their homelands, and a “Regent Elect” to oversee its operation.  Great minds congregated there to learn and teach in relative freedom from international tensions.  Friedan was the most technologically advanced place in all the kingdoms.\n\nFairies:  No one knew where they came from or where they disappeared to, but sightings of the powerful and reclusive creatures petered out to almost nothing over the centuries until stopping entirely about 70 years ago. There was a small government funded effort to locate them, which soon disappeared from the news as budgets were cut.\n\n**PSA**: Submissions are coming in fast enough that I’m going to make the cut off a little earlier than  I thought. Applications should be ready by **12:00 am EST, October 1st**. It’s a bit less than the original week, but I think choosing characters is going to get overwhelming if I wait much longer.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-10-02 05:13:45 UTC",
        "comment": "*“And if they have not died, they are still living happily today.”*\n*-‘The Twelve Tortoises’ (Collected by Franz Von Schönwerth. Mid 1800s.)*\n***\nThe End.\n\nIt came billowing poisonously through the seawater from some untraceable point in the ocean to the northwest, just beyond the Marchen Islands. Sweeping through Werault, it cut a wide, gruesome swath over hundreds of miles of ocean. When it hit the northwestern coast of the Territories, the population fled east, but the poison followed even as it thundered down the coast towards Freidan. The water was undrinkable. Food that grew from it was deadly.\n\nAs the toxin hit Thaler soil, the southerners not only assisted with food drops and supply convoys, they took in refugees from the north. The Alliance held, even as the kingdoms that had created it slowly died.\n\nSoon, the poison riddled the Northern Territories straight through to the opposite coast. Instead of fleeing to Thaler, many survivors rebelled against the crown and began a desperate, decentralized invasion of the southern lands. The fight only grew bloodier as Thaler rounded refugees up into internment compounds and fought back. The war and blight moved south, and Thaler was left as poisonous a shambles as the north. Communications from Territories dwindled until even the capital city of Spythra was silent, and Thaler followed suit. Freidan still stood. Well fortified and well stocked, it went relatively unmolested, the only bastion of hope spared by a dying world.\n\nFinally, one night, the moon failed to rise, and didn’t reappear.   Days afterwards, the water around Freidan began to clear of the poison.  Hopes soared.  A week later, the city fell.\n\n***\n\nIt should have ended in blood, should have taken months under siege for Freidan to fall. The starving dregs of Thaler and The North had already been skirmishing outside the city limits, even as they begged for supplies and equipment. There should have been someone to fight, one last battle with the possibility of a merciful victor.\n\nInstead it had ended suddenly, in fire and ice, as if the earth had gone to war with the sky. Light and darkness clashed, day and night seeming to fall into a violent rage. It began with searing heat as the sun grew  larger and brighter, appearing closer in the sky. Leaves withered, and birds in flight charred and fell. As the heat intensified, many below died of heat stroke or immolation. Water boiled sporadically in the lakebeds. In the harbor, the bodies of ocean dwelling survivors from Werault washed ashore.\n\nThick black clouds appeared, shedding bullets of hail that shattered on thick sheets of ice and hissed on hot pavement and roiling water. Steam poured over the city, capturing the deadly brilliance of the sunlight and the prongs of lightening, reflecting them in brief, mockingly beautiful rainbows like scattered opals.\n\nWithin hours, the chaos lifted as suddenly as it had fallen. The bitterly cold  storms  evaporated, and the sun shrank again. Death settled over the ruins.\n\n***\n\nIn the last surviving car of the last Solar Express subway train, dim red emergency lights guttered to life. There were only three passengers, but not an hour ago they had been treated to front row seats during Freidan’s demise. Speeding through the city, darting into the open air at times to see the destruction, then back into in the relative shelter of tunnels below, they had been able to elude the deadly aboveground environment. Of course, the tunnels were only safe until the earth began to shake and crack open. The resulting crash had destroyed every car but the last, leaving its occupants in various states of collapse.  One man slumped against a wall under a long curtain of black hair.  Another had been thrown to the floor, where a small bird fluttered dizzily beside him.   In the small booth meant for the handicapped and those with particularly delicate tails, wings, or other appendages, a young Harpy woman huddled, twined in safety straps.\n\nAround them, the world was tinged red, illuminated by the back-up lighting of the damaged train car. Through the windows, a curiously intact stretch of very old tunnel could be seen, lined by large stone bricks covered in dingy peeling paint."
    },
    {
        "game_pid": "pb156t",
        "story_name": "Holiday Membership Raffle",
        "post_title": "**Update: Everybody won. We found enough memberships for all 19 people who signed up, and since there have been no entries for about 5 days, we've closed up shop and given one to everyone. Hoping to do this again next year!**\n\nHi there! In the festive spirit, some Storium members are getting together to give away 12 Storium memberships, each one year long (if anyone wants to donate more, let me know! No need to exchange personal information.) Drawings will be every Saturday starting December 4th and going until January 1st. We'll give away two memberships with each of the the first four drawings, and four memberships on Jan 1st.\n\nAll dates (EST): Dec.4, Dec. 11, Dec 18, Dec 25, Jan 1.\n\nPlease POST IN THE LOBBY to enter the raffle. Drawings will come from there. I'll assign numbers to entries and put them through a customized online dice roller. After that, [Storium has an easy gifting option](https://storium.com/give) we only need a winner's Storium username to use, so no personal information is exchanged. Hope this sounds fun! \n\nAll you need to know to enter:\n\n1. To sign up, post a reason you like Storium in the lobby.  I'd like to put the quotes together and post them in the game (all credited), but if you'd rather I not do that with yours, leave a note.\n\n2. *Please* only enter once under one account. This is a pretty darn real amount of money and I'd really like everyone to have a fair chance.\n\n3. Even if you're not entering the raffle, posting reasons you like Storium in the lobby is very much encouraged! Just leave a note telling me not to include you on the spreadsheet.\n\nThat's it, good luck!\n\n**11/29 Update: @Ssieth is also adding a membership, so we are now giving away 6 memberships \\o/ Anyone else who wants to contribute, let me know!**\n\n**11/29 Update: @Rattannah and @Firebirdschild have joined the giveaway, bringing the total memberships given away up to 10, woo! We're hoping for someone to foot the bill for one of them, but they'll all be covered either way.**\n\n**12/2 Update: @Furare has stepped in to pay for the tenth membership we were hoping someone would   step up for--holding steady at 10!**\n\n**12/4 Update: @Neverhall has donated 2 more memberships for a total of 12!**\n\n**12/8: @Zinzerena and @Milgrim have chipped in, and that brings us to critical mass! EVERYBODY WINS!**",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2021-11-30 21:40:24 UTC",
        "comment": "Hi all! Thank you to everyone that commented, it’s really wonderful to see--I’m going to post some quotes now, since I’m guessing there will be less as time goes on. Please feel free to post quotes in the lobby even if you are not entering the drawing, just leave a note for me saying not to add you to the spreadsheet. Special thanks to people who have joined the raffle to donate more memberships, @Rattannah, @Ssieth, @Firebirdschild, and @Furare!\n\nFirst drawing coming up on December 4th 🥳\n***\n***\n\nI joined storium a few months ago, because I wanted a new place to write. I thought it was just going to a dead site with nothing going on, but it was actually really nice. The community is just amazing and the creativity and effort that goes into the game is amazing too.\n[xX_Del_Xx](https://storium.com/user/xx_del_xx)\n***\n\nI’m still new to Storium, but already I can tell it’s a great community on a great platform! The website is set up conveniently and the concept is genius!\n[CaptainParty](https://storium.com/user/captainparty)\n***\n\nI’ve been on Storium for a little over two months now, but I’ve already met some amazing people. I really enjoy the collaborative aspect of Storium and how one person can start with one idea, but after playing a game with others, it can branch off into a totally different, even better direction! I think that’s amazing, and it brings the game back to its roots, writing with other people.\n[Latte1](https://storium.com/user/latte1)\n***\n\nI’ve been on storium just a bit over one year and joined as a way to improve my writing and connected with other skilled writers which has been a rather success in that way. It forces me to improvise and improve as I learn to work with other people’s style and write from different perspectives.\n[Jaspericorn](https://storium.com/user/jaspericorn)\n***\n\nI’ve been on Storium for only a little while now but I’ve already found myself welcomed by such an excellent and creative community and I feel that it’s really inspired me to improve my writing! It’s also been a way for me to connect with other authors and learn about different writing styles while having fun and making both stories and friends.\n[sleepyrune](https://storium.com/user/sleepyrune)\n***\n\nI’ve been on Storium for only a short while but I love it. It’s filled with wonderful people and gives me the freedom, creativity, and a site to express myself. I have been looking for a place to improve my writing for a while and I found it here! Hope I win the raffle, this seems fun :D\n[BlazeTheMonkey](https://storium.com/user/blazethemonkey)\n***\n\nStorium narrators challenge me to research futuristic technologies and historical anecdotes to include in my character posts. It takes a great deal of real-world knowledge to write good fiction.\n[Wyldspace](https://storium.com/user/wyldspace)\n***\n\nAw, this is such a sweet idea! I hopped onto Storium a month ago and was absolutely inspired by the fascinating meld of writing and game mechanics, and even more so inspired by the creative ways narrators and players have utilized that system to create interesting, fun stories and games (and newsletters! And raffles!). Already within my first games I met people who were so incredibly kind and encouraging, and really met that social need I was craving during this time in history. I’m excited to see where my journey here takes me. Happy holidays!\n[Thewillowstorm](https://storium.com/user/thewillowstorm)\n***\n\nPlaying on Storium has given me the opportunity to not only have players explore my world, but to explore other player’s stories as well, and see their worlds. I’ve participated in games in genres I’d never have thought I’d have tried otherwise, and it’s helped me grow as a writer.\n[CraftmasterMatt](https://storium.com/user/craftmastermatt)\n***\n\nI’ve been on storium for just a few months now, but one thing I instantly adored about the platform was its simplicity . It’s been so easy to browse games, look for help, and communicate/collaborate with other players in the games since the moment I started. Storium really has changed the entire collaborative writing experience for me.\n[Layz](https://storium.com/user/layz)\n\n***\nYou know what makes me jump on and play around in Storium?\n\nTHIS\n\nPeople like you mate who are all about bringing communities together and giving back to those who helped and supported you.\n\nI have been on Storium since August, when a really dark and bad time of my life erupted and tried to take hold. (I am not going to bore or going into it)\n\nBut since being on here I have since found the Light and a sense of community that is strong in its support for one another and strengthens each other in a way that society tends to frown on in this current social climate.\n\nStorium has helped me fight back my darkness, and for that I am ever truly grateful for not only the people here, but also the creators of this place.\n\nThankyou all.\n[NeverWolf](https://storium.com/user/neverwolf)\n***\n\nI found Storium while looking for a game with a story or a game for an author who doesn’t want to be shoved into a box of hit bad guy, move on to next bad guy. When I saw this site, I ignored it for a hot minute because it sounded to good to be true. I finally gave in to clicking, and I’m so glad I did. After finding a wonderfully inviting community and a roleplay style that encourages me to come out of my comfort zone, I won’t even think about leaving anytime soon.\n\nBest of luck to everyone!\n[FireFoxTale](https://storium.com/user/firefoxtale)\n***\n\nI’ve always loved writing and making up stories and characters. One of my favourite childhood games was where the whole family passed around a story prompt, building upon it until we have an epic adventure!\n\nI’ve searched around for “collaborative writing games” for a long time and it was only a few months back that I chanced upon Storium.\n\nI’ve met a whole bunch of awesome creative writers and been exploring a whole new side to my writing skills! I have definitely grown in confidence to step out of my comfort zone in writing! So far I’ve loved the experience!\n[Kyoko](https://storium.com/user/kyoko)\n***\n\nI honestly don’t know how I stumbled upon Storium, but I wonder now how I ever got along without it. I, of course, joined as a member from day one because I couldn’t get enough. I hope to be a part of this community for years to come. / Everyone is really nice and supportive. The stories are amazing and I feel right at home. Sometimes we all need a place to escape to a different reality and for me, that has become Storium (and my Stephen King books)\n[Drucellia](https://storium.com/user/drucellia)\n***\n\nStorium is a gem; the community here is just incredible and, like Layz said, the brutal simplicity of this website is just golden. I’ve been addicted the moment i made an account. Thanks for coming up with this idea, @stlhood.\n[PeetTheSockMan](https://storium.com/user/peetthesockman)\n***\n\nNot entering, as I’m not going to use all of it due to the fact that I’m taking a break from Storium around May… just getting in on the fun! :D\nI found Storium after using StoriumEDU with my friends, and I immediately started to love it. I loved the community element of it, and the fact that you could start any story on here and bring others into your world. The game elements just brings the writing out to a whole new level, and adds a very interesting element to the story. There are so many different ideas, and so many amazing writers and people on this site.\n[Blackmoon](https://storium.com/user/blackmoon)\n***\n\nHello! I found Storium just a few days ago and it’s proven to be an incredible place for me to regain my writing muse and to meet other people who are passionate about writing as well!\n\nI, unfortunately, cannot afford a membership for Storium so I’m jumping on this opportunity to hopefully be one of the winners.\n\nThank you for both of your generosities and I hope you both have an amazing holiday season! :)\n[Galaxtia](https://storium.com/user/galaxtia)\n***\n\nHey! I’ve been on Storium for a while now, and I absolutely love it. I find amazing people, who are GREAT writers, and even better friends. There’s hardly any drama, unless it’s in the stories. I love the teamwork people work in!\n \nI cannot afford a Storium membership, so I’m hoping that I might be one of the winners.\n❤️ Happy Holidays! :D\n[Aubrey11](https://storium.com/user/aubrey11)\n***\n\nHello - not entering but lurking :)\nAnd what makes me play storium? I love the mix of games - from the literature end to the pulpy RP end and all the way in between. But… the big draw is the people - storium has such a fantastic, diverse group of players :)\n[Ssieth](https://storium.com/user/ssieth)"
    }
]