[
    {
        "game_pid": "e887nx",
        "story_name": "Storium Comics: Eldritch Mysteries",
        "post_title": "Superheroes! They've taken the world by storm! Their movies flood the market, every few months giving you another adventure that you have to watch, and if you miss one you're going to be confused when the big crossover comes around. Such a lush universe that all the connections can be hard to follow.\n\nAnd don't even get started on the comics. Something in Magical Punchman #21 is relevant to the plot of American Supergroup Annual #5, and in order to fully understand both of those you have to read General Mayhem #214. So many connections can give you pause.\n\nBut what if you got to make that universe? What if you made the city and the stories? What if you were the one to discover the magical artifact that the science heroes investigated? What if you got to define what the Super Lab was, or who their equivalent of Nick Fury or Amanda Waller is?\n\nWelcome to Storium Comics, a continuous super universe that hopefully will continue over multiple games with different heroes going on different adventures. Each scene will be a different comic issue, with the stories being rather episodic, even if they build to a bigger story.\n\nFor our first series, we bring you Eldritch Mysteries. This series focuses on magical heroes and mythological beings. Our focus ranges from our John Constantine and Dr. Strange sorceries to your Wonder Woman and Thor mythological figures. Expect hidden orders using ancient magics, creatures that defy scientific understanding, and dark gods willing to mess with your day.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2020-02-04 05:58:09 UTC",
        "comment": "#Eldritch Mysteries #1\n#The Power of Symbols\n>The cover of this issue shows Ala, Frode, Salem's Wrath and Skatter, [posing in a diamond shape](https://i.dailymail.co.uk/i/pix/2015/10/24/23/2DBE654900000578-3288070-For_40_years_Bohemian_Rhapsody_has_been_one_of_the_world_s_favou-m-10_1445726787002.jpg) in a  purple miasmic void.  The human heroes' eyes are completely white, and on their foreheads (and on Skatter's bulb) is an [occult looking symbol.](https://vignette.wikia.nocookie.net/silent/images/1/15/Halo_of_the_Sun.png/revision/latest?cb=20141021093719)\n>\n>Beyond the title, dramatic text reads \"The Sisters of Eden! Corrupted by darkness in their first book!?\"\n\nThe comic opens on a panel of New Eden, Maine. The city is familiar to those who have read Storium Comics. Despite looking like the quaint coastal town one might expect from Maine, the sprawling city was a hotbed of activity.\n\nThose who read mystical comics knew the city was right on a nexus of ley lines, causing an influx of supernatural circumstance. Those who focused on the more scientific heroes saw this simply as another super city with portals to other dimensions. Whatever the circumstances of this strangeness, the city attracted people of all kinds. \n\nIt was a place of pilgrimages, that shining city on the hill where people of all beliefs and faiths came to experience the supernatural. That shining city being somewhat literal from two iconic features: The Glass Cathedral that glimmered like a rainbow from the stained glass windows, and the New Eden Lighthouse off the coast.\n\nThe comic focuses in on the New Eden Shopping Center, [music playing in the background](https://youtu.be/D__6hwqjZAs). Various people walk past shops, including a single panel showing Devin Murphy as she casually walked through the mall. Finally the overview of the mall came to a stop as the panels focused on a pair of cops eating at the outdoor food court.\n\n\"And then he died.\" One officer said. The second officer shook his head.\n\n\"Seriously? You're going to pull that again? Every time you tell a story about the heroes you always say 'and then they died.' It's getting really old.\"\n\n\"No, really.\" The first officer continued. \"He was helping out with disaster relief and when the aftershocks hit San Panchito he died when he was protecting some civilians-\"\n\n\"The Heir isn't immortal! How can you say-\"\n\nThroughout the panels of the argument, figures had been approaching in the background. The officer had been cut off as a hand suddenly grabbed the back of his head and slammed him against the table.\n\nThe other officer reached for his gun, only for his arm to be grabbed by someone else: The table was surrounded. They weren't surrounded by costumed villains however. They were surrounded by normal humans, strange symbols on their forehead, their eyes fully white.\n\n***\n\nGunshots rung out in the air. People ran in fear from the possessed civilians, who held various weapons they had liberated from the police. They shouted orders, barking in unnatural pitch for people to get down on the ground. Some of the unarmed attackers grabbed those who dropped and dragged them away.\n\nStanding at the front of the group was a man with a shotgun. A magical aura came off of him like heat off a blacktop."
    },
    {
        "game_pid": "ze82na",
        "story_name": "Disney Villains Victorious",
        "post_title": "This is a world where Happily Ever After never happened. Ever.\n\nAll around the world, heroes have fallen or have never risen up. The world has fallen to darkness, some places worse than others. Villains have conquered and twisted their lands in their image. It is a world where Ursula rules the seas and deals with the East India Trading Company. It is a world where Shere Kahn and Scar stalk the jungles, and where Dr. Facilier's spirits roam the Louisiana Purchase. It is a world where Pope Frollo burns the French and Spanish countryside with Inquisitorial flame, and Cheraobog rules a wasted land in Eastern Europe.\n\nBut this is not a world void of hope. Around the world, humans, animals, and everywhere in between all work together to topple the villains that would rule them, just like you.\n\nCan you earn your Happily Ever After?",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2018-11-20 06:07:18 UTC",
        "comment": "Alone in his room with his thoughts, the man in the burgundy coat [listened to his music](https://youtu.be/QAo_Ycocl1E) as his mind ran through the terror of the day. Being on the run was his life, but nowadays everything seemed much more dangerous...\n\n\"So, how are we going to get out of this mess?\"\n\nThe man in the burgundy coat looked down from the ceiling above his bed to look at the duck standing in the doorway.\n\n\"Get out of this mess?\" The man scoffed. \"Everything is a mess. At this rate the only place that isn't a hellhole is probably beyond the edge of the galaxy.\" He reached over to pause his music, causing the room to fill with a tense silence.\n\n\"The edge of the galaxy? So what, are you going to run away?\" The duck asked, his voice raspy and his arms crossed, not moving from the doorway. The man in the burgundy coat let out another scoff.\n\n\"I'm not running. We just need to...\" He held his hands in front of him as he searched for the words. \"We need to hide out. We need to take this ship and get as far from trouble as we can. Lay low until we can figure something out.\"\n\n\"We've already been doing that for months now.\" The duck responded, stepping into the room and closer towards the man. \"We fight, we make some progress, we get pushed back, we hide. This isn't going to work.\"\n\n\"Then what do we do!?\" The man shot up, \"It's just the two of us out here. Everywhere I've called home is either destroyed or just as bad as everything else. We don't have anywhere to go...\" He said, his anger subsiding as he sat back down, defeated.\n\n\"You're right. It's just the two of us.\" The duck responded, \"But we're not alone. There are other people out there. People who still want to be heroes. We just need to find them.\"\n\nThe man in the burgundy jacket stared at his hands, took a few deep breaths, and released them with a sigh.\n\n\"So, where do we start?\"\n___\n\n[\"Out on the open ocean!\"](https://youtu.be/8TTUBMTInVE) The voice of a fresh faced sailor rang out across the decks of the Barracuda. The East India Trading Company ship was travelling across the Indian Sea, heading south after a few visits to ports under the control of Agrabah.\n\n\"Don't you just love the salty air? The rolling waves? It's so peaceful.\" The sailor continued, only to silence himself at the glare of the first mate.\n\n\"It is only so peaceful because the Sea Witch wills it so.\" The first mate said, his voice sharp, his gravitas weighing down on the sailor's shoulders. \"If any of us were to earn her ire, there's a risk that this entire ship might be struck down. Especially if she learned someone she personally hated was on this ship.\"\n\nThe first mate walked along the upper deck, looking over the various sailors doing their work. As his eyes scanned, he would stop on the few 'guests' he could see milling about.\n\n\"It's why I don't like being on a ship that allows for people to charter passage. We don't know their story. Any one of them could be the target of an angry Sea Witch... Any one of them could secretly be a pirate...\" \n\nThe first mate walked off, leaving the cowed sailor to his devices. \n\n\"...Maybe that's why it looks like a fog bank is rolling in...\""
    },
    {
        "game_pid": "3y5q3k",
        "story_name": "Storium 103: Monster of the Week",
        "post_title": "Coming soon to a TV near you: Monster of the Week! Follow a group of heroes as they travel the country, investigating horrible mysteries and fighting the creatures that exist under the bed and in the closet. They may be an unlikely group, but can their friendship survive the mission? Or will the mission be thrown by their incompatability? Find out on Monster of the Week!\n\n___\n\nWelcome to Storium 103! Don't worry, this is not a class in a series, but just another beginner game. In this game you will play as a group of monster investigators to the tune of Supernatural, X-Files, and Buffy. Some of the writing styles will even reference cuts and other such TV references.\n\nIn the process of playing this game you will get an overview of how Storium works. In the full course you will learn:\n\n-How to make a character\n-How the various types of cards work, including neutral cards\n-How challenges work, including special rules a narrator might add to challenges\n-How to strategize and work challenges using the game and card rules of Storium\n-How to ignore the game and let this be a collaborative writing experience.\n\nBeginners be warned: Many Beginner games are more \"drop in, drop out\" allowing for you to get your feet wet and see if Storium is for you. While those games are good and have their place, I generally design mine to have a more direct story and a thought process to teach the players.\n\nIf you do not want to stick around for a full game, this may not be the game for you.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2017-01-01 18:51:35 UTC",
        "comment": "##Stay tuned for the Season Two premiere of Monster of the Week, starting in 3... 2... 1...\n\n___\n\n#LAST TIME ON MONSTER OF THE WEEK\n\nAs a rock song plays, the camera focuses on the building of the Bureau of Paranormal Affairs, in the middle of nowhere and behind several fences.\n\nCut to agent Becky Carter, standing in front of the desk of the mysterious head of the BPA, his face always just off screen. \"This is what you're doing? A ragtag team like this can't work together.\" \n\nThe man behind the desk laughs. \"I know what I'm doing, Agent Carter. Have a little faith...\"\n\nCut to Adrien Ashwood in chains in the back of a police van. Cut to Carter tossing a file down on an interrogation table. \"You're lucky that the BPA stopped it's kill policy a few years ago...\"\n\n___\n\n**Hello, and welcome to the first scene! Let me get your acquainted with the main game layout first. At the top left you have the tabs going between the game screen (seen here) and the the green room, which you've already seen.**\n\n**Along the left you have the character portraits of the cast of the game, along with a link to my profile. Clicking on a character will show all the cards that character currently has. Clicking on the character name will open to their profile, where you can read the background as normal.**\n\n**At the center top you have the picture and title. Clicking on it opens a drop down menu of the game information, like seen on the main tab of the Green Room.**\n\n**To the right you have the Commentary, which is an in game chat. For a fully\u007f public game, anyone can see the chat. You can use this to discuss and joke about the game, and give legitimate commentary.**\n\n**Here, of course, is the actual game. You have the text of the actual game. Above it, the narrator may have a location card and/or a picture showing the scene. Clicking on a location card will give more information about the location in question. On the right side of that you have the various challenges for the scene, which are narrative obstacles your characters encounter. Other things can appear there too, though they will be covered in the future.**\n\n**You'll also see buttons where you can post as well. Make A Move is the one you hit to... Well, make a move. You'll also see Nudge buttons, one for the Narrator and one for the Players. These buttons will send an alert to the use in question. That being said, Storium etiquette sees these buttons as last resorts. Since posting in the green room, commentary, or in the game sends alerts to everyone, and typing @player name in the commentary alerts that player specifically, nudge buttons are seen as somewhat passive aggressive and impatient.**\n\n**At the bottom of the page you have the Activity Tracker. That basically shows everyone's game activity. When people have posted, how many posts they've made, how many cards they've played this scene, etc.**\n\n**Now, for the actual explanation of gameplay. When you make a post, you can type whatever you want. It's like normal text roleplaying. You make a post controlling your character (or others, with permission) that advances the story. That being said, Storium has more actual gameplay than just text RP.**\n\n**The way you make story progress is through the challenges the narrator sets up. These are assigned points, and that's how many cards you as a group must play in order to pass the challenge. In general, you can't narratively complete a challenge until all the points have been played with your own cards. When you post, you can see a button to choose a challenge, and then you can play cards to those challenges.**\n\n**For the sake of this first post, we are going to deal with subplots. These are cards that represent your character's drive. They are what your character desires in the story.**\n\n**For this post, play your subplot card on this challenge. Then make a small scene, a little flashback vignette, somehow showing your character's subplot.**\n\n**If you have any questions, please feel free to ask in the Commentary or Green Room.**"
    },
    {
        "game_pid": "6xwyy4",
        "story_name": "Monster of the Week: A Beginner's Guide to Monster Hunting",
        "post_title": "Coming soon to a TV near you: Monster of the Week! Follow a group of heroes as they travel the country, investigating horrible mysteries and fighting the creatures that exist under the bed and in the closet. They may be an unlikely group, but can their friendship survive the mission? Or will the mission be thrown by their incompatability? Find out on Monster of the Week!\n\n___\n\nIn this game you will play as a group of monster investigators to the tune of Supernatural, X-Files, and Buffy. Some of the writing styles will even reference cuts and other such TV references.\n\nIn the process of playing this game you will get an overview of how Storium works. In the full course you will learn:\n\n-How to make a character\n-How the various types of cards work, including neutral cards\n-How challenges work, including special rules a narrator might add to challenges\n-How to strategize and work challenges using the game and card rules of Storium\n-How to ignore the game and let this be a collaborative writing experience.\n\nBeginners be warned: Many Beginner games are more \"drop in, drop out\" allowing for you to get your feet wet and see if Storium is for you. While those games are good and have their place, I generally design mine to have a more direct story and a thought process to teach the players.\n\nIf you do not want to stick around for a full game, this may not be the game for you.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2018-01-20 16:51:32 UTC",
        "comment": "##Stay tuned for Monster of the Week, starting in 3... 2... 1...\n___\n#Previously on Monster of the Week\n\nIntense music plays over a shot of Wynn sitting in an office meeting room, looking out of place considering the other people in the room are in suits.\n\n\"Ms. Danforth, it doesn't matter what The Agency is or who we are. What matters is that, if you want to keep on hunting monsters, we are going to be the ones signing the checks.\"\n\nAs he talks, the voice over continues over a scene of Ron and Abby staring down into a fire they apparently just caused, both looking beat up.\n\n___\n\n*Hello, and welcome to the first scene! Let me get your acquainted with the main game layout first. At the top left you have the tabs going between the game screen (seen here) and the the green room, which you’ve already seen.*\n\n*Along the left you have the character portraits of the cast of the game, along with a link to my profile. Clicking on a character will show all the cards that character currently has. Clicking on the character name will open to their profile, where you can read the background as normal.*\n\n*At the center top you have the picture and title. Clicking on it opens a drop down menu of the game information, like seen on the main tab of the Green Room.*\n\n*To the right you have the Commentary, which is an in game chat. For a fully\u007f public game, anyone can see the chat. You can use this to discuss and joke about the game, and give legitimate commentary.*\n\n*Here, of course, is the actual game. You have the text of the actual game. Above it, the narrator may have a location card and/or a picture showing the scene. Clicking on a location card will give more information about the location in question. On the right side of that you have the various challenges for the scene, which are narrative obstacles your characters encounter. Other things can appear there too, though they will be covered in the future.*\n\n*You’ll also see buttons where you can post as well. Make A Move is the one you hit to… Well, make a move. You’ll also see Nudge buttons, one for the Narrator and one for the Players. These buttons will send an alert to the use in question. That being said, Storium etiquette sees these buttons as last resorts. Since posting in the green room, commentary, or in the game sends alerts to everyone, and typing @player name in the commentary alerts that player specifically, nudge buttons are seen as somewhat passive aggressive and impatient.*\n\n*At the bottom of the page you have the Activity Tracker. That basically shows everyone’s game activity. When people have posted, how many posts they’ve made, how many cards they’ve played this scene, etc.*\n\n*Now, for the actual explanation of gameplay. When you make a post, you can type whatever you want. It’s like normal text roleplaying. You make a post controlling your character (or others, with permission) that advances the story. That being said, Storium has more actual gameplay than just text RP.*\n\n*The way you make story progress is through the challenges the narrator sets up. These are assigned points, and that’s how many cards you as a group must play in order to pass the challenge. In general, you can’t narratively complete a challenge until all the points have been played with your own cards. When you post, you can see a button to choose a challenge, and then you can play cards to those challenges.*\n\n*For the sake of this first post, we are going to deal with subplots. These are cards that represent your character’s drive. They are what your character desires in the story, or at least some desire outside of the main story arc.*\n\n*For this post, play your subplot card on this challenge. Then make a small scene, a little flashback vignette, somehow showing your character’s subplot. It can be a scene dealing with what happened (such as Wynn having a scene involving her sister) or something later in the story (such as Wynn doing something which shows that redemption is more important to her than her revenge.)*\n\n*If you have any questions, please feel free to ask in the Commentary or Green Room.*"
    },
    {
        "game_pid": "3amwhz",
        "story_name": "The Greeting Card Detective Agency",
        "post_title": "The town of Good Samaritan, Colorado has been described as picturesque, with its nearby access to ski slopes, friendly people, and general aesthetically pleasing nature in its old buildings. It’s that type of small town charm where the you might feel like everyone knows your name.\n\nBut even the friendliest small towns can have their problems. Old family grudges might come to a head, newcomers might come in and make an uproar, and the mayor occasionally makes poor decisions to revitalize the town.\n\nEven with those problems, you love the town. You’ve even made it your personal job to root out these problems when they show up. You might not have a badge, but you see it as your duty and your hobby to investigate the mysteries of this city and bring the truth to light!\n\n___\n\nThe Samaritan Falls Lodge is your one stop shop for wilderness fun. A ski resort during the winter and a wilderness campground during the summer, Samaritan Falls turns the nearby town of Good Samaritan into a quaint tourist trap, along with injecting a bit of money into the local economy.\n\nMany people in the town respect the lodge. Not only does the little bit of attention from tourists help the local businesses, but many residents see the lodge as a refuge for nature, a place that protects the patch of wilderness around it from those who would exploit it.\n\nThis year Summer has finally arrived. Dominic Pine, owner and proprietor of the Samaritan Falls Lodge, hosts his annual Summer Season Welcome Party. Citizens of Good Samaritan and the first few guests of the season come together to eat, drink, and celebrate nature together up at the lodge.\n\nFor many it's a way for the town to celebrate the arrival of Summer.\n\nThis year, it'll be the chance for the town's busybodies to solve an unfortunate case of murder.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2021-06-08 05:09:28 UTC",
        "comment": "Good Samaritan, Colorado.\n\nThe kind of town where everyone knows your name. A beautiful town surrounded by nature. Small, uneven roads crisscross between small treelined areas where the birds sing and wildlife can occasionally be spied.\n\nA car drives through the skinny residential streets, taking the turns slowly as other cars pass by on a road that seems almost too skinny for two vehicles to fit on at the same time. It finally pulls into the driveway of a cozy looking home, and out steps Elizabeth Gataway.\n\nThe young woman walks across the driveway to the front door. She lets herself in, and cries out for her grandmother as she enters. She walks through the house, still trying to get Grandma's attention, only to stop in the kitchen when she notices a piece of paper on the fridge, written in her grandmother's script.\n\n>Lizzie, I didn't know if you would arrive on time, and I didn't want to call you on the road. I know how you kids are with your texting and driving. I went on ahead to the lodge. Mr. Pine asked me to help in the kitchen. I swear, if that boy didn't hike so much my cookies would be the death of him.\n>Assuming you didn't get held up, we'll meet you up at the lodge. XOXO, Grandma.\n\nAt least driving through the town is always nice.\n\n***\n\nUp in the nearby foothills, Samira Criado walks the trails. The weather is perfect for hiking. It's warm, sunny, and a little humid from the nearby stream, but otherwise perfect. \n\nThe trail is one of the shorter ones, a fifteen minute round trip back to the lodge, with side paths increasing that trip. There is one path even claiming to go all the way to Pike's Peak.\n\nOf course, that fifteen minute trip will take a lot longer given Samira's current companion.\n\n\"Look, I'm not gonna spend the day of the Summer Celebration cooped up at home. Plus, you know I need my exercise.\" Samira's brother walks along on a pair of crutches, regaining his strength in his legs.\n\n\"Let's just go to the overlook campsite. We can look at the town, take a rest, and be right back down before things really start.\" He says. He's definitely not stopping.\n\n***\n\n\"So, how are the finishing touches going Mr. Tao?\" Dominic Pine asks as he walks to the side wall of the Samaritan Falls Lodge. Earlier in the Spring, Dominic hired Oliver to do a mural. The pitch was simple: A celebration of the lodge, the woods, and nature. \n\nAnd now both of them stand before the almost finish product, mere hours away from the official reveal to the public.\n\n\"Well well well! That's looking really nice.\" Dominic smiles as he looks over the mural. \"Thank you for doing this. I mean- I know I'm paying you. I still feel like I owe you for your hard work.\"\n\nDominic continues to look it over, \"Did you think of a name for it?\"\n\n***\n\nInside of the lodge, Alana Demarco stands with her coworkers. While this wasn't exactly bookstore work, the owner had volunteered them to help set up the party. Getting announced as the people who helped set up a major town event at a tourist attraction was free advertising after all.\n\nAnd so Alana starts her assignment of decorating, only one of a few who aren't actively mingling. It's far from heroic, but definitely a chance to people watch.\n\nFor example, standing across the way is the local sheriff, staring down at the local \"young detective.\"\n\n\"Look, if you keep trying stuff like this, your dad and I are going to have words.\" Sheriff Cordell says as he hands a second crumpled flier to Preston.\n\n\"If you're going to work as an investigator like this, there's a lot of paperwork. PI licensing and stuff. You're going to get in trouble if you do this without all the extra hoops.\" He explains. \"Do you underst-\"\n\nBefore he could finish the sentence, the chorus of *Rock You Like A Hurricane* rang out from the sheriff's pocket. He pulled out his phone and took a glance at the caller ID.\n\n\"Tell the Chief that I'm sorry she can't make it to the celebration tonight.\" He says, probably assuming that's why Preston is there instead of her. He walks outside to take the call. Maybe this call is worth investigating."
    },
    {
        "game_pid": "vs9qkj",
        "story_name": "Storium 102: The Heist",
        "post_title": "The Malachite Crown is one of the biggest and grandest casinos in all of Vegas. There is at least a cool fifty million in the vault at all times, with more cash coming in as suckers gamble their life savings.\n\nThe casino has a darker side though: The mob runs the show, and the entire operation is a money laundering scheme, with cash coming in from the usual suspects of rackets, with pimps turning in protection and drug money piling high in their vaults.\n\nFor some of you, you want revenge against the criminals. For others, you just want to play Robin Hood. Some of you want money for yourself, and some of you are thrill seekers. Either way you have gathered together for one reason: To pull the biggest heist in the history of Sin City.\n\n___\n\nWelcome to Storium 102! Don't worry, this is not the second class in a series, but just another beginner game. In this game you will play as criminals in the style of Ocean's 11, and in the process get an overview of how Storium works. In the full course you will learn:\n\n-How to make a character\n-How the various types of cards work, including neutral cards\n-How challenges work, including special rules a narrator might add to challenges\n-How to strategize and work challenges using the game and card rules of Storium\n-How to ignore the game and let this be a collaborative writing experience.\n\nBeginners be warned: Many Beginner games are more \"drop in, drop out\" allowing for you to get your feet wet and see if Storium is for you. While those games are good and have their place, I generally design mine to have a more direct story and a thought process to teach the players.\n\nIf you do not want to stick around for a full game, this may not be the game for you.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-10-16 23:28:37 UTC",
        "comment": "It was midday along the California coast, the sun shining down on a warm day. The cool breeze coming in from the Pacific made it a comfortable temperature, if a little on the warm side for any guests from the colder North.\n\nThe six guests had been invited in and sat around a long table that was big enough to sit ten comfortably, all in the shade of his seemingly open air home. Lunch was a delicious mix of fried meats, cheese and fresh fruits, served with an open bar to mix drinks.\n\nAs the meal came to a close, a African American man strode down the stairs, clad in a sharp suit. He walked over to the woman who had been playing hostess, gave her a kiss on the cheek, and softly spoke to her before she nodded and stepped away.\n\n\"Welcome, welcome. Did you enjoy your meals? The better half has been wanting to try some new ideas she got off of Food Network, so I really hope you did.\" He chuckled, walking behind the bar himself and starting to mix a drink.\n\n\"I'm really sorry I'm late. I had a business call to attend to in private, which took much more time than I expected.\" He explained, before walking to the head of the table and putting his briefcase on it. With a few clicks it popped open, and he pulled out six folders, passing one to the six guests, each having their own name written on it.\n\n\"As you know, I only hire the best for my jobs. You've all earned my eye for your skill. Inside you'll find a dossier with information on your five companions, so you can know who exactly you are working with.\"\n\n___\n\n**Hello, and welcome to Storium 102! Most of my posts, especially starting out, will be formatted like this. The top half of the post will be story, while the bottom half will be your \"lesson\" as it were. Let's start with the layout of the page.**\n\n**At the top left, you have the Game and Green Room tabs. This is the Game, and the Green Room is where you can talk like it's a forum. On the top right you have buttons to share this game on Facebook, Google Plus, or Twitter. NOTE THESE ARE USELESS IF YOU ARE IN A PRIVATE GAME, AS THOSE NOT PLAYING WILL NOT BE ABLE TO SEE IT. At the top center, you have the game portrait, and a drop down tab which will bring up the game description again.**\n\n**To the left you have all the characters made for this game, including my narrator character, and my avatar as the narrator. These show you what cards everyone has left, along with links to their character sheet.**\n\n**To the right, you have Commentary. This is the OOC chat that you have for the game. Comments made there will be made public, and kept there, unlike editable forum posts.**\n\n**At the bottom you have your game interaction buttons. \"Make A Move\" is how you post in the game, and hitting that will open up the posting box for you move. The \"Nudge\" buttons are basically for if y0u're impatient and someone else needs to make a move since you can mention someone in the Commentary with @name, using the nudge buttons is seen as extremely passive aggressive by some.**\n\n**Below that you have the activity tracker. It shows various information about challenges and who has posted when. I'll get into a bit more detail on that later on this scene. For now, let's go into the first challenge.**\n\n**When making a post, hit the \"Choose a Challenge\" button. From there you will choose a challenge, and then be told to choose a card to play on the challenge. You will choose one card, and be offered to add more to the challenge. We'll deal with multi-card plays later, so for now play only one.**\n\n**You will be using your starting Strength card for this one. A Strength represents your ability to overcome challenges for one way or another. When a challenge is completed with a majority Strength cards, the challenge's Strong Outcome is achieved, which will do something depending on the challenge in question.**\n\n**For this challenge, please play your starting Strength, and make a post that is a flashback to your character showing off their skill. If you have any questions, post them in the Commentary or the Green Room.**"
    },
    {
        "game_pid": "7eyd9k",
        "story_name": "InSpectres: A Beginner's Franchise",
        "post_title": "You've seen the commercials. You've heard the radio ads. You've read the testimonials. You've even watched the documentary TV show. You know the InSpectres.\n\nIn a world rife with ghosts, ghouls, and goblins, the Inspectres are the (privatized) front line of defense. When you've got werewolves on your property, vampires in your attic, or just a ghost that won't stop stacking your chairs when you plan on using them, these are the people you call.\n\nAnd it just so happens that a new franchise is opening in your area. That 9-5 grind isn't quite the highlight of your life. The days are long and far from enjoyable. Maybe this is the perfect place to start fresh.\n\n___\n\nWelcome to InSpectres, a game inspired by the tabletop RPG by Momento Mori Games. In this heavily structured beginner game, you play as employees of the newly opened InSpectres franchise in Arcadia, California as they open shop and go out on their first mission.\n\nIn this game, beginners will learn:\n-How to make a character\n-How the various types of cards work, including neutral cards\n-How challenges work, including special rules a narrator might add to challenges\n-How to strategize and work challenges using the game and card rules of Storium\n-How to ignore the game and let this be a collaborative writing experience.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-05-30 20:59:14 UTC",
        "comment": "In the city of Arcadia, California, a group of misfits found themselves sitting in the hallway of a Hilton, just outside a conference room. One person would enter, be in there for a few minutes, and leave, telling the next person to come in.\nEventually your turn came around, and you stepped into the conference room. Inside two people sat at the table. There was a man in a suit, who looked like the type who never smiled, ever. There was a younger woman who gave off the vibe of a college dorm's \"Floor Mom.\" There was also a camera between them, set up to look at the chair the interviewee would take.\n\n\"Hello there! Welcome to the InSpectres interview!\" The woman said with a smile. \"I'm Barbara, and this is Toby.\" She motioned to herself and the man. The man flipped through some papers, what you assumed were the various resumes already sent in, and looked up at you.\n\n\"You can call me Mr. Reaper. We are the interviewers for InSpectres. We may be the owners of the franchise, but we expect our experience to be more hands off. Those we hire are expected to run their business as they see fit, usually as equal partners. The only oversight you will have is to make sure you are doing the job and that you are spending funds appropriately.\"\n\n\"So no spending the company card to buy a gold plated yacht, alright!\" Barbara laughed, before suddenly glaring and slowly turning to look at the camera. Whoever would be reviewing these tapes must have gotten on her bad side.\n\n\"Anyways, so we've got a few starter questions, and we'll get to the meat of things, alright?\" Barbara asked.\n\nWith that a slew of questions came out. There were icebreaker hypotheticals like \"Who would win in a fight between Van Helsing and Samuel Haight? There were questions about \"Do you believe in certain occult phenomina?\" And, of course, there was \"This is your application right?\"\n\nFinally we get down to the big questions.\n\n\"What do you think is your biggest strength?\"\n\n___\n\n**Hello, and welcome to your first scene! I know that interviews aren't exactly the height of excitement, but this gives an easy way for cards to make sense for a tutorial.**\n\n**First of all, let me explain the layout of the scene page. Up top you have the game information in a dropdown menu. To the left, you have all the characters, along with the narrator. Click on a character and you can see all their cards. You can click on the name to see their bio and everything, and you can click on the player name if you wish to go to their profile.**\n\n**To the right, you have the Commentary. This can be used in different ways. It is in game chat. It is the story's version of actor commentary. It is a place to negotiate moves with other players.**\n\n**At the bottom, you have the activity tracker. I will have more on that later.**\n\n**Here in the center, you have the actual game and story. The text, of course, is the story. Some cards are used for flavor as well, such as the location under the picture. Challenges, however, are the meat of the GAME aspect of Storium.**\n\n**The way challenges work is this: When you post, you can \"choose a challenge.\" From there, you would choose a challenge (only one, if there are multiple challenges), followed by choosing to select a card by clicking the \"Play a card on this challenge\" button.**\n\n**For this challenge, you will be playing your starting Strength card. Strengths represent the positives of your character that will take them through a challenge. Each Strength gives a positive point to an obstacle. If a Challenge ends on a positive side, the person who completed the challenge gets to add a little flavor to the story about how the challenge ended thanks to their card. This will be a bit more clear in later challenges.**\n\n**For your post, choose the \"Strength?\" challenge and play your default (non wild) strength. Have your post be your character answering the question. If you want to take control of Reaper or Barbara and write them responding to you, maybe having a back and forth, go ahead! Just remember that, despite having you all posting at the same time, this is an individual interview.**\n\n**If you have any questions at all about Storium, or want anything clarified about the story here, feel free to ask in the commentary chat or in the green room. I mean this. Storium has its quirks, and there are no stupid questions. With this block of text done, welcome to Storium, and I hope you have fun!**"
    },
    {
        "game_pid": "48ec6x",
        "story_name": "Storium 104: Monster of the Week 2",
        "post_title": "Coming soon to a TV near you: Monster of the Week! Follow a group of heroes as they travel the country, investigating horrible mysteries and fighting the creatures that exist under the bed and in the closet. They may be an unlikely group, but can their friendship survive the mission? Or will the mission be thrown by their incompatability? Find out on Monster of the Week!\n\n___\n\nWelcome to Storium 103! Don't worry, this is not a class in a series, but just another beginner game. In this game you will play as a group of monster investigators to the tune of Supernatural, X-Files, and Buffy. Some of the writing styles will even reference cuts and other such TV references.\n\nIn the process of playing this game you will get an overview of how Storium works. In the full course you will learn:\n\n-How to make a character\n-How the various types of cards work, including neutral cards\n-How challenges work, including special rules a narrator might add to challenges\n-How to strategize and work challenges using the game and card rules of Storium\n-How to ignore the game and let this be a collaborative writing experience.\n\nBeginners be warned: Many Beginner games are more \"drop in, drop out\" allowing for you to get your feet wet and see if Storium is for you. While those games are good and have their place, I generally design mine to have a more direct story and a thought process to teach the players.\n\nIf you do not want to stick around for a full game, this may not be the game for you.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2017-02-09 01:50:47 UTC",
        "comment": "#MONSTER OF THE WEEK: THE MUNDANE, SEASON 1, EPISODE 14\n\nAs the episode starts after the mid season break, the title card appears reading THE ROAD SO FAR. As it fades out a soft rock song begins to play.\n\nSamara Lang presses herself against the wall of the rear of the library, dropping her research as a creature stalks at her from the shadows. A loud bang is heard and the creature practically explodes from the impact. Victor steps out from the shadows, a revolver that could be described as a hand cannon smoking in his hand. \"Samara Lang? A friend of mine says you've been looking into things you shouldn't have... We're a group that deals with just that.\"\n\nDaniel's voice takes over as a voice over as various clips are played in a montage. Daniel and Lee doing some sort of magical artistic dance more akin to a bender battle from Avatar. Garret and Thomas tearing up monsters with their other forms. Eden performing a ritual, surrounded by a stack of books.\n\n\"As much as they try to hide it, the government has their own organization for dealing with things that go bump in the night. But why would people like us, with our own drives and our own abilities, just lay down and wait for some pencil pusher from Washington to check some boxes and call in an airstrike... Everyone here has their reasons for fighting.\"\n\n___\n\n**Hello, and welcome to the first scene! Let me get your acquainted with the main game layout first. At the top left you have the tabs going between the game screen (seen here) and the the green room, which you’ve already seen.**\n\n**Along the left you have the character portraits of the cast of the game, along with a link to my profile. Clicking on a character will show all the cards that character currently has. Clicking on the character name will open to their profile, where you can read the background as normal.**\n\n**At the center top you have the picture and title. Clicking on it opens a drop down menu of the game information, like seen on the main tab of the Green Room.**\n\n**To the right you have the Commentary, which is an in game chat. For a fully\u007f public game, anyone can see the chat. You can use this to discuss and joke about the game, and give legitimate commentary.**\n\n**Here, of course, is the actual game. You have the text of the actual game. Above it, the narrator may have a location card and/or a picture showing the scene. Clicking on a location card will give more information about the location in question. On the right side of that you have the various challenges for the scene, which are narrative obstacles your characters encounter. Other things can appear there too, though they will be covered in the future.**\n\n**You’ll also see buttons where you can post as well. Make A Move is the one you hit to… Well, make a move. You’ll also see Nudge buttons, one for the Narrator and one for the Players. These buttons will send an alert to the use in question. That being said, Storium etiquette sees these buttons as last resorts. Since posting in the green room, commentary, or in the game sends alerts to everyone, and typing @player name in the commentary alerts that player specifically, nudge buttons are seen as somewhat passive aggressive and impatient.**\n\n**At the bottom of the page you have the Activity Tracker. That basically shows everyone’s game activity. When people have posted, how many posts they’ve made, how many cards they’ve played this scene, etc.**\n\n**Now, for the actual explanation of gameplay. When you make a post, you can type whatever you want. It’s like normal text roleplaying. You make a post controlling your character (or others, with permission) that advances the story. That being said, Storium has more actual gameplay than just text RP.**\n\n**The way you make story progress is through the challenges the narrator sets up. These are assigned points, and that’s how many cards you as a group must play in order to pass the challenge.**\n\n**You *cannot* narratively complete a challenge until all the points on a challenge have been filled. If the challenge is \"grab the macguffin\" the macguffin isn't safely grabbed until the challenge is complete. If the challenge involves capturing and interrogating an enemy, you cannot capture and get the information until the challenge is complete.**\n\n**When you post, you can see a button to choose a challenge, and then you can play cards to those challenges.**\n\n**For the sake of this first post, we are going to deal with subplots. These are cards that represent your character’s drive. They are what your character desires in the story.**\n\n**For this post, play your subplot card on this challenge. Then make a small scene, a little flashback vignette, somehow showing your character’s subplot.**\n\n**If you have any questions, please feel free to ask in the Commentary or Green Room.**"
    },
    {
        "game_pid": "1z4g7a",
        "story_name": "Tragedy Looper: The First Tragedy",
        "post_title": "You have the power to travel back in time. You're not entirely sure how and why you've gotten this power, but it doesn't matter. You have this power and you're using it.\n\nHowever, now and then, tragedies occur where you are deeply involved. Your typical reaction is to travel back in time and behave differently so the tragedy doesn't happen. Up until now, that has worked well enough. However, this time, something is different.\n\nWhatever you do, it seems the tragedy is intent on happening anyways, in other ways, with other methods, or something else horrible happens instead. So naturally, you go back again.But to no avail; it still happens. So you go back and repeat and go back and repeat, again and again and again... but the spiral of tragedy seems to be unstoppable.\n\nGoing repeatedly back in time, you notice two things. The first is that someone, somewhere, is pulling the strings for tragedies to happen. The second thing is that there are other individuals who also keep travelling back, trying to avoid the same horrors. These are your friends.\n\nYou must work together. If not, the tragedies will keep occurring, and none of yo\u007fu will be able to get out of this with a happy\u007f life. This is your fight. Thi\u007fs is your duty.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-07-18 05:30:32 UTC",
        "comment": "#May 6, 2016\n#Loop One, Day One\n\n**The small town of Fujinuma. The town was essentially a suburb of the neighboring city of Katagiri, only a short train ride away. Despite that, the town seemed to survive on its own. Local businesses ran by families thrived, and the Hinazuki shrine was always popular when festivals rolled around. The Fujinuma Hospital was even cutting edge despite being for a smaller town.**\n\n**Some would say this town was idyllic. Despite some eccentric folk, people got along and helped each other out. Rarely did anything bad beyond a kid stealing a candy bar happen. The only time anything major happened in recent history was the mental ward breakout at the hospital, and that... Well, that's been months now. Nothing came of it, and it eventually left the minds of the citizens.**\n\n**Unfortunately, every town has its secrets. Fujinuma is the center of an unseen war, unknown by even its participants. In the end, only three children can save the day. There are many stories, many scripts, many tragedies these three must stop if they wish to obtain the happy ending they desire.**\n\n**Like anything, though, this war must start with the first step. Wake up children. Golden Week may have been fun, but vacation is over. It's time to get to work.**\n___\n\n*You stood on the roof of the school. You looked out over a red tinted landscape. It reminded you of an old sepia toned movie, but the tint was clearly more crimson, as though you were under a red sun.*\n\n*The sun sped up though, and day turned to night and night turned to day. This was the 7th now. Around you, you saw shadowy silhouettes, but one was standing in the center of the roof. Another walked in from the inside of the school and drew what looked like a gun. Two shots rang out, and the first figure was dead.*\n\n*The day sped up again, most of the silhouettes moving at an increased pace. The one with the gun just vanished, and the dead one stood back up. Day turned to night and night turned to day, meaning that this must be the 8th. The once dead silhouette turned and walked over to the edge of the roof. Their movements were slow, intentional. One leg over the rail, the other over the rail. One step forward. You watched as the silhouette fell, going closer and closer to the ground until-*\n\nTaro was awoken by the feeling of chalk slamming into his head. The teacher glared at him for sleeping in class. \"Mr. Hachikuji, if you are going to sleep in this classroom, please do it during lunch.\"\n\nIt was at that time the bell rang for lunch. Such perfect timing. You pulled out your pocket watch. Three hours. Three loops. You needed to tell your friends. Too bad they weren't in your Freshman class like you...\n\n___\n\n*Dear Diary,*\n\n*I remember when things were easier. You would see an old lady get clipped by a car, then go back and stop her from crossing the street. It was much simpler.*\n\n*Now, the mysteries are crazy. First that unstoppable hospital break out, and now this? We've got a murder on Saturday and a suicide on Sunday, and those are just little incidents that I'm not even sure are related to the actual mystery.* \n\n*On top of that, I hear about a serial killer on the news, horrible rumors around town, and my own investigation makes me think a family friend might be involved. I don't know what's going on yet, but I have to go back. I have to stop it.*\n\nKyoto was never sure who wrote the diary entries. Had she already gone through a loop and somehow not remembered it?  Was this another her from a reality where she didn't have her friends? Was this someone else entirely?\n\nIt didn't matter. This meant that something bad was on the horizon, and something really bad by the sounds of it.\n\nThe lunch bell rang. Time to go meet with her friends.\n\n___\n\n*BZZZT BZZZT*\n\n*The screen lit up as you unlocked your phone. A few swipes and taps and you found yourself at the \"Time Loop\" app your grandfather had made. The chibi figure of an animated maid appeared saying \"Welcome back master! We have some people of interest for you to look at.\" A series of cards appeared before you, with pictures and names on them.*\n\n*Makoto Ishihara: Male, Student at Fujinuma High. Current Location: Fujinuma High.*\n*Sakura Shimada: Female, Student at Fujinuma High. Current Location: Fujinuma High.*\n*Akane Shinomura: Female, Student at Fujinuma High, Shrine Maiden at Hinazuki Shrine. Location: Fujinuma High.*\n*Officer Genta Sugita: Male, Police Detecive. Location: Katagiri Police Department.*\n*Sho Naganishi: Male, Office Worker. Current Location: Kirijo Pharmaceuticals.*\n*Doctor Junpei Hirohito: Male, Doctor of Medicine. Current Location: Fujinuma Hospital.*\n\n*\"I'll be sure to tell you if anything important changes! Thank you for your continued service!\" The maid bows before the phone goes back to locked.*\n\nAkira locked his phone before his teacher noticed. Another incident on the horizon. The school bell rung, and the composed male was out the classroom door. He had his friends to meet with."
    },
    {
        "game_pid": "2hz9m5",
        "story_name": "Dreadful Secrets of Candlewick Manor",
        "post_title": "All your life you've been an orphan... Well, at least as long as you can remember. Getting shoved around from orphanage to orphanage, getting bullied, getting ignored. You had trouble making friends. You had trouble getting adopted. There was something off about you. Something... Creepy. That sort of upbringing causes cynicism to grow, a healthy shell to protect you from the cruelty of the world...\n\nThen the man in the black car came. He spoke to your home's director, showed him something in a briefcase, and with an enthusiastic nod dragged you out of your room and into the car.\n\nHe said you were being taken to a new home. You would get your own room, hot meals, new friends. It would be just wonderful. He seemed more happy to get you out of his hands.\n\nAs the car crested over the hill, you found yourself looking out over the beautiful vale. It seemed strange, like it was stuck out of time. For a brief moment, even as you noticed that the mountains around the valley seemed like the jaws of a giant venus fly trap, you felt hope for the first time in a long time.\n\nIs hope what the fly feels before the trap's jaws slam shut?\n\n___\n\n**The Dreadful Secrets of Candlewick Manor is a story inspired by the RPG of the same name, and it in turn was inspired by Twin Peaks and A Series of Unfortunate Events.**\n\n**This is a darkly comic game that follows a group of orphans as they arrive at an orphanage near a small town. They go on various misadventures, discovering the secrets of the town, all while something tingles in the back of their skull... Something in this town is familiar.**\n\n**Imagine, if you will, the Addams Family children being orphaned and sent to the town from Hot Fuzz, all while solving mysteries and conspiracies with maybe a bit of supernatural flair, and you've got the tone for this game.**",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2017-01-28 00:28:51 UTC",
        "comment": "#Episode One: Catalyst\n\n*As you begin to read this story, I will put forth a warning: This story will be an unpleasant one. This is a story about answers. These answers are not necessarily sought out, and frequently are not desired when finally discovered. Unfortunately for the children of Candlewick's Home for the Unfortunate and Unloved, these answers are the only threads they can grasp on in the drowning sorrow of their despair.*\n\n*Now, I make no claims that you should avoid this story. I am not some grim children's author with a dark sense of humor, using curiosity and irony to get you to read the story. Nor will I accuse you of being a salacious sadist or a massive masochist. You read the description. You know what you're getting into.*\n\n*Unlike that other author, however, I make no promises that these children are truly the heroes of our tale. They may be the protagonists, as followed by the definition of \"A force of change in a story,\" but they are not happy folk, and may not even save the day. In fact, they may even make it worse.*\n\n___\n\nOur story begins on a winding mountain road. The tall, grey peaks of stone blocked all line of sight beyond them, making any ride through the pass a bit dull. The January weather hadn't given these mountains much snow this year, which made the pass even duller. The road could be seen stretching out between the curves, but beyond that there were no sights to see. It didn't help that the overcast clouds matched the grey of the rocks around them, causing a pallet that could only be more boring if it was all switched with beige.\n\nThe only spot of color on the entire mountainside was a jet black vehicle cutting its way down the empty road. In both size and interior design, the vehicle matched that of a short bus. (The implications of that phrase notwithstanding) Within that bus was an older man, gritty, quiet, and smoking up a storm. Behind him sat six children who, if given any amount of attention, would remind any Biblical scholar of the Psalmic verse, \"I am fearfully and wonderfully made.\" At least if you forgot the wonderful part...\n\nBetween the children sat a small basket of fruits and an ice filled bucket, the latter currently chilling old fashioned glass bottles of soda. It was supposed to be a welcoming treat for the kids who would join the Candlewick home. Unfortunately, mountain roads did nothing to settle the stomachs and made the food that much less appealing.\n\n\"Here we are, kids.\" The man behind the wheel said as the mountains finally parted. \"Welcome to Candlewick Vale.\"\n\nAs the road began to head downhill, the children could look out of the car to see the wondrous land before them. For once in their life the children felt hope. Even the grey skies seemed... Well, they still seemed grey, but were instead filled with the peaceful clouds that came with the soft rain.\n\nThe car drove past the few houses that sat along the edge of The Cove before curving off along the edge of the Childalost Forest. It followed the path between Shingle Beach and the Ironmonger bog before cutting through the city's docks. It crossed the rickety bridge over the Bent Stick River, took a sharp turn at the edge of Old Man Snap's Farm, and followed along the coast. \n\nEventually the car took a sharp left turn and headed into the main Candlewick Township. The small town had all the shops and buildings a small town could ever want. It also had more than enough secrets for a town much larger than itself, along with enough secrets to overflow into about twenty federal government agencies.\n\nThe children could feel the sudden change as though someone had turned on the heater. What brief comfort they had knowing that the metaphorical heat was coming was suddenly replaced by a heavy chill as the metaphorical cold air rushed from the metaphorical vents. The first people they saw seemed to stare at the car with a hint of dread and malice. That emotion became stronger the close they got to the center of the town.\n\nMercifully they seemed to reach the center of the town, and took another right turn. The town was eventually left behind, the only other building before the forest's return being Our Lady of the Height's Church, surrounded by its rather sizable graveyard. The car drove past it as well, heading up the riding road which curved along the edge of the forest. It suddenly cut through a thin patch of trees and revealed a wrought iron fence with all the pointy bits an intruder would avoid.\n\nAn opened gate lay before them, with words on the archway reading \"Candlewick Manor\" in rusted letters. Below that a much newer sign hung, this one reading \"Candlewick Home for the Unfortunate and Unloved.\"\n\nThe vehicle rolled to a stop before a massive mansion, the windows looking warm and inviting from their seats in the car. The man behind the wheel climbed out of his seat, his massive size causing him to hunch in order to fit in the car at all.\n\n\"Alright kids, last stop. Grab yer bags and get inside. I'm sure Dr. Candlewick is just dying to meetcha.\" Now that the man had spoken more than four words at a time you could hear his thick Irish accent. He stepped out of the vehicle and waited patiently, most likely to give you a push in the right direction."
    },
    {
        "game_pid": "1ne2tn",
        "story_name": "InSpectres: Ghost Hunting for Beginners",
        "post_title": "You've seen the commercials. You've heard the radio ads. You've read the testimonials. You've even watched the documentary TV show. You know the InSpectres.\n\nIn a world rife with ghosts, ghouls, and goblins, the Inspectres are the (privatized) front line of defense. When you've got werewolves on your property, vampires in your attic, or just a ghost that won't stop stacking your chairs when you plan on using them, these are the people you call.\n\nAnd it just so happens that a new franchise is opening in your area. That 9-5 grind isn't quite the highlight of your life. The days are long and far from enjoyable. Maybe this is the perfect place to start fresh.\n\n___\n\nWelcome to InSpectres, a game inspired by the tabletop RPG by Momento Mori Games. In this heavily structured beginner game, you play as employees of the newly opened InSpectres franchise as they set up shop and go out on their first mission.\n\nIn this game, beginners will learn:\n-How to make a character\n-How the various types of cards work, including neutral cards\n-How challenges work, including special rules a narrator might add to challenges\n-How to strategize and work challenges using the game and card rules of Storium\n-How to ignore the game and let this be a collaborative writing experience.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2018-05-06 05:35:40 UTC",
        "comment": "The storefront was empty of all decoration, but everyone around town had heard what this place was going to be: Inspectres.\r\n\r\nThe infamous company known for hunting down the supernatural around the continental United States (plus a few franchises in Canada and one right across the Mexican border) had staked a franchise claim in this city and was having open interviews for anyone who wanted to work in the supernatural hunting business.\r\n\r\nThe line was out the door and all the way around the street corning, so many people were looking for a job. One by one they were called in, and one by one people left, looking unsure of their fate.\r\n\r\nEventually, you were called in. No other people wanting the job. Just you, a table, a camera, and the three people interviewing you.\r\n\r\n\"Hello, my name is Emily Dalton, CEO of Inspectres.\" A woman spoke first, a small smile on her face. Despite that smile, everything else about the woman screamed seriousness and intelligence.\r\n\r\n\"I'm Saul Carter. I own the major franchise out in Arcadia.\" A large man was next, and the smile on his face was even wider that Emily's. While the man was on the chubbier side, one look at his arms coming out of the polo could show that there was some muscle behind it.\r\n\r\n\"And I'm Dani Cho, the technology expert for the company as a whole.\" A second woman said. She had a laptop in front of her with strange, almost science fiction attachments on it.\r\n\r\n\"We're conducting the interviews for this branch of the company, and we're going to go over a few questions.\" Emily said as she looked at a list on a paper in front of her.\r\n\r\nMost of the questions were usual interview fair, though some were strange, getting into weird hypotheticals involving the supernatural. Eventually the questions lead to things that seemed more important.\r\n\r\n\"Alright, so what we need here at Inspectres is people who know what they're doing. It doesn't have to be knowing about ghosts, but I do want to know what you think you're good at.\" Emily said.\r\n\r\n___\r\n\r\n*Hello, and welcome to the first scene! Let me get your acquainted with the main game layout first. At the top left you have the tabs going between the game screen (seen here) and the the green room, which you’ve already seen.*\r\n\r\n*Along the left you have the character portraits of the cast of the game, along with a link to my profile. Clicking on a character will show all the cards that character currently has. Clicking on the character name will open to their profile, where you can read the background as normal.*\r\n\r\n*At the center top you have the picture and title. Clicking on it opens a drop down menu of the game information, like seen on the main tab of the Green Room.*\r\n\r\n*To the right you have the Commentary, which is an in game chat. For a fully\u007f public game, anyone can see the chat. You can use this to discuss and joke about the game, and give legitimate commentary.*\r\n\r\n*Here, of course, is the actual game. You have the text of the actual game. Above it, the narrator may have a location card and/or a picture showing the scene. Clicking on a location card will give more information about the location in question. On the right side of that you have the various challenges for the scene, which are narrative obstacles your characters encounter. Other things can appear there too, though they will be covered in the future.*\r\n\r\n*You’ll also see buttons where you can post as well. Make A Move is the one you hit to… Well, make a move. You’ll also see Nudge buttons, one for the Narrator and one for the Players. These buttons will send an alert to the use in question. That being said, Storium etiquette sees these buttons as last resorts. Since posting in the green room, commentary, or in the game sends alerts to everyone, and typing @player name in the commentary alerts that player specifically, nudge buttons are seen as somewhat passive aggressive and impatient.*\r\n\r\n*At the bottom of the page you have the Activity Tracker. That basically shows everyone’s game activity. When people have posted, how many posts they’ve made, how many cards they’ve played this scene, etc.*\r\n\r\n*Now, for the actual explanation of gameplay. When you make a post, you can type whatever you want. It’s like normal text roleplaying. You make a post controlling your character (or others, with permission) that advances the story. That being said, Storium has more actual gameplay than just text RP.*\r\n\r\n*The way you make story progress is through the challenges the narrator sets up. These are assigned points, and that’s how many cards you as a group must play in order to pass the challenge. In general, you can’t narratively complete a challenge until all the points have been played with your own cards. When you post, you can see a button to choose a challenge, and then you can play cards to those challenges.*\r\n\r\n*For now, we start with Strength cards. These represent what your character is good at, and the skills they have to overcome challenges.*\r\n\r\n*These are things that you’re generally wanting to play. Strong Outcomes give you the chance to give your team the upper edge, give your character a bonus, or just let them come out of the challenge unscathed. It’s the chance to let the characters do their best and be heroic.*\r\n\r\n*For the sake of this challenge, play your NON WILD, DEFAULT STRENGTH and answer the question like it is an interview.*"
    },
    {
        "game_pid": "kpca4v",
        "story_name": "Weird West: The Train Job",
        "post_title": "The Weird West is a dangerous place for anyone, be them orc, elf, or anything in between. Criminal gangs rob and kill for a living, and the law can't do much out in the middle of nowhere. That's where mercenaries like you come in.\n\nMercenary is a strong word, to be fair. You're more like private security. The Go'ruk firm has provided skilled protection for people, places, and things for almost a decade now, and they've got the reputation to hold their own in the competitive market of hired guns.\n\nYour small group of ragtag gungslingers has been working for Go'ruk for a little while now, and have been given a pretty high ranking job: Protect a travelling train from anyone who wants to rob it.\n\nSo, do you think you're up for it?",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2017-10-02 13:26:21 UTC",
        "comment": "The city of Davenport. It was one of the bigger cities in the West. It was big enough to have four full crossroads rather than the usual none for smaller town. It was built right on the railway as well, giving it that extra boost of industry that kept the West thriving.\n\nIt was also the home to the Go'ruk Agency, a band of private security that was currently being audited.\n\n\"I assure you, Ms. Go'ruk, this is merely a formality. Once we look over your records we'll be out of your hair in no time.\" The male elf had on an obviously forced smile. This was business as usual for him, but being this far out west was a pain for his more sensitive sensibilities.\n\n\"You know, a lot of us came out west to get the fingers of you and yours out of our pies.\" Go'ruk grumbled, the orc woman leaning against the door frame as the auditors went about their business. A goblin and a human were running about her office, grabbing her various business ledgers and files for their audit.\n\n\"Well, as long as you work within the country's territory, you have to pay the piper. It's a fact of life.\" The elf responded. \"You're a legitimate business, and that means we have to treat you like any other-\"\n\n\"Oh shut up. We all know you're here because of the security job on the train from a few months back.\" Go'ruk interrupted the elf. \"We did our best given the intel we had. Just because it turned into a clustfu-\"\n\n\"Ma'am, can you watch your language?\" The elf rose a hand to stop her. \"We have to write up a full transcript of our conversation for the reports, and I'd prefer not to have any obscenities in it.\" The orc growled, then scoffed at the prim and proper elf. There was a tense moment of silence between the two.\n\n\"...She is right, you know.\" The halfling who had been taking the transcript down spoke up. The elf turned and shot him a glare.\n\n\"Bramblefoot, we were supposed to be keeping that subtle.\"\n\n\"How? We were going to be asking her about the train incident anyways. Asking her about the entire thing would make it obvious why we're here. She's not dumb.\"\n\n\"I like him.\" Go'ruk said with a smirk on her face. \"He has the cojones to be honest with me at least.\" She got back to her feet and walked across the room to her shelves. Within minutes she had pulled a few ledgers from the shelves, along with one from the goblin's hands.\n\n\"This here is everything you need to know about the train incident. I've got the worker's files, the contract, the incident reports... Where should we start?\"\n\n___\n\n*Hello, and welcome to your first scene. Let me get you acquainted with the layout of the page first before we get into the actual game.*\n\n*To the left, you have the character portraits. Clicking on one of these will show you what cards the other players have left, along with quick links directly to the players' and characters' profiles.*\n\n*To the right, you have the Commentary. This is basically the in game chat where you can discuss things on the current scenes. This can be set to public or private depending on the setting, but in this case it's public.*\n\n*On the top of the page you have the tabs for the Game (where you are currently) and the Green Room, where you can have a forum-like discussion, among other things. You also have the game's cover. If you hit the little down arrow, it opens the game description and all the information there.*\n\n*On the bottom of the page, you have the Activity Tracker. This helps you know when people posted last, how many cards they played, and how many more cards they can play this scene.*\n\n*And here in the center you have the game text. This includes the story you are reading now, the cards such as the Location (The Davenport card above), Challenges (The Strengths card in the upper right of this post), and any Assets and Goals you can pick up. Those will be explained in the future.*\n\n*All cards played, be it by me or another player, can be clicked on and read. These cards might have extra descriptions or flavor text which can help set the scene or explain the move.*\n\n*There is also the actual buttons to post and to nudge. Posting is self explanatory, but nudging is another thing that needs some explanation. Basically, you can choose to nudge players, which will send everyone in the game a message to keep the game moving. You can nudge the narrator specifically, to tell them to keep the game moving. These are fine, but most people find it bad form to use them outside of nobody posting for like three weeks. It's easier to type @name in the Commentary to get someone's attention.*\n\n*Anyways, now for the actual challenge. When you post, you can choose a challenge to play on. In this case, Strengths is what you are going for. Strengths represent various positives about the character. It could be literal physical strength, skills, personality traits. I've even seen it used to say they have a special item, family heirloom type thing.*\n\n*For this post, please play your non-wild Strength card onto this challenge. For your narration, give us a little scene or vignette of your character showing off that strength. It doesn't have to be associated with other players currently. Just show off what it means for your character to be cool.*\n\n*If you have any questions, please post them in the Commentary or in the Green Room.*"
    },
    {
        "game_pid": "3tqt2f",
        "story_name": "The Train of Time: An Interstitial Tale",
        "post_title": "##**It's said that history of made up of memories.**\n\nThere are worlds other than our own, each with their own story to tell. They've got heroes and villains, Light and Darkness, and their own hearts trying to find their way. Despite their disparate existence, they are united through the strength of their bonds. The Light and the Dark find harmony  in the worlds, even as there are those who fight for their side.\n\n##**Each person, each event, only exists if someone is around to remember the truth.**\n\nDeep down in the darkness, in the world between worlds, a cult looks at the balance between the worlds and the bonds that connect them, and scoff. They and their dark master demand oblivion. They spread out among the stars, permeating reality with their dark energy, eating worlds to please that which they worshiped.\n\n##**That's why I fight: So our memories can stand the test of time.**\n\nThe sound of a whistle becomes a symbol of hope to those whose worlds become infested with these creatures of darkness. A train travels between the worlds, carrying those who would fight against the cult of oblivion. On their home world, some may have been heroes. Some may have been villains. Some may have been average citizens. But in the face of destruction they have been chosen to fight.\n\nSo, what are you waiting for? Shake my hand, make our contract official, and let's save the worlds together!",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2020-09-02 01:24:01 UTC",
        "comment": "The man in the suit stares out the window of the train, his look pensive, not even registering the train platform outside. Behind him, the door to his private compartment... Well, it would normally be his. As of what some would perceive as five minutes ago, it was being used by his client.\n\n\"Owner, is everything alright?\" The curious voice of Naomi came from the hallway door. The man in the suit turned to her, his face stoic as ever.\n\n\"I was simply thinking about how quiet things have been.\" He responded. \"We haven't had an adventure like this in quite a long time.\"\n\n\"Is it smart, sir?\" Naomi asked as she stepped into the hallway. \"We've never interfered in the worlds like this. This could end badly for everyone on board.\"\n\n\"Unfortunately, there's nothing we can do now. We've made a contract, and to break that would have even worse consequences.\" The man explained. \"Not just for us, but for the worlds as a whole.\"\n\nThe stewardess didn't respond, though her face turned down in concern.\n\n\"You needn't worry, Naomi. Things have always worked out for us so far, correct?\" The Owner put on a smile, one that any normal human might see as awkward and forced. Naomi looked up at him and put on her own smile.\n\n\"Right! I'll go get the dining car ready!\" She said confidently, and turned to stride back through the door she entered from.\n\nThe man in the suit looked back out the window. The smile stayed on his face.\n\nThings were about to get a lot louder, again.\n\n***\n#Elijah Cole\n##House of Blues, Anaheim\n\nIt was such a weird little box.\n\nElijah had been in plenty of clubs and plenty of green rooms. He'd seen enough sound equipment to be able to recognize what each device was if he looked at it for more than a glance. He'd even seen plenty of custom add ons for instruments that would change the noise.\n\nThe strange, flip open black box looked like nothing he'd ever seen before. \n\nWhen he first saw it, he thought someone from the opening act left their phone on the table, but it wasn't a phone at all.\n\nElijah was taken out of his thoughts with a knock on the door. Standing in the doorway was  one of the venue workers.\n\n\"Alright, the openers are just finishing! You're on!\"\n\nThere was no time for solving the weird puzzle before him. He had a show to put on! \n\n***\n#Ka’Liel\n##Vermilion Station\n\nIt was such a weird little box.\n\nKa'Liel had seen puzzle boxes before, of course. For some they were trinkets, while others actually used them to hide the treasures they wished to keep hidden.\n\nThe major question was why this particular box was hidden deep in dwarven ruins, and why it was in mint condition. \n\nAs she sat on a bench at Vermilion Station, waiting for her train to arrive, her attention turned to the box in question.\n\nEach knob, each pipe, each gear seemed dependent on the others, all turning whatever mechanism held the box closed. There was something inside of it. She was certain of that. It was just a question of how to get it open.\n\n***\n#Shen'aa\n##The Swamp of Sorrows\n\nIt was such a weird little box.\n\nThe bladesinger had entered the swamp following rumors and leads. Even her previous lives knew of this area and its other names, and knew the stories of creatures that dwelled there.\n\nWhat that didn't explain was the sudden surge of monsters coming from the swamp. Beings of shadow attacked the nearby villages rather than staying to the wetlands.\n\nAnd now the bladesinger had found a curiosity within the swamp: A small shrine in the middle of nowhere. Abandoned structures were uncommon in the Swamp of Sorrows, but not nonexistent. However, none of the voices of the blade had any memory of this shrine. \n\nOn the center, on some sort of altar, was a small, black box that would fit in one's hand. It looked like nothing she had ever seen before.\n\nWhatever it was, Shen'aa had a job to do first. Small monsters, beings made of shadow, crawled from the darkness in small monstrous forms. Yellow lights in place of eyes glowed in the dark.\n\nThe time to fight was now!\n\n***\n#Xahro\n## ???\n\nIt was such a weird little box.\n\nThe remnants of fallen worlds were a place that Xahro had seen before. Rocky crags and small mountains, pools of dark water... Nothing left of these worlds.\n\nBut that didn't explain where the box had come from.\n\nIn a small clearing, flashes of darkness acted as portals, with more and more heartless leaking into the destroyed world. And in the center of it all, having come through a dark portal with a flash, was a small black box. \n\nWhatever it was, it was an oddity in the darkness. It wasn’t a monster or a lost soul such as himself. Why not investigate?\n\n***\n#Professor Arturo\n## ???\n\nIt was such a weird little box.\n\nThe professor had been travelling between worlds ever since his connection to his allies was lost. He was looking for a sign of something, any sort of hope to keep him moving forward. Had his home truly been destroyed? Was there nothing left?\n\nThese questions plagued his mind as he tried to survive. Time almost seemed to run together as world after world passed, his memories almost congealing together...\n\nAnd then he woke up.\n\nHe didn't remember falling asleep. He also didn't remember the strange device in his hand.\n\nA strange folding box, about the size of his wallet, rested in his hand. It unfolded like a wallet, and the clear portion did seem to have a slit that a card could be placed in.\n\nBut he had no idea what this box was.\n\n\"Here you go, sir. Coffee!\" A feminine voice interrupted his thoughts as a cup and saucer of what looked like coffee was placed in front of him.\n\nIt was around then that the Maximilian realized that he was sitting at a table on what seemed to be a train's dining car. The long nature of the room and the shifting underneath him gave the impression that he was on a train, and that it seemed to be moving.\n\nThere was nobody else in the car besides the stewardess. \n\nAnd he still had no idea what this box was."
    },
    {
        "game_pid": "b7jr7s",
        "story_name": "Super InSpectres: A Beginner Game",
        "post_title": "You've seen the commercials. You've heard the radio ads. You've read the testimonials. You've even watched the documentary TV show. You know the InSpectres.\n\nIn a world rife with ghosts, ghouls, and goblins, the Inspectres are the (privatized) front line of defense. When you've got werewolves on your property, vampires in your attic, or just a ghost that won't stop stacking your chairs when you plan on using them, these are the people you call.\n\nAnd it just so happens that a new franchise is opening in your area. That 9-5 grind isn't quite the highlight of your life. The days are long and far from enjoyable. Maybe this is the perfect place to start fresh.\n\n___\n\nWelcome to InSpectres, a game inspired by the tabletop RPG by Momento Mori Games. In this heavily structured beginner game, you play as employees of the newly opened InSpectres franchise as they set up shop and go out on their first mission.\n\nIn this game, beginners will learn:\n-How to make a character\n-How the various types of cards work, including neutral cards\n-How challenges work, including special rules a narrator might add to challenges\n-How to strategize and work challenges using the game and card rules of Storium\n-How to ignore the game and let this be a collaborative writing experience.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2018-09-13 04:12:49 UTC",
        "comment": "A large group of people had taken a seat outside of a cave out in the woods just outside of the city. Folding tables had been set up, along with a few grills where meat and vegetables were being cooked and served like this was a barbecue. This was not a barbecue though. This was an interview.\n\n“Ladies and gentlemen, I apologize for the inconvenience!” A voice called out from the mouth of the cave. Out stepped a older Black male, a Christian priest if his outfit was legit.\n\n“We were going to have this at an office, but a few days ago an emergency job came in and... well, we’ve had to keep an eye on this cave. It’s pefectly safe though.” He smiled.\n\n“Anyways, I am Father Clay. I happen to run a franchise of Inspectres out of my church. If that doesn’t tell you how anyone can be an Inspectre, I don’t know what can.” He laughed at his own joke.\n\n“Anyways, we’ll be taking you in one at a time to do an interview with myself and two other members of my own Inspectres family. Once you’re done, I’ll escort you back out here and in a few days we’ll call you and help you open up a new franchise. While you’re here though, you can enjoy the food. And can we give a clap offering to Jeffery and his son!” He pointed to the two men manning the grills. “I swear, I don’t know how my church would survive our Super Bowl parties without you.” Jeffery and his son each have a wave at the smatterings of applause in response.\n\nFrom there Father Clay began to call out names, and one by one people were escorted into the cave, and they came out looking a little psyched out.\n\nEventually it was your turn. Your name was called and you stepped with Father Clay into the darkness of the cave, which soon lead to a room lit with some large construction lights plugged into a gas powered generator. The rest of the cave was blocked by a wall made of sheet metal that was covered in strange, spray-painted patterns.\n\nThere were two other people in the cave. One was a young man in a paint mask, working on the sigils on the wall. The other was a young woman who seemed to have some sort of make shift flamethrower, the tip lightly radiating some sort of green flame.\n\n\"Take a seat! Take a seat!\" Clay said, pointing to a chair in front of another folding table. \"And... Just ignore what might be behind that wall...\"\n\nHe took a seat across from you, and soon the two others joined him, though all three kept glancing at the sheet metal wall.\n\n\"This young man is Eddie, and this woman Tori. They're members of my flock, and are helping me with this interview.\" The priest explained before clearing his throat grabbing a legal pad from a stack of legal pads. \n\nSmall talk began, trying to get to know you at first, before finally the traditional questions came about.\n\n\"So, tell me, what is your greatest strength? What do you think makes you a good Inspectre?\"\n\n___\n\n*Hello, and welcome to the first scene! Let me point you to how everything is laid out.. At the top left you have the tabs going between the game screen (seen here) and the the green room, which is where you have characters, the main pitch, a list of players and their characters, and the discussion tab.*\n\n*Along the left you have the character portraits of the cast of the game, along with a link to my profile. Clicking on a character will show all the cards that character currently has. Clicking on the character name will open to their profile, where you can read the background as normal. These portraits are at the top of the page if you are using mobile view, such as your phone.*\n\n*At the center top you have the picture and title. Clicking on it opens a drop down menu of the game information, like seen on the main tab of the Green Room.*\n\n*To the right you have the Commentary, which is an in game chat. For a fully public game, anyone can see the chat. You can use this to discuss and joke about the game, and give legitimate commentary. This is at the bottom of the page if you are on mobile.*\n\n*Here, in the center of everything, is the actual game. You have the text of the actual game, which you are reading here. Above it, the narrator may have a location card and/or a picture showing the scene. Clicking on a location card will give more information about the location in question. On the right side of that you have the various challenges for the scene, which are narrative obstacles your characters encounter. Other things can appear there too, though they will be covered in the future.*\n\n*You’ll also see buttons where you can post as well. Make A Move is the one you hit to… Well, make a move. You’ll also see Nudge buttons, one for the Narrator and one for the Players. These buttons will send an alert to the use in question. That being said, Storium etiquette sees these buttons as last resorts. Since posting in the green room, commentary, or in the game sends alerts to everyone, and typing @player name in the commentary alerts that player specifically, nudge buttons are seen as somewhat passive aggressive and impatient.*\n\n*At the bottom of the page you have the Activity Tracker. That basically shows everyone’s game activity. When people have posted, how many posts they’ve made, how many cards they’ve played this scene, etc. I personally use it a lot, mostly to keep track of the number of posts. If I'm feeling like I'm stealing the show and posting a lot, I will sometimes @ someone who hasn't posted as much to see if they have anything they want to do.*\n\n*Now, for the actual explanation of gameplay. When you make a post, you can type whatever you want. It’s like normal text roleplaying. You make a post controlling your character (or others, with permission) that advances the story. That being said, Storium has more actual gameplay than just text RP.*\n\n*The way you make story progress is through the challenges the narrator sets up. These are assigned points, and that’s how many cards you as a group must play in order to pass the challenge. In general, you can’t narratively complete a challenge until all the points have been played with your own cards. When you post, you can see a button to choose a challenge, and then you can play cards to those challenges.*\n\n*While it doesn't apply quite yet, the person who finishes a challenge gets to narrate the outcome. A challenge will have a Weak Outcome and a Strong Outcome, along with some description of what that outcome means. If you complete a challenge, you get to write out that narration of that completion. Of course, it has to be within reason.*\n\n*For now, we start with Strength cards. These represent what your character is good at, and the skills they have to overcome challenges.*\n\n*These are things that you’re generally wanting to play. Strong Outcomes give you the chance to give your team the upper edge, give your character a bonus, or just let them come out of the challenge unscathed. It’s the chance to let the characters do their best and be heroic.*\n\n*For the sake of this challenge, play your NON WILD, DEFAULT STRENGTH and answer the question like it is an interview.*"
    },
    {
        "game_pid": "g1q3ny",
        "story_name": "The Dreadful Secrets of Candlewick Manor",
        "post_title": "All your life you've been an orphan... Well, at least as long as you can remember. Getting shoved around from orphanage to orphanage, getting bullied, getting ignored. You had trouble making friends. You had trouble getting adopted. There was something off about you. Something... Creepy. That sort of upbringing causes cynicism to grow, a healthy shell to protect you from the cruelty of the world...\n\nThen the man in the black car came. He spoke to your home's director, showed him something in a briefcase, and with an enthusiastic nod dragged you out of your room and into the car.\n\nHe said you were being taken to a new home. You would get your own room, hot meals, new friends. It would be just wonderful. He seemed more happy to get you out of his hands.\n\nAs the car crested over the hill, you found yourself looking out over the beautiful vale. It seemed strange, like it was stuck out of time. For a brief moment, even as you noticed that the mountains around the valley seemed like the jaws of a giant venus fly trap, you felt hope for the first time in a long time.\n\nIs hope what the fly feels before the trap's jaws slam shut?\n\n___\n\n**The Dreadful Secrets of Candlewick Manor is a story inspired by the RPG of the same name, and it in turn was inspired by Twin Peaks and A Series of Unfortunate Events.**\n\n**This is a darkly comic game that follows a group of orphans as they arrive at an orphanage near a small town. They go on various misadventures, discovering the secrets of the town, all while something tingles in the back of their skull... Something in this town is familiar.**\n\n**Imagine, if you will, the Addams Family children being orphaned and sent to the town from Hot Fuzz, all while solving mysteries and conspiracies with maybe a bit of supernatural flair, and you've got the tone for this game.**",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2019-06-17 21:15:20 UTC",
        "comment": "#Episode One: The Maleficent Manor\n\nFor those of you who were browsing this site and randomly clicked on this story out of curiosity and interest, I do wish to warn you that you made a terrible mistake. Perhaps you were looking for a simple mystery, or some sort of childhood adventure story, and the book jacket style description made you assume that this was the story for you.\n\nI regret to inform you that while this story does have mysteries and children going on adventures, this story is not going to be pleasant. In reality this story is about a city, the people in it, and the dark secrets they all share. If a story about uncovered corruption and a city at war with itself seems too dark for your taste, I recommend going back to the Featured tab and investigating one of those rather comedic fantasy or science fiction adventures they have listed there.\n\nFor those of you still here, I commend your bravery. While I'm certain none of you have any connection to Candlewick Vale, I'm certain learning of the terrible events that happened here will keep you up at night as it has myself.\n\nMy name is Elias Swift, and it is my solemn duty to record the dreadful events that tore Candlewick Vale apart at the seams.\n\n___\n\nOur story begins on a winding mountain road. The tall, grey peaks of stone blocked all line of sight beyond them, making any ride through the pass a bit dull. The summer weather had kept the mountain dry, even with the cloud cover, so what little plant life lined the hills was dead. The road could be seen stretching out between the curves, but beyond that there were no sights to see. It didn’t help that the overcast clouds matched the grey of the rocks around them, causing a pallet that could only be more boring if it was all switched with beige.\n\nThe only spot of color on the entire mountainside was a jet black vehicle cutting its way down the empty road. In both size and interior design, the vehicle matched that of a short bus. (The implications of that phrase notwithstanding) Within that bus was an older man, gritty, quiet, and smoking up a storm. Behind him sat five children who, if given any amount of attention, would remind any Biblical scholar of the Psalmic verse, “I am fearfully and wonderfully made.” At least if you forgot the wonderful part…\n\nBetween the children sat a small basket of fruits and an ice filled bucket, the latter currently chilling old fashioned glass bottles of soda. It was supposed to be a welcoming treat for the kids who would join the Candlewick home. Unfortunately, mountain roads did nothing to settle the stomachs and made the food that much less appealing.\n\n“Here we are, kids.” The man behind the wheel said as the mountains finally parted. “Welcome to Candlewick Vale.”\n\nAs the road began to head downhill, the children could look out of the car to see the wondrous land before them. For once in their life the children felt hope. Even the grey skies seemed… Well, they still seemed grey, but were instead filled with the peaceful clouds that came with the soft rain.\n\nThe car drove past the few houses that sat along the edge of The Cove before curving off along the edge of the Childalost Forest. It followed the path between Shingle Beach and the Ironmonger bog before cutting through the city’s docks. It crossed the rickety bridge over the Bent Stick River, took a sharp turn at the edge of Old Man Snap’s Farm, and followed along the coast.\n\nEventually the car took a sharp left turn and headed into the main Candlewick Township. The small town had all the shops and buildings a small town could ever want. It also had more than enough secrets for a town much larger than itself, along with enough secrets to overflow into about twenty federal government agencies.\n\nThe children could feel the sudden change as though someone had turned on the heater. What brief comfort they had knowing that the metaphorical heat was coming was suddenly replaced by a heavy chill as the metaphorical cold air rushed from the metaphorical vents. The first people they saw seemed to stare at the car with a hint of dread and malice. That emotion became stronger the close they got to the center of the town.\n\nMercifully they seemed to reach the center of the town, and took another right turn. The town was eventually left behind, the only other building before the forest’s return being Our Lady of the Height’s Church, surrounded by its rather sizable graveyard. The car drove past it as well, heading up the riding road which curved along the edge of the forest. It suddenly cut through a thin patch of trees and revealed a wrought iron fence with all the pointy bits an intruder would avoid.\n\nAn opened gate lay before them, with words on the archway reading “Candlewick Manor” in rusted letters. Below that a much newer sign hung, this one reading “Candlewick Home for the Unfortunate and Unloved.”\n\nThe vehicle rolled to a stop before a massive mansion, the windows looking warm and inviting from their seats in the car. The man behind the wheel climbed out of his seat, his massive size causing him to hunch in order to fit in the car at all.\n\n\"Alright kids, time to get going. I'm sure Dravenfirth is just dyin' to meet ya.\" Now that the man had said more than four words at once to you, his rather ambiguous accent was obvious. He stepped out of the bus and began to unload your bags, motioning you towards the door as your grabbed you luggage.\n\nStanding at the door was a tubby man with narrow glasses, looking at a pocket watch with a bitter look on his face.\n\n\"You're late, Jurgen. It's already past the children's bedtime and-\"\n\n\"Do you want to try safely driving a bus through these hills?\" The large man said, arms crossed and glaring at the smaller man, who seemed even smaller as he shrunk away. \"I thought not. Can we go inside now?\"\n\nThe smaller man nodded and turned, opening the door to reveal a grand hall where some other adults were standing, talking among themselves. There was a large staircase leading up to a second floor, and lamps and art lining the  walls. This room gave off a grandiose feeling to say the least.\n\n\"Welcome, children, to Candlewick's Home for the Unfortunate and Unloved.\" The smaller man said, his voice cracking slightly as he increased his volume. \"My name is Dr. Dravenfirth, and I am in charge of the well-being of all the children here in this home. That includes your education. You, of course, have met Mr. Drakenslager. He's the driver and mechanic of the manor.\"\n\n\"There's Ms. Fineliner. She's the nurse for the manor. She'll be taking care of your scrapes and bruises.\" He motioned to a woman who smiled and waved. She had lollipops sticking out of her apron pockets and even wore one of those silly nurse hats.\n\n\"There is Mr. Grooner. He is the groundskeeper for the manor. If any of you children are troublemakers, you'll be spending plenty of time assisting him in the gardens.\" The man being motioned to seemed very physically dirty. His rough clothes were covered in dirt, his hands knobby, and his left eye covered with an eye patch. He seemed to be chewing or sucking on something, and gave a small wave with little enthusiasm.\n\n\"That man over there is Mr. Sangrioli. He's the chef of our home, and the one who will be providing you with your meals from here on out.\" The chef was a large man, tubby, with a large, curly mustache. He gave an enthusiastic wave, and you got the impression that if you weren't being talked at by the director that he'd come and give you all a big bear hug of welcome.\n\n\"Lastly, you have Ms. Silverdale. She is the head of housekeeping. She and her underlings are in charge of your laundry. If there any messes, you are to report them directly to her.\" The housekeeper was an older woman, and gave the impression of being a silver vixen. She gave a polite wave and had a large smile on her face.\n\n\"Now, let's make sure everyone is here.\" The director said, turning back to the group and holding up a clipboard, ready to call each of their names one by one."
    }
]