[
    {
        "game_pid": "fmzmvz",
        "story_name": "Securing Hope",
        "post_title": "August 1939, only one month before the world would be changed forever. The Great Powers of the world, yet again, lined themselves up to face each other in a battle of ideology, economics and manpower once more. The lessons of The Great War had not been thoroughly learned or appreciated by the statesmen of the nineteen-thirties, they were swept up by nationalism, imperialism, protectionism in a lethal cocktail that would burn the throats of many. \n\nOne month prior to spark of Nazi aggression against Polish sovereignty, the Great Powers of the world sent their best soldiers to a secret meeting held at the War Ministry in London. Whilst the diplomats that accompanied them would hash out the details of their international agreement, the elite soldiers would meet with their colleagues on the dawn of the most tragic war to scar the Earth. This elite Special Forces team will face some the most fearsome situations across the globe throughout the course of the war, from submarine infiltrations to frontline fighting, the group will be expected to traverse any challenge. As the cars arrived at the grim exterior of the War Ministry… Everything was about to change…\n\n(-)(-)(-)\n\nPremise: This is where the premise of the story begins, each player represents an elite commando/soldier from their respective country who want to prevent the expansion of the Nazi Germany and the possibility of a Second World War. You will be going on missions throughout the Second World War trying to undermine the key advances, the key attacks and help fight the war on the Allies behalf. Tensions will obviously arise, the USSR representative will resent the delaying tactics by the Western Nations to join the battle on continental Europe, and the group will view the representatives of Turkey and Republican Spain as dangerously close to aligning to the fascist agenda. You the players, as a group will overcome these differences and attempt to change the course of history.\n\nStyle: The story is going for a medium/fast pace throughout the story and would like to stick with a third person past tense style, not necessary but would like some cohesion. Will be happy to allow characters to use NPC’s as much as they like in their own post and would like cooperation between players for improvisation (Revisions will be freely available if anything is too far). This game had a loose plot but will be heavily influenced by player interaction and choices!\n\nCharacter Creation: Natures are there for guidelines pictures and descriptions can be edited but would like the essential nature to remain the same. However, strengths, weaknesses and Sub-Plots are there to provide guidelines or to be used and edited. I would like quite a lot of backstory in the descriptions of your characters.\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-02-19 22:39:08 UTC",
        "comment": "**September 2nd 1939 09:00 War Office London** Several uniform black vehicles line the pavement outside of the War Office on a warm mid-September morning in 1939, the trepidation in the air was almost tangible. The world, yet again, seemed balanced on the precipice of another global war. In the East, the Japanese had seized on their territorial ambitions in the South Pacific, first with Manchuria and Korea, now their focus seemed to be on annihilating the Chinese. In Africa, Italy had decided that their territory in Libya was not enough to compete with Britain and France and had completed a full scale invasion of Ethiopia, one of the few countries left unaltered by imperialist colonialism. Finally, In Europe to German spectre rose again above the battlefields of France and Poland, only recently returning to normality, ready to resurrect the eternal Reich that the Kaiser, those many years ago, had envisaged. Sir Hugh Quex Sinclair sat behind his royal mahogany desk looking over several status reports from agents in the field in these areas of tensions and hostilities. Britain couldnt afford, nor even risk, a global conflict at this time. The Great War had depleted the great treasures of Pax Brittainia and now, in all manner of irony, her former colonies were beginning to outshine her. He took a long drag on a cigarette before stubbing the remainder out in a gold plated ashtray, he knew that this operation was one of the biggest to be undertaken by Britain It could save her from the brink of collapse. Outside, the officials and delegates from several nations are seemingly unnoticed by the public, until they realise that the entire street has been cordoned off for the mean time. Representatives from the United States, The Soviet Union, France, Poland and several others emerged from their automobiles and ascended the steps into the lavish reception room. The representatives of the states went left, to meet with the prime minister and his affiliates and discuss the political implications, whilst the agents who were outnumbered five to one by their delegates went right, towards Sir Hughs office. These countries had been summoned several weeks ago, on a top secret mission that crossed political and ideological boundaries to end a second global war, to stop Germany, Italy, Japan and anyone else who threatened the global status quo as quickly and as effectively as possible. Commandos. The soldiers, having been recruited around the world for their excellent combat skills, were also *unique* in their own way, much to the respect and honour of their peers, this meeting was to be brief and insightful before they were being sent out to the slaughter. Good morning soldiers, tomorrow the United Kingdom and France are preparing to declare war against Nazi Germany. You are going to Poland, tonight. Any questions? He smirked ostentatiously at blurting all that classified information and waited for their response. Beside him, a young and debonair scientist stood apprehensively twiddling with an ornate ivory dagger. I am Winston Eddington, your Quartermaster so to speak, we have very little time to get your requests but, he paused and smiled I will endeavor to provide you with weaponry and communications."
    },
    {
        "game_pid": "rdynt0",
        "story_name": "Aftermath",
        "post_title": "Fifty years have passed since the fateful moment that Commander Shepard had decided, for the good of the galaxy, to sacrifice his tethers to this mortal plain and command the Reaper fleet. It had been forty-five years since the Reapers had repaired the damaged relays throughout the galaxy and destroyed the Beta relay with a final goodbye of “Do not follow.” It had been thirty-five years since the Galactic Council of Turians, Salarians, Asari and Humans was reassembled on the battered Citadel and chaired their first resolution to restore order and peace to the Galaxy. It had been twenty years since the SPECTRE program that the Citadel Council had used prior and throughout the Reaper threat was opened to all galactic races with a widely modified class system and training regime. It had been ten years since the Citadel Council race home systems had been thoroughly cleaned of piracy and lurking threats and the council had re-established ‘Citadel Space’. It had been two years since you all enrolled in the SPECTRE training program with the hope of joining the most elite organisation in galaxy intent on restoring the honour and authority of the Citadel Council. It is now that you are going to make your mark.\n\n(-) (-) (-)\n\nApplication: I have made a few basic cards, but any applicants may feel free to create any new cards that they desire. The only request is that the Nature cards include your race and some background (i.e Quarian Engineer). I would like pictures either real or from mass effect for all cards! :)\n\nI will not be operating on a first come first serve system and will be waiting to acquire a number of applications and selecting the best from those available.\n\nPacing: I will be operating on a Normal pace. The first few days will no doubt be decently active, so I would appreciate all those that apply be ready to keep up with the fast initial pace. After this, however, it would be appreciated if we can aim for the 2/3 scene minimum per week.\n\nWord Limit: I have the game set to “No Word Limit” with the expectation that certain objectives within the story may take more time to accomplish than others, and I do not want the players to feel restricted. I will give large leeway to the characters and the story that we will jointly create, I have only a rough guideline of the story but I am happy to ditch this if we create something more exciting! I am excited for your application!\nGoogle Doc: https://docs.google.com/document/d/1wWvqK422YmdShrs7XuMq3EPlXgr3NSOx6LAmdVLI5eE/edit?usp=sharing",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-01-14 18:58:08 UTC",
        "comment": "**Prologue** The Citadel Tower was still in the midst of its repairs when the SPECTRE candidates were summoned to the councils private chambers. Keepers continued to flit between the panels on the walls, to maintain air pressure, humidity and a variety of other atmospheric variables, to the many areas that were still under active construction. Crews from all across the galactic community were converging on the Citadel in a show of galactic togetherness and workmanship. The Citadel may have been moved to Earth during the desperate final fight between the Reapers and the galactic alliance but it was now restored to its rightful place in Widow and everyone who had benefitted from the end of the Reaper purge, nearly everyone, was happy to assist in the Citadels restoration. It had been forty-five years since the last known sighting of Commander Shepard, she had vanished through the Beta relay with a stern warning of Do Not Follow before she obliterated the relay with a charge. Many myths and legends had circulated the galactic community whilst the rebuilding continued over the next forty years. Had she been corrupted by the power of the Reapers? Was she sealing them out a last resort to stop them returning? Was she merely building power, hidden behind the destroyed relay? No one dared venture near to her vanishing point, especially at this time of turmoil. The rebuilding phase may have been a galactic, communal effort on the Citadel but all of the home systems in the galaxy were left to fend for themselves. It had been a long, and hard, struggle to establish authority even in their own systems for the Galactic Council members. Fighting the twin snakes of piracy and autonomy that the Reaper invasion had spread had been an almost impossible task, considering the many systems and colonies of the galaxy. The non-council members faced worse isolation, the Quarians, Geth, Hanar, Drell, Krogan and Batarians were in an odd situation of stasis. Their home worlds were safe but the vast voids between them and the Citadel were still harbouring the many remaining threats to Galactic Security. Galactic Council Space was only a tenth of its pre-Reaper size and the Citadel Council fleet was at less than twenty-five percent of full strength. It was these stark facts, and the fact that the Galactic Council was now realising that that the monopoly of the Big Four was quickly eroding, that forced the Galactic Council to act. The SPECTRE program, the elite espionage and tactical arm of the Citadel, was opened to all races to allow feelings of galactic togetherness to flourish. The new SPECTRE program had been running for the past twenty years, with experienced tutors from all races encouraging a new breed of SPECTRE to combat the piracy and uncontrolled madness that the rebellious sectors bred. One month ago, the Galactic Council summoned some of the best and brightest prospects within the organisation to a special dinner at the Citadel Tower. The four heads of the Galactic Council were assembled at the top table; the room was bustling with high level diplomats, soldiers, tutors and reporters. The announcement would be made soon but, for now, all you have to do is mingle"
    },
    {
        "game_pid": "ftxtts",
        "story_name": "Evil Strikes London",
        "post_title": "The stale air as you awaken in the cold, sterile white corridors of the University Hospital in Lewisham is eerily cold and the corridors no longer ring with the sounds of patients, doctors and paramedics. Everything is silent, nothing is moving and you cannot remember anything, blackness is all you awaken from, no dreams, no memories, no idea what has happened in the past few days…\n\n(-) (-) (-)\n\nPremise: You and a group of survivors have find yourself in the abandoned Lewisham Hospital and there is an unknown, evil presence in the air. A mixture of 28 Days Later, Resident Evil and Dawn of the Dead, the story will start with a small group and slowly grow as people explore the desolate and destroyed remains of London, no one will really recall what happened or how but they all know they have to get out of London… Fast. People can and will die, only if they agree too, NPC’s will die, lots of action, lots of challenges and lots of cards. Hopefully leading to some interesting dilemmas and situations. (Threat will be decided as I write, maybe zombie, maybe something along the lines of The Last of Us).\n\nTo begin with I will be accepting 2-3 players as the original hospital survivors (Apart from these you can create your own natures, strengths, weaknesses, and sub-plots). Pictures are a must for cards where it is applicable as I believe it adds more depth.  Hospital Characters do not have to use the pre-made cards but they give a general jist of the idea.\n\nWriting will be centred on Third Person and I would like a high level of interactivity between player characters, NPC’s and myself – If you have some reservations about people using your characters of course I will be using revisions where there are issues. \n\nTimestamps shall be essential for posts:\n\nFor instance\n\n4:30 am – Monday – My House",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-08-19 23:18:30 UTC",
        "comment": "**Lewisham University Hospital Emergency Room (Ground Floor) 09:00 - Wednesday 20th August 2015** The resounding bellows of silence rang through the usually chaotic Emergency Room of Lewisham University Hospital. Plastic sheeting, draped across the doorways and walls, flapped gently in the breeze left by several holes in the automatic glass doors. Harriet Haynes lied in the middle of the Emergency Room waiting area, the variety of green leather benches around the room were either out of alignment or completely overturned. One of the overhead lights sparked in a desperate attempt to cast more light into the room, Harriet can taste the stale blood in her mouth and felt the pound of a headache emerging in her brain **Lewisham University Hospital Intensive Care Room 4B (4th Floor) 09:05 - Wednesday 20th August 2015** The petite and frail body of Carrie Emery lies in a sophisticated and high-tech Intensive Care Unit on the fourth floor of the Lewisham University Hospital. To the last of Carries memory, her visit at the hospital was to meet her miraculous oncologist Dr Emma Herscht who, for all intents and purposes, had saved her from almost certain death. Now, however, Carrie could feel the sophisticated orthopaedic mattress underneath her, the tight sheets of the bed keeping her almost rigidly in place. The ward seemed a world away from the Emergency Room mere feet below her, the beds next to her were untidy and empty but, apart from a critique of the cleaning in the hospital, the ward seemed fine. Across the small corridor between the beds, Carrie could see the outline of a fellow patient on her ward. The outline of Ellen Mignola appeared to be a lot more comfortable in her own bed, draped by the same light blue and white sheets and blankets. Ellen appeared to feel Carries stare and began to stretch under the covers and yawn audibly in the silent ward. The doors to the outer corridor and freedom, however, were coded shut, red lights on the keypad indicating to her that they were in here for a reason. Outside, the plastic sheeting is draped across the windows, a large yellow banner cross the translucent material. Suddenly, Carrie didnt feel confused, more panicked. The panic increased as she realised, from a dull thudding pain in her wrist, that one arm was zip locked to the metal arm of the bed **Lewisham University Hospital Staff Room (3rd Floor) 09:00 - Wednesday 20th August 2015** One floor below, in one of the back corridors of the administrative area of the hospital, the wind continues to filter in through the windows, fluttering the plastic blinds that obscure the rising sun from the room. Beige carpet and white walls accurately portray the functionality of the Staff Room. Several worn grey sofas, an aging television hoisted on the wall and a line of vending machines dominate the room before a small door leads to the on-call room with a small bed and shower room. Led in the middle of the floor, spread eagled, are the outlines Doctor Steven Sharpe and hospital security guard Carson Mathews. Both have the familiar tang of blood in their mouths and can feel the bruises on their skulls rising almost instantaneously as their eyes begin to blink back into life"
    },
    {
        "game_pid": "cy5my2",
        "story_name": "Revolution",
        "post_title": "The Galactic Defence Movement (GDM) were always meant to be there to protect the citizens of the human empire in space, separated by law from the individual governments and organisations of man by empirical decree, and, to begin with, they had with the utmost quality and service.  Being free from the shackles of bureaucracy and democracy, however, was always an uncertain path that could be manipulated by anyone who wanted to centralise more power within the Human Empire and, after nearly fifty years of ‘protection’, the organisation soured.  The Human Expanse of Space had been subject to many terrorist acts from humanists and environmentalists who opposed the continued exploitation of the Galaxy, after the devastation of Earth from global warming and depleting the planets fauna and flora. The GDM had crushed these threats with ease, a strong and capable force with separate funding and unlimited access to internal and external records, leading to a pioneering *safe* human space which allowed trade, industry and colonisation to flourish. The GDM secured wealthy contracts from the most scrupulous of companies: mining conglomerates, terraforming companies and colonial outposts all snapped up the oppressive security force to practically enslave their workforces and populaces.\n\nThe GDM now commands the largest fleet of private military space vehicles and rumours abound that, if the Human Enclave had to go to war with the GDM, it would lose. *But why would anyone worry about that? They are **protecting** us?* The media relations department at the GDM has outwardly convinced many of the masses that aren’t oppressed by the GDM and benefit from the industries it protects that the GDM is the most successful and reliable security force for humanity and that it can be *fully* trusted. This had led to an odd disparity that bubbles below the surface of the Human Empire and the GDM, those who hate the oppressive GDM and it’s exploitative ways and those who chose to ignore the GDM and profit from the added security and the extensive financial benefits of those who are exploited.\n\nThis is where *you* come in. You find yourself aboard the fearsome GDM Corvette *Bastion* which is tasked with transporting a wide variety of miners, colonists, prisoners, and many more, to the frontier. *Bastion* is a fearsome vessel, with the best track record in the fleet, and led by the brutal Commander Rahneki who has a zero-tolerance policy towards any infraction on GDM protocols. Several transported persons have mysteriously *vanished* aboard his vessel for disobedience or revolution – one such victim was found drifting in the Pursean Nebula by a scouting vessel seven months later. Whatever your backstory, you know that this trip to the colony Huerta would only lead to your probably enslavement or abandonment on the fringe of the known galaxy. A fate that no-one wants in these prosperous times. To change your fate, however, you know that you are going to have enact a *mutiny*…\n\n(-) (-) (-)\n\n**Application:** I have made a few basic cards, but any applicants may feel free to create any new cards that they desire.\n\nI will not be operating on a first come first serve system and will be waiting to acquire a number of applications and selecting the best from those available.\n\n**Pacing**: I will be operating on a *daily* pace. The first few days will no doubt be decently active, so I would appreciate all those that apply be ready to keep up with the fast initial pace. After this, however, it would be greatly appreciated if everyone could aim for **one post a day** (obviously barring real life emergencies!).\n\n**Word Limit:**I have the game set to “No Word Limit” with the expectation that certain objectives within the story may take more time to accomplish than others, and I do not want the players to feel restricted. I will give large leeway to the characters and the story that we will **jointly** create, I have only a rough guideline of the story but I am happy to ditch this if we create something more exciting! I am excited for your application!\n\n**Narrated by:** Jakeie",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-12-11 18:35:59 UTC",
        "comment": "**Friday 19th November 22:37 GST GDM Bastion Command Deck** The *GDM Bastion* continued to lurch through the Purusean Viel with a fast, efficient spirit that was the motto of the Galactic Defence Movement. *To Protect Humanity With The Efficiency They Deserve*. The *Bastion* was the heaviest corvette in its *Beijing* Class but it was still spritely. It continued to be one of the most efficient and reliable ships with the GDMs Outer Rim Task Force with completion rate of 98.7%. The 1.3% discrepancy was only due to mechanical fault never human or logistical, the Captain always made *sure* of that. The *Bastion* was *vast* for a corvette class, it had several decks each dedicated to its own speciality. Command, Medical, Colony, Science, AI Core, Mechanical, Prison and Cargo Hold. The many people who were held aboard the *Bastion*, either with or without their consent, find that the ship is one of the most efficient and high-tech ships within the fleet and a thoroughly pleasant transport ship. Unless, that is, you are a prisoner confined to the disgusting Prison Deck that has purposefully been left, un-upgraded, since the *Bastion* first entered service. Similarly, the *Bastion* may seem slightly *overbearing* for those who do not appreciate the constant, vigilant forces of the GDM patrolling the winding corridors of the ship with violent eyes and itchy trigger fingers. Contrastingly, the Purusean Veil was a beautiful place. A vast, open nebula full of clashing, vibrant colours with very little else for the ship to concern itself with. No asteroid belts, no space-stations, no gravitational pulls or anomalies for several thousand miles and, for the crew, this was the easiest part of the journey. Of course, the *Bastion* did *not* have to stop here every time the ship made its faithful endeavour to the furthest reaches of Human Controlled Space but it always did at the behest of its Captain. Captain Victor Rahneki lounged in his robust leather captains chair and continue to view the picturesque view from the large forward observation station. Captain Rahneki was an imposing man, at least six foot three and comprehensively rippling in muscle, his dark skin seemed to struggle to be contained under his GDM Captains uniform. His face was stern and unrelenting, harsh grey eyes, a chiselled chin and thin lips that all shared a thin scar that trailed down the left half of his face. That scar was the last time an enemy of the Captain had been able to lay a finger on him, and the scar was a miniscule price to pay for the suffering that the Captain would later inflict on his enemy. Victor always took six hours out of the precise, GDM approved, timetable to observe the brilliance of the Veil as a form of vigil to those he had killed over the years. He was sure that in a few more years he would need far more than six hours to reflect. The *Bastion* was known for being the harshest ship in the GDM fleet. Victor had personally jettisoned anyone who had interrupted his perfectionist plans regardless whether it was a prisoner, crew or a colonist. Victor had no time to pander to those who could not keep to schedules, obey the rules or respect the GDM. Victor knew the horrors before the GDM. The unrelenting terrorism, the inability to travel in space without fear and the constant threats of the pirates and scaremongers. Victor knew that the GDM was the **only** answer to the threat, much more than the weak remnants of the Human Empire. He would support the GDM until the end and use the *Bastion* as his will until the last breath left his body. Throughout the *Bastion* those captives or employees currently have the six hours as downtime, a brief respite on the relentless journey to the edge of the galaxy. Resentment amongst the crew at the captain and the other passengers towards the GDM continued to boil below the surface. The taste of revolution was almost in the air"
    },
    {
        "game_pid": "sx6kfm",
        "story_name": "Tainted Shores",
        "post_title": "1874 was a year of adventure within the German Empire. The Kaiser Otto Von Faustenberg has urged a new wave of colonial expeditions to the furthest unclaimed lands from the homeland, the time for expansion was dying and the Kaiser had no intention of being left behind by the great powers of New Francia, Iberia and The Federated United Kingdom. The Earth, the fertile plain that had harboured and raised humanity from the dawn of time was no longer unconnected and infinite, the land was running out and the Empire needed to compete with its rivals. \n\nYou are going to be setting sail on the airship *Der Geist* for one of the most far flung regions of the Earth. You have either been vetted and selected by the Empire Colonial Board or been forced to by either the penal system or corporate contract to settle these unknown lands. It has been ten days since you left the bountiful fields of the German Empire for the dangerous and unknown shores of the Pacific Region, an unclaimed and unknown archipelago has been claimed for the Kaiser known as * Die Scatter Inseln* (The Scatter Isles).  It is the final day of the journey that your story begins, the airships last few hours before it will descend and abandon you, with all your worldly supplies and belongings, on these treacherous islands.\n\nYour bravery and colonial spirit will be spoken of with pride in the homeland but, for you, the journey of establishing a colony is only now about to begin. \n\nUnbeknownst to the would be colonists, these islands have been long uninhabited for a *reason*. One that lurks in the shadows of the jungle and longs for the attention of humans that have called its earth home. When they come back into contact, who knows what will happen…\n\n(-) (-) (-)\n\nApplication: I have made a few basic cards, but any applicants may feel free to create any new cards that they desire. I would like pictures either real or drawings for all cards! :)\n\nI will not be operating on a first come first serve system and will be waiting to acquire a number of applications and selecting the best from those available.\n\nPremise: Steampunk, alternative world surrounding a colonial start up on a far flung island chain in the Pacific. The technology will be steampunk with some futuristic components, basic computers exist for example, and will focus on impressing the Empire and surviving. \n\nUnderneath all this, however, the lurking lovecraftian threat is watching, waiting for the colony to be seduced and used by his power…\n\nPacing: I will be operating on a Normal pace. The first few days will no doubt be decently active, so I would appreciate all those that apply be ready to keep up with the fast initial pace. After this, however, it would be appreciated if we can aim for the 2/3 scene minimum per week.\n\nWord Limit: I have the game set to “No Word Limit” with the expectation that certain objectives within the story may take more time to accomplish than others, and I do not want the players to feel restricted. I will give large leeway to the characters and the story that we will jointly create, I have only a rough guideline of the story but I am happy to ditch this if we create something more exciting! I am excited for your application!\n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-01-18 19:55:28 UTC",
        "comment": "The Airship Emporia rocked slightly as it was buffeted by another cross-wind, the journey seemed to be endless but at least the weather had held for the majority of the trip. The launch ceremony had been a hushed affair, despite the *Emporia*s mission being one of great importance to spread Germanys influence in the Pacific, the Kaiser could not use the negative publicity of a failed launch. He would announce the colonial mission *after* it was a success. Therefore, the convicts and assembled members of the colonial crew embarked during the dead of night, the mission secretly departed from Hamburg and they had been encased in its wooden and brass panelling ever since. The convicts and prisoners were not held in the brig, this colonial mission was their penance. Of course, there were still guards and soldiers to ensure that they didnt get *too* carried away with their perceived freedom but they were allowed to mingle with their fellow colonists for the journey. They were roughly eighteen hours from their final destination, the steam engines continued to chug heartily in the background as everyone on board milled around the large central cabin. The blazing Pacific sun filtered through the windows and showed the vast expanse of blue sky and even darker blue sea. A wisp of cloud cut the scene in two, but no land could be seen from any of the tall windows. The hustle and bustle of the launch and the subsequent days of refuelling and resupplying had meant that many of the colonists had very little time to get to know each other. It appeared that, on this calm and clear day of sea-sailing, they would finally be able to share their stories with each other. If they didnt they would have to combat the creeping threat of boredom that had been encroaching on the journey, there is only so much that an Airship can provide to ease the plight of boredom. The airship had some battered board games that had been used on the previous journeys, several shelves of worn books and an abandoned radio post used to contact the outside world but, apart from that, there was very little in the form on entertainment. At the helm of the ship, observing the panoramic view of the ocean, were the two most important people aboard the *Emporia*. One was Captain Michael Schrmann, the young and energetic owner of the *Emporia* who had been hired by the German Empire to transport the colonial expedition under the shroud of secrecy and ensure they got to the Pacific Islands in one piece. He was a brutish young man, filled with the testosterone of youth that showed in his blas attitude to his subordinates and his inclination to take risks. Over China, he had nearly come under fire from Chinese defences due to his lax attitude to international exclusion zones, he was a hot-headed and feisty character. He wanted to do his task for the Empire and earn the recommendation of his superiors, so he could finally assume a greater role within the Airfleet. Roughly eighteen hours til we reach our destination, the Kaiser will be pleased, thats an entire day ahead of schedule. He spoke confidently, staring at his companion. Beside him, much shorter in stature and lacking the anger of youth, stood the expedition leader Walter Mathrop. Walter was an elderly industrialist that the Kaiser trusted to oversee the development of the Colony, almost like an unelected mayor, and ensure that the Kaisers pacific dreams flourished. He had been a shrewd businessmen during his time within the Empire in the textile industry and had built significant wealth for this expedition. After the untimely death of his wife, he decided that the life of adventure and exotic locations was for him and the Kaiser had no hesitation in allowing him his wish. That is most fortuitous, you have been an excellent Captain, Michael. He responded cooly. Walter was a much cooler man to approach, he had the pompousness that was almost synonymous with wealth but he was also approachable. He hadnt forgotten his working class roots. Walter spun on the spot to stare at the fifty or so colonists bustling behind him We had better get ready for landing people. Our glorious colony awaits! He smiled broadly and clapped as finished his announcement."
    },
    {
        "game_pid": "f0vgh6",
        "story_name": "Mysteries Of The Earth",
        "post_title": "The Mysteries of the Earth are still lying out there, in the many tombs, vaults and epiphyses of man. So many, treasures and so many secrets to the most powerful people of history, some of the most powerful races and kingdoms locked away from the eyes of the public due to their sacred history or… *their power*. You have been summoned by Lord Arthur Bannock to his country estate to go on a global quest for adventure with his only daughter, Miss Madeline Bannock, who has chosen that the life of a lady in the English Countryside is not the life for her.\n\nYou have been driven to Lord Bannock for his wealth, his connections, his reputation in the field and you know that looking after his daughter will only be second to your primary mission; to find the secrets and treasures that the world holds…\n\n*(OOC: A mystery puzzle adventure story based loosely on Lara Croft based in the modern day. Expect some twists and turns some villians, some devilish puzzles and traps and , most importantly, FUN.)*\n\n(–) (–) (–)\n\nPace: Normal/Fast Pace\n\nPost Length: Set at 1500 (I love long posts but this isn’t a requirement).\n\nTheme: Survival / Mystery\n\nCards: Strength/Weakness/Sub-plot are just place holders can be used or ignored. Natures are guidelines they can be edited or new roles created but will have to be justified.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-11-27 14:26:43 UTC",
        "comment": "Lord Bannock relaxed in his study, an opulent book-lined room filled with leather chairs and mahogany furniture and the smell of history. A large cigar was clasped in one hand and, as he took a long drag, a small trail of smoke rose to the corniced ceiling and hung there, mingling with the chandelier, and giving the entire room a thoroughly eighteenth century feel. He wrapped his free hand on the large desk beside him, he was still not sure whether this venture was the best idea for him or, more importantly, for his daughter but, as he had always known, she *always* got her own way. Who could judge a father for giving his daughter everything when he had the finances and influence to provide it? Arthur Bannock was a renowned name in England. He, and his sadly departed wife Margery, had been one of the most influential power couples in the world of antiquities and politics for the past thirty years. They had travelled the world with the aim of achieving true greatness, from the deepest forests of Argentina to the desolate wastes of Transylvania, they had done all of their exploring together and had become insanely rich from their treasures and their memoirs. Then, as they were about to go on a tour of Egypt, Margery announced that she was pregnant with their first, and ultimately only, child Madeline who had changed everything between them. Margery would not have sacrificed the child for her career but, upon Madelines birth, Arthur was forced to become a stay at home dad whilst her mother continued on her journey to explore the mysteries that the Earth still hid from her population. Dividing their lifes mission had always led to arguments whenever Margery was at home and then, after Madelines seventh birthday, she disappeared. Margery had been on a tour of the East Indies when she never returned, much to the devastation of Arthur and his daughter, despite their arguments she was always part of him. It was now twelve years later and Madeline, recently nineteen, wanted to set out on her own journey of discovery in this vast and untapped world that we all inhabit. In the beginning, Arthur had vehemently denied his daughter those dreams of exploration, fearing for her safety and that he would lose his only family member in the same vein as he dearly departed wife. Madeline was a girl of strong beliefs, however, and she declared that this was the only thing she wanted to do with her life, pursue her mothers passion, and Arthur knew, much like when he and Margery first announced they were going to become explorers with much ridicule from both their families, once you had the passion it was *very* hard to resist it. Lord Arthur would have loved to have joined his daughter on the journeys he could never accomplish when he was raising his daughter but, alas, his health and profession limited him now. At 72, Lord Bannock was nowhere near agile or spritely and despite his lordship being a ceremonial role in parliament, he still enjoyed the occasional issue to debate when he wasnt managing his antique businesses. He had decided to implore the best and brightest he could find, via the newspapers and internet, to arrive at his house today and convince him that a party of them could achieve the two things he desired. One, to protect his precious daughter and, Two, give the adventure of a lifetime and find some truly unique treasures. His connections and finances had made many apply but, after a week of deliberations, the final five are arriving at the house to meet them today. Father? Madelines fragile voice loomed into the room as she entered. Madeline was a magnificently pretty young lady, in Arthurs thoroughly biased opinion, and she knew that she could have the easy settled life in the English countryside if she chose it. Long brown hair draped her slender frame and sparkling blue eyes. Her pale skin was dotted lightly with freckles and her sparkling smile dominated her well-proportioned face. Her gleaming teeth glinted as she spotted her father behind the desk. There you are! She exclaimed and she gave him a quick hug. Those are not good for you, you know. She chastised him with a cheeky glare. I know, I know my darling but my nerves are tingling. I cant believe today may be the start of your adventure. His voice trembled slightly as he said it, he was more than nervous, more than scared. Dont worry father, I am sure those you have selected will be more than ample to protect me from the world. She soothed gently pouring him a glass of strong brandy and placing it in his free hand. They are arriving sir! The crisp voice of the Butler bellowed up the stairs through the open door of the study as the sound of tyres crunching the white gravel of the drive began to sound through the windows. Thank you Kenneth, Arthur replied Make sure that they are ready for the meeting! Arthur took a large gulp of the glass and it seemed to immediately steady his nerves as his daughter sat beside him. Kenneths face hardened as he saw the cars arrive, he knew that this was a bad idea, he didnt want Lord Bannock to be hurt again by the gallivanting ideals of the women in his life Kenneth wasnt going to let this explorers in without a fight."
    },
    {
        "game_pid": "ynas9h",
        "story_name": "Arklay Police Department",
        "post_title": "Arklay District is going downhill, the economy bottomed out and the industry that once kept this part of the city thriving has abandoned the inhabitants. Many have left, many others have turned to crime and depravity. It is up to the small Arklay precinct to maintain order and law in an area that seeks nothing more than to separate itself from the so-called society that wishes to protect it. The Chief is expecting results, the areas crime rate has risen by twelve percent and the failures of the police in the area threaten to become a national news story. You have been drafted in as a department restructuring to restore order to Arklay and give the residents the peace of mind that the police are there to protect them and that the word of law is *final*. \n\n(-) (-) (-)\n\n*Premise*: A procedural police drama set in a downtrodden area of a large American City, each player will have been drafted in by the Captain to take over at Arklay Police Department and turn around an area of the city that has been damaged by the recession and spiralling crime rates. The game will open with a meeting at the department as a celebration of the switch over presided over by the chief and you may or may not be introducing yourselves to each other for the first time.\n\n*Post Length and Tense*: I would like a 250 word minimum post per player as I am not a fan of small posts and would prefer past tense third person but I am willing to negotiate.\n\n*Character Creation*: All cards are placeholders and can be edited or changed but I would like a large backstory to work with in the beginning. Expect a slow build up to some serious cases that will try the entire department. I am hoping to get some complex work relationships that will help drive this character driven storium. \n\nCurrent Specs (May Change): 1 Lieutenant, 2 Detectives, 2 Patrol Officers, 1 CSI Technician and 1 Mortician.\n\nAny questions I am happy to discuss via a Private Message! \n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2015-03-31 22:25:13 UTC",
        "comment": "Arklay Police Department was a downtrodden building. Sitting on the junction of Main and Sixth, the dilapidated sixties building was showing all the signs of its age. Faded paint, chipped concrete and sagging plastic that adorned the brutalist frame of the structure. On one side of the building, down an alley that connected Main with the Police Department car park, the message of eternal youth *Fuck The Police* was scrawled in angry red lettering over the concrete. The heavy orange sun began to sink beneath the towering skyline and bathed the dilapidated station in an auburn glow. Arklay had seen better days. Once, it had been the regenerative hope of the sixties, as the prefabricated homes and offices were torn down and replaced with the concrete and steel buildings of the future. Now, however, Arklay was rife with crime and destitution. Half of the buildings in the area were in a major state of disrepair or abandoned completely. The mafia had moved in, in force and now ran a protection racket that was nigh on untouchable under the previous regime and crime rates had soared past the threshold of public or fiscal tolerance. The Chief had ordered a sweeping press conference that stunned both local and regional news outlets. The Chief wiped the entire department in Arklay from their jobs either into retirement or into other departments as a major restructure only one or two extreme veterans were allowed to retain any influence within the precinct. She had wanted a fresh slate for the neighbourhood of Arklay that had been let down by generations of mismanagement and poor policing. The powerful rhetoric had worked on the populace, leading the Chief into a healthy range of mid-term public opinion polls but, now, she had to deliver. The car park of Arklay Police Department was busy, new employees transferred as far in as from across the state to start their new police journey. To set Arklay back on the straight and narrow. The redistribution of certain figures within the department had been viewed with scepticism from some aspects of the media. Was it really a robust challenge on the criminality of Arklay by a courageous Chief or, was it actually, a restructuring by the Chief to set some members of the department up to fail spectacularly? The whispering media mill continued to turn quietly in the background. One floor above the central reception, in a small but functional briefing room. The Chief, a middle aged fiery woman with flaming red hair stood beside the large oak conference table, a glass of iced water clutched in her hand tightly. She surveyed the room with a cold stare, it was her reputation at stake here and she knew that she had to deliver. She may have her fingers in many political and media pies but even the sweetest treat can sour with failure. She is joined by the many recruited members of the new Arklay Department, and one or two of the remaining figures about to depart. Chief among them, the retiring Lieutenant James Gamble, who was once held as a stalwart of bullish interrogation and getting results whatever the cost, who seemed wilted by his age and situation. Mutterings had that the Chief *forced* his decision to retire and that he was merely there for some of the media to get a few last snaps and portray a *happy* handover. The large media screens at one end of the screens recycled images of a happier time in Arklay, when the district had been a blossoming community with a strong police force, and along one wall there was a selection of meagre buffet food and drinks. It seemed to mirror an optimistic parents attempt to win over their child when they had done something wrong. Trying too hard to appear normal just made the *entire* scenario awkward. The Chief took a long cold gulp of the iced water before speaking, lightly rapping her pale knuckles against the table to gain the attention of the room. The mild ambient music filtering through the aging speakers stopped immediately. Thank you everyone for attending. Thank you especially to those of you selected to bring Arklay back under the firm rule of the law and justice. Too long has Arklay been allowed to slump into the archaic depravity of the mafia and oversee rampant disregard for the basics of civilised society. I am pleased to see such a stellar selection from across the city and the state here to reverse this dangerous trend. The speech was full of powerful statements for the media types to note, two of the journalists had already flipped their pads open and were scratching notes. Lieutenant Gamble took a hefty draft from his *Budweiser* in response, he had no intention of listening to his record being shat on whilst sober. He stalked, unnoticed by the reporters, to a far corner of the room and stared reminiscently at the slowly changing photographs. Sandras eyes hardened as she noticed the former Lieutenant sulking. Crime doesnt pay in Arklay anymore than any other district in this fine city. She boomed articulately. Failure is not an option here. Arklays citizens demand more than what they have received in recent years and you she pointed her finger across the new Arklay Department staff. Are my hopes of reversing the situation. But, more importantly, you are all *their* hopes. Now, lets celebrate and get to know each other. She plastered the fakest smile across her face as one of the cameras clicked satisfactorily in the background. The music returned to fill the silence after her speech and people began to mill around the room. The Chief was alone, affording the opportunity to ask her more about the Arklay Police Department and their remit, if anyone of them fancied the chance"
    },
    {
        "game_pid": "5cg606",
        "story_name": "The Last Hope",
        "post_title": "2142, the year that everything humanity had known would change. The Earth Space Alliance, a global confederation of the numerous nation-states and multinational corporations on Earth, has been researching advanced technology to begin the exodus of people to repopulate the Sol System and the rest of the galaxy. Earth is now an unrecognisable husk, the rampant overpopulation and industrialisation that had begun in the early nineteenth century is now at a crisis level. The oceans are higher than ever, dirty and polluted, many of Earth’s many unique animals have died due to the rapid change in climate, vegetation and air quality. Earth’s bountiful resources that had, for so long, been the source of conflict and death were now at their very last reserves, people were desperate for an alternate solution to the depravity and desolation that the Earth had become.\n\nThe ESA set up a bold program to recruit the best and brightest from around the globe to accelerate the aging space program that had been scrapped years ago to try and solve Earth’s problems without extrasolar influence. The project has been running for twenty years now and the future of humanity now relies in the spaceship *Revelation*. *ESF Revelation* and her future sister ships *Redemption* and *Righteousness* are humanities first foray into colonising the sol system and the wider galactic front around them. Technological advancements in propulsion, atmospheric calibration, communications, weaponry, medicine and science as a whole had allowed the ESA to consider the launch of *Revelation* in 2142. \n\nYou have all been selected from the masses on Earth to represent one of the final chances for humanity to survive within the Sol System and the wider galaxy before Earth is broken so badly that no-one could live there…\n\n(-) (-) (-)\n\nPace: Fast to Daily (I would like to get a 2 scenes done a week, minimum. The story will be pushed on if people are lagging).\n\nPost Length: Set at 1500 (I love long posts but this isn’t a requirement).\n\nTheme: Space / Survival\n\nCards: Strength/Weakness/Sub-plot are just place holders can be used or ignored. Natures are guidelines they can be edited or new roles created but will have to be justified.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-10-13 00:05:08 UTC",
        "comment": "The command deck of the *ESA Revelation* glittered under the filtered sunlight that streamed through the unshielded windows of the vast room. The surfaces and panels of the room were bedecked in the colours of the Earth Space Agency, aquamarine and silver, the entire deck was a technological marvel for a humanity that was on its last legs. Down on the surface, visible from the starboard windows, the torture of unshackled globalisation and pollution on the Earth had finally forced the Earth to fight back. The seas were rising at an astounding rate, global temperatures soared and the cyclical nature of Earths weather was now replaced with antagonistic random acts of destruction. Several areas once famous on Earth were now desolate, over populated husks that were only home to those most desperate. New York, once the jewel in the crown of the United States now lays in ruin. Three foot of water now covers the famous streets of Broadway, Wall Street and Fifth Avenue; the water inviting disease and famine to those who remained in the abandoned buildings that used to signify humanities progress. Many of humanities nations in the past have expanded and changed beyond recognition but the Earth Space Agency is a global hope to find a solution to a problem that Earth simply cannot solve. There simply isnt enough resources or space to house the population that is now running fully unchecked, even Earths worst disasters and diseases are not stopping the constant erosion of man. The clock is ticking for the Earth when everything runs outs, and it is desperately low on time now, the last of humanity will turn on each other until nothing remains. The Earth Space Agency was founded, with funding from all members of the fragile United Nations, to combat this problem with the single biggest undertaking in human history. Space. The idea that a similar garden world to Earth is out there in the galaxy had been around for hundreds of years, they just needed to improve the technology to allow an expedition to leave *quickly*. The year is now 2142, forty years of development and building connected to abandoned International Space Station had led to this moment, the *Revelation* was the first in trio of ships planned and funded by the ESA. Her sister ships *Righteousness* and *Redemption* were on schedule but were constantly plagued by problems as they were joint projects with client nations. The aim was that the three ships would be able to find a suitable planet within time and establish a colony before signalling back to Earth to send refugees, each ship would have roughly eight hundred passengers excluding crew who would be pioneers. Therefore, the ships were gigantic compared to previous human space endeavours with a combined population of nearly one thousand with their own botanic gardens, water reclamation facilities, fully stocked hospitals, security forces and fighter protection squads. The central space of the Command Deck was dominated by a large enlightened dais that housed the holographic projector for the on board ship AI, known as CHRIS, although the AI could communicate through any of the screens and speakers aboard the Revelation, this central command was most usual for crew meetings. Around the central projector there were several smaller daises, each dedicated to their respective head of department. In front of the central command unit was the captain and vice captains high backed leather chairs that could swivel to the wide screens to see their targets or sweep back to liaise with the heads of departments. Each Head of Department was at their command dais as the Overseer and Pilot strode into the room with a mixture of confidence and bravado, the pair couldnt be any dissimilar in age or demeanour but they both oozed confidence this morning. The Commander and Executive Officer rose from their chairs as the aging Overseer summoned all the officers in front of the AI projector. Power on. Good morning CHRIS. The Overseers voice was croaky but stern, he looked like he hadnt slept in weeks. The large, faint humanoid, face materialised in front of the group as the Overseer turned to them. Gerald McDermott was a seasoned veteran within the ESA, he had been on the original commission who oversaw the go ahead of the project and had been *heavily* involved ever since some even said he was too interfering. Good morning ladies and gentlemen, as you know this morning the last of your passengers boarded from Earth. We know that this will be a testing and unknown mission and the strains put upon you as heads of departments is immense but I want you all to know that the ESA will be monitoring and assisting you all in any way that it can. He paused and drank from the coffee he held in his tight grasp. Earth is dying my friends, we all know this. We all know you have suffered or experienced the growing overpopulation and resource shortage that is crippling our once beautiful Earth. The heavy burden of finding our new Eden now lays on your shoulders, I have every faith in you and so does the entire ESA. Before you depart, however, we need to make sure that every aspect of the ship is in full working order and fully efficient. I will be performing a tour of the ship in each of your departments and inspecting your full company of staff, facilities and protocols. Any questions? He finished his speech with a wry smile. The Overseer was about to take another sip of his coffee when he noticed the pilot stood beside him and began to speak again. Randy Linkwater was a decorated pilot on Earth serving in the North American Federation Air Force for three years and gaining much experience in their disputes with *La Regin Espaola* that border them. He had a notorious reputation of taking risks and pushing his craft to the very limit but he was also renowned for his skill and ability. I almost forgot. Gerald said briskly. This is Randy many may have heard of him on Earth, La Roja Pass was an unbelievable feat of skill for a pilot on Earth and he has been granted the honour to serve as your helmsman. I am sure he will be excited to meet you all. He gestured to Randy, who was adored in a full flight suit completed with a cheeky grin upon his pale face. Hey dudes, he paused to look at the girls with an eager eye and dudettes. The Overseer rolled his eyes behind him"
    }
]