[
    {
        "game_pid": "mq0jt9",
        "story_name": "I Want to Dance",
        "post_title": "I Want to Dance is a story about a cause.\n\nIt’s a story about striking back against an authority that seeks to control you.\n\nIt’s about your identity and what it means to you. About being yourself in a world that would rather you conform. It's about digging deep and pulling out all the stops and never giving up.\n\nIt’s also a story about rival pilots clashing in spiritually charged mechs, of soldiers holding their own against unbelievable odds, and of spies and artificers building something out of nothing. \n\nIt’s not a time for careful preparation or truces, it’s now or never.\n\n*It’s hard to change the world without taking a risk.*\n\n---\n\n>*For hundreds of years this has gone on. The Magister sits in their throne room unchallenged, while the rest of us do all the dirty work. Does that sound right to you, my family? No? So, we going to do something about it?*\n\n>*Sure we are.*\n\n>*We’re going to smack them where it hurts. We’re not going to sit in our homes while the magic is drained from our land, we’re going to rise up and take back what’s rightfully ours. We’re going to take back the cutting plants, the cities, the castles and the forests.*\n\n>*And we’re doing to look damn good doing it.*\n\n>*See that’s our way. Damn what some bozos in big ass metal machines say, cuz I can’t hear them from all the way up there. And what about when you get one? You ask, well I won’t be able to hear them from all the way up there, either.*\n\n>*So go forth and kick shiny metal behinds.*\n\n>*Take a risk, break a leg.*\n\n > Iogair, hero of the rebellion.\n\nThis is the last speech given by Iogair before she went missing. A dark day in the rebellion’s history, but one that’s about to change.\n\nIogair’s been found, and we’re going to get her back.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2022-11-09 19:08:51 UTC",
        "comment": "#Chapter 1: Danger close\n\n##*La Makan, 12:54 standard time*\n\nWind whistled through the close streets of *La Makan*, stirring grains of sand with all the effect of a man attempting to blow salt through eternity. It whipped around the corners of the alleys, and rustled the banners hanging from the balconies and glassless windows. It looked for something, a thing it would never find. It carried a message on the wind, static buzzing on every word.\n\n“And to each man and woman, freedom.” The *voice*, smooth as velvet, boomed. “But freedom, as with all things, cannot be attained without a price. So the magister, protector of us all, works to lower our price…”\n\nThe sound originated from a pair of large speakers arranged in the town centre. They stood sentinel in front of a stage, one with its own banners and podium. The stage was built of hastily constructed wood and metal scaffolding. It looked as though it would collapse at a moment’s notice. \n\nUpon that stage were a unit of royal guard. They shone burnished gold in the desert sun, no doubt sweltering hot. In their middle waited Ser Cabot. Her black hair, bound in a tight ponytail, flicked out behind her. She wore an expression of boredom, clearly wanting to be anywhere but in the “*backwards*” town she found herself in.\n\nYet her expression went unnoticed by the crowds who had turned out to hear the address. They gathered in the town square in their tens, the population so far reduced by relocation and poverty, and whispered among themselves.\n\nSomeone detached themselves from the crowd and shuffled over to an alley. The figure’s movements were natural enough that no one would take notice. He’d learned that skill from years of hard work in a life where you succeed, or you don’t get a second try.\n\nLieutenant Sanje pulled his dust mask tighter around his face and risked one last cursory glance at the stage before stepping into the shadow of the building. Here three more people waited for him, each having made their own way into the ghost town.\n\n“Insane. They don’t question it.” He said under his breath, then shook it out of his system and addressed the group. “We’re here. No problems, I hope?”\n\nHe didn’t wait for the answer, and ploughed on with his instructions. They had a time limit; someone would notice, or their cover would be blown. Either way wouldn’t end well for them. \n\n“Our contact gave us an area, but not an address. We have,” he checked his watch, “five minutes until the distraction starts. We need to find them and get them out. Problem is, we don’t know what they look like, only that their house is pink.”\n\nHe glanced over his shoulder at the multicoloured buildings. Any one of the scoured pink buildings could’ve been their one. “Vic, you knew Xitor the best of any of us, I’m trusting you to get us there. Everyone else, let's keep our hats on, ‘kay?”"
    },
    {
        "game_pid": "qshe7s",
        "story_name": "Persona S",
        "post_title": "\"I am thou... thou art I... from the sea of thy soul, I come... call upon me and mark thy name upon the world thou seeks to create!\"\n\nThe year is 2020. Japan has finally recovered after upset of the Phantom Thieves took the nation by storm. Yaldabaoth has been defeated, and life has settled down for good.\n\n*Or has it?*\n\nIgor sits in the velvet room, a new mission presented to him. His attendant stands at his shoulder, and a new set of tarot cards are on his desk. A new tale unfolds in front of him. This time it will shake the bonds of the entire world, and it will revolve around the Daigaku University archaeology society.\n\nPeople the world over have been forgotten. Their entire lives disappeared even down to their name. These people, known as [blanks], have spontaneously been removed from existence without warning. That is, to all except a select group of students of Daigaku University\n\nThese students are the outcast members of society; those that society have forgotten, those who know what it's like to be ignored. Those that are about to save the world. Unknown to them they are being gathered by forces for good and bad, and soon they will be awakening to a new power.\n\n*Persona.*\n\nAnd so your story begins, as a blue butterfly flutters past... \n",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2020-06-06 22:40:46 UTC",
        "comment": "*A dream.*\n\n*Everything is hazy. Darkness as far as the eye can see, it surrounds you. You hold up your fingers and it envelops them. It eats away at them, blurring the border between real and darkness. You aren’t sure where you end and it begins.*\n\n*Then you see it. The faint glow of blue shining from a butterfly as it makes its way through the darkness. You reach out to it but it is always just beyond reach. No matter how hard you strain you cannot touch the ghostly blue shape.*\n\n*You call out to it but no sound comes out of your mouth. Instead the light grows fainter still, and the distance grows. Now you fall down deep into the pits of the darkness. You can feel the wind rushing past your ears as you fall deeper and deeper.*\n\n*You land on something solid but when you look down there is nothing beneath you. Struggling to your feet you hear a voice in your ear.*\n\n*“I am thou… thou art I.”*\n\n***\n\nApril 4th. Registration day at Daigaku University.\n\nThe small peaceful campus is peaceful no more as returning students and new arrivals make their way to sign up for their elective courses. Nowhere from the new fancy looking modern buildings of the science labs, to the old European import buildings of the university main house or the walled parks and water gardens are free of life.\n\nThe university station is packed. People of all shapes and sizes are crammed into train carriages or on the platform. People call out to each other, waving their hands over the crowds to attract the attention of their fellows. In the corners shady vendors stand hawking their wares to anyone unlucky enough to pass by without a companion.\n\nOn the lawns sports clubs are yelling their lungs out while wildly waving fliers for their respective practice. In one place a space has been cleared for the award winning Kendo team to demonstrate their Katas, which has gained quite an audience. On a court a jump in practice basketball game began but no one’s quite sure the basketball society started it.\n\nIn the canteen glorious smells waft through the air, and the bustle of lunchtime conversation makes war with the sound of musicians busking in the open air courtyard. People constantly stream through the doors but no matter how many pass there’s no shortage of food for all. Those that leave find themselves in possession of a newspaper, completely unsure of how or where they got it.\n\nIn the middle of it all, five complete strangers find their way across campus, completely unaware of just how much their life is about to intertwine. All are watched as they make their way across campus by a tall man in a blue blazer; his white blond hair swept back in a manner reminiscent of a member of the yakuza, and his half moon spectacles hanging on the end of his nose. \n\nIn a moment he would gather them up like poker winnings, but for now it was easier for him to watch how the chips fell."
    },
    {
        "game_pid": "7pe6rj",
        "story_name": "New World Blues",
        "post_title": "\"C'est la vie\", say the old folks\nIt goes to show you never can tell\"\n\n2141.\n\nAfter the downsizing didn’t work, humanity was forced to take to the stars before their time. Between the new worlds we forged a life for ourselves, something of a frontier, but like with all frontiers things didn’t exactly go to plan. After wars, planetary politics and the breakdown of common government, the Sol system became fractured and rifts formed. Many planets became independent, and nations within them sprang up forging ever smaller communities.\n\nTo fill the gap, new roles of society sprang up. Some are Runners; willing to fly cargo ships through blockades and battlefield so that fringe groups could survive. Others are Wisemen who believed the universe speaks through them, leading their flock of misguided souls. Worst are the Bounty Hunters willing to take a life just to pay the bills. It’s lonely up there among the stars, but someone had to do it, may as well be them.\n\nSometimes it’s a roll of a dice just to keep love and life alive.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2020-05-30 22:05:37 UTC",
        "comment": "Lunar, the forgotten moon.\n\nThe descent to the moon’s surface could not have felt longer. The inter-Terra transit company decided in-flight entertainment wasn’t a necessity, so it was eight hours from the closest transit hub in a sealed tube with nothing to do. The small view port slits next to the seats weren’t even proper windows, so it was hard enough to see the Oasis facility as one made the long descent. Still, as the sealed doors of the tube opened and the flight attendant in her slightly-too-tight blue waistcoat ushered the crew out of the door the locale became apparent.\n\nBuilt as a cul-de-sac, Oasis was a mixture of the new and the old. The far buildings were the clean, crisp looking white buildings of pre-downsizing technology, and the closer ones boxy and rusted looking prefabs that were a long time in need of being removed.\n\nAs though whoever had planned the place decided to ignore the discrepancy; the lawns and teardrop street lights that lit the avenue leading up to reception looked like a patch job to cover the glaring issue. Probably the nicest looking things here were the vintage fords and chevys arranged like a synchronised dance routine along the small patch of tarmac road.\n\nBeyond the glass domed facility nothing existed but moon rock,  beyond that the stars, and the distant but noticeable shadow of Vita Regnans blotting out a patch of starlight. It all combined to give the place an early evening feel despite the clocks showing just past twelve-thirty at night. Earth time, obviously.\n\nAt the base of the ramp to the landing pad the guide stopped. He took out a cigarette and put it to his lips, without lighting it he glanced down at the clipboard in his hands. Meanwhile a tidal wave of lab coats and scrubs spread out to relieve those on their shifts. \n\n“Okay, y’all are looking for a Doctor Herbert Achebe.” He scratched the back of his head as he glanced through the group assembled before him. “Should find him in the reception hall over there,” he indicated the central building with a nod of his head, “just ask the pretty girl at the desk and she’ll put you through.”\n\nHis clipboard fell to his side and he sniffed the air. “Oh and Marshal, sir,” he added hastily, “good hunting.” \n\n***\n\nInside the facility things looked nicer. The floors were polished white, the ceiling smooth metal panels with circle lights spread to get the best coverage. Even the chairs looked recently cleaned and the bins were almost empty. Not that it helped the smell; chemicals and the faint undertone of cigarette smoke.\n\nSomewhere in the air the scratchy sound of a gramophone sung Frank Sinatra’s *Fly Me to the Moon*. It wasn’t in the lobby, but it was loud enough that it could be heard without the need to concentrate. It filled the weirdly empty void which one would usually associate with people, more so somewhere like a hospital.\n\nOf the two people present, one sang along to it. The other, a petite young woman sat behind the reception desk, looked down at the paper in front of her. She wore a soft smile, entirely engrossed in her work. She didn’t look up when the doors opened, the only indication she was even alive was when she swept a few strands of platinum blonde hair out of her pale face.\n\n“How can Oasis help you tonight?” She spoke to the air when someone approached her desk."
    },
    {
        "game_pid": "b98433",
        "story_name": "Ever Onward",
        "post_title": " Welcome, one and all, to the UEC Ever Onward.\n\nWe guarantee this marvel of modern technology is the pinnacle of human advancement. Its sleek design shows off the greatness of humanity, as it boldly journeys where no one has gone before.\n\nFeaturing fourteen decks, the Ever Onward has state of the art facilities. It boasts ample private quarters, leisure decks, kitchens and canteens. It's medical facilities are up to date and beyond, and it's essential systems are well taken care of. We prepared to make your life as easy as possible on the longest trip Humanity has ever attempted.\n\nBelow the hood the Ever Onward has the latest in engine designs. This specialist equipment uses folding to shorten the distances between ship and destination. Combined with comfortable, efficient nuclear engines, it’s the fastest ship ever made. And it sails smooth as a whistle to boot.\n\nAnd let’s not forget the Linsbridge Gravity Engine to ensure you always feel like you’re at home, even away from home. Comfort is our top priority. There’s no reason to feel homesick on our flight, and when you get back we’ll have plenty to talk about.\n\nBut don’t take our word for it, Admiral James Lightspeed is here to attest to the Ever Onward’s brilliance; “*To say I was impressed is an understatement. When I first saw the designs I never thought they could do it, let alone finish it in only ten years. The ship itself is the finest ship I’ve ever been on, and I’m looking forward to the journey.*”\n\nHigh praise, do you think? We will live up to expectations. But that’s enough talk from us, why not sign up today and take a look?\n\n---\n\nAn advert for the UEC Ever Onward programme\n\nThe above, or a variation of it, was on nearly every wall, TV screen, website or anywhere else with advertising.\n\nThe programme itself was for the first ever extrasolar journey conducted by humanity. The destination; an Earthlike planet five years away, making the journey a ten year round trip.\n\nThe ship itself is capable of carrying four thousand crew members. The intent was that not all would be active at any time.  A network of cryogenic freezing pods provides a rotating crew.  This avoids the complications of prolonged cryogenic freezing. \n\nAnyone could sign up, with up to ten year training programmes while the ship was in production. \n\nNow it’s time to depart.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2022-05-07 21:33:38 UTC",
        "comment": "“Welcome one and all, to the grand departure of the UEC Ever Onward.”\n\nThe loudspeakers blared, without any static, over the UEC exploration facility, Ontario. It hailed through hangers, over observation decks and even in the courtyard outside. It rang out over the noise of the gathering crowds of personnel and public alike.\n\nA cheer went up the moment it did, loud enough to deafen anyone who wasn’t ready for it. It drowned out the next part of the speech, but that didn’t make anyone any less enthusiastic. Today was the day, ten years in the making, and no one was in a bad mood.\n\n“Starting at 05:00 this morning, the crew have been preparing for departure. Step one was conducting final maintenance, and step two was loading the longest lasting supplies...” The spokesperson carried on. The speech was in English, but for any speaks of other languages it was available in any spoken across the world.\n\nJust like there were people across the world there. Every culture and nationality represented, one way or another. The crowds of people were impressive. They gathered in the courtyard, spilled  through reception and into the viewing dome. On the hanger, beside the Ever Onward, family and friends only added to the masses.\n\nThe ship itself was impressive. It sat motionless, for the moment, on its transit rail. It was ready to move out any time, when the crew finished boarding. It stood sentinel over weepy goodbyes, or the brovadosious slaps on the back. On each boarding ramp a member of the bridge crew stood ready to meet and greet their starting crew.\n\nNear the front was the Captain, looking old but intense. At the second was the chief engineer, looking nervous and out of place. At the third was the chief of medicine, looking genial and welcoming. They shook hands or said encouragement to the army of jumpsuited individuals boarding. Each carrying hand luggage ready for liftoff.\n\n---\n\nOn the inside of the ship people hurried to deposit their luggage in their room claims or to man their stations. Everyone smiled or wished each other good luck, passing by on their way. Everything was lit by orange ceiling lights and green LEDs along the floors. Each floor and wall was smooth and polished.\n\nA low hum resounded through the interior. It permeated every surface, and was louder the more decks one descended. The source was in the engine room. The generators, which started long before, powered reserve batteries and warmed up propulsion. \n\nThe engineering deck was buzzing with activity. Engineering assistants rushed with clipboards or toolkits for last minute tuneups. Section leaders barked orders or talked through microbead earpieces. At the head of it all, Gio Vessacci, assistant head of engineering, stood proxy for Mattia while she was away.\n\nHe was stern but fair, and he gripped the railing of his observation post with excitement. His face was lit up by the underglow of blue as the engine ready lights lit up, one after another. The very tension in his muscles reflected the mood of anticipation.\n\n---\n\nElsewhere on the ship, a gathering was forming in the many canteens. On the observation deck, people filled the canteen to the walls. They gathered to witness the departure from the inside. There was the bubble of casual conversation and a warm atmosphere.\n\nSomeone appeared with glasses of Champaign. They moved through the crowd offering it to anyone who wanted it. The chef was hard at work in the kitchen beyond, preparing snack food and other delicacies.\n\nNew people were gathering every minute. \n\nThe ceremony had begun."
    },
    {
        "game_pid": "jaatcf",
        "story_name": "The Four Dragon Festival",
        "post_title": "Grandmaster Zhihao Bai Zhu’s tenure is coming to an end. Over his long and generous life he earned many achievements. He united the Northern and Southern styles. From that alliance he brought forth a new generation of practitioners. It is even said that he achieved the much sort after enlightenment. Unfortunately, as with all people, his life must come to and end but before that he intends to choose a successor.\n\nAnd so, with the Emperor's blessing, the Grandmaster looks to the four dragon festival for an answer. For the first time in 86 years this ancient ritual will help him choose his successor. For two days and two nights, martial artists across the world will gather. Old rivalries will be rekindled and new alliances formed. Then at the climax, under the new moon, the Grandmaster will pick his successor.\n\nOn the subject the Grandmaster refuses to comment. Instead he spends his time dwelling upon it in his sanctum. Many believe the Grandmaster’s own pupil, Master Hua Zhong, will be chosen. Others believe a practitioner of common birth will come from the ranks.  With such honour at stake even those that do not practice  rush for an audience with the Grandmaster.\n\nRumour has it that even the Island of the Sun has sent a delegation. Those of honourable skill not recognised by many of the mainland seek to prove their place in the halls of the forbidden palace. Maybe one will stand alongside the murals of the Great Grandmasters.\n\nHowever, not all is as it seems. There are some who seek to end the alliance between the North and South. Their goal is to return the world to its rightful place of feuding war. They slither from clandestine meetings, and plot to bring death upon the aging Grandmaster. Should they succeed before he is able to pick his successor, the world will plunge into chaos.\n\nNot even the wisest astronomer or most talented prophet could see the outcome of this festival of the ages.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2021-06-20 23:30:09 UTC",
        "comment": "The day began with heat, perhaps uncharacteristically so, and then with dirt. Many speculated the heat was a sign the festival would be a time of great change, while some said it was a warning. To those on the day, it was dry.\n\nThe roads were thick with people. Some were entourages of masters looking to try their luck, others simple spectators. In between, beggars and thieves moved but spirits were high enough no one noticed.\n\nHigh spirits did not kill the rivalries between styles though, and every few steps a new duel began. When such happened, those with more time or investment stopped to watch.\n\n---\n\nIt was just such an occasion, on the road from the South Coast to the Imperial city, that two masters looked to duel. They strolled off the path onto the grass, the sun beating down on their heads, and took five paces between them.\n\nTo those in the know, these two masters would instantly be recognisable. The first, a taller man rolling his sleeves back, was Sifu Fu Chao Wu. A strong contender to be head of the Eight Palms, his service record was as long as the trail on his sleeves. The second, a young woman with fire in her eyes, was Dong-Geun Eun. She who knows a thousand kicks, and daughter of the chair to The Way of the Foot.\n\n“It has been some time since I fought a Southern practitioner.” Fu Chao smiled as he slid his feet together, and rolled his shoulders. “I had thought you all died out.”\n\n“If we had it would be for the stupidity of the Northern barbarians.” Dong-Geun replied, stretching her legs. “But worry not, I shall ensure not to send you away with your tail between your legs.”\n\nThey faced each other and, fist to palm, bowed. “Please” they spoke in unison. \n\n---\n\nElsewhere, many had reached the Qing-Long river. This great body of water was the final boundary between the North and the Imperial city. It was a place of life, but taken lightly it was a place of death too. It’s current was strong, and it led all the way to the Eastern Coast.\n\nTo ford this river the Emperor built two major crossings. First was the Emperor’s own bridge; a place staffed and audited by the Imperial Guard. The second was the ancient bridge at the Serpents Tongue where the river was divided in two. \n\nDue to the nature of those traveling to the festival people packed onto both bridges. The waits to cross would be hours if not days. Camps appeared for those who could afford to wait and boats for those who weren't. \n\nBut like with all gatherings of people, these areas were tense and not without their problems. With far too many to contain, the Imperial Guard could not stop every crime or intercede in every duel.\n\n---\n\nFor those taking the western roads though there was an altogether different problem. Long had the poorer western lands been plagued by banditry. Their trade routes plundered and their highways ransacked. Anyone travelling here would need a strong arm and a tough heart.\n\nThough many ventured beyond their walls, few reached their destination. The bandits had little interest in the festival. They saw it as a waste of time brought on by those who had too much money. The mountain clans of this mind stalked down to patrol roads and set up toll posts.\n\nTo a brave practitioner they may be little challenge, but to those not so strong they would prove a deadly. No journey in these parts could end without blood.\n\n---\n\nSuch was the Four Dragon Festival, that really began long before the day the festival started."
    },
    {
        "game_pid": "rq9q1f",
        "story_name": "Queenslayer",
        "post_title": "The year is 2020, the Tokyo Olympics.\n\nJapan takes the gold in the *Golpelota* tournament, smashing the German team 123 to 78. The match is spectacular, lighting a fire in the youth of the nation. In particular a light is lit in the hearts of six girls watching their father’s compete on an international level. \n\nOver the next years these girls played Golpelota under their parent’s tutelage, inheriting their father’s talent. They excelled, becoming incomparable in their respective positions. When the oldest, Yuna Akiyama, reached middle school she made them take a vow that they would not play in official matches until highschool where they would compete to see who was best. \n\nNow in 2032, they are all high school aged and the battle of the *Queens of the Court* has begun. Little do they know, another team challenges their superiority.\n\n---\n\nThree years ago Nichidaisan High’s Golpelota team failed for the fourth year running to beat the regional group stages. Demoralised they disbanded, and their club room fell into disrepair. Three years later a first year appeared in the faculty office requesting the club be remade.\n\nTsubaki Tamako, the unknown Queen of the Court, made the request with the intention of defeating them all and proving they aren’t as strong as they pretend to be. While she can’t play due to injuries, she intends to act as the manager of the team and create a weapon of regicide.\n\nHer only hope is that she’ll find the players she’s looking for.\n\n---\n\nQueenslayers is a game that takes place in an alternate history timeline; In the early 2000s a new Latin American game known as Golpelota became hugely popular and internationally successful. It became a widely played game in every nation, and in Japan it gained an impressive high school following with an intense national scene.  \n\nThe sport is a full contact team sport. It’s based on a mixture of Indoor Football, Basketball, and Volleyball. It has teams of 6, with a single team captain, 5 outfield players and a keeper. A game consists of an hour of play, separated into 15 minute quarters. \n\nThe game begins with a ball toss where two players jump to take possession of the ball first. They then pass to another player and the quarter begins. The players must then take the ball into their opponents half and score in their opponents goal. A player must travel with the ball by bouncing it (dribbling) and may not hold a ball for more than two seconds.\n\nIn order to score a player must hit the ball into the goal in a similar way to spiking or serving a volleyball. This can be done from anywhere on the pitch, but is easiest done in the opponent's end zone; however, a player is not allowed to be in contact with both the ball and the floor in an end zone (unless they are the keeper). To avoid this roles such as pivots were made to set up a spike for a player in the end zone. \n\nA penalty shot is worth 1 point, a shot made in the end zone is worth 2 points and a shot made outside the end zone is worth 3 points. Games will often end in values of between 60 and 90 points.\n\n*This is all subject to change, ideas about how the game should work is welcome. I’d like to encourage potential applicants to ask questions and get involved in the creation of the sport and world. A more comprehensive rulebook is also in development which should be done by the time we begin XD* ",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2020-08-07 21:45:15 UTC",
        "comment": "*The shine of sweat, the power of the plays, the sound of the crowd as it came alive on that day twelve years ago. The day that lit a fire in the hearts of a generation.*\n\n*The well oiled machine of the Japanese Golpelota team. The whistle blew and the play began. The keeper; Mistuki Akiyama, passed the ball to Yusaka Kubo. He switched pace, driving forward to meet the German striker. A quick switch up in pace and he spun around him, passing the ball across to the centre.*\n\n*Yuri Koizumi controlled the ball, passing it between his legs from his left to right hand to avoid a steal before running a fast break into the opponents half. Cut off by a one on one from the German centre his options were limited. He took a breath, the world seemed to move in slow motion.*\n\n*Many would dispute Yuri’s next move, claiming he ran away, but to others he acted with quick thinking. Toshiro Sato slipped behind him, taking a veiled hand off before moving into space in the German defenses before they could react.*\n\n*Two attackers moved into place, jumping in unison. The perfect feint. Toshiro had all the options, he stepped in for the set and with pinpoint precision brought the ball to Taro Konishi at the apex of his jump. The German keeper moved the wrong way, panicked and out of time.*\n\n*The crack of the impact as Taro spiked the ball could be heard anywhere in the stadium. It flew without interference into the open right of the goal. There was a momentary silence as the two attackers landed, and immediately the celebrations erupted.*\n\n*The sound was deafening. Japan had pulled ahead.*\n\n---\n\nTsubaki switched off the tv and leaned back in her chair. She sighed and shook her head. Every time she watched that it gave her chills, reminded her of the memory. Reminded her of the sweet little girls they all used to be; gathered watching their parents play at the top of their game. She blinked and closed her eyes.\n\n*None of this Queens of the Court nonsense.*\n\nThen she sat forward and looked over to where Eden stood in the corner of the room. She laughed sardonically and put her hands on her knees. “The new players should be arriving soon, mostly second years. A promising first year and another third year as well.” She stood and put the remote in front of the Tv.\n\nWhen she turned, she used her foot to flick a Golpelota ball into her hand. It felt natural, just like old times. She was a *Queen* after all, the accident wasn’t her fault. Maybe it was selfish, but by the end of the year she’d prove it. Tsubaki held it out for Eden.\n\n“I’m counting on you to keep ‘em motivated.” This time the smile was genuine, and followed by a wink. “That’s the captain after all. Now come on, let’s see what they can do.”\n\n---\n\nThe sports hall was empty by the time the first new player had arrived. It was possible they expected more from the recruiting drive Tsubaki’d been doing the last week coupled with the fliers pinned to just about every notice board. But it was empty.\n\nA cage of balls stood in one corner, and two abandoned looking goals were placed at either side of a Golpelota court with faded line markers. The floor was scuffed in places and the walls were dirty. The entire place had that unused feel that a sports hall got when it’s team were away for a long time. The smell of sweat and dreams still lingered though, the oly indication that Nichidaisan had a Golpelota team at all.\n\n*The meeting place did say the old sports hall, right?* A nagging voice seemed to call out from somewhere. *Where is everyone?*\n\nLuckily they didn’t have to wait long."
    },
    {
        "game_pid": "s5r6yd",
        "story_name": "Walking on Sunlight",
        "post_title": "“*Ladies and gentlemen you join us here again for a glorious day here at Queensmont for the 53rd annual airship race. Going is good fluffy, minimal bird traffic but the wind is mildly fierce and a little greasy.* \n\n*Taking their places are fan favourites; The Lord Arthur, Anabelle’s Twilight, In Midnight Clad, Dances in Daytime and of course Seramiggia. Beside them stand many more than I can count, and the excitement is, of course, palpable.*\n\n*Over the next two weeks they will be flying from here in the heart of Argus to the Great Purple Jewel of Seranus by route picked by this year's judges. The competition is fierce, the trash talking has started and I do believe I just heard a cannon shot. Hold onto your hats ladies and gentlemen it’s going to be a wild ride.*”\n\nThe radio crackled on the bridge of the *Wistful Spirit.* The message stung a little, a clear note that the small airship wasn’t quite important enough to be counted among the kings of the sky, but that didn’t matter. This was the year one of those juggernauts would lose, and who better than a small ship like this one.\n\nStill tensions were high as the wait for the starting signal to sound dragged on. Long agonising moments that lasted from the first light of dawn. For a pilot it meant you couldn’t leave your seat because if you did you’d lose precious seconds, and for everyone else it was that coffee cup shaking anticipation that had you going back and forth from the john every twenty minutes. \n\nStill there was no lie that the lines of airships stretching out from the sky dock to the far side of Queensmont was impressive. There was every size and model ranging from the original Leven Carriers to the newer specialist models like Erinson’s Firefly. There were even shadows cast by Argus warships like In Midnight Clad. It was enough to make any airship engineer sweat.\n\nWho could say how this year would go?",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2020-10-18 23:33:50 UTC",
        "comment": "Sunlight split the clouds as the clock ticked past the four hour mark. By now every competing airship had arrived and drifted lazily in it's starting blocks. They were arranged by order of size, but as per usual not enough space was permitted for the number of competitors and many of the smaller ones were fitted in the shadows of giants.\n\nBeyond them the airdocks above Queensmont were alive with activity. Thick crowds of people packed into the observation decks like sardines, craning to get a view of ships they had only heard about in stories. Above them crew men stalked back and forth on rickety gantries and busy walkways checking and rechecking lists on clipboards.\n\nAt one side of the dock, near the clocktower, the private market buzzed with anticipation and anxiety. Though every captain was smart enough to plan for, *nearly,* every opportunity there was always the odd engine part or ration box that went awry resulting in the market rush. Of course at times like this the shopkeepers made sure to boost their prices to lethal rates.\n\nAt the other end more transport balloons were carrying last minute crew additions, more audience members and every other person you could think of that would have any kind of investment in the great race. \n\nIt was often said that \"experiencing the crowd was just as exciting as being part of the race itself,\" and looking at the place now that was obvious.\n\n---\n\nOur ship, The Wistful Spirit, was given its mooring on the smaller end of the lineup given it’s early arrival. In fact it had been sat in the allotted space for nearly two days, and since then everything that could possibly go wrong with the preflight checks had.\n\nAt first it was just a slight drift on the steering column that bugged anyone who wanted to be “*on course*” and then it was the altitude meter displaying something that was, without a doubt, wrong. After that the engine made a strange noise which made everyone a little bit uncomfortable, and finally the toilets lack of flushing.\n\nIt had made the last two days hell, but now that the four hour mark passed everything looked to be in working order, or at least as much as anyone could as for in the given circumstances. That said, no one wanted to forgo the idea of doing last minute preflight checks, and a couple of extra spares from the market wouldn’t have gone amiss.\n  \n---\n\nSpeaking of the market, though, it was clear that near one ship in particular had the same thought. At nearly every stand a group of people in the sky blue uniform of the RNAF were haggling with the shopkeepers or showing large bags of government funding. \n\nThose stands that weren’t being hassled by official navy business were occupied by the haggard crew of other smaller vessels who just wanted piece of mind. The negotiations of these stands were more tense, though whether this was due to the lack of trained soldiers or the lack of money was hard to tell. Either way it became increasingly obvious that finding a shop that sold anything useful would be that much harder to find.\n\nAs luck would have it though, there was one stall that wasn’t occupied in the slightest. With a large sign made of pieces of salvaged junk, *Lilly the Skull’s General Goods* stood open without any interference. It advertised it’s wares with flashy signs and the rather inviting smell of cooking, but one had to question the legality of anything being sold there.\n\n---\n\nThe bridge of the Wistful Spirit was no less tense, for it was tradition that before every race the course that a ship takes be reconsidered and altered as many times as is humanly possible in as short a time as possible. \n\nThe rules of the race dictate that as long as key waypoints are passed through, the exact course any ship takes is entirely up to the Captain and Navigator of the ship in question. That left a lot up to change, and that meant a navigator spent every spare moment after the course announcement knocking off any precious second they could.\n\nAnd for a small ship like the Wistful Spirit knocking off seconds was the best option, because they couldn’t hope to compete with the resources of something like In Midnight Clad or with the pace of something like The Lord Arthur without a few tricks up their sleeve.\n\nThe only hope was that this year the course could make a difference where it mattered, *and save the ship from getting shot out of the air.*"
    }
]