[
    {
        "game_pid": "f0r80d",
        "story_name": "Secrets of the Fallen City",
        "post_title": "A thousand years ago, there was magic and technology beyond anything in the world today. People lived in great cities, worshipped strange gods, and performed miracles as easily as breathing. Most wondrous of all was Val’Raz, the Floating City, held aloft by spells now lost to time—until disaster or affronted gods cast it down to earth.\n\nOr so the tales claim. Most serious scholars doubt that Val’Raz ever existed, though it is true that the ancients possessed magic unknown to any still living.\n\nThen, an expedition sent by the renowned University of Shalben into the jungles of Tahella found a ruined city scattered across the landscape.  Rumour claimed it was the great Val'Raz, and though learned minds doubted, many still wanted to see.\n\nAs the excavation of the ruins progressed, guards and scholars began to go missing. No one knew what to make of it, not until a survivor limped back to camp.\n\nHe spoke one word and then collapsed. “Demons!”",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2021-09-21 12:04:56 UTC",
        "comment": "**Central Camp**\n**Hour 15 (mid-afternoon)**\n\nThe expedition to Val'Raz, prepared with great care and expense by the combined efforts of the University and the Crown of Shalben, had thus far proceeded relatively smoothly.  Of course, archaeology was never tidy, academia was never uncontentious, and nothing that involved so many people happened without *some* tears and headaches.  But all things considered, it had gone well; the head of logistics had only threatened to resign twice.\n\nThen the disappearances had started.\n\nTo begin with, it was no more than anyone might expect; the number of people on any dig who fled back to town on discovering how much _work_ archaeology involved was frequently staggering.  The fog of suspicion and rumour was unsurprising, too, as the trenches uncovered secrets from a time of legend, and even scholars could have too much imagination.\n\nAt some point, though, everyone had to accept that there might be more to it than fanciful tales from bored students or twitchy porters. That came when a grizzled veteran of the Tahellan Warmasters’ Guild limped into camp, barely upright, gasping and bleeding.\n\n“Demons!”\n\nBael Sivornin had spent twenty years fighting beasts and men across the realms. He was no wet behind the ears greenhorn who might mistake a jungle creature for a fiend. If he said that there were demons, the expedition leaders would have to consider the idea.\n\n---\n\nTwenty minutes later, the scene in the central camp was less a meeting than a cacophony.\n\n\"Well, no one _knows_ how Val'Raz fell—”\n\n\"But _demons_, really, how fanciful.  Bandits, now that I could believe...\"\n\nAn arcanist who went by the name of Ash grimaced to hear the talk.  His long forked tail lashed out, disturbing several of his rivals' papers.  Rumour said that his mother's mother was a demon from the Infernal Planes, so it was no wonder that he didn't like this line of talk.\n\n\"Typical, isn't it?  The minute you can't explain something, it must have been _demons_.\"\n\n“Everyone, please, this isn’t helping.”\n\nNo one paid any attention to the efforts of the senior mage-scholar to bring the meeting to order until the Martial Commander slammed her blue steel-edged shield into the floor.\n\n“Quiet!”\n\nIrian Shildrath had the fierce nature and commanding presence common to clerics of the forge-god Sil Marne. She spoke, and suddenly everyone was quiet and respectful, glaring at their neighbours as if _other people_ had been causing the trouble, not them.\n\n“Thank you, Lady Shildrath.” She nodded, and took a step back, leaving the floor to the chief archaeologist, Najib Akhiran, who looked as if he would rather be anywhere else.\n\n“The most important thing is to figure out what has happened.” A few people seemed inclined to start whispering again, but a glare from Irian changed their minds. “Bael is unconscious, so we can’t question him now, and we can’t afford to wait for him to wake up. He came from the Eastern Excavation, so I plan to send a party there to investigate.”\n\nNajib looked around the room, but almost everyone avoided his eyes. More in hope than in expectation, he asked: “Does anybody want to volunteer?”"
    },
    {
        "game_pid": "jafny0",
        "story_name": "Nebulous Connections",
        "post_title": "One of the first rules for understanding humans is that no matter how wondrous anything may be, it *will* become commonplace and beset by petty complaints.\n\nAnd so it was with interstellar travel.\n\nOnce nothing but a dream woven by scientifically-minded fantasists, warp propulsion brought it into the world of the possible.  At first only for the very rich, attended by every luxury... but as the days of Stephenson's Rocket and The Flying Scotsman gave way to Southern Rail, so too did space travel fall into the hands of the masses.\n\nWhat had been unthinkable was now just another mode of transport.  People griped about delays and wrote lifestyle articles about coping with \"warp boredom\".  \n\nIt only got worse as the New Age of Colonisation made long voyages more common.  Setting up a new life on another world, under a sun that no human had ever seen was daunting enough, but coping with a month or more in deep space?\n\nIt was no wonder that long-haul space-travel became seen as \"dangerous\".  Oh, not *physically* dangerous, or at least no more so than the aeroplanes of bygone centuries.  No, this was more of a social danger, as there were whispers of colonies imploding through interpersonal drama before anyone even touched the ground.\n\nProbably exaggerated, of course, but unsettling nonetheless...",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2018-10-29 16:30:21 UTC",
        "comment": "##**I: The Grand Opening (Day 1)**\n\n\"Greetings, esteemed guest.\"\n\nThe automated voice produced the same response for every ticket presented to the reader, sounding less and less sincere as the boarding process went on.\n\n\"Greetings, esteemed guest.\"\n\nStarChaser Colonies might be a relatively low-budget project, but it certainly didn't suffer from lack of efficiency.  Uniformed security staff directed passengers down the corridors towards the heart of the ship, keeping the steady influx from turning into a crush.\n\n\"Greetings, est—”\n\n\"The 0920 shuttle from Cocoa Beach is now disembarking.  Please follow the instructions of our security and hospitality staff as you board the *Symphonia*.  Thank you.\"\n\nOnly the stragglers remained from the 0905 Cayenne shuttle, and the new arrivals had been stopped for the final security screening before boarding.  A dark-haired white woman, her age probably somewhere around forty, stood watching the proceedings in quiet approval.  She was trying to project an air of military competence, but her attitude and bearing told a different story; to those who knew what to look for she was all too obviously ex-police.\n\nHer eyes followed one passenger in particular, but she made no move to intercept him.\n\n\"Greetings, esteemed guest.\"\n\nPassengers continued to flow onto the ship, and the first of the Cocoa Beach arrivals reached the gate.  The security staff shepherded them into the correct sectors and, as they walked, their devices downloaded information about the gala reception in a few hours.\n\nUntil then, they were at liberty to do as they pleased.\n\n---\n\nTwo corridors converged and flowed forwards as one, the closely-spaced doors on either side marking it as an accommodation area.  Nearest the corner were two single cabins, smaller but more private.  One of the doors was open just enough to show a flash of green within.\n\nThe usher, a petite and androgynous person in a crisp new uniform, stepped forward to show the ticket holder down the hall to the indicated cabin.  They demonstrated the biometric entry system—as if anyone on Earth might *not* know how one worked—and swung the door open to reveal the room beyond.  It was somehow exactly as described in the recruitment literature yet also vaguely disappointing.  Even a \"virtual tour\" could tell a lie, apparently.\n\n\"If you need anything while you're settling in, come and find me.  I'll be in the corridor.\"\n\nThe door closed behind them, leaving the passenger alone.  \n\nIt was the *size*, really.  The carefully crafted words and well-chosen camera angles had somehow, probably deliberately, managed to conceal that.  Another bed, as yet empty and unclaimed, stood as a reminder that a *second* person would be sharing this too-tight space.\n\nAt least there was no noise from down the hall.  Whether that was due to clever soundproofing or simply an absence of other guests remained to be seen, but it was promising.\n\nStill, it hardly mattered.  They were aboard the ship now.  Their adventure had begun.\n\n---\n\n*More challenges will be added as the scene progresses.  For now, though you can make as many moves as you like, you should play only one card on one of the challenges.*\n\n*The **Strange(r) Bedfellows** and **Unexpected Situation** challenges are for PC-PC interaction, with one card from each player.  For an Uncertain outcome, the players get to decide what the result of their interaction looks like.  The **Settle In** challenge outcome depends only on the card you play, though you may involve NPCs and even other PCs (with permission) in your move if you want.*"
    },
    {
        "game_pid": "6c7e8g",
        "story_name": "Shadows Across a Savage Sun",
        "post_title": "Not one of the five planets that orbit the yellow star Pelagea is fit for sentient life, but that hasn't stopped this remote system from becoming a hive of activity.  The planets and asteroid fields are prime sites for gas and mineral mining—and, even better, the place is so remote that the near-ubiquitous Company has only a token presence.\n\nThat might change one day, but for now, the system is free from their interference.  Free from protection, too, but those who would mind that don't come here.\n\nEven without the Company, most people in Pelagius are engaged in legitimate work, whether that's mining, trade runs, or scientific research.  Some skirt the line between legal and... not-so-legal, turning to salvage, bounty hunting and the odd smuggling run.  But that's all mostly harmless, and it's not as if you ever fire the first shot.\n\nAnd then there are the others: pirates and brigands who ply their nefarious trade from fortified \"rogue stations\".  People like the black-hearted crew of the _Shadow Chancellor_, a ship that everyone in the Pelagius System has learned to fear.\n\nThe best you can do is stay out of their way.  But that may be easier said than done.",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2021-03-23 09:30:32 UTC",
        "comment": "**_The Daggers Drawn_**\n**Trade Station Heraklion**\n\nAt some point in the not-too-distant past, the Pelagius System had been beautifully unspoilt, as most places unfit for human habitation tended to be.  Perhaps it had been a cold, indifferent, lifeless beauty, the kind that only an astronomer could truly appreciate, but even so, it was long gone now.  It had started with the discovery of rare minerals in the asteroid fields, intensified as the mining of gas giants swung back into vogue, and now the ruin was complete.  Pelagius was littered with makeshift tin-can orbital stations, barely equipped to handle mining, commerce, science, and all of the necessities of modern life.\n\nOf these floating bases or 'outposts', the largest and most prominent was Heraklion.  When interstellar freighters made it to Pelagius, most of them docked here, so it was the best place to go if you had something to sell, or needed anything the system couldn't provide.\n\nIt also housed _The Daggers Drawn_, the best-known merc bar in Pelagius.  If you needed to hire someone who at least probably wasn't a pirate, there was nowhere better.  There was nothing so crude as a \"job board\"; fixers and agents set up meetings in a discreet location, and sometimes friends ran into one another and exchanged details.  Couriers, smugglers, salvage crews, even a few bounty-hunters: all could be found here if you knew who to ask.\n\nIf you believed what _he_ had to say, Garim Larius knew everyone of importance in the whole system.  He preferred to employ people who'd worked for him before, which had inspired \"that damn wrench jockey Malinowski\" to ask how anyone got a _first_ chance.  Larius had glowered at her, but as luck would have it, he'd had a \"little job\" on his books just then...\n\nThe rest, as a biographer might say, was history.  He wasn't their most regular _or_ their most lucrative employer, but if he had something for them, it was usually worth a look.\n\n\"It ain't much of a job.\"\n\nThey recognised this opening gambit for what it was: an attempt to keep the price down.  If he didn't need them to do this, he wouldn't have asked.  No one paid for nothing out here.\n\n\"Let us be the judge of that.\"\n\n\"That's probably best, yeah.\"  Larius shot a sideways glance at his only companion, a quietly menacing woman he called Rigger.  Whether it was her name, a nickname, a title, or just one of Larius's jokes, no one knew for sure.  Nor was it clear what her position was; some claimed she was a simple bodyguard, others that she was the brains of the operation.\n\nThe truth probably lay somewhere between the two, but wild speculation was more fun.\n\nAs was her habit, she didn't say anything in reply; very few of Larius's business associates ever heard her speak.  But she _did_ raise her eyes eloquently to the ceiling as he turned away.\n\n\"Alright, so, it's a salvage job, as I'm sure you could've worked out without me saying it.  There's a cargo—or part of a cargo, anyway—spread across the Rivera Belt, a few hours from here as you head towards Shackleton.  I got a client who wants it back, but either they can't be assed to get it, or they'd have to fill too many forms to do it the legit way.\"\n\nThis was far from uncommon; besides the reasons Larius had offered, there was also a lot less chance of any higher-ups finding out what had happened if you hired mercenaries.\n\n\"So it's just a standard tractor beam job.  Got any questions?\""
    },
    {
        "game_pid": "0qse99",
        "story_name": "Hidden Depths",
        "post_title": "For two hundred years, the village of Draythel has stood alone on its little island.\n\nThough it *is* isolated from the rest of the world—save for the ferry that runs twice a day in summer and once in winter—most of the people who live there don’t care.  They like their little town just the way it is.  Those who don’t… well, they leave.  \n\nIt happens.  Village life isn’t for everyone.\n\nOver the years, a number of people have departed Draythel for pastures new across the narrow sea, and most of them have never looked back.  But now, on the eve of the much-feted two hundred year anniversary, a few of these deserters stand at the waterfront, waiting for the ferry to take them back to their former home.\n\nOnly to find, when they arrive, that everyone has disappeared...",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2017-06-14 22:41:57 UTC",
        "comment": "The ferry was late.\n\nThough none of them had set foot in Draythel for some time, this simple fact was enough to make them feel at home, or at least spark some fond nostalgia for the place.  It was one of the constant truths of life on the island: the ferry would always be late.\n\nJust before they might have given up for the night, it arrived; a small flat-bottomed boat, piloted by a boatman who was heavily muffled against the cool and unpleasantly damp evening air.  A shroud of fog hung over the water, transformed into a sickly, fire-covered curtain as the light of the setting sun filtered through.\n\nEven before they set off, the omens were there.  Perhaps it would have been better for them to turn away, to abandon the idea of coming back to Draythel at all.\n\nNo good ever came of ignoring omens.\n\nThe next clue that something—or everything—would go wrong came when they drew close enough to the docks at Draythel to see that there were no lamps lit.  Worse, as the ferry bobbed through the last few feet, they could see that there was no one on the dockside at all.  True, it was an unpleasant evening, but that would not have stopped *everyone* from leaving their homes.  There ought to have been someone there.\n\nAs they stepped out of the boat, the creaking of the aged wooden jetty was all they could hear.  The only sound for what seemed like miles around.  No one was at the docks.  And, from the sound of it, no one was anywhere else, either.\n\nWhat was going on?\n\n---\n\n>Tutorial:\n>&nbsp;\n>Welcome to the first scene of the game!\n>&nbsp;\n>The narrative in a Storium game is driven by Challenges, like these Obstacles.  The Narrator will _set_ the challenges and give prompts for the outcomes, but it's up to the Players to describe how the outcome is achieved.\n>&nbsp; \n>A player helps to overcome challenges by using the cards in their hand.  A Strength card builds towards a Strong outcome, and represents the character positively influencing the situation.  A Weak card builds towards a Weak outcome, and represents the character negatively influencing the situation. \n>&nbsp; \n>Neutral cards (like your Subplot) are a bit different.  In this instance, as the challenge is only a single point, playing a Subplot leads to an Uncertain outcome—which means I will tell you what happens as a result of your actions.\n>&nbsp; \n>As all of these challenges are one point, you will all get to practice _writing an outcome_ (or leaving space for me to write the outcome).  When you win control, you get to say how the challenge turns out, using the Narrator's prompt.  When the challenge ends Uncertain, stop before either outcome would be reached, to allow the Narrator to take over and tell you how it went. \n>&nbsp; \n>One thing I really try to stress is that Weak outcomes are not Bad, necessarily.  Mostly I try to keep Weak outcomes to either \"success but\" (where there is a cost or a complication or the success is delayed) or a failure that enables the *player* to do something clever or fun. \n>&nbsp; \n>Another thing to bear in mind with regards to Strong and Weak outcomes: it may seem \"better\" to get Strong outcomes—but sooner or later you will run out of Strengths.  You must use **all** of the Strengths **and** Weaknesses in your hand before you get to \"refresh your hand\" and pick new ones.  That's a reason to play Weak cards over and above it just being fun!"
    },
    {
        "game_pid": "em0nzs",
        "story_name": "Scourge of the High Seas",
        "post_title": "Shanties, treasure and adventure on the high seas... could a pirate's life be for you?\n\nIf you're contemplating this exciting career change, the \"good\" ship *Scourge of the Seas* is recruiting now!  Captain Jolly Roger and his crew will show you the ropes in this new in-depth on the job training course.  Become the fearsome marauder you were born to be!  Unlock your diabolical potential today, scurvy dogs! ",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2017-10-11 10:41:53 UTC",
        "comment": "“And… *fire!*”\n\nThe acrid scent of powder filled the air, followed by the sound of splintering wood and screams from the deck of the *Scourge*’s prey, a merchant ship riding low in the water.\n\n‘Jolly Roger’, for once not *jolly* at all, stalked up and down the deck barking orders at all and sundry, sending sailors and officers alike scurrying to obey.  The battle was tipped heavily in their favour, but it had not been won just yet.\n\n“Put yer backs into it, ye load o’ lubbers!”\n\nThe captain waved his cutlass in a very expressive—but not very safe—gesture in the direction of the other ship. “Bring ‘er in!” he shouted to the helmsman. “Some of ye best get ready to go over there so’s we can secure the prize and get ‘er back to port.”\n\nFrom the look of things, not all of the merchantman’s crew had been cowed by the assault.  Whoever went over there would have quite a fight on their hands!\n \n---\n\n>**_Tutorial:_** \n>&nbsp; \n>_The narrative in a Storium game is driven by challenges like these ones.  The narrator sets the challenges and gives prompts for the outcomes, but it's up to the players to overcome the challenges and describe how the scene turns out._\n>&nbsp; \n>_To do that, you'll need to use the cards in your hand to show how your character responds to and helps to resolve the issue.  A Strength card builds towards a Strong outcome, and represents the character positively influencing the situation.  A Weak card builds towards a Weak outcome, and represents the character negatively influencing the situation._\n>&nbsp; \n>_Neutral cards, like your Subplot, have no inherent weight.  If a challenge is \"trending Strong\", then your neutral play will push the narrative closer to a Strong outcome (and thus should represent a positive effect on the situation).  If it is \"trending Weak\", then the **same play** will push the narrative closer to a Weak outcome and thus have a negative effect on the situation.  If it is the first card on a challenge, or if the challenge was previously \"trending Uncertain\", then the effect of your actions will be less clear, and you should leave it open for others to write._\n>&nbsp; \n>_As all of these challenges are one point, you will all get to practice writing an outcome (or, if you play a Subplot, leaving space for me to write the outcome).  When you win control, you get to say how the challenge turns out, using the Narrator's prompt.  When the challenge ends Uncertain, stop before either outcome would be reached, to allow the Narrator to take over and tell you how it went._\n>&nbsp;  \n>_On justifying your card plays: You do not have to use the exact words that appear on the card. Showing your character making a clever deduction is better than writing: “Character was intelligent, so…”_\n>&nbsp; \n>_One thing I really try to stress is that Weak outcomes are not Bad, necessarily.  Mostly I try to keep Weak outcomes to either \"success but\" (where there is a cost or a complication or the success is delayed) or a failure that enables the *player* to do something clever or fun._\n>&nbsp;  \n>_Another thing to bear in mind with regards to Strong and Weak outcomes: it may seem \"better\" to get Strong outcomes—but sooner or later you will run out of Strengths.  You must use **all** of the Strengths **and** Weaknesses in your hand before you get to \"refresh your hand\" and pick new ones.  That's a reason to play Weak cards over and above it just being fun!_"
    },
    {
        "game_pid": "41v10b",
        "story_name": "This Fire in Our Hearts",
        "post_title": "Few are immune to the lure of a fabled lost treasure.  You certainly aren't.\n\nMaybe treasure-hunting was your first choice for a way of life.  Maybe you're just in dire need of some fast coin.  Whatever the reason, you're part of a small band of adventurers on the trail of the near-mythical ruby known as the Heart of Fire, one of the most famous treasures from the days of the Old Princes of Ishkarin.\n\nCertainly the most famous to have never been found.\n\nThe jewel alone, with its reputed size and powers--not to mention its historical value--could set you all up for life.  With the rest of the rumoured missing hoard... well, rich beyond your wildest dreams is such a subjective statement, isn't it?\n\nIt won't be easy, of course.  There has to be a reason *why* the Heart has remained unclaimed for so many years, when your group is hardly the first to seek it.  The Lost City, where the gem is thought to be, seems determined to live up to its name.\n\nBut then, as they say in the Temple of Naukar: *Everything now found was once lost.*",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2016-06-24 00:27:46 UTC",
        "comment": "The lust for gold lies within every heart, however well-hidden it may be.\n\nOr, at least, that is what the dwarves of the Ironside Mountains say.  And, whatever the truth of this proverb in general, it was surely in the minds of the people of Ain-Qisam that evening, when they saw the motley collection of outsiders stumble into their little town.\n  \nJudging from appearances, these strange folk were adventurers, which in the desert usually meant treasure hunters.  Or perhaps grave robbers--though to the Ishkarim this was less an act of desecration and more an inevitable fact of life.  Camels spat, sand stung your eyes, jackals looted tombs.  In these more enlightened days they burned their dead anyway.\n\nSo no one in Ain-Qisam paid much attention to the visitors, save to note that some were foreigners while others were not.  The large golem that travelled with them raised a few eyebrows—but, after all, the art of golemancy was not unknown or even very obscure.  According to some of the better-educated townsfolk, it was a particularly impressive specimen, but even that was not sufficient to distract them from their own concerns.\n\nTheir indifference did not last for long, however, once they had learned *why* this particular band of treasure hunters had come to their town.\n\nFevered conversation gripped the marketplace as the locals packed away their wares:\n\n\"The Lost City?  Are you deaf or are they insane?\"\n\n\"My ears are as good as ever they were, thank you.  But yes, they seek the Lost City.\"  A shrug, careless and dismissive.  \"It is not the first time.  It will not be the last.  People will seek after anything that is lost.\"\n\n\"How else are things to be found?\"  This from Jinan, the town's lone Priest of Naukar, whose opinion on such things was both predictable and hopelessly biased.\n\n\"The Lost City is lost by the will of the gods.  Why do these fools believe they can find it?\"\n\n\"The will of the gods?\"  A snort.  \"No; it was *men* who decreed the city should be lost.  Though I will not say that they were wrong, for it was a place of wickedness and greed.\"\n\n\"Did you see?  The man is one of *them*.  Who knows what *they* might seek there?\"\n\n\"The treasures of his ancestors?\"  The speaker let out a hoarse guffaw.  \"Don't be a fool.\"\n\nSome more pragmatic soul spoke next.  \"They have a map, I believe.\"\n\n\"A map!\"  This was greeted with some scorn.  \"Anyone could draw such a thing, to profit from ignorant foreigners.  *I* could have done so.\"\n\n\"And have done in the past, I would imagine.\"  This speaker was a young woman, clad in light chainmail, a shamshir at her belt.  \"Well.  Perhaps they know the true path.  Perhaps not.  If you will excuse me, *sudiqan*, I would see these travellers and their map for myself.\"\n\n---\n\nIn the meantime, the subjects of this conversation had settled in the public room of Ain-Qisam's caravanserai.  Refreshments had been ordered, and they were now sampling the local delicacies, including what passed for beer in this part of the world.  It was a strange brew, thick and sweet, almost a gruel in its unfiltered state--but for all that it was not unpleasant, and even those who were unfamiliar with it seemed to like it well enough.\n\n(Atru, of course, could not drink it at all, though perhaps he wished he could.)\n\nIn any case, they each had more important things with which to occupy their minds; food and drink ranked a poor second to the task ahead of them.  Ain-Qisam was the last marker on their map that could be called at all civilised.  When they left on the morrow, they were to strike south and east across untracked lands, at the mercy of the merciless desert."
    },
    {
        "game_pid": "nh13vk",
        "story_name": "Sleeping Chaos",
        "post_title": "**As it says on the \"beginner games\" section, these games do _not_ count towards the 3 game limit for free players.  You only have to retire if you actually want to.**\n\n---\n\nA thousand years ago, there was magic and technology beyond anything in the world today.  People lived in great cities, worshipped strange gods, and performed miracles as easily as breathing.  Most wondrous of all was Val'Raz, the Floating City, held aloft by spells now lost to time—until disaster or affronted gods cast it down to earth.\n\nOr so the tales claim.  Most serious scholars doubt that Val'Raz ever existed, though it _is_ true that the ancients possessed magic unknown to any still living.\n\nThen an expedition into the jungles of Tahella found a ruined city that seemed to have been scattered across the landscape.  Rumour claimed it was none other than Val'Raz, and though learned minds doubted it could be, many still wanted to see.\n\nAs the excavation of the ruins progressed, guards and scholars began to go missing.  No one knew what to make of it, not until a survivor limped back to camp.\n\nHe spoke one word and then collapsed.  \"Demons!\"",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2020-07-10 08:31:00 UTC",
        "comment": "Deep in the jungles of Tahella lurk the ruins of countless lost civilisations.  Or so the stories say, and there is enough truth in them to support dozens of archaeological expeditions.  But there was always one dream that seemed to be impossible: the Floating City of Val'Raz.\n\nUntil now.\n\nThe scouts who uncovered the site noted that the shattered stone and cracked columns had no foundations in the earth beneath them.  It was as if they'd fallen from a great height.\n\nIf it was Val'Raz, that was true, both literally and metaphorically.\n\nPeople came from far and wide to join the expedition: to help or to argue, to guard or to marvel at the wonder of it.  In truth, there was very little to see, except a litter of broken stones strewn across the jungle floor, but imagination is a powerful thing.\n\n---\n\nNo one with any experience of large-scale expeditions was surprised by the fog of rumour and superstition surrounding the ruins, especially after the first few disappearances.  Those weren't unexpected either; the number of people who fled back to town upon realising how much _work_ was involved in archaeology was truly staggering.\n\nAt some point, though, everyone had to accept that there might be more to it than bored students and the fancy of twitchy porters.  That point came when a grizzled veteran of the Tahellan Warmasters' Guild limped into camp, barely upright, gasping and bleeding.\n\n\"Demons!\"\n\nBael Sivornin had spent twenty years fighting beasts and men on battlefields across the land.  He was no wet behind the ears greenhorn to mistake a jungle creature for a fiend.  If he said that there were demons, the expedition leaders would have to consider the idea.\n\n---\n\nThe scene in the central camp was less a meeting and more a cacophony.\n\n\"Well, no one _knows_ how Val'Raz fell—”\n\n\"But _demons_, really, how fanciful...\"\n\nOne of the arcanists, who went by the improbable name of Joy-in-Ashes, grimaced at this, lashing out with his long forked tail and disturbing several of his rivals' papers.  His mother's mother, so the gossip went, was a demon from the Infernal Plane of Fire.  So it was little wonder that he didn't like the current talk, or that his colleagues eyed him uneasily.\n\n\"Typical, isn't it, the minute you can't explain something, it must have been _demons_ that did it.\"  His voice was quiet, but it hissed and crackled like dormant embers.\n\n\"Everyone, please, this isn't helping.\"\n\nNo one paid any attention to the efforts of the senior mage-scholar to bring the meeting to order until the Martial Commander slammed her blue steel-edged shield into the floor.\n\n\"Quiet!\"\n\nIrian Shildrath had the fierce nature and commanding presence common to clerics of the forge-god Sil Marne.  She spoke, and suddenly everyone was quiet and respectful, glaring at their neighbours as if _other people_ had been causing the trouble, not them.\n\n\"Thank you, Lady Irian.\"  She nodded, and took a step back, leaving the floor to the chief archaeologist, Nevyz Akhiran, who looked as if he would rather be anywhere else.\n\n\"The most important thing is to figure out what has happened.\"  A few people seemed inclined to start whispering again, but a glare from Irian changed their minds.  \"Bael is unconscious, so we can't question him now, and we can't afford to wait for him to wake.  He came from the Eastern Excavation, so I plan to send a party there to investigate.\"\n\nNevyz looked around the room, but almost everyone avoided his eyes.  More in hope than in expectation, he asked: \"Does anybody want to volunteer?\"\n\n---\n\n>_**Tutorial Notes:**_\n>&nbsp;\n>_For this challenge, everyone will play their **Subplot** card and make a move to show why their character agrees to investigate.  Because Subplots are neutral cards, this means that the challenge will finish **uncertain**, and no one has to worry about writing an outcome just yet._"
    },
    {
        "game_pid": "1qaw0a",
        "story_name": "Desperate Measures",
        "post_title": "*Peace must not prevail.*\n\nWar is brewing to the south, an ancient territorial dispute rekindled with surprising and deadly fervour.\n\n*The blood price must be paid.*\n\nBandits plague the roads of the borderlands, pushing up towards the sinister marshland known as the Birchmere.  The very swamp where, if the legends speak true, an artefact of unimaginable evil was lost centuries ago, and has languished ever since.\n\n*Take up the sword and conquer.*\n\nThe Sword of Souls awaits its hour to corrupt another foolish victim - and through its agent bathe the whole continent in blood.\n\n*Listen to my song... and be lost.*\n\nIn Eastholt, over a hundred miles north of the Birchmere, a weapon master's daughter has gone missing.  All signs point to her having run away in search of a legendary weapon, wanting to become a mighty hero and save her country the pain of yet another war.\n\nCould it be the Sword of Souls that she seeks in her ignorance?  Either way, her father is determined to put a stop to her plans before she or anyone else can get hurt.  He recruits a search party to find his wayward Lydia and bring her back home...\n\n[Setting Notes can be found here: http://tinyurl.com/ko6y37t]",
        "format": "establishment",
        "role": "narrator",
        "created_at": "2014-10-23 18:47:32 UTC",
        "comment": "How long would it take you to notice that your only child had gone missing?\n\nIt took Aryn Sunderling fifteen hours.  His daughter, Lydia - bright, brash and just seventeen - was given to wandering the countryside at all hours of the day, so when she failed to show up for the morning meal, he thought nothing of it.  He was a busy man with students to oversee, and had little energy to expend on worrying about what small mischiefs Lydia might have managed to get into.  The girl could handle herself.  She *was* his daughter, after all.\n\nThen the midday meal came and went, with Lydia still nowhere to be found - and that was when Aryn began to worry.\n\nWhen he went to look in her bedroom - something that, without such a cause, he would never have ventured to do - he found a long, silly letter detailing his daughter's plans to search for a legendary weapon.  Her plans to become a great hero.  Her plans to get herself embroiled in the war that was possibly brewing between Atalera and Vidaris, miles to the south.  And *that* was when Aryn sent out a call for professional help.\n\nThere were always adventurers passing through Eastholt.  It was a well-supplied minor trading post that provided a good deal of goods and services interesting to those of an itinerant persuasion - and for those who fancied themselves as warriors, there was Aryn's school.  Many of the local adventuring fighters had trained there at some point or other, and it was generally considered good form to offer to spar the current students when passing through.\n\nAnd so, when Aryn Sanderling put out a call for adventurers, it took hardly any time at all for five likely candidates to be gathered in front of him.  The weapons master looked at the composition of the little group, and wisely threw out any parts of his planned speech that centred around the flightiness of young women.\n\n\"Thank you for turning out at such short notice,\" he said, as he paced before them.  \"I assume you have already heard the reason for my call - but in case you have not, my daughter Lydia has run away.  She left a letter behind, in which she outlines her intention to find a weapon of legend and end the potential war with Vidaris before it can start.\"  He shook his head.  \"Which would be worrying enough, even had I not found a copy of this book under her pillow.\"\n\nHe handed the book to the nearest adventurer, who took a look at the title page, blanched and passed it on.  As far as potentially harmful fantasy masquerading as history went, it was hard to do better - or worse - than *Sword of Destiny: The Truth Behind the Legend of the Sword of Souls*.  And it was hard to think of a worse legendary weapon for a naive young person to seek in innocence. \n\n\"You will no doubt understand why I put out such an urgent call.\"  Aryn said, his voice dry, his face pained.\n\nOf course they did.  How could they not?\n\n\"Warden only knows how she set hands on that book, but at least it tells us what she is seeking and where she will be going.\"  He grimaced.  \"The *fiction* between these covers espouses the popular opinion that the Sword was lost in the Birchmere when the invader Riach was slain and his armies driven back to Vidaris.  So that is where she would go, at least at first.\"\n\nIt would be a long journey, especially on foot.  They could hope to catch Lydia on the road long before then - but the girl had been gone for hours now.  Their best hope might be to travel with all haste to Barrowdene, forty miles and more to the south, and hope to pick up news there.\n\n\"One more thing,\" Aryn said, his eyes as hard and cold as flints.  \"One of the Eastholt Guard saw her leave, but was... *persuaded* not to report it.  He is presently in the stocks.\"  Barely-restrained violent anger tightened the weapons master's face, reminding all present that, middle-aged or not, there were still few who could best Aryn Sunderling in a fight.  \"I don't know what good questioning him might do you, but perhaps you wish to throw something at him before you leave.\"\n\nSuddenly his faced softened, and in a much more gentle voice - the voice of a worry-stricken father - he said, \"I... there is no way for me to thank you enough for what you are doing for me - and for Lydia.  This is a truly noble thing that you do.  From the bottom of my heart, I thank you.\""
    }
]