[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided in the chat history likely include detailed, actionable rules for plot development, creativity, character and setting development, and language use. These rules are structured categorically and tailored specifically to the writing prompt, ensuring comprehensive guidance for narrative generation.\n\nFor the new writing prompt, the rules should focus on the internal conflict of the protagonist, the moral and emotional weight of his decisions, and the dark, introspective tone of the story. The narrative should explore themes of power, guilt, and the cyclical nature of violence, with a strong emphasis on character development and psychological depth.\n\n<story_rules>\n- **Plot**:\n  - Structure the story around the protagonist's internal struggle with the decision to assassinate the new leader.\n  - Begin with a scene that establishes the protagonist's past actions and the current political climate.\n  - Develop a series of events that force the protagonist to confront the new leader's cruelty and the potential consequences of inaction.\n  - Include flashbacks or memories that reveal the emotional and psychological toll of the protagonist's previous assassination.\n  - Build towards a climax where the protagonist must make a definitive choice, highlighting the moral and ethical dilemmas involved.\n  - Conclude with the immediate aftermath of the protagonist's decision, emphasizing the lasting impact on his psyche.\n\n- **Creativity**:\n  - Use a dark, introspective tone to reflect the protagonist's inner turmoil and the gravity of his decision.\n  - Incorporate symbolic elements and motifs that represent the themes of power, guilt, and the cyclical nature of violence.\n  - Employ vivid and evocative descriptions to create a tense and immersive atmosphere.\n  - Introduce secondary characters who challenge or support the protagonist's views, adding depth to the moral conflict.\n  - Explore unconventional narrative techniques, such as non-linear storytelling or unreliable narration, to enhance the psychological complexity of the story.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a complex, multidimensional character with a rich backstory and deep emotional scars.\n  - Highlight the protagonist's internal conflict through detailed inner monologues and interactions with other characters.\n  - Create a vivid and oppressive setting that reflects the political turmoil and the new leader's cruelty.\n  - Use the setting to amplify the protagonist's sense of isolation and desperation.\n  - Develop secondary characters who embody different perspectives on the new leader's regime and the protagonist's potential actions.\n\n- **Language Use**:\n  - Use a formal and somber tone to match the gravity of the story's themes.\n  - Employ descriptive and evocative language to create a vivid and immersive atmosphere.\n  - Focus on the protagonist's internal dialogue, using introspective and reflective language to convey his emotional and psychological state.\n  - Use dialogue to reveal character motivations and to heighten the moral and ethical dilemmas faced by the protagonist.\n  - Maintain a consistent tone that reflects the dark and introspective nature of the story.\n</story_rules>"
]