[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided focus on:\n1. **Plot**: Clear narrative progression with a focus on internal and external conflicts.\n2. **Creativity**: Use of metaphors, surreal elements, and imaginative scenarios to enhance the narrative.\n3. **Development (Character and Setting)**: Detailed character development and immersive settings that reflect the emotional states of the characters.\n4. **Language Use**: Poetic, evocative language with a focus on sensory details, maintaining a consistent tone that reflects the themes of the story.\n\nFor the new writing prompt, the **Story Rules** should guide the narrative to explore the protagonist's evolving perception of their old college friend, the contrast between past and present, and the emotional impact of these observations. The rules should ensure a balance between introspection and external observations, with a focus on character dynamics and the setting's role in reflecting the protagonist's emotional journey.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist unexpectedly encountering their old college friend in a familiar or significant setting.\n  - Develop the narrative through the protagonist's observations and reflections, gradually revealing the cracks in their friend's facade.\n  - Introduce specific incidents or interactions that highlight the changes in the friend's character and life circumstances.\n  - Conclude the story with the protagonist's realization or acceptance of the friend's imperfections, leaving room for introspection and unresolved questions.\n\n- **Creativity**:\n  - Use metaphors and symbolic elements to represent the contrast between the friend's past perfection and present flaws.\n  - Incorporate flashbacks or memories to juxtapose the friend's past and present selves, enhancing the narrative's emotional depth.\n  - Blend elements of realism and subtle surrealism to create a sense of disorientation and discovery.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist's character through their internal monologue and emotional responses to the friend's changes.\n  - Provide detailed descriptions of the friend's appearance, behavior, and surroundings to illustrate the cracks in their facade.\n  - Use the setting to reflect the protagonist's emotional state and the evolving dynamic between the characters, creating an immersive atmosphere.\n\n- **Language Use**:\n  - Employ poetic and evocative language, with a focus on sensory details and metaphor to create a rich and immersive narrative.\n  - Maintain a reflective and contemplative tone, matching the protagonist's introspective nature and the theme of rediscovery.\n  - Use dialogue sparingly and ensure it contributes to the overall sense of revelation and emotional depth.\n  - Create a tone that is melancholic and contemplative, reflecting the protagonist's emotional journey and the themes of the story.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed and structured rules under the categories of Plot, Creativity, Development (Character and Setting), and Language Use. Each category contained specific, actionable instructions that were tailored to the unique elements of the writing prompt. The rules emphasized the importance of thematic consistency, character development, and immersive descriptions.\n\nFor the new writing prompt, the rules should focus on the mysterious and potentially eerie nature of the wedge-shaped house, the impact of the environment on the characters, and the gradual revelation of the house's secrets. The tone should be suspenseful and slightly unsettling, with a focus on building tension and intrigue.\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonists moving into the wedge-shaped house, highlighting their initial impressions and reasons for choosing it.\n  - Develop a sense of unease as the seasons pass, with subtle hints and strange occurrences that suggest the house holds secrets.\n  - Introduce a series of mysterious events or discoveries that gradually reveal the house's hidden nature.\n  - Build towards a climax where the protagonists confront the house's secrets, leading to a resolution that leaves a lasting impact on their relationship and perception of the house.\n\n- **Creativity**:\n  - Use the unique shape and location of the house as a central element in the story, incorporating it into the plot and atmosphere.\n  - Incorporate elements of mystery and suspense, using the house's oddities to create a sense of intrigue and tension.\n  - Explore the psychological impact of the house on the protagonists, using surreal or dream-like sequences to blur the line between reality and imagination.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonists' characters through their interactions with each other and their reactions to the house's mysteries.\n  - Provide detailed descriptions of the house and its surroundings, using sensory details to create an immersive and eerie atmosphere.\n  - Show the progression of the protagonists' relationship as they navigate the challenges posed by the house, highlighting changes in their dynamics and emotional states.\n\n- **Language Use**:\n  - Use descriptive and evocative language to create a vivid and immersive narrative, focusing on the sensory details of the house and its environment.\n  - Maintain a tone of suspense and unease, using pacing and word choice to build tension and intrigue.\n  - Employ dialogue to reveal character traits and advance the plot, ensuring it contributes to the overall sense of mystery and suspense.\n  - Use metaphors and similes to enhance descriptions and convey the psychological impact of the house on the protagonists.\n</story_rules>"
]