[
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used in crafting the rules. The few-shot demonstrations emphasize a deep exploration of internal conflict, metaphorical and symbolic storytelling, and a focus on introspection and character development. The rules are structured into categories: Plot, Creativity, Development (Character and Setting), and Language Use, each with specific, actionable instructions and examples.\n\nFor the new prompt, the rules will need to focus on the theme of perception versus reality, the unraveling of a seemingly perfect facade, and the protagonist's internal journey as they reconcile their past perceptions with present observations. The examples will illustrate how to depict the gradual revelation of flaws and the protagonist's emotional response to these discoveries.\n\nI will ensure the rules are comprehensive, providing detailed guidance on plot progression, creative elements, character and setting development, and language use, all tailored to the new prompt's themes and narrative potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a chance encounter between the protagonist and their old college friend in a familiar setting, such as a coffee shop or a college reunion. Use this meeting to establish the friend's seemingly perfect nature and the protagonist's initial admiration.\n  - Develop the narrative through a series of observations and interactions that reveal the friend's imperfections and the protagonist's growing disillusionment. For example, describe a moment when the friend makes an offhand comment that contradicts their previous values.\n  - Introduce a pivotal moment where the protagonist confronts their own biases and assumptions about the friend, leading to a deeper understanding of both the friend and themselves. This could be a reflective scene where the protagonist recalls a past event with new insight.\n  - Conclude with a resolution that emphasizes personal growth and acceptance, such as the protagonist acknowledging the complexity of human nature and embracing the imperfections in themselves and others.\n\n- **Creativity**:\n  - Use the theme of perception versus reality to explore the complexities of human relationships and the illusions we create. Incorporate symbolic elements, such as mirrors or reflections, to emphasize the theme of self-discovery and revelation.\n  - Create a sense of intrigue and gradual revelation by weaving in subtle clues and inconsistencies in the friend's behavior. For instance, describe the friend's nervous habit that the protagonist never noticed before, hinting at underlying stress or insecurity.\n  - Incorporate elements of nostalgia and memory, using flashbacks to contrast the friend's past and present selves. This can be achieved by describing a vivid memory of a college event where the friend seemed flawless, juxtaposed with their current demeanor.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a reflective and observant character, using their internal monologue to convey their evolving perceptions and emotional journey. Highlight their initial idealization of the friend and the subsequent realization of their own biases.\n  - Portray the friend as a multifaceted character, using their imperfections to drive the narrative and create tension. Use dialogue and body language to reveal their vulnerabilities and complexities.\n  - Use the setting to reflect the protagonist's emotional state and the dynamics of their relationship with the friend. Transition from a vibrant, nostalgic setting to a more subdued, introspective environment as the protagonist's perceptions shift.\n\n- **Language Use**:\n  - Employ descriptive and introspective language to convey the protagonist's emotions and observations. Use sensory details to create a vivid and immersive experience, such as describing the friend's appearance and demeanor in detail.\n  - Maintain a tone of curiosity and introspection, using reflective and contemplative language to explore the protagonist's internal conflict and the story's themes. For example, describe the protagonist's thoughts as they grapple with the disparity between their memories and the present reality.\n  - Use dialogue sparingly, focusing on the protagonist's internal monologue and observations to drive the narrative. When dialogue is used, ensure it reveals character motivations and deepens the narrative, such as a conversation where the friend inadvertently reveals a personal struggle.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used. The demonstrations emphasize a strong connection between the plot and the protagonist's internal journey, use of metaphor and symbolism, and a focus on introspective and sensory language. The rules should guide the narrative to explore the mysterious and potentially supernatural elements of the Triangle Zone, while also delving into the dynamics of the protagonist's relationship with their partner. The examples should illustrate how to weave these elements into the story effectively.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist and their partner moving into the wedge-shaped house, highlighting their initial excitement and curiosity about the low rent and unique architecture. For example, describe their first impressions as they step inside, noting the odd angles and the constant rumble of passing trains.\n  - Develop the narrative by gradually introducing strange occurrences within the house, such as unexplained noises, shifting shadows, or objects moving on their own. Use these events to build tension and intrigue, leading the protagonist to question the true nature of the Triangle Zone.\n  - Introduce a pivotal moment where the protagonist discovers a hidden aspect of the house, such as a secret room or an old journal, that reveals clues about its mysterious past. This discovery should propel the story towards a climax where the protagonist must confront the house's secrets.\n  - Conclude with a resolution that ties together the house's mysteries and the protagonist's relationship with their partner, such as deciding whether to stay or leave. Ensure the ending leaves a lasting impression, reflecting on the impact of the Triangle Zone on their lives.\n\n- **Creativity**:\n  - Use the house's unique shape and location as a metaphor for the protagonist's relationship and personal journey. For instance, describe how the narrow, confining spaces mirror the growing tension between the protagonist and their partner.\n  - Incorporate elements of mystery and the supernatural, such as ghostly apparitions or time anomalies, to enhance the story's imaginative quality. For example, describe a scene where the protagonist glimpses a figure from the past through a window that shouldn't exist.\n  - Create a sense of unease and suspense by weaving in subtle hints and foreshadowing about the house's true nature, such as cryptic messages or recurring dreams.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist and their partner as complex characters with distinct personalities and motivations. Use their interactions and reactions to the house's mysteries to reveal their relationship dynamics and individual growth.\n  - Portray the house as a character in its own right, using detailed descriptions of its architecture and atmosphere to create a vivid and immersive setting. For example, describe the way light filters through the narrow windows, casting eerie shadows that seem to move on their own.\n  - Use the setting of the train lines to emphasize the house's isolation and the constant pressure on the protagonist and their partner. Describe the relentless noise and vibrations as both a physical and metaphorical barrier to their peace and understanding.\n\n- **Language Use**:\n  - Employ descriptive and sensory-rich language to convey the atmosphere of the house and the protagonist's emotional state. Use vivid imagery to bring the setting and characters to life, such as the metallic screech of the trains or the musty scent of the old wood.\n  - Maintain a tone of mystery and suspense, using introspective and contemplative language to reflect the protagonist's inner turmoil and curiosity. For example, describe the protagonist's thoughts as they lie awake at night, listening to the house creak and groan around them.\n  - Use dialogue sparingly to heighten the sense of isolation and focus on the protagonist's internal monologue and sensory experiences. When dialogue is used, ensure it reveals character motivations and advances the plot, such as a tense conversation about whether to investigate the house's secrets further.\n</story_rules>"
]