[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used. The prompt focuses on memory as a form of resistance, suggesting themes of defiance, history, and the impact of the past on the present. The rules will need to guide the narrative to explore these themes deeply, using memory as both a plot device and a thematic element. The examples will illustrate how memory influences characters and settings, and how language can evoke the emotional weight of remembering. The rules will be organized into the specified categories, ensuring they are actionable and specific to the prompt's objectives.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Center the narrative around a pivotal event or series of events that characters are determined to remember, despite external pressures to forget. For example, depict a community gathering annually to recount a historical event that authorities have tried to erase from records.\n  - Use memory as a driving force for character actions and decisions. Show how the act of remembering influences the plot, such as a character uncovering hidden truths about their ancestry that empower them to challenge the status quo.\n\n- **Creativity**:\n  - Employ symbolic elements to represent memory and resistance, such as a recurring motif of a tree that has witnessed generations of stories. For instance, describe how the tree's roots intertwine with the memories of those who gather beneath it.\n  - Integrate non-linear storytelling to reflect the fragmented nature of memory. Use flashbacks or dream sequences to reveal key moments from the past that shape the present narrative, like a character recalling a childhood story that inspires their current actions.\n\n- **Development (Character and Setting)**:\n  - Develop characters who are deeply connected to their memories, showing how these memories define their identities and motivations. For example, portray a character who carries a locket with a photo of a lost loved one, using it as a talisman of resistance.\n  - Create a setting that embodies the weight of history, such as a town with monuments or ruins that serve as constant reminders of the past. Describe how the environment influences the characters' resolve to remember, like a mural depicting historical events that becomes a rallying point for the community.\n\n- **Language Use**:\n  - Use evocative and sensory language to convey the emotional depth of memory. Describe memories with vivid imagery, such as \"the scent of jasmine lingering in the air, a whisper of summers long past.\"\n  - Incorporate repetition and rhythm to emphasize the persistence of memory. Use phrases that echo throughout the narrative, reinforcing the theme of resistance, like \"We remember, we resist, we endure.\"\n</story_rules>"
]