[
    "<thinking>\nAnalyze the few-shot examples to understand the structure and level of detail required for the **Story Rules**. The examples provide a clear framework for organizing the rules into categories: **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category should contain specific, actionable instructions that align with the new writing prompt's themes of memory, resistance, and the impact of the past on the present.\n\nThe new writing prompt suggests a narrative that explores the power of memory as a form of resistance. The story should delve into the emotional and psychological aspects of remembering, highlighting how the characters' lives are shaped by their refusal to forget. The tone should be reflective and poignant, with a focus on the struggles and triumphs associated with holding onto the past.\n\nBased on this analysis, the **Story Rules** will be crafted to guide the narrative in a way that emphasizes the significance of memory, the emotional weight it carries, and the resistance it represents.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story by establishing the context in which remembering is an act of resistance, providing background on the societal or personal forces that seek to erase the past.\n  - Introduce the main characters early on, highlighting their connection to the memories they are determined to preserve.\n  - Develop a central conflict that revolves around the struggle to keep memories alive in the face of opposition, whether it be from external forces or internal doubts.\n  - Use flashbacks or recollections to reveal key memories that shape the characters' motivations and actions, weaving these into the present-day narrative.\n  - Conclude the story with a resolution that underscores the power and importance of memory, leaving the reader with a sense of the enduring impact of the past on the present and future.\n\n- **Creativity**:\n  - Employ a narrative structure that seamlessly blends past and present, using creative transitions to move between different time periods.\n  - Use symbolic elements to represent memory and resistance, such as objects, places, or recurring motifs that hold significant meaning for the characters.\n  - Explore the emotional and psychological dimensions of memory, using vivid and evocative descriptions to convey the weight and intensity of the characters' recollections.\n  - Incorporate elements of magical realism or surrealism to highlight the transformative power of memory and its ability to transcend time and space.\n\n- **Development (Character and Setting)**:\n  - Develop the main characters through their memories, revealing their personalities, values, and motivations through the past experiences they hold onto.\n  - Create a setting that reflects the themes of memory and resistance, using detailed descriptions to evoke a sense of place and time that is integral to the characters' memories.\n  - Depict the societal or personal forces that seek to erase the past, providing a clear antagonist or source of conflict that the characters must confront.\n  - Use secondary characters to support the main narrative, showing how different individuals are affected by the act of remembering and the resistance it represents.\n\n- **Language Use**:\n  - Employ a reflective and poignant tone, using language that conveys the emotional depth and significance of the characters' memories.\n  - Use descriptive and sensory language to bring memories to life, allowing the reader to experience the past alongside the characters.\n  - Incorporate introspective and contemplative dialogue, using it to explore the characters' thoughts and feelings about their memories and the act of remembering.\n  - Maintain a consistent narrative voice that emphasizes the themes of memory and resistance, using language that resonates with the reader and underscores the story's emotional impact.\n</story_rules>"
]