[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used in the rules. The prompt focuses on themes of finality, hope, and creating light in dark situations. The rules must guide the narrative to explore these themes deeply, using specific examples to illustrate how to convey the emotional weight and potential for lightness in a hospice setting. The rules will be organized into the categories of Plot, Creativity, Development (Character and Setting), and Language Use, ensuring they are actionable and tailored to the prompt's unique narrative potential.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with the moment the word \"hospice\" is spoken, capturing the immediate shift in atmosphere and the characters' reactions. For example, describe a family meeting where a doctor gently introduces the term, causing a palpable silence to fall over the room.\n  - Develop a narrative arc that balances the heaviness of the situation with moments of unexpected lightness or humor. Introduce a subplot where a character finds solace in small acts of kindness, such as a nurse who tells light-hearted stories to ease the tension.\n\n- **Creativity**:\n  - Use metaphors and imagery to contrast the heaviness of the word \"hospice\" with symbols of light and hope. For instance, describe sunlight streaming through a window as a metaphor for hope breaking through despair.\n  - Incorporate elements of magical realism to create moments of lightness, such as a scene where a patient imagines their room transforming into a vibrant garden, filled with the laughter of loved ones.\n\n- **Development (Character and Setting)**:\n  - Develop characters who embody both the weight of the situation and the potential for light. Create a character who initially struggles with the concept of hospice but gradually finds peace through meaningful interactions, such as a grandchild who brings joy with their innocent questions and observations.\n  - Set the story in a hospice environment that feels both somber and serene. Use detailed descriptions of the setting, like the soft hum of medical equipment and the gentle rustle of curtains, to create a backdrop that supports the narrative's emotional depth.\n\n- **Language Use**:\n  - Employ a tone that is both respectful and hopeful, using language that acknowledges the gravity of the situation while highlighting moments of beauty and connection. For example, describe a patient's smile as \"a beacon of warmth in the shadowed room.\"\n  - Use dialogue to reveal character emotions and relationships, ensuring it feels authentic and poignant. Capture the complexity of the situation with lines like, \"I never thought I'd find peace here, but somehow, I do,\" spoken by a character reflecting on their journey.\n</story_rules>"
]