[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided in the chat history demonstrate a clear structure and detailed guidance under the categories of **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contains specific, actionable instructions that are tailored to the unique aspects of the writing prompt. The rules are written in the second person and provide comprehensive guidance on narrative aspects such as pacing, humor, character dynamics, and emotional tone.\n\nFor the new writing prompt, the rules should focus on the themes of finality, hope, and creating light in dark situations. The narrative should explore the emotional and psychological impact of the word \"hospice\" and how characters navigate this challenging environment. The rules should guide the development of a poignant and emotionally resonant story that balances heaviness with moments of light and hope.\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the moment the word \"hospice\" is first spoken, capturing the immediate emotional impact on the characters.\n  - Develop a narrative that explores the characters' journey through grief, acceptance, and the search for hope in a seemingly hopeless situation.\n  - Introduce moments of light and levity that provide relief from the heavy atmosphere, showing how characters find small joys and comforts.\n  - Conclude the story with a sense of resolution, whether it be acceptance, peace, or a renewed sense of hope, ensuring the narrative arc feels complete.\n\n- **Creativity**:\n  - Use symbolism and metaphor to represent the themes of light and hope, such as a recurring motif of a candle or sunlight breaking through clouds.\n  - Incorporate elements of magical realism or surrealism to create moments of wonder and beauty in the midst of the characters' struggles.\n  - Experiment with narrative structure, such as non-linear timelines or multiple perspectives, to deepen the emotional impact and complexity of the story.\n  - Infuse the narrative with cultural or personal rituals that bring comfort and meaning to the characters, highlighting the diversity of ways people cope with grief.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters who each have their own way of dealing with the news of hospice, showcasing a range of emotional responses.\n  - Create a setting that reflects the heaviness of the situation, such as a dimly lit room or a quiet, somber environment, but also includes elements that symbolize hope and light.\n  - Use the setting to enhance the emotional tone of the story, making it an integral part of the characters' journey.\n  - Show the growth and transformation of the characters as they navigate their emotions, highlighting moments of connection, love, and resilience.\n\n- **Language Use**:\n  - Use evocative and descriptive language to convey the weight of the word \"hospice\" and the atmosphere it creates.\n  - Maintain a balance between heavy, somber tones and lighter, hopeful moments, ensuring the narrative does not become overwhelmingly bleak.\n  - Employ dialogue that is authentic and reflective of the characters' emotional states, using it to reveal their inner thoughts and feelings.\n  - Use sensory details to create a vivid and immersive experience for the reader, capturing the physical and emotional environment of the story.\n</story_rules>"
]