[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as narrative structure, tone, and thematic depth. The few-shot examples emphasize non-linear plots, surreal and absurd elements, character complexity, and vivid language. For the new prompt, I will focus on creating a tense, atmospheric narrative that explores themes of ambiguity and duality. The rules will guide the LLM to develop a plot that blurs the lines between hunter and hunted, incorporate creative and mysterious elements, develop complex characters and settings, and use language that enhances the suspenseful and enigmatic tone of the story. Each rule will include specific examples to illustrate its application, ensuring the guidance is actionable and aligned with the prompt's objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the hitman in the alley, establishing a tense and suspenseful atmosphere. Use the setting to reflect his anticipation and uncertainty, such as describing the alley as \"a narrow corridor of shadows and echoes.\"\n  - Develop the narrative through a series of encounters and revelations that blur the line between predator and prey. Introduce the mysterious woman as both a potential threat and an ally, creating ambiguity about her intentions.\n  - Conclude with an open-ended resolution that leaves the reader questioning the true nature of the characters' relationship. For example, end with the hitman realizing that the woman might be his next target or his savior, leaving their fates intertwined.\n\n- **Creativity**:\n  - Incorporate elements of mystery and intrigue to enhance the story's tension. Use the woman's enigmatic presence to introduce surreal or unexpected events, such as her knowing details about the hitman's past that she shouldn't.\n  - Use symbolic imagery to reflect the themes of duality and deception, such as describing the woman's eyes as \"mirrors reflecting both fear and fascination.\"\n  - Create scenarios that challenge the hitman's perception of reality, like hearing whispers in the alley that seem to come from nowhere, adding to the sense of unease.\n\n- **Development (Character and Setting)**:\n  - Develop the hitman as a complex character with a hidden vulnerability. Use internal monologue to reveal his doubts and fears, such as questioning his loyalty to his boss or his readiness to face the unknown.\n  - Depict the mysterious woman as an enigmatic figure whose motives are unclear. Use her interactions with the hitman to reveal layers of her character, such as a cryptic comment that hints at her own agenda.\n  - Create a setting that enhances the story's mood, using the desolate alley as a metaphor for the hitman's isolation and the uncertainty of his mission. Describe the alley's features in detail, like \"the flickering streetlight casting long, distorted shadows.\"\n\n- **Language Use**:\n  - Employ a tense and atmospheric narrative style, using short, clipped sentences to convey urgency and suspense. For example, \"He waits. The alley breathes around him, alive with secrets.\"\n  - Use vivid and sensory language to immerse the reader in the setting and the characters' emotions. Describe the hitman's heartbeat as \"a drumbeat echoing in the silence\" to emphasize his anxiety.\n  - Incorporate dialogue that is sparse and loaded with subtext, allowing the characters' words to carry multiple meanings. For example, have the woman say, \"Not everything is as it seems,\" to hint at deeper layers of the plot.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as non-linear plot structures, surreal and absurdist creativity, character development through quirks and imperfections, and a distinctive narrative voice. The new prompt involves a seaside puppet show with dark comedy and blurred lines between performance and reality, which suggests a need for rules that emphasize chaotic plot progression, creative absurdity, character dynamics within a performance setting, and language that captures the comedic yet unsettling tone.\n\n1. **Plot**: The plot should reflect the chaotic and unpredictable nature of the puppet show, with a focus on the escalating antics of Citizen Punch and the crowd's reactions. The narrative should explore the blurring of reality and performance, leading to an unexpected climax.\n\n2. **Creativity**: The story should incorporate dark humor and absurdity, using the puppet show as a metaphor for societal chaos. The creativity should highlight the surreal elements of the performance and the crowd's complicity in the chaos.\n\n3. **Development (Character and Setting)**: Characters should be developed through their interactions with the puppet show, with Citizen Punch as a central figure whose actions drive the narrative. The seaside setting should enhance the story's atmosphere, reflecting the boundary between reality and performance.\n\n4. **Language Use**: The language should be vivid and dynamic, capturing the energy of the puppet show and the crowd's reactions. The narrative voice should balance humor and tension, using descriptive and rhythmic language to convey the story's themes.\n\nI will now generate the **Story Rules** based on this analysis.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Structure the narrative around the escalating chaos of the puppet show, using Citizen Punch's antics to drive the plot. Begin with a seemingly typical performance that gradually descends into mayhem, such as Punch's slapstick violence becoming increasingly real and affecting the audience.\n  - Explore the blurring of lines between performance and reality by introducing unexpected consequences of the show, like audience members becoming part of the act or real injuries occurring. Conclude with an ambiguous climax that leaves the boundary between reality and performance unresolved.\n\n- **Creativity**:\n  - Incorporate dark humor and absurdity into the narrative, using Citizen Punch's actions as a metaphor for societal chaos. For example, depict Punch using exaggerated violence that the crowd finds hilariously entertaining, only for it to have real-world repercussions.\n  - Use surreal elements to enhance the story's comedic yet unsettling tone, such as puppets appearing to move on their own or the seaside setting transforming in response to the show's chaos.\n\n- **Development (Character and Setting)**:\n  - Develop Citizen Punch as a charismatic yet chaotic figure whose actions captivate and disturb the audience. Use his interactions with other puppets and the crowd to reveal his influence and the story's themes.\n  - Create a vivid seaside setting that reflects the story's atmosphere, using sensory details like the sound of waves and the smell of salt to ground the narrative. The setting should enhance the blurring of reality and performance, such as the stage appearing to merge with the sea.\n\n- **Language Use**:\n  - Employ dynamic and vivid language to capture the energy of the puppet show and the crowd's reactions. Use rhythmic and descriptive language to convey the escalating chaos and humor, such as describing Punch's antics with lively verbs and exaggerated imagery.\n  - Balance humor and tension in the narrative voice, using witty dialogue and ironic commentary to engage the reader. For example, describe the crowd's laughter as \"a wave crashing over the stage, drowning out the line between puppet and puppeteer.\"\n</story_rules>"
]