[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used in the rules. The demonstrations emphasize actionable instructions, detailed examples, and alignment with the writing prompt's themes and tone. For the new prompt, the rules should focus on the writer's struggle with his mother's expectations, the creative process of writing a children's story, and the emotional dynamics between the writer and his mother. The rules should guide the narrative to explore themes of familial pressure, creative challenges, and the pursuit of approval, while maintaining a tone that balances humor and sincerity. Each rule will include specific examples to illustrate its application, ensuring comprehensive and granular guidance for the storytelling process.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with the writer receiving a request from his mother to write a children's story, setting the stage for his internal conflict and desire to please her. Example: \"When his mother casually mentioned her wish for a story about a brave little squirrel, he felt the weight of her expectations settle on his shoulders.\"\n  - Develop the narrative through the writer's attempts to draft the story, highlighting his struggles with creating a happy ending that satisfies his mother's critique. Example: \"Each draft ended with the squirrel facing a new dilemma, and each time, his mother would sigh, 'But where's the joy, dear?'\"\n  - Conclude with a resolution that reflects the writer's growth and understanding of his mother's perspective, whether he achieves the happy ending or finds peace in his creative process. Example: \"In the end, the squirrel found a home, and so did he—in the acceptance of his own storytelling voice.\"\n\n- **Creativity**:\n  - Use imaginative elements and whimsical scenarios within the children's story to contrast with the writer's real-world challenges. Example: \"In the story, the squirrel discovered a magical acorn that granted wishes, but in reality, the writer wished for just one approving nod from his mother.\"\n  - Incorporate playful language and fantastical creatures to capture the essence of a children's story, while maintaining a layer of irony in the writer's struggle. Example: \"The squirrel's best friend, a talking mushroom, offered sage advice that the writer himself longed to hear.\"\n\n- **Development (Character and Setting)**:\n  - Develop the writer as a character torn between his artistic integrity and his desire to meet his mother's expectations. Use his internal monologue to reveal his thoughts and emotions. Example: \"He wondered if his mother saw the world in black and white, while he painted in shades of gray.\"\n  - Portray the mother as a well-meaning but critical figure, whose feedback is both a source of frustration and motivation for the writer. Example: \"Her eyes twinkled with love, even as her words cut through his latest draft like a red pen.\"\n  - Set the story in a cozy, domestic environment that reflects the warmth and tension of the mother-son relationship. Example: \"The kitchen table, cluttered with drafts and coffee cups, became their battlefield and sanctuary.\"\n\n- **Language Use**:\n  - Employ a narrative voice that balances humor and sincerity, capturing the writer's exasperation and affection for his mother. Use witty dialogue and introspective narration to convey the story's emotional depth. Example: \"He joked that his mother was the Simon Cowell of bedtime stories, but secretly, he craved her applause.\"\n  - Use vivid and descriptive language to bring the children's story elements to life, contrasting with the more grounded tone of the writer's real-life interactions. Example: \"The squirrel's fur shimmered like spun gold in the moonlight, a detail his mother insisted was 'too fanciful.'\"\n  - Maintain a consistent tone that reflects the writer's journey, using language that evolves as he gains insight into his creative process and relationship with his mother. Example: \"As he penned the final line, he realized the story's true ending lay not in the squirrel's adventure, but in his own acceptance of imperfection.\"\n</story_rules>"
]