[
    "```markdown\n<thinking>\nThe provided writing prompt sets up a scenario where a prophesied evil is met with overwhelming preparation, creating a backdrop ripe for exploring themes of expectation versus reality. The user profile indicates a preference for stories that focus on the protagonist's internal journey, emotional transformation, and moral dilemmas. This suggests that the story should delve into the Great Evil's perspective, exploring their internal conflict and emotional response to being met with such resistance. The user’s style emphasizes character depth and societal implications, which can be reflected in the Great Evil's backstory and the societal impact of the prophecy. The few-shot examples demonstrate a focus on irony, humor, and introspection, which can be used to explore the Great Evil's skepticism and the absurdity of the situation. Language should be emotive and descriptive, focusing on the internal struggles and emotional depth of the protagonist, with a slower pacing to emphasize introspection over action.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin with the Great Evil's awakening, focusing on their initial thoughts and emotions upon realizing the extent of the preparations against them.\n  - Develop the narrative around the Great Evil's internal journey, exploring their skepticism about the prophecy and their role in it.\n  - Highlight the moral dilemmas faced by the Great Evil, such as whether to fulfill their prophesied role or seek a different path.\n  - Conclude with the Great Evil's decision, emphasizing their emotional transformation and the impact of their choice on the world.\n\n- **Creativity**:\n  - Reinterpret the prophecy with depth, exploring its societal implications and the pressure it places on both the Great Evil and the world.\n  - Introduce unique elements, such as the Great Evil's casual skepticism and unexpected reactions to the preparations against them.\n  - Blend genres by incorporating elements of dark humor and irony, contrasting the serious tone of the prophecy with the absurdity of the situation.\n\n- **Development (Character and Setting)**:\n  - Develop the Great Evil as a multidimensional character, using internal thoughts and dialogue to explore their emotional complexity and internal conflicts.\n  - Create an immersive setting that reflects the societal impact of the prophecy, emphasizing the contrast between the world's expectations and the Great Evil's reality.\n  - Use secondary characters, such as the blessed knights and other defenders, to highlight the societal pressure and expectations placed on the Great Evil.\n\n- **Language Use**:\n  - Employ descriptive and emotive language to convey the Great Evil's internal struggles and emotional depth.\n  - Use stark, impactful language to emphasize the emotional weight of the Great Evil's decisions and the story's themes.\n  - Maintain a slower, deliberate pacing to focus on introspection and internal processing over external action.\n</story_rules>\n```",
    "<thinking>\nThe writing prompt presents a scenario where the protagonist is confronted with the unexpected consequences of a past decision—donating genetic material to a secret organization. This setup naturally leads to themes of responsibility, identity, and the moral implications of one's actions. The protagonist's encounter with superpowered teenagers claiming to be their offspring introduces a personal and emotional conflict, ripe for exploration of internal transformation and moral dilemmas.\n\nThe user profile indicates a preference for plots centered on the protagonist's internal journey and emotional transformation, often driven by skepticism and moral dilemmas. This suggests that the story should focus on the protagonist's introspection and personal growth rather than external action. The user also favors reinterpreting prompts with depth and complexity, incorporating unique backstories and societal implications, which aligns well with the prompt's potential for exploring the societal impact of genetic manipulation.\n\nIn terms of character and setting development, the user excels in creating emotionally complex protagonists and immersive settings that enhance the narrative's themes. This suggests that the protagonist's internal conflicts and emotional arcs should be vividly explored, with a setting that reflects the complexities of their life and the implications of their past actions.\n\nThe user's language style is characterized by descriptive and emotive language, with a focus on internal struggles and emotional depth. This suggests that the story should employ stark, impactful language to convey the protagonist's internal processing and emotional journey, with dialogue that reveals character emotions and motivations.\n\nOverall, the story should focus on the protagonist's internal journey, exploring themes of responsibility and identity, with a creative reinterpretation of the prompt that incorporates societal implications and a darker, more serious tone.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin with the protagonist's initial shock and skepticism upon meeting the superpowered teenagers, focusing on their internal reaction and emotional turmoil.\n  - Develop the narrative through the protagonist's introspective journey, exploring their feelings of responsibility and the moral implications of their past decision.\n  - Include significant internal monologue and reflection, allowing the protagonist to grapple with their identity and the societal impact of their actions.\n  - Conclude the story with the protagonist making a decisive choice about their role in the teenagers' lives, indicating personal growth and a new understanding of their responsibilities.\n\n- **Creativity**:\n  - Incorporate a unique backstory for the secret organization and the societal implications of genetic manipulation, adding depth and complexity to the narrative.\n  - Use a darker, more serious tone to explore themes of identity, responsibility, and the unforeseen consequences of one's actions.\n  - Introduce unexpected twists, such as the protagonist discovering hidden aspects of their own abilities or the true intentions of the organization.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as emotionally complex, using internal thoughts and dialogue to convey their skepticism, moral dilemmas, and eventual transformation.\n  - Create an immersive setting that reflects the protagonist's internal journey, with detailed descriptions of their environment and the impact of the teenagers' presence.\n  - Ensure that the superpowered teenagers are developed through their interactions with the protagonist, highlighting their unique abilities and perspectives.\n\n- **Language Use**:\n  - Use descriptive and emotive language to convey the protagonist's internal struggles and emotional depth, allowing readers to connect deeply with their experience.\n  - Maintain a slower, deliberate pacing that emphasizes the protagonist's internal processing and the gravity of their situation.\n  - Incorporate dialogue that reveals character emotions and motivations, focusing on the protagonist's introspective journey and the teenagers' perspectives.\n</story_rules>",
    "```markdown\n<thinking>\nThe writing prompt presents a scenario where the protagonist discovers their roommate's true identity as an ex-assassin, leading to a tense confrontation. This situation is ripe for exploring themes of trust, deception, and the protagonist's internal journey as they grapple with this revelation. The user profile indicates a preference for plots centered on emotional transformation and moral dilemmas, suggesting that the story should focus on the protagonist's internal conflict and decision-making process. The user's style emphasizes creativity through unique backstories and societal implications, which can be incorporated by exploring the roommate's past and the protagonist's reaction to it. Character development should focus on the protagonist's emotional arc and the setting should enhance the narrative's themes. Language use should be descriptive and emotive, conveying the protagonist's internal struggles and the story's emotional depth.\n\nThe few-shot examples demonstrate a consistent approach to crafting story rules that emphasize internal character development, creative reinterpretation of prompts, and the use of emotive language. These elements should be reflected in the new story rules, ensuring they align with the user's storytelling style and the specific elements of the writing prompt.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin with the protagonist's realization of their roommate's true identity, focusing on their immediate emotional response and internal conflict.\n  - Develop the narrative around the protagonist's skepticism and moral dilemma, exploring their decision-making process in the face of danger.\n  - Include a backstory for the roommate that reveals their past as an assassin and the reasons for their current lifestyle, adding depth to the plot.\n  - Conclude with the protagonist's resolution, whether it involves confronting the roommate, seeking help, or finding a way to coexist, emphasizing their emotional growth.\n\n- **Creativity**:\n  - Introduce unique elements such as the protagonist's casual skepticism and how it influences their perception of the situation.\n  - Explore societal implications of the roommate's past actions and how they affect the protagonist's view of morality and trust.\n  - Incorporate unexpected twists that challenge the protagonist's beliefs and add complexity to the narrative.\n\n- **Development (Character and Setting)**:\n  - Focus on the protagonist's internal thoughts and dialogue to develop their emotional arc and response to the revelation.\n  - Create a multidimensional portrayal of the roommate, exploring their motivations and the impact of their past on their current behavior.\n  - Establish an immersive setting that reflects the tension and emotional stakes of the narrative, using detailed descriptions to enhance the atmosphere.\n\n- **Language Use**:\n  - Employ descriptive and emotive language to convey the protagonist's internal struggles and the story's emotional depth.\n  - Use impactful dialogue to reveal character motivations and advance the plot, ensuring it reflects the protagonist's emotional state.\n  - Maintain a slower, deliberate pacing that emphasizes internal processing over external action, creating an intimate and introspective reading experience.\n</story_rules>\n```"
]