[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a unique twist on the zombie apocalypse theme, focusing on a protagonist who chooses medieval weaponry over modern firearms. This scenario offers opportunities for high-stakes action, personal transformation, and creative reinterpretation of the apocalypse genre. I will draw from the author's style of integrating societal themes, personal responsibility, and humor, as well as their use of vivid settings and character development through internal conflict and dialogue. The language should blend formal and archaic tones with humor to reflect the protagonist's unique approach to the apocalypse.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the narrative around a high-stakes scenario where the protagonist, armed with medieval weaponry, faces the immediate threat of zombies. Begin with the protagonist's decision to raid a medieval armory, creating tension as they navigate a world where everyone else is armed with guns. For example, depict a scene where the protagonist, clad in full plate armor, confronts a horde of zombies, using their sword to cut through the chaos, highlighting the urgency and danger of their situation.  \n  - Develop the plot around personal transformation and resilience. Show the protagonist's journey from an ordinary individual to a medieval warrior, emphasizing their growth and adaptation to the new world. Illustrate this transformation through a climactic moment where the protagonist, initially struggling with the weight and unwieldiness of the armor, eventually masters it to protect their home.  \n  - Incorporate societal themes and personal responsibility by exploring the protagonist's motivation to protect their community. Use a subplot where the protagonist encounters a group of survivors who initially doubt their medieval approach but eventually rally behind them, showcasing themes of leadership and unity.  \n\n- **Creativity**:  \n  - Integrate elements of dark fantasy and historical context to enrich the narrative. Describe the medieval armory as a relic of a bygone era, filled with artifacts that hold stories of past battles. Use this setting to create a sense of mysticism and history, such as the protagonist discovering a legendary sword with an inscription that hints at its storied past.  \n  - Blend absurdist humor with the serious tone of the apocalypse. Create comedic situations where the protagonist's medieval gear leads to humorous misunderstandings, such as a scene where they accidentally knock over a shelf of modern weapons in a gun store, drawing the attention of both zombies and survivors.  \n  - Subvert expectations by reinterpreting the role of the protagonist as a modern-day knight. Highlight their unique approach to the apocalypse, contrasting their chivalrous demeanor with the grim reality of the zombie-infested world.  \n\n- **Development (Character and Setting)**:  \n  - Develop the protagonist through internal monologue and reflection, highlighting their doubts and determination. Use introspective moments where the protagonist questions their choice of medieval weaponry, pondering whether they are a relic of the past or a beacon of hope for the future.  \n  - Create a richly detailed setting that enhances the story's themes of survival and resilience. Describe the protagonist's home as a fortified medieval stronghold, complete with battlements and a moat, which they have transformed into a sanctuary against the undead.  \n  - Develop characters through dialogue and shared history. Introduce a supporting character, perhaps a historian or reenactor, who provides insight into the medieval artifacts and becomes an ally in the protagonist's quest to reclaim their home. Use their interactions to reveal the protagonist's backstory and motivations.  \n\n- **Language Use**:  \n  - Employ a formal and archaic language style to evoke a sense of ancient mysticism and gravity. Use phrases like \"By the sword of my ancestors, I shall reclaim what is mine\" to add a solemn and heroic tone to the protagonist's quest.  \n  - Use descriptive language to convey character emotions and atmosphere. Describe the protagonist's experience in the armor with vivid imagery, such as \"The weight of the steel pressed down like the burden of a thousand battles, yet it was a comforting embrace against the chaos outside.\"  \n  - Incorporate colloquial and humorous dialogue to establish character voice and tone. Use exchanges like, \"Who needs a shotgun when you've got a sword that could cleave a dragon?\" to add levity and personality to the narrative, reflecting the protagonist's unique perspective on the apocalypse.  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, \"You never knew you were a god until you got your very first follower,\" I will analyze the Author Writing Sheet to identify key storytelling elements that can be adapted to this prompt. The author's style includes high-stakes scenarios, societal themes, personal transformation, and a blend of reality and fantasy. The creativity often involves dark fantasy, historical context, and subversion of expectations. Characters are developed through emotional depth, internal struggles, and dialogue, while language use ranges from formal and archaic to colloquial and humorous.\n\nFor the Plot, I will focus on structuring the narrative around a high-stakes revelation of divinity, incorporating societal themes and personal transformation. Creativity will involve integrating elements of dark fantasy and myth, possibly reinterpreting the godhood concept with a modern twist. Character and Setting Development will emphasize the protagonist's internal struggle with their newfound identity and the setting's reflection of societal reactions. Language Use will employ a mix of formal and colloquial tones to convey the gravity and absurdity of the situation.\n\nThese elements will be tailored to the Writing Prompt, ensuring the narrative explores the implications of discovering one's divinity and the dynamics with the first follower.  \n</thinking>  \n<story_rules>  \n- **Plot**:\n  - Structure the narrative around the high-stakes revelation of the protagonist's divinity, creating tension and urgency. Begin with an ordinary scenario that escalates into a divine revelation, such as a mundane event where the protagonist accidentally performs a miracle, leading to the first follower's devotion.\n  - Incorporate societal themes by exploring the protagonist's responsibility as a newfound deity. For example, depict the protagonist grappling with the expectations of their follower and the broader implications of their divine status on society.\n  - Use a first-person account to blur the line between reality and fantasy, allowing the protagonist to reflect on their disbelief and the surreal nature of their transformation into a god.\n\n- **Creativity**:\n  - Integrate elements of dark fantasy and myth to reinterpret the concept of godhood. Introduce fantastical elements, such as ancient symbols or forgotten rituals, that hint at the protagonist's divine nature.\n  - Creatively explore the theme of temptation and moral conflict as the protagonist navigates their new powers. For instance, depict the internal struggle of using their abilities for personal gain versus the greater good.\n  - Subvert expectations by presenting the protagonist's initial reluctance to accept their role, only to find unexpected fulfillment in guiding their follower.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through their internal struggle with their identity as a god. Use introspective monologues to reveal their doubts and determination, such as questioning their worthiness and the implications of their powers.\n  - Establish a setting that reflects societal reactions to the protagonist's divinity. Describe a world where people are divided between skepticism and reverence, using vivid imagery to depict the contrasting environments.\n  - Develop the first follower as a character with nuanced emotional depth, perhaps someone who has been searching for meaning and finds it in the protagonist's divinity. Use dialogue to explore their dynamic and the follower's unwavering faith.\n\n- **Language Use**:\n  - Employ a formal and archaic language style during moments of divine revelation to evoke a sense of ancient mysticism and gravity. For example, use incantations or prophetic language when the protagonist first realizes their powers.\n  - Use descriptive language to convey the protagonist's emotional state and the atmosphere of their transformation. Phrases like \"a surge of power coursed through my veins\" can enhance the reader's immersion.\n  - Incorporate colloquial and humorous dialogue to establish the protagonist's voice and tone, especially in moments of disbelief or when interacting with their follower. This can add a layer of relatability and humor to the narrative.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet to identify key storytelling elements that can be adapted to the narrative of a wizard explaining their reluctance to rely on magic. The Author Writing Sheet provides insights into the author's style across four categories: Plot, Creativity, Development (Character and Setting), and Language Use. I will extract specific techniques and examples from each category to create detailed, actionable Story Rules that align with the prompt's themes of skepticism and problem-solving in a magical context.  \n\nFor **Plot**, I will focus on structuring the narrative around high-stakes scenarios and personal responsibility, as well as incorporating humorous misunderstandings and personal revelations. For **Creativity**, I will integrate elements of dark fantasy and absurdist humor, blending them with the modern skepticism of technology and magic. In **Development (Character and Setting)**, I will emphasize nuanced character development through internal struggles and moral decisions, as well as creating a richly detailed setting that reflects the themes of skepticism and faith. Finally, for **Language Use**, I will employ a mix of formal and colloquial language to convey tension, humor, and character dynamics effectively.  \n\nThese elements will be tailored to the Writing Prompt, ensuring that the story captures the unique style of the author while exploring the theme of a wizard's skepticism towards magic.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the narrative around a high-stakes scenario where the party faces a critical challenge that could be easily solved with magic, but the wizard refuses to use it, creating tension and urgency. For example, the party might be trapped in a collapsing cave, and the wizard insists on finding a physical solution rather than casting a spell.  \n  - Incorporate societal themes and personal responsibility by having the wizard explain their reluctance to use magic due to past experiences where reliance on magic led to unintended consequences, such as a spell backfiring and causing harm.  \n  - Use a series of humorous misunderstandings and escalating absurdities to highlight the party's frustration with the wizard's refusal to use magic. For instance, the party might attempt to use mundane solutions that comically fail, like trying to dig their way out with spoons.  \n  - Build the plot around a personal revelation where the wizard shares a pivotal moment from their past that shaped their skepticism towards magic, such as a mentor's warning about the dangers of over-reliance on spells.  \n\n- **Creativity**:  \n  - Integrate elements of dark fantasy by describing the wizard's past experiences with magic as encounters with forgotten or dangerous spells that had dire consequences, adding a layer of mysticism and caution to their skepticism.  \n  - Blend science fiction with absurdist humor by having the wizard compare magic to unreliable software, using technical jargon and humorous analogies to explain their lack of faith in spells, such as describing a spell as having \"bugs\" or \"crashing\" unexpectedly.  \n  - Creatively explore the theme of temptation and moral conflict by presenting scenarios where the wizard is tempted to use magic but ultimately decides against it, highlighting their internal struggle and moral stance.  \n\n- **Development (Character and Setting)**:  \n  - Develop the wizard's character through internal monologue and reflection, revealing their doubts and determination to rely on non-magical solutions. Use introspective musings to explore their past experiences and the lessons learned from them.  \n  - Create a richly detailed setting that reflects the themes of skepticism and faith, such as a world where magic is both revered and feared, with historical events that illustrate the consequences of unchecked magical use.  \n  - Develop the party's dynamics through dialogue and reactions to the wizard's refusal to use magic, emphasizing their frustration and attempts to persuade the wizard, which can lead to comedic exchanges and character growth.  \n\n- **Language Use**:  \n  - Employ a mix of formal and colloquial language to convey the wizard's explanations and the party's reactions. Use formal language when the wizard discusses the technical aspects of magic, and colloquial language for humorous and tense interactions.  \n  - Use descriptive language to convey the atmosphere and emotions, such as the tension in the air when the party faces a dire situation without magic, or the humor in their failed attempts to solve problems without spells.  \n  - Incorporate period-appropriate language and dialogue to enhance authenticity, using phrases that reflect the magical setting while also drawing parallels to modern technological skepticism.  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The goal is to create rules that reflect the author's unique style while aligning with the narrative potential of the prompt, which involves a witch, her woods, and an unexpected encounter with a mysterious teenager.\n\n### Plot\nThe author often structures narratives around high-stakes scenarios, societal themes, and personal transformations. For this prompt, the plot should incorporate the tension of the witch's surprise and the potential threat or opportunity the teenager represents. The narrative could unfold as a first-person account, blurring the line between reality and fantasy, and build up to a personal revelation or transformation.\n\n### Creativity\nThe author integrates elements of dark fantasy, historical context, and moral conflict. The story should creatively explore the witch's mystical connection to the woods and the teenager's unexpected presence, possibly incorporating elements of dark fantasy or myth. The narrative could reinterpret the prompt by subverting expectations about the teenager's role, perhaps revealing them to be more than they seem.\n\n### Development (Character and Setting)\nThe author develops characters with emotional depth and settings that enhance thematic elements. The witch should be portrayed with complexity, reflecting on her role and the implications of the teenager's presence. The setting of the woods should be richly detailed, enhancing the story's mystical and foreboding atmosphere.\n\n### Language Use\nThe author employs formal, descriptive, and sometimes humorous language. The story should use vivid and evocative language to convey the witch's emotions and the atmosphere of the woods. Dialogue should be used to reveal character dynamics and tension, possibly incorporating period-appropriate or mystical language to enhance authenticity.\n\nWith these insights, I will craft detailed Story Rules that guide the language model in emulating the author's style while tailoring the narrative to the Writing Prompt.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:\n  - Begin the story with the witch returning to her hut, immediately sensing something amiss in her woods. Use a first-person perspective to convey her surprise and the tension of the unknown.\n  - Structure the narrative around the high-stakes scenario of the witch confronting the teenager, building up to a personal revelation about the teenager's true intentions or identity.\n  - Incorporate societal themes by exploring the witch's role in the community and her responsibility towards the woods, reflecting on how the teenager's presence challenges or reinforces these themes.\n  - Use a gradual build-up to a climactic moment where the witch must decide how to respond to the teenager, possibly leading to a transformation in her understanding of her powers or her role.\n\n- **Creativity**:\n  - Integrate elements of dark fantasy by describing the mystical connection between the witch and her woods, using imagery like \"whispering trees\" and \"shadows that dance with intent.\"\n  - Creatively reinterpret the prompt by subverting expectations about the teenager's role, perhaps revealing them to be a lost spirit, a future seer, or a harbinger of change.\n  - Explore the theme of moral conflict by having the witch grapple with the decision to help or hinder the teenager, reflecting on the potential consequences of her actions.\n  - Use historical or cultural references to enrich the narrative, such as ancient rituals or folklore associated with the woods, grounding the fantastical elements in a relatable context.\n\n- **Development (Character and Setting)**:\n  - Develop the witch's character through introspective musings and reflections on her past experiences, revealing her internal conflict and growth as she interacts with the teenager.\n  - Portray the teenager with nuanced emotional depth, hinting at their backstory and motivations through subtle cues and dialogue.\n  - Establish the setting of the woods with vivid, atmospheric descriptions, such as \"a canopy of ancient oaks\" and \"the scent of earth and magic,\" creating a sense of mystery and enchantment.\n  - Use the setting to reflect the socio-economic conditions or cultural beliefs of the time, perhaps through the witch's observations of changes in the woods or the teenager's attire and mannerisms.\n\n- **Language Use**:\n  - Employ a formal and archaic language style when the witch performs spells or rituals, evoking a sense of ancient mysticism and gravity.\n  - Use descriptive language to convey the witch's emotions and the atmosphere of the woods, with phrases like \"a chill ran down her spine\" and \"the air hummed with unseen energy.\"\n  - Incorporate dialogue that conveys tension and character dynamics, using exchanges like, \"What brings you to my woods, child of the unknown?\" to underscore the gravity of the situation.\n  - Use vivid and colloquial language to reflect the witch's internal state, with expressions that capture her surprise and curiosity, such as \"By the roots of the elder tree, who are you?\"  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The prompt involves an immortal character born in 1986, which suggests a blend of modern and fantastical elements. The author’s style includes high-stakes scenarios, societal themes, and personal transformation, often with a humorous or absurd twist. The creativity often involves blending historical or fantastical elements with modern settings. Characters are developed through internal struggles and nuanced backstories, while language use ranges from formal and archaic to colloquial and humorous. I will tailor these elements to create Story Rules that align with the prompt's themes of immortality and modernity.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the narrative around a high-stakes scenario involving the protagonist's immortality being discovered by a modern-day organization, creating tension and urgency. For example, the protagonist might be pursued by a secretive government agency interested in their unique condition, leading to a series of close encounters and narrow escapes.  \n  - Develop the plot around societal themes, such as the impact of immortality on personal responsibility and relationships in a modern context. Illustrate this through the protagonist's struggle to maintain friendships and jobs without revealing their secret, highlighting the isolation and ethical dilemmas they face.  \n  - Use a first-person account to blur the line between reality and fantasy, as the protagonist reflects on their experiences and the absurdity of being immortal yet lacking ancient knowledge. This can be presented as a series of diary entries or blog posts, capturing their unique perspective on modern life.  \n  - Incorporate a series of humorous misunderstandings and escalating absurdities, such as the protagonist's attempts to fit into modern society while inadvertently revealing their immortality through outdated references or behaviors.  \n\n- **Creativity**:  \n  - Integrate elements of dark fantasy and modern technology to reinterpret the prompt. For instance, the protagonist might use a smartphone app to track other immortals, blending the mystical with the mundane.  \n  - Creatively explore the theme of temptation and moral conflict through the protagonist's interactions with modern society. They might be tempted to use their immortality for personal gain, such as insider trading, but face moral dilemmas about the consequences.  \n  - Blend science fiction with absurdist humor by introducing a subplot where the protagonist is mistaken for an alien due to their lack of historical knowledge, leading to comedic situations involving conspiracy theorists and UFO enthusiasts.  \n\n- **Development (Character and Setting)**:  \n  - Develop the protagonist with nuanced emotional depth, focusing on their internal struggles with loneliness and the burden of immortality. Use introspective monologues to reveal their longing for connection and normalcy.  \n  - Establish a modern setting that reflects the socio-economic conditions of the present day, such as bustling cityscapes and digital culture, grounding the fantastical elements in a relatable context.  \n  - Develop characters through their reactions to the protagonist's immortality, emphasizing cultural differences and misunderstandings. For example, friends might react with disbelief or humor, adding depth to their relationships.  \n\n- **Language Use**:  \n  - Employ a reflective narrative tone to explore themes of duty and compassion, as the protagonist contemplates their role in the world and the impact of their actions on others.  \n  - Use colloquial and humorous dialogue to establish the protagonist's voice and tone, capturing their modern sensibilities and wit. For instance, they might joke about their immortality with phrases like, \"I'm not ancient, just vintage.\"  \n  - Incorporate vivid and colloquial language to convey the protagonist's emotional state, using expressions that reflect their frustration and bemusement with modern life, such as, \"What in the digital age is going on?\"  \n</story_rules>"
]