[
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet to identify key storytelling elements that define the author's style. The prompt involves a character who experiences near-death situations and transitions to alternate universes, retaining memories of these events. This concept naturally aligns with themes of tension, conflict, and introspection, which are prevalent in the author's style.\n\n**Plot**: The author emphasizes intense confrontations, immediate tension, and unexpected events. For the prompt, the plot should revolve around the protagonist's realization of their universe-hopping ability, leading to strategic confrontations with forces or individuals who threaten their existence. The narrative should begin with an immediate sense of danger, perhaps during a near-death experience, and build towards a dramatic revelation or confrontation.\n\n**Creativity**: The author subverts traditional narratives and employs humor and irony. The story should creatively explore the implications of the protagonist's ability, perhaps by introducing unexpected roles or humorous situations where the protagonist uses their knowledge of past deaths to manipulate outcomes or deceive adversaries.\n\n**Development (Character and Setting)**: Characters are developed through internal reflections, dynamic dialogue, and distinct speech patterns. The protagonist should undergo significant personal growth, reflecting on their past deaths and the lessons learned. Dialogue should reveal relational tensions and power dynamics, especially as the protagonist interacts with others who may or may not be aware of the universe-hopping phenomenon.\n\n**Language Use**: The author uses vivid, visceral language and colloquial dialogue. The story should employ intense, descriptive language to convey the brutality of near-death experiences and the protagonist's emotional turmoil. Colloquial and aggressive dialogue can enhance the tone, especially during confrontations or moments of tension.\n\nWith these insights, I will craft Story Rules that guide the language model in emulating the author's style while aligning with the Writing Prompt.  \n</thinking>  \n<story_rules>  \n- **Plot**:\n  - Begin the story with an immediate, intense confrontation that places the protagonist in a life-threatening situation. For example, start with the protagonist narrowly escaping a car crash, only to find themselves in a new universe where the crash never happened.\n  - Structure the plot around the protagonist's strategic deception and manipulation of their knowledge from past deaths. Introduce a scene where the protagonist uses their awareness of a previous betrayal to outmaneuver an antagonist.\n  - Build towards a dramatic and unexpected event, such as the protagonist confronting a mysterious figure who reveals the truth about their universe-hopping ability, leading to a climactic showdown.\n\n- **Creativity**:\n  - Subvert traditional narratives by having the protagonist assume unexpected roles in each universe. For instance, in one universe, they might be a detective using their knowledge to solve crimes they previously witnessed.\n  - Infuse humor and irony by placing the protagonist in situations where their past deaths provide comedic advantages, such as knowing the punchline to a joke that saves them from danger.\n  - Introduce a noir-like atmosphere by setting scenes in gritty, crime-laden environments where the protagonist navigates through a web of deceit and danger.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through internal reflections on their past deaths, focusing on personal growth and the emotional impact of remembering each demise.\n  - Use dynamic dialogue to reveal relational tensions, such as a conversation with a loved one who notices changes in the protagonist's behavior due to their memories.\n  - Employ distinct, stylized dialogue to establish power dynamics, especially during confrontations. For example, have the protagonist assertively confront an antagonist with lines like, \"You think you can scare me? I've died a thousand times.\"\n\n- **Language Use**:\n  - Use vivid and visceral language to describe near-death experiences, capturing the intensity and brutality of each moment. For instance, \"The impact was a symphony of shattering glass and screeching metal, a cacophony that should have been my end.\"\n  - Incorporate colloquial and aggressive language in dialogue to enhance the story's tone. During a tense negotiation, the protagonist might say, \"You want to play hardball? I've got nothing to lose.\"\n  - Employ descriptive language to create intrigue and tension, especially when the protagonist uncovers clues about their universe-hopping ability. Use lines like, \"Every universe whispers secrets, and I'm the only one who hears them.\"  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet to identify key storytelling elements that define the author's style. The prompt involves a science fiction setting with themes of conflict, strategic deception, and unexpected outcomes. The author's style emphasizes intense confrontations, strategic manipulation, and vivid language, which align well with the prompt's potential for dramatic and strategic storytelling. I will create Story Rules that incorporate these elements, ensuring they are tailored to the prompt's narrative of interstellar conflict and clever retaliation.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Begin the story with an immediate sense of tension and conflict. Introduce the Terrans' discovery of the incoming asteroid, creating urgency as they scramble to devise a plan. For example, start with a scene where Terran scientists detect the asteroid's trajectory, sparking a heated debate on how to respond.  \n  - Structure the plot around intense confrontations and strategic deception. Develop a scene where Terran leaders confront the Galactic Empire's envoy, using clever tactics to negotiate a ceasefire. For instance, have the Terrans reveal their plan to hollow out and return the asteroids, catching the Empire off guard.  \n  - Incorporate unexpected and dramatic events to maintain suspense. Include a climactic moment where the Terrans successfully launch the hollowed asteroids back, causing chaos within the Empire's ranks. This could involve a dramatic space battle or a political upheaval within the Empire.  \n  - Use dialogue-driven conflict and resolution to advance the plot. Craft exchanges between Terran and Empire representatives that reveal underlying tensions and strategic maneuvers, such as a negotiation scene where the Terrans leverage their technological prowess to secure peace.  \n\n- **Creativity**:  \n  - Subvert traditional narratives by focusing on unexpected character roles and strategic manipulation. Introduce a Terran engineer who plays a crucial role in devising the asteroid-hollowing technique, using their knowledge to outsmart the Empire.  \n  - Employ humor and irony to subvert expectations about power dynamics. Create a scene where a seemingly insignificant Terran official outwits a high-ranking Empire commander, using wit and sarcasm to highlight the absurdity of the Empire's overconfidence.  \n  - Infuse the narrative with a noir-like, crime drama atmosphere. Set scenes in gritty, industrial environments on Terran mining colonies, where characters operate in a shadowy world of espionage and sabotage, adding depth to the science fiction setting.  \n\n- **Development (Character and Setting)**:  \n  - Develop characters through internal reflections and personal growth. Focus on a Terran protagonist who evolves from a reluctant participant to a strategic leader, reflecting on their journey and the lessons learned from past conflicts.  \n  - Use dynamic dialogue and relational tension to flesh out character relationships. Highlight the differing perspectives of Terran and Empire characters through their interactions, such as a debate between a Terran scientist and an Empire diplomat on the ethics of planetary destruction.  \n  - Employ distinct, stylized dialogue to reveal personality and power dynamics. Craft lines for the Terran protagonist that convey authority and confidence, such as, \"You thought you could crush us with rocks? We turned them into our weapons.\"  \n\n- **Language Use**:  \n  - Employ vivid and visceral language to convey the intensity of space battles and strategic maneuvers. Describe scenes with phrases like \"The asteroid's hollow shell glided silently through the void, a ghostly harbinger of Terran ingenuity.\"  \n  - Use colloquial and aggressive language to enhance character interactions and tone. Include dialogue that reflects the gritty, streetwise nature of Terran miners, such as, \"We ain't just rock-busters, we're rock-flingers now.\"  \n  - Utilize descriptive language and dialogue to create intrigue and tension. Craft lines that hint at the mysterious and formidable nature of the Terrans' retaliation, such as, \"We've turned your weapons into whispers of our defiance.\"  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Author Writing Sheet and the Writing Prompt, I will analyze the author's unique storytelling style across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt suggests a theme of immortality with a significant constraint, which can be explored through intense personal conflict, strategic deception, and unexpected events, as highlighted in the author's style. The author's use of humor, irony, and a noir-like atmosphere can creatively subvert the traditional narrative of immortality. Character development will focus on internal reflections and dynamic dialogue, while language use will employ vivid, visceral, and colloquial tones to enhance the story's intensity and intrigue. I will craft detailed, actionable Story Rules that incorporate these elements, ensuring they are tailored to the Writing Prompt.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Begin the story with an immediate sense of tension and conflict. Introduce the protagonist as they grapple with the shocking revelation of immortality tied to the confinement of a single room. For example, start with a scene where the protagonist is confronted by a mysterious figure who offers them eternal life at the cost of their freedom, creating an urgent and dangerous atmosphere.\n  - Structure the plot around intense confrontations and strategic deception. Develop a scenario where the protagonist must navigate the psychological and emotional challenges of their new reality, perhaps facing adversaries who seek to exploit or challenge their newfound immortality.\n  - Incorporate unexpected and dramatic events to maintain narrative momentum. For instance, introduce a twist where the protagonist discovers a hidden passage within the room that leads to a series of booby-trapped chambers, echoing the author's style of dramatic escape sequences.\n  - Use dialogue-driven conflict and resolution to advance the plot. Craft exchanges between the protagonist and the mysterious figure that reveal deeper layers of the immortality deal, using dialogue to build tension and drive the story forward.\n\n- **Creativity**:  \n  - Subvert traditional narratives by focusing on unexpected character roles and strategic manipulation. For example, reveal that the mysterious figure is not a typical villain but a former immortal who seeks redemption by guiding others through the same choice.\n  - Employ humor and irony to subvert expectations about immortality and confinement. Introduce a scene where the protagonist humorously negotiates the terms of their confinement, perhaps requesting absurd amenities to cope with eternal life in a single room.\n  - Infuse the story with a noir-like, crime drama atmosphere. Set the room in a gritty, urban environment where the protagonist's isolation is contrasted with the bustling world outside, adding a unique twist to the immortality theme.\n\n- **Development (Character and Setting)**:  \n  - Develop the protagonist through internal reflections and personal growth. Use their confinement as a catalyst for introspection, exploring themes of freedom, choice, and the value of life.\n  - Use dynamic dialogue and relational tension to flesh out character relationships. For instance, create a complex relationship between the protagonist and the mysterious figure, using their interactions to reveal differing perspectives on immortality and freedom.\n  - Employ distinct, stylized dialogue to reveal personality and power dynamics. Craft the mysterious figure's speech to convey authority and mystery, using phrases that hint at their own experiences with immortality.\n\n- **Language Use**:  \n  - Employ vivid and visceral language to convey the intensity of the protagonist's situation. Describe the room in detail, using sensory language to evoke the claustrophobia and allure of eternal life within its confines.\n  - Use colloquial and aggressive language to enhance character interactions and tone. For example, have the protagonist use streetwise language when negotiating with the mysterious figure, adding a layer of grit and realism to their exchanges.\n  - Utilize descriptive language and dialogue to create intrigue and tension. Craft lines that hint at the broader implications of the immortality deal, such as, \"This room is your kingdom, but every kingdom has its price,\" to maintain a mysterious and dramatic tone throughout the story.  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt suggests a narrative involving power dynamics, possibly in a supernatural or fantasy setting, with themes of debt and authority. The author's style emphasizes intense confrontations, strategic deception, unexpected character roles, humor, irony, and a noir-like atmosphere. Characters are developed through internal reflections, dynamic dialogue, and distinct speech patterns. Language is vivid, visceral, colloquial, and aggressive, enhancing the tone and character interactions. I will create Story Rules that incorporate these elements, ensuring they are actionable and tailored to the Writing Prompt.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Begin the story with an immediate confrontation where the protagonist is approached by a fae or demon attempting to reclaim their name. Use this encounter to establish tension and urgency, similar to the vampire farmer's surprise upon discovering a human.  \n  - Structure the plot around a series of strategic deceptions and intense confrontations. For example, the protagonist might use their knowledge of the fae's or demon's debts to manipulate the situation, leading to a dramatic escape or resolution, akin to the archeologist's escape through a booby-trapped tunnel.  \n  - Incorporate unexpected and dramatic events, such as a sudden betrayal or a magical duel, to maintain suspense and intrigue, reflecting the climactic battle involving Mermadons and Gondwanans.  \n  - Use dialogue-driven conflict to resolve the story, where the protagonist negotiates or outsmarts the fae or demon, similar to the dynamic exchanges between Mr. Piggy and the Big Bad Wolf.  \n\n- **Creativity**:  \n  - Subvert traditional narratives by portraying the protagonist as a seemingly ordinary individual with unexpected power over supernatural beings, mirroring the valet's strategic manipulation on holy ground.  \n  - Infuse humor and irony into the interactions, such as the fae or demon underestimating the protagonist's influence, similar to Duke Mantacito's reaction to De La Delala.  \n  - Create a noir-like atmosphere by setting the story in a gritty, urban environment where supernatural debts are settled, akin to the crime drama world of Mr. Piggy's house of cards.  \n\n- **Development (Character and Setting)**:  \n  - Develop the protagonist through internal reflections on their past dealings with supernatural beings, highlighting their growth and tactical acumen, as seen in the valet's story.  \n  - Use dynamic dialogue to reveal the protagonist's relationships and power dynamics with the fae or demon, similar to the exchanges between the vampire farmer and Ethel.  \n  - Craft distinct, stylized dialogue for the protagonist that conveys authority and confidence, such as, \"You think you can reclaim your name? Not unless I say so,\" reflecting Mr. Piggy's authoritative speech.  \n\n- **Language Use**:  \n  - Employ vivid and visceral language to describe the supernatural elements and confrontations, such as, \"The air crackled with energy as the demon's eyes glowed with a fiery intensity.\"  \n  - Use colloquial and aggressive language to enhance the tone and character interactions, with phrases like, \"You owe me, and you know it,\" to create a streetwise, assertive atmosphere.  \n  - Incorporate descriptive language and dialogue to build intrigue and tension, such as, \"I hold the power of your name, and with it, your fate,\" enhancing the mysterious and dramatic tone.  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt \"You can never truly kill a vampire. You can burn them to ash, but a drop of blood is all they need to come back, even if centuries have passed,\" I will analyze the Author Writing Sheet to extract key storytelling elements. The author emphasizes intense confrontations, strategic deception, and immediate tension in plot development. Creativity is expressed through subverting traditional narratives and infusing humor and irony. Characters are developed through internal reflections, dynamic dialogue, and distinct speech patterns, while language use is vivid, colloquial, and descriptive. I will tailor these elements to the vampire theme, ensuring the rules guide the language model to create a story that is both authentic to the author's style and engaging for the prompt.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Begin the story with an immediate and intense confrontation involving a vampire who has been reduced to ash but is on the verge of resurrection. Use a setting where a drop of blood is about to fall onto the ashes, creating a sense of urgency and danger. For example, a character might accidentally cut themselves while exploring an ancient crypt, unaware of the vampire's remains beneath them.\n  - Structure the plot around strategic deception, where the vampire, once resurrected, manipulates those around them to regain power. Introduce a character who believes they can control the vampire, only to be outwitted in a dramatic twist.\n  - Incorporate unexpected and dramatic events, such as a sudden betrayal or a hidden alliance revealed during a climactic battle between vampire hunters and the newly resurrected vampire, using lightning or other supernatural elements to heighten the drama.\n  - Use dialogue-driven conflict to resolve key plot points, such as a negotiation between the vampire and a descendant of their original slayer, where the vampire offers a deal to spare the descendant's life in exchange for freedom.\n\n- **Creativity**:  \n  - Subvert traditional vampire narratives by presenting the vampire as a strategic manipulator who uses their resurrection to challenge societal norms, perhaps by infiltrating a modern-day corporation or political system.\n  - Employ humor and irony by depicting the vampire's struggle to adapt to contemporary life, such as their confusion with modern technology or fashion, leading to comedic situations that highlight their ancient origins.\n  - Infuse a noir-like, crime drama atmosphere by setting the story in a gritty urban environment where the vampire operates like a crime lord, using their powers to control a network of human and supernatural allies.\n\n- **Development (Character and Setting)**:  \n  - Develop the vampire character through internal reflections on their past life and the centuries spent in oblivion, focusing on their desire for revenge or redemption. Use these reflections to show their growth and adaptation to the modern world.\n  - Use dynamic dialogue to explore the relationships between the vampire and other characters, such as a vampire hunter who is torn between duty and a personal connection to the vampire.\n  - Create distinct, stylized dialogue for the vampire that reveals their personality and power dynamics, such as using archaic language mixed with modern slang to show their struggle to fit in.\n\n- **Language Use**:  \n  - Employ vivid and visceral language to describe the vampire's resurrection, using phrases that convey the brutality and intensity of their return, such as \"The ashes stirred, coalescing into a form that was both ancient and terrifying.\"\n  - Use colloquial and aggressive language in character interactions to enhance the story's tone, such as a vampire hunter's gritty threats or the vampire's mocking retorts.\n  - Utilize descriptive language and dialogue to create a sense of intrigue and tension, particularly in scenes where the vampire's true intentions are revealed, using lines like, \"I have waited centuries for this moment, and now, the world shall remember my name.\"  \n</story_rules>"
]