[
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The prompt involves witnessing a dangerous spell, which suggests themes of curiosity, danger, and possibly ethical considerations. The author's style often involves moral dilemmas, ethical boundaries, and personal relationships, which can be integrated into this narrative. The author also uses modern, relatable elements and vivid sensory language, which will be crucial in crafting an engaging story. I will create Story Rules that incorporate these elements, ensuring they align with the prompt's themes and the author's unique style.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the plot around a moral confrontation involving the dangerous spell. Use dialogue to explore the ethical implications of performing such a spell. For example, have the protagonist confront the spellcaster, questioning the morality of their actions: \"Do you even realize what could happen if this goes wrong? It's not just about you.\"  \n  - Develop the narrative through a familial or close relationship conversation, where the protagonist seeks reassurance or advice about the witnessed spell. This could involve a mentor or a family member who has experience with magic, providing a grounding perspective.  \n  - Integrate a sudden, intense vision or realization that prompts immediate action. For instance, the protagonist might have a vision of the spell going awry, leading them to intervene or warn others.  \n\n- **Creativity**:  \n  - Subvert traditional spellcasting stereotypes by incorporating modern, relatable elements. The spellcaster could be a young, tech-savvy individual using unconventional tools, like a smartphone app, to perform the spell.  \n  - Integrate supernatural elements into a realistic setting, such as a bustling city or a college campus, to explore the everyday challenges of living with magic. This could involve the protagonist navigating a world where magic is both a tool and a threat.  \n  - Explore the darker potential of the prompt by introducing ethical conflicts. The protagonist might grapple with the morality of learning or stopping the spell, questioning whether the ends justify the means.  \n\n- **Development (Character and Setting)**:  \n  - Develop characters through realistic dialogue that reveals personal values and conflicts. The protagonist's conversation with the spellcaster should highlight their differing views on the use of magic: \"Just because you can, doesn't mean you should.\"  \n  - Use interactions and backstories to add depth to relationships. The protagonist might have a history with the spellcaster, such as being former friends or rivals, which influences their current dynamic.  \n  - Explore characters' internal struggles and emotional depth. The protagonist could internally debate the risks and rewards of intervening, reflecting on past experiences with magic.  \n\n- **Language Use**:  \n  - Use direct and conversational language to create an engaging and contemporary tone. The protagonist's internal monologue and dialogue should feel current and relatable, such as, \"This isn't Hogwarts, and you're not Harry Potter.\"  \n  - Employ vivid, sensory language to convey the intensity of the spell and the protagonist's emotions. Describe the spell's effects with phrases like \"the air crackled with energy\" and \"a chill ran down my spine as I watched.\"  \n  - Use contrasting imagery to emphasize the protagonist's transformation or realization. Contrast the initial awe of witnessing the spell with the sobering reality of its potential consequences, using imagery like \"the dazzling light faded, leaving only the shadow of what could have been.\"  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The goal is to create rules that reflect the author's unique style while aligning with the prompt's themes of an uneasy alliance between humans and vampires in a zombie-ravaged world.\n\n### Plot\nThe author often structures plots around moral confrontations, familial conversations, and sudden visions that drive action. For this prompt, the plot should focus on the moral and ethical dilemmas of the alliance, such as the vampires' need for human blood and the humans' reliance on vampires for protection. The narrative can unfold through dialogues that explore these ethical boundaries and the consequences of the alliance.\n\n### Creativity\nThe author creatively subverts traditional stereotypes and integrates supernatural elements into realistic settings. For this prompt, the story should creatively depict the alliance, perhaps by showing vampires in unexpected roles, such as protectors or strategists, and humans adapting to new societal norms. The narrative can explore the darker potential of the alliance, such as the ethical conflicts arising from the vampires' need for blood.\n\n### Development (Character and Setting)\nThe author develops characters through realistic dialogue, emotional depth, and internal struggles. Characters in this story should be developed through their interactions and the moral dilemmas they face. The setting should reflect a world where humans and vampires coexist out of necessity, with vivid descriptions of the post-apocalyptic environment.\n\n### Language Use\nThe author uses direct, conversational language and vivid sensory descriptions. The story should employ a conversational tone to make the characters relatable, while vivid language should be used to describe the intense emotions and the bleak setting of a zombie-ravaged world.\n\nUsing these insights, I will create detailed Story Rules that guide the language model in crafting a narrative that aligns with both the author's style and the Writing Prompt.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the plot around the moral and ethical dilemmas of the alliance between humans and vampires. Use dialogue to explore the necessity and tension of this relationship. For example, create a scene where a human leader and a vampire discuss the terms of their alliance, debating the ethical implications of using humans as a food source.\n  - Develop the narrative through a familial conversation that highlights the personal stakes of the alliance. For instance, depict a conversation between a human parent and child about the dangers and benefits of living under vampire protection.\n  - Incorporate a sudden, intense vision that prompts immediate action, such as a human or vampire having a premonition of a zombie attack, which forces the alliance to act quickly to prevent disaster.\n\n- **Creativity**:\n  - Subvert traditional vampire stereotypes by portraying them in modern, relatable roles, such as strategists or protectors. For example, describe a vampire character who wears contemporary clothing and uses technology to coordinate defense strategies.\n  - Integrate supernatural elements into the realistic setting of a post-apocalyptic world. Show how vampires and humans adapt to everyday challenges, like securing food and shelter, while dealing with the constant threat of zombies.\n  - Explore the darker potential of the alliance by introducing ethical conflicts. Create a scenario where a vampire must decide whether to save a human in exchange for blood, raising questions about the morality of their actions.\n\n- **Development (Character and Setting)**:\n  - Develop characters through realistic dialogue that reveals their personal values and conflicts. For example, write a conversation where a human expresses distrust of vampires, while a vampire defends their necessity in the alliance.\n  - Use emotional depth and internal struggles to add layers to characters. Show a vampire grappling with guilt over their need for human blood, or a human struggling with fear and reliance on their vampire allies.\n  - Describe the setting with vivid detail, capturing the desolation of a zombie-ravaged world. Use sensory language to depict the eerie silence of abandoned cities and the constant threat of zombie attacks.\n\n- **Language Use**:\n  - Employ direct and conversational language to create an engaging and contemporary tone. Use casual dialogue to make characters relatable, such as a vampire joking about their past life before the apocalypse.\n  - Use vivid, sensory language to convey the intensity of the characters' emotions and the bleakness of the setting. Describe the fear and urgency during a zombie attack with phrases like \"the air was thick with tension\" and \"the ground shook with the undead's relentless march.\"\n  - Maintain a conversational and introspective narrative style to convey the protagonist's thoughts and emotions. Include internal monologues that reflect on the complexity of the alliance and the characters' personal struggles.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt \"There is just one problem with your plan. Humans. They will pack bond with anything. Even **that**,\" I will analyze the Author Writing Sheet to identify key storytelling elements. The author frequently uses moral confrontations, familial conversations, and psychic abilities to drive plots. Creativity is expressed through subverting stereotypes, integrating supernatural elements into realistic settings, and exploring ethical conflicts. Characters are developed through realistic dialogue, emotional depth, and internal struggles. Language use is direct, conversational, and vivid, often employing sensory details and introspective tones. I will tailor these elements to the Writing Prompt, focusing on the theme of humans forming unexpected bonds, possibly with an unusual or supernatural entity, and the implications of such bonds.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the plot around a moral confrontation involving the unexpected bond between humans and a non-human entity. Use dialogue to explore the ethical boundaries of this bond. For example, a character might argue, \"You can't just treat it like a pet. It's not meant to be domesticated.\"\n  - Develop the narrative through a familial conversation that explores themes of independence and reassurance in the context of the bond. A parent might express concern, \"Are you sure it's safe to keep it around?\" while the child reassures, \"It's not dangerous, just misunderstood.\"\n  - Center the plot on the exploration of the implications of humans bonding with the entity, perhaps revealing unforeseen consequences or benefits. For instance, the bond might unlock latent psychic abilities or create a new form of communication.\n  - Introduce a sudden, intense vision that drives immediate action related to the bond, such as a character foreseeing a future where the bond changes societal norms, prompting them to act to prevent or encourage this future.\n\n- **Creativity**:\n  - Subvert traditional stereotypes of the non-human entity by emphasizing modern, relatable elements. For example, the entity might have a quirky, endearing habit that makes it more relatable, like enjoying human music or mimicking human speech.\n  - Integrate the supernatural or unusual entity into a realistic setting to explore everyday challenges, such as the entity causing disruptions in a neighborhood or workplace, leading to humorous or tense situations.\n  - Explore the darker potential of the bond by introducing ethical conflicts, such as whether the bond is truly consensual or if it manipulates human emotions.\n  - Use metaphors and societal commentary to explore the theme of sentience and the implications of humans forming bonds with non-human entities, perhaps comparing the bond to historical alliances or friendships.\n\n- **Development (Character and Setting)**:\n  - Develop characters through realistic dialogue that reveals their personal values and conflicts regarding the bond. For instance, a character might express skepticism, \"How can you trust something that isn't even human?\"\n  - Add depth to characters through their interactions and backstories, perhaps revealing past experiences with unusual bonds or their motivations for forming such a bond.\n  - Explore characters' emotional depth and internal struggles as they navigate the complexities of the bond, such as feeling torn between societal norms and personal beliefs.\n  - Use emotional responses and interactions to reveal deeper connections between characters and the entity, highlighting empathy and understanding.\n\n- **Language Use**:\n  - Use direct and conversational language to create an engaging and contemporary tone, making the bond feel relatable and current. For example, a character might casually remark, \"It's like having a pet, but way cooler.\"\n  - Employ dialogue to effectively convey character emotions and relationships, using exchanges that reveal concern, curiosity, and humor about the bond.\n  - Use vivid, sensory language to create an immersive atmosphere, describing the entity and its interactions with humans in detail, such as \"Its presence felt like a warm, comforting blanket on a cold day.\"\n  - Employ a conversational and introspective narrative style to convey the protagonist's thoughts and emotions about the bond, reflecting on its impact on their life and relationships.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The prompt involves themes of family dynamics, superpowers, and personal identity, which can be explored through moral dilemmas, emotional depth, and creative reinterpretations of traditional themes. The author's style emphasizes moral confrontations, realistic dialogue, and vivid sensory language, which will be integrated into the Story Rules.  \n\nFor **Plot**, the author often structures narratives around moral dilemmas and personal relationships. The story should focus on the protagonist's internal conflict about reconnecting with their family and the implications for their children. For **Creativity**, the author subverts traditional themes and integrates supernatural elements into realistic settings. The story should creatively explore the protagonist's non-superpowered life and the unique challenges it presents. In **Development (Character and Setting)**, the author uses dialogue and emotional depth to reveal character values and conflicts. The protagonist's interactions with their family and children should highlight their internal struggles and personal growth. For **Language Use**, the author employs direct, conversational language and vivid imagery. The story should use these techniques to convey the protagonist's emotions and the tension of the family dynamics.  \n\nI will now construct detailed Story Rules for each category, incorporating examples inspired by the Author Writing Sheet and tailored to the Writing Prompt.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the plot around a moral confrontation between the protagonist and their family. Use dialogue to explore the ethical implications of the family's attempt to reconnect. For example, have the protagonist question their family's motives, saying, \"You cut me off when I needed you most. Why now, when my kids have what you wanted?\"  \n  - Develop the narrative around a familial conversation that explores themes of independence and reassurance. Include a scene where the protagonist reassures their children about their unique identity, despite the family's past actions.  \n  - Integrate a sudden, intense realization that drives immediate action. For instance, the protagonist might have a moment of clarity about the importance of protecting their children's autonomy, prompting them to confront their family.  \n\n- **Creativity**:  \n  - Subvert traditional superpower narratives by emphasizing the protagonist's non-superpowered life and how they navigate challenges without powers. Describe their everyday life with relatable elements, such as balancing work and parenting.  \n  - Integrate supernatural elements into a realistic setting to explore the protagonist's unique challenges. For example, depict how the protagonist manages a household where their children have powers, blending the extraordinary with the mundane.  \n  - Explore the darker potential of the prompt by introducing ethical conflicts. Consider the moral implications of the family wanting to reconnect for the sake of the children's powers, raising questions about genuine familial bonds versus utilitarian motives.  \n\n- **Development (Character and Setting)**:  \n  - Develop characters through realistic dialogue that reveals personal values and conflicts. Use conversations between the protagonist and their family to highlight their strong moral compass and the pain of past rejections.  \n  - Use emotional depth to explore the protagonist's internal struggles. Show their conflict between wanting to protect their children and the desire for familial acceptance.  \n  - Develop the protagonist's character through introspection and personal relationships. Include internal monologues where the protagonist reflects on their past and the impact of their family's actions on their self-worth.  \n\n- **Language Use**:  \n  - Use direct and conversational language to create an engaging and contemporary tone. For example, have the protagonist use casual, modern dialogue when discussing everyday life with their children, such as, \"Superpowers or not, you still have to do your homework.\"  \n  - Employ vivid, sensory language to convey the intensity of the protagonist's emotions and the tension in family interactions. Describe the atmosphere during a family meeting with phrases like, \"The air felt charged, like a storm about to break.\"  \n  - Use informal and conversational language to establish a relatable tone. Include moments where the protagonist uses humor or sarcasm to cope with the situation, such as, \"Great, now they want to play happy family. Where were they when I needed a babysitter?\"  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The prompt involves a human living in a university dorm for monsters, which presents opportunities for exploring themes of coexistence, adaptation, and the blending of the supernatural with the mundane. The author's style emphasizes moral dilemmas, personal relationships, and the integration of supernatural elements into realistic settings. I will create Story Rules that reflect these elements, ensuring they are actionable and tailored to the prompt.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the plot around a moral confrontation involving the protagonist's initial fear or prejudice against their supernatural roommates. Use dialogue to explore ethical boundaries and the protagonist's evolving understanding of coexistence. For example, have the protagonist initially refuse to participate in a werewolf's full moon ritual, citing safety concerns, but later engage in a conversation that reveals the ritual's cultural significance.\n  - Develop the narrative through a series of familial-like conversations with the supernatural roommates, exploring themes of independence and reassurance. For instance, include a scene where a vampire roommate reassures the protagonist about their safety, saying, \"You’re safer here than anywhere else on campus.\"\n  - Introduce a subplot involving the exploration of the protagonist's latent psychic abilities, which are triggered by the supernatural environment. This could involve the protagonist having visions that help them navigate conflicts within the dorm.\n  - Drive the story with a sudden, intense vision that prompts immediate action, such as the protagonist foreseeing a conflict between dorm members that they must prevent to maintain harmony.\n\n- **Creativity**:  \n  - Subvert traditional monster stereotypes by emphasizing modern, relatable elements. For example, depict werewolves as fitness enthusiasts who use their transformations for athletic competitions, or vampires as nocturnal scholars who excel in night classes.\n  - Integrate supernatural elements into the university setting to explore everyday challenges, such as managing a shared kitchen with dietary restrictions for vampires and werewolves.\n  - Explore the darker potential of the prompt by introducing ethical conflicts, such as the protagonist grappling with the morality of using their newfound psychic abilities to influence dorm dynamics.\n  - Use metaphors and societal commentary to explore themes of sentience and acceptance, such as comparing the protagonist's adaptation to the dorm to a cultural exchange program.\n\n- **Development (Character and Setting)**:  \n  - Develop characters through realistic dialogue that reveals personal values and conflicts. For instance, have a werewolf roommate express frustration over stereotypes, saying, \"Just because I howl doesn’t mean I’m a savage.\"\n  - Enrich character relationships through interactions and backstories, such as revealing a vampire's past life as a human and their struggles with immortality, which parallels the protagonist's own journey of adaptation.\n  - Explore characters' emotional depth and internal struggles, such as the protagonist's initial fear of their roommates evolving into a protective bond, highlighted by their willingness to stand up for them in a university council meeting.\n  - Use emotional responses and interactions to reveal deeper connections, like a scene where the protagonist comforts a homesick werewolf, showcasing their growing empathy and understanding.\n\n- **Language Use**:  \n  - Employ direct and conversational language to create an engaging and contemporary tone. Use casual dialogue to reflect the protagonist's initial discomfort and eventual ease with their supernatural roommates, such as, \"I never thought I'd be sharing a bathroom with a vampire, but here we are.\"\n  - Use dialogue to effectively convey character emotions and relationships, capturing moments of tension and camaraderie, like a heated debate over dorm rules that ends in laughter and mutual respect.\n  - Incorporate vivid, sensory language to create an immersive atmosphere, describing the dorm's unique environment with phrases like \"the air buzzed with an electric energy\" or \"the moonlight cast eerie shadows that danced across the walls.\"\n  - Use contrasting imagery to emphasize the protagonist's transformation from fear to acceptance, such as describing their initial perception of the dorm as \"a haunted house\" and later as \"a home filled with unexpected warmth.\"  \n</story_rules>"
]