[
    "<thinking>\nThe provided writing prompt introduces a fantastical scenario involving immortality and the rebirth of universes, setting the stage for a story rich in introspection and existential themes. The protagonist faces a council that questions their qualifications for immortality, suggesting a narrative centered on self-discovery and moral dilemmas. The user profile indicates a preference for introspective, emotionally driven plots with non-linear structures, which aligns well with the prompt's potential for exploring complex internal conflicts. The user's style of blending genres and incorporating surreal elements can enhance the story's depth, while their skill in character development and evocative language will help create a vivid and immersive narrative. The few-shot examples demonstrate a focus on character introspection and emotional journeys, which should be reflected in the new story rules by emphasizing the protagonist's internal struggle and the abstract nature of the setting.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin with the protagonist standing before the council, feeling the weight of their judgment and the implications of their past actions.\n  - Use a non-linear narrative structure to explore the protagonist's past experiences with universe rebirths and their decision to end their universe prematurely.\n  - Integrate episodic flashbacks that reveal key moments of the protagonist's journey, highlighting their emotional struggles and moral dilemmas.\n  - Conclude with the protagonist's introspective realization about their actions and the true meaning of immortality, leaving the story open-ended and thought-provoking.\n\n- **Creativity**:\n  - Blend elements of fantasy and existential philosophy to create a unique narrative that challenges the protagonist's understanding of life and immortality.\n  - Incorporate surreal and abstract imagery, such as universes collapsing and rebirthing, to enhance the story's depth and mystery.\n  - Use irony and humor to underscore the protagonist's internal journey, adding layers of complexity to their character.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a multidimensional character through internal monologues and symbolic interactions with the council and other immortals.\n  - Create a diverse and vividly described setting that reflects the protagonist's internal turmoil, such as a cosmic council chamber with shifting stars and galaxies.\n  - Use the setting to enhance the emotional and thematic depth of the story, tying it closely to the protagonist's experiences and realizations.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to create vivid imagery and convey the protagonist's complex emotions and internal conflicts.\n  - Use a conversational and introspective tone, with short, punchy sentences that reflect the protagonist's internal monologue and emotional journey.\n  - Adapt the pacing to match the narrative's emotional beats, using slower, reflective passages to build tension and faster, dynamic scenes to heighten excitement.\n</story_rules>",
    "<thinking>\nThe provided writing prompt suggests a narrative centered around power, leadership, and the protagonist's determination to protect their achievements from an unworthy leader. The thematic elements include ambition, destiny, and resistance against perceived injustice. The user profile indicates a preference for introspective and emotionally driven plots, often with non-linear and episodic structures. The user blends genres and employs surreal elements, focusing on the protagonist's internal journey and emotional struggles. Characters are developed through internal monologues and symbolic interactions, with settings that enhance emotional depth. Language use is descriptive and evocative, adapting to the narrative's tone.\n\nGiven these insights, the story rules will focus on creating a complex, introspective narrative that explores the protagonist's emotional struggle against the backdrop of a surreal and imaginative setting. The plot will be non-linear, with episodic elements that reflect the protagonist's internal conflict and resistance. Creativity will involve blending genres and incorporating surreal elements to enrich the narrative. Character development will focus on the protagonist's internal monologue and symbolic interactions, while the setting will be vividly described to enhance the emotional and thematic depth. Language use will be descriptive and evocative, adapting to the narrative's tone to create an immersive experience.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Structure the narrative in a non-linear, introspective format, focusing on the protagonist's internal struggle against the perceived unworthy leader.\n  - Integrate episodic elements that explore different facets of the protagonist's resistance and determination to protect their achievements.\n  - Include moments of introspection and emotional conflict, highlighting the protagonist's motivations and fears.\n  - Conclude with an open-ended resolution that reflects the ongoing nature of the protagonist's struggle and leaves room for future developments.\n\n- **Creativity**:\n  - Blend genres by incorporating elements of political intrigue, fantasy, and psychological drama.\n  - Use surreal and abstract elements to symbolize the protagonist's internal conflict and the cosmic misalignment of the stars.\n  - Incorporate imaginative settings and scenarios that challenge the protagonist's perceptions and beliefs.\n  - Employ irony and subtle humor to highlight the absurdity of the situation and the protagonist's determination.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through internal monologues and symbolic interactions, revealing their complex emotions and motivations.\n  - Create a multidimensional antagonist whose ambition and perceived destiny contrast with the protagonist's values.\n  - Design diverse and vividly described settings that reflect the emotional and thematic depth of the narrative, such as celestial landscapes or symbolic representations of power.\n  - Use the setting to enhance the protagonist's emotional journey and highlight the stakes of their struggle.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to create vivid imagery and convey the protagonist's complex emotions.\n  - Adapt the language style to suit the narrative's tone, using introspective and reflective language for internal monologues.\n  - Use dynamic and engaging dialogue to reveal character motivations and drive the narrative forward.\n  - Maintain a balance between introspective and action-oriented language to create an immersive and emotionally impactful narrative.\n</story_rules>",
    "<thinking>\nThe provided writing prompt sets up a humorous and potentially chaotic scenario involving a misunderstanding about which button should not be pressed. This prompt suggests a narrative that could explore themes of miscommunication, curiosity, and unintended consequences. The user profile indicates a preference for introspective and emotionally driven plots with extraordinary elements, suggesting that the story could delve into the characters' internal reactions to the chaos that ensues. The user's style of blending genres and creating imaginative settings could transform this simple scenario into a surreal or abstract narrative, perhaps involving unexpected outcomes from pressing the wrong button. The character development should focus on the emotional and psychological responses to the situation, using vivid and evocative language to create a rich, immersive experience. The few-shot examples demonstrate a preference for non-linear, episodic storytelling, which could be applied here by exploring the aftermath of the button press in a series of interconnected vignettes or episodes. The language should be conversational and informal, with a focus on internal monologue to capture the protagonist's thoughts and feelings.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin with a seemingly mundane scenario that quickly escalates due to the button press, creating a sense of chaos and unpredictability.\n  - Structure the narrative in a non-linear, episodic format, exploring the consequences of the button press through a series of interconnected vignettes.\n  - Focus on the protagonist's internal journey and emotional responses to the unfolding events, using introspection to drive the plot forward.\n  - Conclude with an open-ended resolution that leaves room for interpretation and further exploration of the characters' experiences.\n\n- **Creativity**:\n  - Blend elements of humor and surrealism to create a unique and engaging narrative that surprises and intrigues the reader.\n  - Incorporate abstract or supernatural consequences from the button press, adding layers of mystery and depth to the story.\n  - Use irony and unexpected twists to highlight the absurdity and unpredictability of the situation.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters through internal monologues and symbolic interactions, focusing on their emotional and psychological responses to the chaos.\n  - Create a vividly described setting that enhances the emotional and thematic depth of the story, using imaginative and diverse environments to reflect the characters' experiences.\n  - Explore the characters' complex emotions, such as fear, curiosity, and confusion, through introspective narratives.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to create vivid imagery and convey complex emotions, adapting the style to suit the narrative's tone.\n  - Use a conversational and informal tone, with short, punchy sentences and a focus on the protagonist's internal monologue to capture their thoughts and feelings.\n  - Vary the pacing to match the narrative's emotional beats, using slower, reflective passages to build tension and faster, dynamic scenes to heighten excitement.\n</story_rules>",
    "<thinking>\nThe provided writing prompt presents a humorous and fantastical scenario involving a curse that prevents lying, leading to unintended oversharing. This setup suggests a plot that can explore themes of honesty, social interactions, and the consequences of truth-telling. The user profile indicates a preference for introspective and emotionally driven plots, often with non-linear and episodic structures. The user enjoys blending genres and incorporating surreal elements, which can be applied to this prompt by exploring the protagonist's internal journey and emotional struggles with the curse. The user excels in creating multidimensional characters and vivid settings, which can be used to enhance the narrative's emotional depth. The language style should be descriptive and evocative, with a conversational and informal tone to match the prompt's humorous nature. The few-shot examples demonstrate the user's ability to create complex, introspective stories with a mix of humor and supernatural elements, which should be reflected in the new story rules.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's immediate reaction to the curse, using a non-linear structure to explore past instances where lying played a significant role in their life.\n  - Integrate episodic scenes that highlight the protagonist's interactions with others, focusing on the humorous and awkward situations that arise from their inability to lie.\n  - Develop an introspective narrative that delves into the protagonist's emotional journey, exploring themes of honesty, vulnerability, and self-discovery.\n  - Conclude with a reflective moment where the protagonist gains insight into their relationships and personal growth, leaving room for continued exploration of their new reality.\n\n- **Creativity**:\n  - Blend humor and fantasy to create a unique narrative that balances the absurdity of the curse with the protagonist's emotional struggles.\n  - Incorporate surreal and abstract elements, such as dream sequences or symbolic interactions, to add depth and mystery to the protagonist's journey.\n  - Use irony and wit to highlight the protagonist's internal conflicts and the social dynamics affected by the curse.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a multidimensional character through internal monologues and symbolic interactions, revealing their fears, curiosities, and personal growth.\n  - Create diverse and vividly described settings that reflect the protagonist's emotional state and enhance the narrative's thematic depth.\n  - Use secondary characters to challenge and support the protagonist, revealing different facets of their personality and the impact of the curse on their relationships.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to create vivid imagery and convey the protagonist's complex emotions.\n  - Use a conversational and informal tone, with short, punchy sentences to match the humorous and introspective nature of the narrative.\n  - Adapt the language style to suit the narrative's tone, using humor and irony to enhance the story's emotional impact and engagement.\n</story_rules>",
    "<thinking>\nThe writing prompt presents a unique twist on the vampire genre by introducing zombies as a mere annoyance, shifting the focus to the vampire's struggle to find a suitable meal. This sets the stage for a story that blends horror with dark humor and introspection. The user profile indicates a preference for introspective, emotionally driven plots with non-linear and episodic structures. The user excels in creating multidimensional characters and vivid settings, often using surreal and abstract elements to add depth. Their language is descriptive and evocative, adapting to the narrative's tone. The few-shot examples demonstrate a focus on blending genres, using humor and irony, and creating immersive narratives. These elements will guide the creation of Story Rules that emphasize the vampire's internal journey, the surreal nature of their world, and the emotional and thematic depth of their struggle to find an edible meal amidst a zombie apocalypse.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Develop an introspective and emotionally driven plot that explores the vampire's internal struggle with their identity and the challenges of finding sustenance in a world overrun by zombies.\n  - Structure the narrative in a non-linear, episodic manner, using flashbacks and fragmented memories to reveal the vampire's past experiences and current predicament.\n  - Integrate extraordinary elements into everyday scenarios, such as the vampire's interactions with zombies and their quest for an edible meal, to create a complex and engaging narrative.\n\n- **Creativity**:\n  - Blend genres by incorporating elements of horror, dark humor, and introspection, focusing on the vampire's unique perspective on the zombie apocalypse.\n  - Use surreal and abstract elements, such as the vampire's internal monologue and symbolic interactions with zombies, to add layers of mystery and depth to the narrative.\n  - Employ humor and irony to highlight the absurdity of the vampire's situation and their emotional journey.\n\n- **Development (Character and Setting)**:\n  - Develop the vampire as a multidimensional character through internal monologues and symbolic interactions, exploring their complex emotions and existential dilemmas.\n  - Create a vivid and immersive setting that reflects the vampire's experiences, using detailed descriptions of the post-apocalyptic world and the challenges it presents.\n  - Use diverse and vividly described settings, such as abandoned cities and eerie landscapes, to enhance the emotional and thematic depth of the story.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to create vivid imagery and convey the vampire's complex emotions and internal struggles.\n  - Adapt the language style to suit the narrative's tone, using a conversational and informal style with short, punchy sentences to reflect the vampire's internal monologue.\n  - Use humor and irony in the language to enhance the story's darkly humorous tone and highlight the absurdity of the vampire's predicament.\n</story_rules>"
]