[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt suggests a dystopian setting where humanity has reverted to natural selection by removing safety features, implying themes of survival, societal critique, and perhaps dark humor. The author's style emphasizes internal conflict, emotional depth, and introspective journeys, often with a central revelation or mystery. The author also uses vivid sensory language and integrates modern twists and personal settings to explore themes. I will incorporate these elements into the Story Rules, ensuring they are actionable and tailored to the prompt.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the narrative around the protagonist's internal conflict with the societal shift towards natural selection. Begin with the protagonist's initial acceptance or indifference, leading to a personal experience that challenges their beliefs. For example, the protagonist might witness a loved one suffer due to the lack of safety features, prompting introspection and a reevaluation of their stance.\n  - Develop the plot around a central revelation that challenges the protagonist's identity or beliefs. This could be a discovery that the removal of safety features is a cover for a deeper, more sinister agenda by those in power, forcing the protagonist to confront their role in this society.\n  - Incorporate a mystery resolved through a tangible explanation, such as uncovering a secret group that sabotages safety features to accelerate natural selection, providing a concrete resolution to the societal chaos.\n\n- **Creativity**:  \n  - Explore the emotional complexities of living in a world without safety features, focusing on the internal experience rather than external dangers. For instance, describe the protagonist's anxiety and heightened awareness as they navigate daily life, knowing that any misstep could be fatal.\n  - Integrate a personal and domestic setting to explore the theme of survival and adaptation. Use the protagonist's home environment to reflect their coping mechanisms, such as removing all sharp objects or padding furniture, highlighting the absurdity and desperation of their situation.\n  - Introduce an unconventional twist by suggesting a scientific or technological explanation for the societal shift, such as a government experiment to study human adaptability and resilience, adding depth to the narrative.\n\n- **Development (Character and Setting)**:  \n  - Develop the protagonist's character through internal conflict and self-awareness. Use introspective moments where the protagonist questions their own survival instincts and moral compass in a world that values natural selection.\n  - Develop characters through their emotional responses to the societal changes. For example, show a character's fear and determination as they navigate a city without safety features, highlighting their resilience and adaptability.\n  - Reflect the oppressive nature of the new societal norms through the setting. Describe urban environments stripped of safety, with citizens constantly on edge, mirroring the protagonist's internal struggle with the harsh realities of their world.\n\n- **Language Use**:  \n  - Use vivid sensory language to convey the protagonist's emotional state and the tension of living in a world without safety features. For example, describe the protagonist's heightened senses as they walk through a city, feeling every uneven pavement and hearing every distant scream.\n  - Employ dialogue to convey character dynamics and thematic elements. Use conversations between characters to highlight differing perspectives on the societal changes, such as debates on the ethics of natural selection.\n  - Use internal monologue to build tension and convey the protagonist's emotional state. For instance, have the protagonist reflect on their fear and uncertainty, questioning whether they can survive in a world that seems to punish the slightest mistake.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet to identify key storytelling elements that can be adapted to the narrative of discovering an advanced civilization with a modern company's symbol. The author's style emphasizes internal conflict, emotional experiences, and introspective journeys, often with a central revelation that challenges identity. Creativity is expressed through supernatural bonds, personal settings, and unconventional twists. Characters are developed through introspection, emotional responses, and professional roles, while settings often reflect internal struggles. Language use is vivid and sensory, with dialogue and internal monologue conveying emotional states and thematic elements. I will tailor these elements to the Writing Prompt, ensuring the narrative explores the mystery of the advanced civilization and the modern symbol through the protagonist's personal and emotional lens.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative around the protagonist's internal conflict and introspective journey as they uncover the ruins of the advanced civilization. Focus on their emotional and personal experiences, such as the awe and confusion upon discovering the modern company's symbol. For example, describe the protagonist's thoughts as they trace the symbol with their fingers, feeling a mix of excitement and dread.\n  - Develop the plot around a central revelation that challenges the protagonist's understanding of history and identity. Introduce a moment where the protagonist realizes the implications of the symbol, questioning their beliefs about the past and the present.\n  - Incorporate a mystery that is resolved through a tangible explanation. Guide the protagonist to uncover evidence that links the modern company to the ancient civilization, such as a hidden chamber with documents or artifacts that provide a concrete resolution.\n\n- **Creativity**:\n  - Explore the emotional complexities of the protagonist's connection to the ruins, focusing on their internal experience rather than external phenomena. Use the ruins as a backdrop to delve into the protagonist's feelings of insignificance and wonder.\n  - Integrate a personal and domestic setting to explore the theme of transformation. For instance, have the protagonist reflect on their own life changes as they navigate the ruins, drawing parallels between their personal growth and the rise and fall of civilizations.\n  - Introduce an unconventional twist by suggesting a scientific explanation for the modern symbol's presence. Perhaps the protagonist discovers that the company is conducting secret experiments related to time travel or parallel universes.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist's character through internal conflict, introspection, and self-awareness. Highlight their emotional responses to the discovery, such as disbelief, curiosity, and a sense of destiny.\n  - Use the setting of the ruins to reflect the protagonist's internal struggle with understanding their place in the world. Describe the ruins in vivid detail, emphasizing their grandeur and mystery, and how they mirror the protagonist's own search for meaning.\n  - Develop characters through their professional roles and interactions. Introduce a team of archaeologists or historians working with the protagonist, each with their own perspectives and theories about the ruins, which reveal their personalities and priorities.\n\n- **Language Use**:\n  - Employ vivid sensory language to convey the protagonist's emotional state and the depth of their connection to the ruins. Use phrases like \"The air was thick with history, each breath a reminder of the lives that once thrived here.\"\n  - Use dialogue to convey character dynamics and thematic elements. Have characters engage in discussions about the implications of the modern symbol, using their conversations to explore themes of history, identity, and progress.\n  - Utilize internal monologue to build tension and convey the protagonist's emotional state. For example, \"As I stood before the symbol, a chill ran down my spine. It was as if the past and present were colliding, and I was caught in the middle.\"\n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the prompt \"Fingerguns are real,\" I will analyze the Author Writing Sheet to identify key storytelling elements that can be adapted to this prompt. The author’s style emphasizes internal conflict, emotional experiences, and personal revelations, often with a supernatural or speculative twist. The narrative often revolves around a central revelation or mystery, with a focus on introspection and character development through emotional responses and internal monologues. The author uses vivid sensory language and dialogue to convey character dynamics and thematic elements.\n\nFor the prompt, I will create Story Rules that incorporate these elements, focusing on the protagonist's internal journey and the emotional and psychological implications of fingerguns being real. The narrative will explore the protagonist's identity and personal transformation, using vivid language and introspective monologues to convey the emotional depth and complexity of the situation. The setting will reflect the protagonist's internal struggle, and the plot will revolve around a central revelation or mystery related to the newfound reality of fingerguns.\n\nI will ensure the Story Rules are actionable, detailed, and aligned with both the Writing Prompt and the Author Writing Sheet, providing concrete examples and stylistic nuances to guide the language model effectively.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative around the protagonist's internal conflict and introspective journey as they grapple with the reality of fingerguns being real. For example, depict a scene where the protagonist accidentally uses a fingergun in a moment of stress, leading to an emotional breakdown as they realize the power they wield.\n  - Develop the plot around a central revelation that challenges the protagonist's identity. Introduce a moment where the protagonist discovers that their ability to use fingerguns is linked to a hidden aspect of their past, such as a family secret or a suppressed memory.\n  - Incorporate a mystery that is resolved through a tangible explanation. For instance, the protagonist might investigate why fingerguns have become real, uncovering a scientific experiment or a supernatural event that explains the phenomenon.\n\n- **Creativity**:\n  - Explore the emotional complexities of having a supernatural ability like fingerguns, focusing on the protagonist's internal experience rather than external phenomena. Describe how the protagonist feels a surge of power and fear simultaneously when they realize the implications of their ability.\n  - Integrate a personal and domestic setting to explore the theme of transformation. Use the protagonist's home environment, such as their bedroom or kitchen, to reflect their emotional state and the changes they undergo as they come to terms with their new reality.\n  - Incorporate an unconventional twist by suggesting a scientific or supernatural explanation for the existence of fingerguns. For example, introduce a subplot where the protagonist learns about a secret government project or a magical artifact that has altered reality.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist's character through internal conflict, introspection, and self-awareness. Use internal monologues to convey their emotional turmoil and the impact of their newfound ability on their sense of self.\n  - Develop characters through their emotional responses to the revelation of fingerguns being real. Show how different characters react, such as a friend who is excited and wants to experiment, or a family member who is fearful and urges caution.\n  - Develop the setting as a reflection of the protagonist's internal struggle. Describe how familiar places, like their workplace or a local park, take on new significance as the protagonist navigates their changed reality.\n\n- **Language Use**:\n  - Use vivid sensory language to convey the protagonist's emotional state and the depth of their connection to the phenomenon of fingerguns. For example, describe the tingling sensation in their fingers and the adrenaline rush they feel when they use their ability.\n  - Employ dialogue to convey character dynamics and thematic elements. Use conversations between the protagonist and others to explore themes of power, responsibility, and fear.\n  - Use internal monologue to build tension and convey the protagonist's emotional state. For instance, have the protagonist reflect on the potential consequences of their actions and the moral dilemmas they face.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet to identify key storytelling elements that can be adapted to the theme of immortality and the eventual contraction of a life-limiting disease. The author's style emphasizes internal conflict, emotional introspection, and personal revelations, which can be effectively woven into a narrative exploring the existential implications of immortality and mortality. The creativity section highlights the use of supernatural bonds, personal settings, and scientific explanations, which can be adapted to explore the theme of immortality as a natural state altered by disease. Character development focuses on introspection and emotional responses, which will be crucial in portraying the protagonist's journey from immortality to mortality. Language use emphasizes vivid sensory details and internal monologue, which will help convey the protagonist's emotional and psychological state. These elements will be tailored to the Writing Prompt to create a cohesive and immersive narrative.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative around the protagonist's internal conflict and introspective journey as they grapple with the realization of their mortality. Begin with the protagonist's initial understanding of their immortal nature, followed by the revelation of the disease that limits their lifespan. For example, depict a scene where the protagonist reflects on their childhood memories of feeling invincible, only to be confronted with the harsh reality of their condition during a routine medical check-up.\n  - Develop the plot around a central revelation that challenges the protagonist's identity as an immortal being. Introduce a pivotal moment where the protagonist learns about the disease, perhaps through a conversation with a doctor or a historical document that reveals the origins of the disease. This revelation should lead to a deep existential crisis, forcing the protagonist to reevaluate their understanding of life and death.\n  - Incorporate a mystery that is resolved through a tangible explanation, such as the discovery of the disease's origin or a potential cure. Use a subplot involving a secret organization researching immortality, where the protagonist uncovers hidden truths about their condition, leading to a resolution that provides closure or a new perspective on their mortality.\n\n- **Creativity**:\n  - Explore the emotional complexities of the protagonist's transition from immortality to mortality, focusing on their internal experience rather than external phenomena. Use introspective moments where the protagonist contemplates the implications of their newfound mortality, such as the fear of aging or the loss of loved ones.\n  - Integrate a personal and domestic setting to explore the theme of transformation. Use the protagonist's home environment, such as a family gathering or a solitary moment in their bedroom, to highlight the emotional and physical changes they experience as they come to terms with their mortality.\n  - Incorporate an unconventional twist by suggesting a scientific explanation for the disease that limits immortality. Introduce a subplot involving a scientific experiment or a historical event that led to the spread of the disease, adding depth and intrigue to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist's character through internal conflict, introspection, and self-awareness. Use internal monologue and reflective moments to convey their emotional journey from immortality to mortality, highlighting their fears, hopes, and acceptance of their condition.\n  - Develop characters through their emotional responses to the revelation of their mortality. Show how the protagonist and those around them react to the news, using dialogue and interactions to reveal their personalities and relationships. For example, depict a scene where the protagonist's family members express disbelief and concern, leading to a heartfelt conversation about life and legacy.\n  - Develop the setting as a reflection of the protagonist's internal struggle with their mortality. Use vivid descriptions of the protagonist's surroundings, such as a bustling city or a serene countryside, to mirror their emotional state and the broader implications of their condition.\n\n- **Language Use**:\n  - Use vivid sensory language to convey the protagonist's emotional state and the depth of their connection to life and mortality. Employ descriptive phrases that evoke the protagonist's physical and emotional experiences, such as the sensation of time slipping away or the warmth of a loved one's touch.\n  - Employ internal monologue to convey the protagonist's emotional state and build tension. Use introspective thoughts to reveal their fears, hopes, and acceptance of their mortality, creating a rich and immersive narrative.\n  - Use dialogue to highlight the protagonist's internal struggle and the thematic elements of immortality and mortality. Craft conversations that reveal the characters' perspectives and the broader implications of their condition, such as a discussion about the meaning of life or the legacy they wish to leave behind.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the given Writing Prompt and the Author Writing Sheet, I will analyze the author's unique storytelling style across the categories of Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a post-quest scenario where a hero refuses a queen's marriage proposal, citing a disparity in their perceived worth. This scenario offers rich potential for exploring themes of self-worth, identity, and societal roles, which align well with the author's style of introspective and emotionally driven narratives. I will craft Story Rules that incorporate the author's techniques, such as focusing on internal conflict, using vivid sensory language, and integrating creative twists, while ensuring these elements are tailored to the narrative of the hero and the queen.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative around the hero's internal conflict and introspective journey, focusing on their emotional response to the queen's proposal. For example, depict the hero's internal monologue as they grapple with feelings of inadequacy and self-doubt, reflecting on past experiences that shaped their self-image.\n  - Develop the plot around a central revelation that challenges the hero's identity. Use the queen's proposal as a catalyst for the hero to confront their self-perception and societal expectations, leading to a moment of self-realization.\n  - Incorporate a mystery resolved through a tangible explanation, such as the hero discovering a hidden truth about their lineage or past that influences their decision to refuse the proposal.\n\n- **Creativity**:\n  - Creatively explore the emotional complexities of the hero's decision, focusing on their internal experience rather than external events. Use metaphors and introspective dialogue to convey the hero's turmoil and eventual clarity.\n  - Integrate a personal and domestic setting to explore themes of transformation. For instance, depict the hero in their humble abode, reflecting on their journey and the contrast between their simple life and the grandeur of the queen's world.\n  - Introduce an unconventional twist by suggesting a scientific or magical explanation for the hero's perceived inadequacy, such as a curse or enchantment that affects their self-image.\n\n- **Development (Character and Setting)**:\n  - Develop the hero's character through internal conflict, introspection, and self-awareness. Highlight their journey from self-doubt to self-acceptance, using flashbacks or internal monologues to reveal their past struggles and triumphs.\n  - Develop the queen's character through her emotional response to the hero's refusal. Show her grace and understanding, perhaps revealing her own insecurities or past experiences that make her empathize with the hero.\n  - Use the setting as a reflection of the hero's internal struggle. Describe the contrast between the opulent royal court and the hero's modest surroundings, using sensory details to evoke the disparity and tension.\n\n- **Language Use**:\n  - Employ vivid sensory language to convey the hero's emotional state and the depth of their connection to the queen. Use phrases that evoke the hero's awe and admiration for the queen, as well as their own feelings of inadequacy.\n  - Use dialogue to convey character dynamics and thematic elements. Craft exchanges between the hero and the queen that reveal their mutual respect and the underlying tension of the proposal.\n  - Utilize internal monologue to build tension and convey the hero's emotional journey. Allow the hero's thoughts to reveal their fears and hopes, culminating in a moment of clarity and decision.\n  - Employ a tone of resignation mixed with subtle defiance to reflect the hero's perspective. Use language that captures their humility and determination to remain true to themselves despite societal pressures.\n</story_rules>"
]