[
    "<thinking>  \nTo generate Story Rules that align with the given Writing Prompt and the Author Writing Sheet, I will analyze each category to extract the author's unique storytelling style and apply it to the narrative context of surviving an encounter with mimics. The prompt suggests a scenario involving tension, survival, and possibly betrayal or revelation, which can be enriched by the author's style of blending personal relationships with broader themes, using humor, and developing characters through dialogue and introspection.\n\n### Plot\nThe author often intertwines personal relationships with broader societal issues and uses humor and absurdity in interactions. For this prompt, the plot should focus on the dynamics between the protagonist and their \"friends\" after surviving the mimics, possibly revealing deeper societal or personal themes. The narrative should include humorous or absurd elements, such as the protagonist's internal commentary on the situation or the absurdity of the mimics' behavior.\n\n### Creativity\nThe author blends genres and uses dark humor and existential themes. The story should creatively explore the nature of the mimics and the protagonist's relationship with their \"friends,\" possibly introducing a speculative or science fiction element, such as the mimics representing a societal issue or existential threat.\n\n### Development (Character and Setting)\nCharacters are developed through interactions, introspection, and witty dialogue. The protagonist's decision to stop following their friends should reveal their internal conflict or moral struggle. The setting should be vivid and contribute to the tension, possibly reflecting the broader themes of safety and trust.\n\n### Language Use\nThe author uses a conversational, irreverent tone with vivid language and a first-person perspective. The narrative should include the protagonist's reflective commentary and humorous observations, using vivid descriptions to convey the tension and emotions of the encounter with the mimics.\n\n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the plot around the protagonist's relationship with their \"friends\" and the broader implications of their survival. Use the moment of stopping as a turning point to reveal deeper themes, such as trust or betrayal. For example, the protagonist might internally question the true nature of their \"friends\" and whether they are safer alone or together.\n  - Incorporate humorous and absurd interactions, such as the protagonist's sarcastic thoughts about the mimics' ridiculous attempts to blend in or the absurdity of the situation. For instance, the protagonist might think, \"Of course, the one time I trust someone, they turn out to be a mimic in disguise.\"\n\n- **Creativity**:\n  - Blend genres by introducing a speculative element, such as the mimics being a metaphor for societal issues like conformity or deception. Use dark humor to explore these themes, perhaps through the protagonist's cynical reflections on the nature of safety and trust.\n  - Integrate existential themes by having the protagonist ponder the futility of running from the mimics, questioning whether true safety is ever possible. For example, \"Safe? From what? The mimics or the lies we tell ourselves?\"\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through their decision to stop following their friends, highlighting their internal conflict and moral struggle. Use introspection to reveal their doubts and fears, such as, \"Why do I feel safer with the mimics than with them?\"\n  - Use witty and irreverent dialogue to highlight the complex relationships between the characters. For example, a friend might say, \"Come on, it's not like we're the mimics,\" to which the protagonist could reply, \"That's exactly what a mimic would say.\"\n  - Create a vivid setting that reflects the tension and themes of safety and trust. Describe the environment in detail, such as the eerie silence beyond the safe point or the unsettling mimic-infested area they left behind.\n\n- **Language Use**:\n  - Employ a conversational and irreverent tone, using informal language and humor to engage the reader. Include the protagonist's reflective commentary on the situation, such as, \"I stopped because I realized the real danger wasn't the mimics, but the company I keep.\"\n  - Use vivid language to convey the protagonist's experiences and emotions, enhancing the narrative's impact. Describe the physical sensations and emotional tension, like \"the cold sweat trickling down my back as I watched them disappear into the shadows.\"\n  - Write in the first-person perspective to create an intimate and immersive experience, allowing readers to directly experience the protagonist's thoughts and emotions. For example, \"I could feel my heart pounding in my chest, each beat a reminder of the choice I had to make.\"\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a humorous and absurd situation where the protagonist must cancel a necromancer service after multiple resurrections. This aligns well with the author's style of blending humor with existential themes and focusing on personal relationships intertwined with broader societal issues. The author’s use of conversational and irreverent tones, along with vivid language, will be crucial in crafting the narrative. The character development should focus on interactions and internal conflict, while the setting should be rich in world-building elements.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the plot around the protagonist's personal journey to cancel the necromancer service, intertwining it with broader societal commentary on the absurdity of modern conveniences. Begin with the protagonist's realization of the inconvenience and absurdity of repeated resurrections, leading to a humorous confrontation with the necromancer service's customer support. For example, depict a scene where the protagonist argues with a disinterested necromancer about the \"no-refund policy\" on resurrections.\n  - Incorporate a series of humorous and absurd interactions, such as the protagonist's frustration with the necromancer's bureaucratic procedures and the surreal experience of being resurrected in increasingly inconvenient situations, like waking up in a different time zone or in the middle of a family dinner.\n  - Emphasize the protagonist's disdain for their repeated resurrections and the trivialization of their life, using this as a driving force for their determination to cancel the service. Illustrate this with a scene where the protagonist sarcastically comments on being resurrected \"just to be late for their own funeral.\"\n\n- **Creativity**:\n  - Blend genres by integrating elements of dark humor and existential themes into the fantasy setting of necromancy. Use the protagonist's internal monologue to reflect on the absurdity of their situation, such as pondering the existential implications of being resurrected for the fifth time.\n  - Infuse the narrative with dark humor, presenting the protagonist's repeated deaths and resurrections as a running gag. For instance, have the protagonist joke about their \"frequent flyer miles\" with the necromancer service or their \"death count\" being higher than their credit score.\n  - Explore speculative ideas by introducing unconventional necromancy practices, such as a subscription model for resurrection services, and the societal implications of such services being as common as a gym membership.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through their interactions with the necromancer service and their internal conflict about the value of life and death. Highlight their moral and emotional struggles as they navigate the absurdity of their situation.\n  - Use witty and irreverent dialogue to highlight the protagonist's complex relationships with the necromancer service representatives, showcasing their frustration and sarcasm. For example, include a dialogue where the protagonist quips, \"Do I get a loyalty card for every resurrection, or is that just for the undead VIPs?\"\n  - Create a rich setting by focusing on the world-building of the necromancer service, detailing its operations and the societal norms around resurrection. Describe the service's headquarters as a blend of a corporate office and a mystical lair, filled with arcane artifacts and mundane office supplies.\n\n- **Language Use**:\n  - Employ a conversational and irreverent tone, using informal language and humor to engage the reader. Use phrases like, \"After the fifth time, dying just feels like a bad habit I can't kick,\" to convey the protagonist's irreverent attitude.\n  - Use vivid language to convey the protagonist's experiences and emotions, enhancing the narrative's impact. Describe the sensation of resurrection with phrases like, \"The jolt of life felt like a caffeine overdose mixed with a lightning strike.\"\n  - Utilize a first-person narrative to create an intimate and immersive experience, allowing readers to experience the protagonist's thoughts and emotions directly. This perspective will enhance the sense of immediacy and personal involvement in the narrative.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a humorous and absurd situation where the protagonist must cancel a necromancer service after multiple resurrections. This scenario aligns well with the author's style of blending humor with existential themes and focusing on personal relationships intertwined with broader societal issues. The author's use of conversational and irreverent tones, along with vivid language, will be crucial in crafting the narrative. I will ensure the Story Rules reflect these elements while tailoring them to the prompt's themes of frustration with repeated resurrection and the absurdity of dealing with a necromancer service.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the plot around the protagonist's personal frustration with their repeated resurrections and the absurdity of dealing with a necromancer service. Begin with the protagonist's realization of the need to cancel the service after their fifth death, highlighting their growing annoyance. For example, depict a scene where the protagonist wakes up in a coffin, again, and mutters, \"Not this again,\" as they claw their way out, only to find a bill from the necromancer service waiting for them.  \n  - Integrate humorous and absurd interactions with the necromancer service. Create a scene where the protagonist attempts to cancel their subscription, only to be met with a customer service representative who insists on upselling them to a \"premium resurrection package,\" complete with a loyalty program.  \n  - Emphasize the trivialization of the protagonist's legacy through their repeated resurrections. Illustrate this by having the protagonist receive a \"Resurrectee of the Month\" award, complete with a tacky trophy, which they disdainfully toss aside.  \n\n- **Creativity**:  \n  - Blend dark humor with existential themes, presenting the protagonist's situation as both absurd and reflective of deeper societal issues. For instance, have the protagonist reflect on the commercialization of life and death, thinking, \"When did dying become a subscription service?\"  \n  - Introduce speculative elements by exploring the arcane web as a bizarre and surreal marketplace. Describe the protagonist navigating through a virtual bazaar filled with pop-up ads for \"soul insurance\" and \"afterlife travel packages,\" adding a layer of social commentary on consumerism.  \n  - Incorporate a psychological horror element by blurring the lines between reality and the protagonist's dreamscape. Create a scene where the protagonist dreams of being trapped in an endless cycle of deaths, each more ridiculous than the last, only to wake up and question if they are still dreaming.  \n\n- **Development (Character and Setting)**:  \n  - Develop the protagonist through their interactions with the necromancer service and their internal conflict about their repeated resurrections. Highlight their moral and emotional struggles, such as feeling trapped in a cycle they cannot escape.  \n  - Use witty and irreverent dialogue to highlight the protagonist's frustration and complex relationships. For example, have the protagonist sarcastically quip to the necromancer, \"Do I get a discount for frequent flyer miles to the afterlife?\"  \n  - Create a multidimensional protagonist through sarcastic and mocking dialogue, revealing their desire for peace and normalcy. Illustrate this by having them express a longing for a \"permanent rest\" in a moment of introspection.  \n\n- **Language Use**:  \n  - Employ a conversational and irreverent tone, using informal language and humor to engage the reader. Use phrases like, \"Seriously, who knew dying could be such a hassle?\" to convey the protagonist's exasperation.  \n  - Use vivid language to convey the protagonist's experiences and emotions, enhancing the narrative's impact. Describe the sensation of waking up in a coffin with \"the stale air and the claustrophobic darkness pressing in,\" to create a visceral experience.  \n  - Utilize a first-person narrative to create an intimate and immersive experience. Allow the protagonist's thoughts and emotions to be directly experienced by the reader, enhancing the sense of immediacy and personal involvement in the narrative.  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the given Writing Prompt and the Author Writing Sheet, I will focus on the author's unique storytelling style across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a humorous and absurd situation where a demon-possessed manager is more tolerable than the original manager, which aligns well with the author's style of blending humor with societal commentary and character interactions. I will incorporate the author's techniques of using humor, societal issues, and character dynamics to create a narrative that is both engaging and reflective of the author's style. The rules will be structured to guide the language model in crafting a story that is rich in character interactions, humor, and vivid language, while also exploring the broader implications of the situation.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the plot around the humorous and absurd interactions between the employees and the demon-possessed manager. Begin with a scene where the employees are initially shocked by the possession but quickly realize the demon's management style is preferable. Use comedic elements to highlight the absurdity, such as the demon's unexpected efficiency or bizarre motivational speeches.  \n  - Integrate a subplot that explores the broader societal implications of a demon being a better manager than a human, perhaps through a satirical commentary on corporate culture or management practices. For example, include a scene where the demon implements a new policy that drastically improves productivity, leading to a humorous reflection on human management flaws.  \n  - Emphasize the protagonist's growing disdain for the trivialization of their work environment, using the demon's presence as a catalyst for this realization. For instance, the protagonist might sarcastically comment on how their career has become a \"hellish\" parody of itself, yet somehow more tolerable.  \n\n- **Creativity**:  \n  - Blend elements of dark humor with existential themes, presenting the demon's possession as a metaphor for the dehumanizing aspects of corporate life. Use the demon's otherworldly perspective to offer unconventional takes on office dynamics, such as a scene where the demon critiques human inefficiencies with a mix of humor and cynicism.  \n  - Introduce a psychological horror element by occasionally blurring the lines between reality and the surreal, such as a dream sequence where the protagonist envisions the office as a literal hellscape, only to wake up and find the demon making coffee in the break room.  \n  - Explore speculative ideas about the nature of possession and its impact on workplace dynamics, perhaps suggesting that the demon's presence has altered the office's energy in a way that defies conventional understanding.  \n\n- **Development (Character and Setting)**:  \n  - Develop characters through their interactions with the demon, focusing on how these interactions reveal their personalities and coping mechanisms. For example, a character might bond with the demon over shared interests, highlighting their adaptability and open-mindedness.  \n  - Use introspection and internal conflict to develop the protagonist, who grapples with the moral and emotional implications of preferring a demon as a manager. Include moments of self-reflection where the protagonist questions their own values and the nature of their work.  \n  - Employ witty and irreverent dialogue to highlight complex relationships and exaggerated personalities. For instance, include a banter-filled exchange between the protagonist and a coworker about the demon's latest management decision, showcasing their dynamic and the absurdity of the situation.  \n\n- **Language Use**:  \n  - Use a conversational and reflective tone, incorporating direct commentary on the narrative itself. For example, include a passage where the protagonist reflects on the irony of their situation, such as, \"Who knew a demon would be the one to finally bring some sanity to this place?\"  \n  - Employ vivid language to convey the protagonist's experiences and emotions, enhancing the narrative's impact. Describe the demon's presence with phrases that evoke both humor and a sense of the uncanny, such as \"the sulfurous scent of competence\" or \"a hellish grin that somehow felt reassuring.\"  \n  - Use a first-person narrative to create an intimate and immersive experience, allowing readers to experience the protagonist's thoughts and emotions directly. This perspective will enhance the sense of immediacy and personal involvement in the narrative.  \n  - Maintain a reflective and evaluative tone throughout the narrative, encouraging readers to consider the broader implications of the story's events. For instance, include a reflective passage where the protagonist muses on the nature of leadership and the unexpected lessons learned from a demonic manager.  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's unique style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a character who unexpectedly arrives in hell as a millionaire due to the souls they have accumulated, despite living a seemingly normal life. This scenario offers rich potential for exploring themes of morality, identity, and the afterlife, which can be woven into the author's style of blending personal narratives with broader societal issues, using humor, and developing characters through dialogue and introspection.\n\n**Plot**: The author often intertwines personal relationships with societal issues and uses humor and absurdity in plot development. For this prompt, the plot could explore the protagonist's interactions in hell, revealing societal structures and personal dilemmas through comedic and absurd situations.\n\n**Creativity**: The author blends genres and uses dark humor and existential themes. The story could creatively explore the concept of souls as currency, using humor to address the absurdity of the protagonist's situation and the moral implications of their newfound wealth.\n\n**Development (Character and Setting)**: Characters are developed through interactions, introspection, and witty dialogue. The protagonist's character can be fleshed out through their reactions to hell's society and their internal conflict about their unexpected wealth.\n\n**Language Use**: The author uses a conversational tone, vivid language, and first-person narrative. The story should employ these techniques to create an immersive and engaging narrative, using humor and reflection to explore the protagonist's thoughts and emotions.\n\nWith these insights, I will craft detailed Story Rules that guide the language model in creating a story that aligns with both the Writing Prompt and the author's style.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the plot around the protagonist's arrival in hell and their interactions with its inhabitants, using these interactions to reveal both personal dilemmas and broader societal issues. For example, depict a scene where the protagonist is confused about their millionaire status and engages in a humorous exchange with a demon banker who explains the soul currency system.\n  - Incorporate a series of absurd and comedic interactions that highlight the protagonist's disbelief and frustration with their situation. For instance, include a scene where the protagonist tries to return their \"wealth\" only to be met with bureaucratic absurdities and nonchalant demons.\n  - Emphasize the protagonist's internal conflict and disdain for their unexpected wealth, paralleling their legendary status with mundane uses in hell, such as being offered luxury accommodations that trivialize their moral standing.\n\n- **Creativity**:\n  - Blend elements of dark humor and existential themes by exploring the absurdity of souls as currency. Create a subplot where the protagonist questions the moral implications of their wealth, perhaps through a satirical conversation with a fellow \"millionaire\" who boasts about their \"achievements.\"\n  - Integrate speculative ideas about the afterlife and morality, such as a scene where the protagonist encounters a \"soul market\" that operates like a stock exchange, complete with traders and fluctuating soul values.\n  - Use psychological horror elements by blurring the lines between the protagonist's expectations of hell and the surreal reality they encounter, such as a dreamlike sequence where they relive moments from their life that contributed to their soul count.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through their interactions with hell's inhabitants and the consequences of their decisions. For example, show how their attempts to understand or change their situation lead to unexpected alliances or conflicts with other souls.\n  - Highlight the protagonist's introspection and internal conflict about their moral standing and the nature of their wealth. Use reflective moments where they ponder their past actions and the irony of their situation.\n  - Use witty and irreverent dialogue to develop complex relationships and exaggerated personalities. Include exchanges where the protagonist's sarcasm and frustration are met with the indifferent or bemused responses of hell's denizens.\n\n- **Language Use**:\n  - Employ a conversational and reflective tone, incorporating direct commentary on the narrative. Use first-person narrative to create an intimate and immersive experience, allowing readers to engage directly with the protagonist's thoughts and emotions.\n  - Use vivid and eloquent language to convey the protagonist's experiences and emotions, enhancing the narrative's impact. For example, describe the protagonist's first impression of hell with phrases like \"the oppressive heat felt like a mocking embrace\" or \"the cacophony of wailing souls was both a symphony and a sentence.\"\n  - Incorporate humor and irreverence in the protagonist's internal monologue and dialogue, using informal language to engage the reader. For instance, have the protagonist quip about their situation with lines like, \"Millionaire in hell? Guess I finally made it big in the afterlife's twisted lottery.\"\n</story_rules>"
]