[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a protagonist dealing with a distorted perception of time, which suggests themes of suspense, survival, and possibly a supernatural or psychological twist. The author's style includes a focus on moral ambiguity, suspense, and survival, which can be integrated into the narrative. The author also uses dark, atmospheric settings and vivid, sensory language, which can enhance the eerie and unsettling nature of the prompt. The character development often involves inner conflict and roles within a larger system, which can be adapted to the protagonist's struggle with time. Finally, the author's use of formal dialogue and vivid imagery can be employed to create tension and emotional depth.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative around the protagonist's central act of confronting the distorted perception of time, which leads to a transformation or revelation. For example, the protagonist might discover that their watch, a symbolic object, is stuck at a specific time, representing their internal struggle with reality.\n  - Emphasize a personal journey of survival and acceptance as the protagonist grapples with the implications of time being incorrect. They might initially panic, fearing danger, but gradually come to terms with the situation, reflecting on what it means for their life and choices.\n  - Build suspense by focusing on the protagonist's immediate need to understand and survive the time distortion. Delay any resolution or romantic elements until the protagonist has faced the core conflict, such as realizing that time itself is a construct they can manipulate or transcend.\n  - Highlight the tension between authority and rebellion by introducing a figure or system that enforces the importance of timekeeping, which the protagonist must defy to find their truth.\n\n- **Creativity**:\n  - Use a dark, atmospheric setting to enhance the mystical and unsettling nature of the narrative. Describe the protagonist's environment with elements like flickering streetlights or clocks that tick erratically, creating a sense of unease.\n  - Integrate telepathic or supernatural communication to convey critical plot developments, such as the protagonist receiving cryptic messages or visions that hint at the true nature of time.\n  - Employ symbolic objects, like a broken clock or a watch with a missing hand, to represent the choices and paths available to the protagonist as they navigate their distorted reality.\n  - Incorporate elements of horror and moral ambiguity by exploring the psychological impact of the time distortion on the protagonist, such as questioning their sanity or the morality of their actions in a world where time is fluid.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through detailed physical descriptions and subtle emotional cues, highlighting their motivations and inner conflicts. For instance, describe their anxious glances at their watch and the growing tension in their posture as they struggle to make sense of their situation.\n  - Create a setting that mirrors the protagonist's internal conflict, such as a cityscape where time seems to stand still, with people moving in slow motion or shadows lengthening unnaturally.\n  - Use dialogue to reveal the protagonist's motivations and ideologies, such as conversations with a mentor or friend who emphasizes the importance of time, contrasting with the protagonist's growing skepticism.\n  - Establish a somber and oppressive setting that reflects the story's themes, like a dimly lit room filled with ticking clocks, each showing a different time, underscoring the protagonist's disorientation and the oppressive nature of their predicament.\n\n- **Language Use**:\n  - Use vivid, sensory language to create an immersive and emotionally charged narrative. Describe the protagonist's surroundings with phrases like \"the air felt thick with the weight of uncounted seconds\" or \"the relentless ticking echoed in their mind, a constant reminder of time's betrayal.\"\n  - Employ descriptive language to convey the protagonist's emotional journey, using phrases like \"their heart raced with each tick that defied logic\" or \"a chill ran down their spine as the hands of the clock spun wildly.\"\n  - Use formal and confrontational dialogue to convey tension and authority, such as a conversation with a timekeeper who insists on the importance of maintaining order, challenging the protagonist's growing defiance.\n  - Enhance the emotional impact of the narrative with vivid imagery, like \"the clock face cracked, its hands frozen in a silent scream,\" to evoke the protagonist's fear and tension as they confront the distorted reality of time.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, \"You are an immortal on a mission to help everyone else become immortal,\" I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The goal is to create rules that reflect the author's unique style while aligning with the themes of immortality and transformation inherent in the prompt.\n\n### Plot\nThe author's plots often revolve around a central act or decision that defines the protagonist's transformation and moral ambiguity. For this prompt, the immortal protagonist's mission to grant immortality can serve as the central act, with moral ambiguity arising from the implications of immortality. The narrative should also incorporate elements of suspense and survival, delaying any romantic or secondary plotlines, and emphasize the inevitability of fate and the tension between authority and rebellion, as the protagonist may face opposition from those who control the current order of life and death.\n\n### Creativity\nThe author employs dark, atmospheric settings and integrates supernatural elements to enhance the narrative's mystical and morally ambiguous nature. For this prompt, the setting could be a world on the brink of transformation, with the protagonist using telepathic communication to convey the potential and risks of immortality. Symbolic objects, such as an elixir or artifact representing immortality, can be used to illustrate the choices available to those the protagonist encounters.\n\n### Development (Character and Setting)\nCharacters are developed through detailed physical descriptions and subtle emotional cues, revealing their motivations and inner conflicts. The immortal protagonist should be portrayed with a nuanced understanding of the burden and allure of immortality. The setting should reflect the protagonist's internal conflict, perhaps a world that mirrors the tension between life and eternal life, with elements that enhance the story's suspense and moral complexity.\n\n### Language Use\nThe author uses vivid, sensory language to create an immersive narrative. For this prompt, descriptive language should evoke the awe and fear associated with immortality, using formal and confrontational dialogue to convey the tension between the protagonist and those who resist the idea of eternal life. Vivid imagery should enhance the emotional impact, illustrating the protagonist's journey and the transformative potential of their mission.\n\nWith these insights, I will craft detailed Story Rules that guide the language model in emulating the author's style while aligning with the Writing Prompt.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative around the immortal protagonist's central mission to grant immortality, focusing on a pivotal act or decision that reveals the moral ambiguity of eternal life. For example, the protagonist might offer immortality to a dying leader, sparking a debate on the ethics of eternal life.\n  - Emphasize suspense and survival by introducing challenges and opposition from those who fear or oppose immortality. Delay any romantic or secondary plotlines until the primary mission is well-established.\n  - Highlight the inevitability of fate and the tension between authority and rebellion. The protagonist may confront a powerful council that controls the cycle of life and death, leading to a dramatic showdown that questions the natural order.\n\n- **Creativity**:\n  - Employ a dark, atmospheric setting that enhances the mystical and morally ambiguous nature of the narrative. The world could be depicted as a place where shadows and light play tricks, symbolizing the dual nature of immortality.\n  - Integrate telepathic communication to convey critical plot developments, such as the protagonist sharing visions of an immortal future with those they encounter.\n  - Use symbolic objects to represent the choices available to characters, such as a vial of glowing liquid that offers immortality, but at an unknown cost.\n\n- **Development (Character and Setting)**:\n  - Develop the immortal protagonist through detailed physical descriptions and subtle emotional cues, highlighting their wisdom and the burden of eternal life. Describe their eyes as \"ancient pools of knowledge\" and their demeanor as \"calm yet burdened.\"\n  - Create a setting that mirrors the protagonist's internal conflict, such as a city on the brink of transformation, where the architecture reflects both decay and renewal.\n  - Develop characters through dialogue that reveals their motivations and ideologies, such as a character who questions the value of immortality, saying, \"What is life without the fear of its end?\"\n\n- **Language Use**:\n  - Use vivid, sensory language to create an immersive and emotionally charged narrative. Describe the process of granting immortality with phrases like \"a surge of eternal light coursing through veins\" and \"the air shimmering with the weight of forever.\"\n  - Employ formal and confrontational dialogue to convey tension and authority, especially in interactions between the protagonist and those who resist immortality.\n  - Use vivid imagery to enhance the emotional impact, such as describing the moment of transformation as \"a cocoon of light enveloping the soul, unraveling the threads of mortality.\"\n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The goal is to create rules that reflect the author's unique style while aligning with the narrative potential of the Writing Prompt.\n\n### Plot\nThe author often structures narratives around a central act or decision, focusing on survival, suspense, and moral ambiguity. For the Writing Prompt, the plot should revolve around the knight's decision to protect the throne, emphasizing the tension between authority and rebellion. The narrative should build suspense as characters attempt to reach the throne, with the knight's actions reflecting moral complexity.\n\n### Creativity\nThe author integrates dark, atmospheric settings and elements of horror and moral ambiguity. For the lighthouse setting, the atmosphere should be mysterious and foreboding, with supernatural or horror elements enhancing the narrative. The knight's role can be creatively reinterpreted, perhaps as a guardian with a dark secret or a cursed protector.\n\n### Development (Character and Setting)\nCharacters are developed through detailed descriptions and dialogue that reveal motivations and inner conflicts. The knight should be portrayed with a rich backstory and complex motivations, perhaps tied to the kingdom's ruin. The lighthouse setting should reflect the knight's internal struggle, with elements that enhance the story's tension and atmosphere.\n\n### Language Use\nThe author uses vivid, sensory language to create immersive narratives. Descriptions of the lighthouse and the knight should be rich in detail, evoking a sense of mystery and tension. Dialogue should convey authority and conflict, reflecting the power dynamics between the knight and those who seek the throne.\n\nWith these insights, I will craft Story Rules that guide the language model in creating a narrative that aligns with both the author's style and the Writing Prompt.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative around the knight's central decision to protect the throne, emphasizing their moral ambiguity and the tension between authority and rebellion. For example, depict a scene where the knight faces a former ally who seeks the throne, forcing them to choose between loyalty and duty.\n  - Build suspense by focusing on the survival of those attempting to reach the throne. Introduce a character who must navigate the lighthouse's dangers, with the knight's presence looming as an ever-present threat.\n  - Emphasize the inevitability of fate by portraying the kingdom's ruin as a backdrop to the knight's actions. The narrative should reflect the futility of rebellion against the knight's unwavering resolve.\n\n- **Creativity**:\n  - Create a dark, atmospheric setting for the lighthouse, using elements like flickering lights and echoing winds to enhance the mystical and foreboding nature of the narrative.\n  - Integrate supernatural or horror elements, such as the lighthouse being haunted by the spirits of past rulers, adding layers of complexity to the knight's role as a guardian.\n  - Use symbolic objects, like a rusted sword or a tarnished crown, to represent the choices and burdens the knight faces in their duty to protect the throne.\n\n- **Development (Character and Setting)**:\n  - Develop the knight's character through detailed physical descriptions and subtle emotional cues. Describe the knight's armor as \"battered and worn, yet still gleaming with a stubborn defiance,\" and reveal their inner conflict through interactions with those who challenge their authority.\n  - Use dialogue to reveal the knight's motivations and ideologies. For instance, have the knight declare, \"The throne is not just a seat of power; it is a burden I must bear alone,\" highlighting their sense of duty and isolation.\n  - Develop the lighthouse setting as a reflective space that mirrors the knight's internal conflict. Describe it as \"a towering sentinel against the encroaching darkness, its walls echoing with the whispers of the past.\"\n\n- **Language Use**:\n  - Employ vivid, sensory language to create an immersive and emotionally charged narrative. Describe the lighthouse as \"standing tall against the stormy sea, its light cutting through the gloom like a beacon of hope and despair.\"\n  - Use formal and confrontational dialogue to convey tension and authority. For example, have the knight confront an intruder with, \"You dare challenge the guardian of the throne? Your courage is commendable, but your fate is sealed.\"\n  - Enhance the emotional impact of the narrative with vivid imagery. Describe the knight's solitary vigil as \"a lonely watch, where time drips like water from the crumbling stones, each moment a reminder of duty unfulfilled.\"\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The prompt involves a mysterious and historical element, focusing on a family of grave keepers and a thousand-year-old conqueror. The narrative should explore themes of legacy, mystery, and possibly supernatural elements, reflecting the author's style of moral ambiguity, suspense, and atmospheric settings.\n\n**Plot**: The author often structures narratives around a central act or decision, emphasizing moral ambiguity and survival. For this prompt, the plot should revolve around the protagonist's decision to investigate the mysterious flower offerings, leading to a revelation about their family's connection to the conqueror. The narrative should build suspense and explore themes of fate and rebellion against historical narratives.\n\n**Creativity**: The author uses dark, atmospheric settings and integrates supernatural elements. The story should creatively reinterpret the prompt by incorporating a mystical or supernatural aspect to the flowers and the conqueror's legacy, perhaps suggesting a lingering presence or influence.\n\n**Development (Character and Setting)**: Characters are developed through detailed descriptions and emotional cues, while settings reflect internal conflicts. The protagonist should be portrayed with a deep connection to their family's legacy, and the graveyard setting should mirror their introspection and the eerie mystery surrounding the conqueror.\n\n**Language Use**: The author employs vivid, sensory language to create immersive narratives. The story should use descriptive language to evoke the graveyard's atmosphere and the protagonist's emotional journey, enhancing the mystery and tension.\n\nWith these insights, I will craft Story Rules that guide the narrative to align with the Writing Prompt while reflecting the author's unique style.  \n</thinking>  \n<story_rules>  \n- **Plot**:\n  - Structure the narrative around the protagonist's decision to investigate the mysterious flowers left at the conqueror's tomb. This decision should lead to a revelation about their family's historical connection to the conqueror, emphasizing moral ambiguity and the tension between legacy and personal identity.\n  - Build suspense by delaying the full revelation of the flowers' significance. Introduce elements of survival and acceptance as the protagonist uncovers unsettling truths about their ancestry and the conqueror's lingering influence.\n  - Incorporate a public spectacle or confrontation, such as a town gathering or historical reenactment, where the protagonist's discoveries challenge the accepted narrative of the conqueror's legacy.\n\n- **Creativity**:\n  - Use a dark, atmospheric setting to enhance the mystical and morally ambiguous nature of the narrative. Describe the graveyard with elements like mist-covered tombstones and ancient, gnarled trees, creating a somber and mysterious atmosphere.\n  - Integrate supernatural elements, such as the flowers being imbued with a mystical energy or the spirit of the conqueror communicating with the protagonist, adding a layer of intrigue and horror.\n  - Reinterpret the prompt by emphasizing the conqueror's threatening and enigmatic presence, perhaps suggesting that the flowers are a form of tribute or appeasement to prevent his return.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through detailed physical descriptions and subtle emotional cues, highlighting their internal conflict between familial duty and personal curiosity. Describe their attire as traditional grave keeper garb, with hints of wear and history.\n  - Develop the graveyard setting as a reflective space that mirrors the protagonist's internal conflict. Use descriptions of the environment, such as the quiet rustle of leaves and the distant call of a raven, to create an atmosphere conducive to introspection and discovery.\n  - Use dialogue to reveal the protagonist's motivations and ideologies, such as conversations with family members or townsfolk that expose differing views on the conqueror's legacy and the significance of the flowers.\n\n- **Language Use**:\n  - Employ vivid, sensory language to create an immersive and emotionally charged narrative. Describe the flowers with phrases like \"petals as red as freshly spilled blood\" and \"a scent that lingered like a forgotten memory,\" enhancing the reader's engagement with the mystery.\n  - Use descriptive language to convey the protagonist's emotional journey, illustrating their transition from skepticism to a deeper understanding of their family's history. Phrases like \"a chill ran down their spine\" and \"their heart pounded with a mix of fear and curiosity\" should be used to evoke tension and intrigue.\n  - Incorporate formal and confrontational dialogue to convey tension and authority, especially in interactions with figures of local authority or historical experts who challenge the protagonist's findings.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The prompt involves a powerful figure, the \"shadow emperor,\" who is provoked by a king's actions. This setup suggests themes of authority, rebellion, and personal vendetta, which align well with the author's style of exploring moral ambiguity, power dynamics, and suspenseful narratives.\n\n**Plot**: The author often structures narratives around a central act or decision that defines the protagonist's transformation, with a focus on suspense and survival. For this prompt, the plot should revolve around the shadow emperor's decision to confront the king, emphasizing the tension between authority and rebellion. The narrative should build suspense through the emperor's strategic maneuvers and the king's obliviousness to the impending threat.\n\n**Creativity**: The author integrates elements of horror, political intrigue, and supernatural themes. For this story, the shadow emperor's powers and influence should be depicted with a dark, atmospheric tone, possibly involving telepathic communication or symbolic objects that represent the emperor's control over the world.\n\n**Development (Character and Setting)**: Characters are developed through detailed descriptions and dialogue that reveal motivations and ideologies. The shadow emperor should be portrayed with a nuanced personality, reflecting both their immense power and the personal slight they feel. The setting should mirror the emperor's internal conflict and the oppressive atmosphere of their hidden empire.\n\n**Language Use**: The author uses vivid, sensory language to create an immersive narrative. The story should employ descriptive language to convey the emperor's emotional journey and the tension between them and the king. Dialogue should be formal and confrontational, reflecting the power dynamics and the emperor's authority.\n\nWith these insights, I will craft Story Rules that guide the narrative to align with the author's style and the Writing Prompt.  \n</thinking>  \n\n<story_rules>\n- **Plot**:\n  - Structure the narrative around the shadow emperor's decision to confront the king, focusing on the moral ambiguity of their actions. Begin with the emperor's realization of the king's transgression, leading to a strategic plan for retribution. For example, depict the emperor observing the king's court through magical means, noting the king's arrogance and the moment he crosses the line.\n  - Build suspense by delaying the confrontation, emphasizing the emperor's careful planning and the king's ignorance of the looming threat. Use scenes where the emperor's agents gather intelligence, creating a sense of impending doom.\n  - Highlight the tension between authority and rebellion by showcasing the emperor's internal conflict between maintaining their shadowy rule and the desire for direct vengeance. Conclude with a climactic encounter where the emperor reveals their true power, forcing the king to confront the consequences of his actions.\n\n- **Creativity**:\n  - Employ a dark, atmospheric setting to enhance the mystical and morally ambiguous nature of the narrative. Describe the emperor's hidden lair as a place of shadows and whispers, where their influence extends unseen across the world.\n  - Integrate telepathic communication to convey critical plot developments, such as the emperor issuing commands to their agents or receiving reports on the king's activities. For instance, describe the emperor's voice as a \"whisper in the wind,\" carrying their will across great distances.\n  - Use symbolic objects to represent the emperor's control, such as a globe with moving shadows that reflect the emperor's reach and influence over the world.\n\n- **Development (Character and Setting)**:\n  - Develop the shadow emperor through detailed physical descriptions and subtle emotional cues. Describe their appearance as regal yet enigmatic, with eyes that \"hold the weight of centuries\" and a demeanor that commands respect and fear.\n  - Use dialogue to reveal the emperor's motivations and ideologies, such as a conversation with a trusted advisor that highlights their belief in maintaining balance and order, even through ruthless means.\n  - Develop the setting as a reflective space that mirrors the emperor's internal conflict. Describe their lair as a place of both grandeur and isolation, filled with relics of past conquests and reminders of the emperor's solitary rule.\n\n- **Language Use**:\n  - Use vivid, sensory language to create an immersive and emotionally charged narrative. Describe the emperor's emotions with phrases like \"a storm brewing beneath a calm facade\" to convey their simmering anger and resolve.\n  - Employ formal and confrontational dialogue to convey tension and authority. For example, have the emperor address the king with lines like, \"You have overstepped your bounds, and now you must face the shadow you have awakened.\"\n  - Use descriptive language to create a vivid and unsettling atmosphere, such as describing the emperor's lair with \"shadows that dance like living things\" and \"a silence that speaks of untold power.\"\n</story_rules>"
]