[
    "<thinking>  \nAnalyze the Author Writing Sheet for all four categories in depth to infer patterns, unique traits, and key elements of the author’s storytelling style. Reflect on how these elements can be adapted to suit the Writing Prompt. Use this analysis to craft **Story Rules** enriched with tailored examples inspired by the Evidence, ensuring alignment with both the Writing Prompt and the Author Writing Sheet.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative to focus on the internal conflict of the protagonist, the parent who is perceived as a hoarder. Show their struggle with the public perception of their lifestyle versus the reality of their collection. For example, the parent might reflect on how their child sees them as a hoarder, while they see themselves as a preserver of history.\n  - Center the plot around a single pivotal encounter, such as the moment the Hoarders TV show team discovers the historical artifacts. This encounter should encapsulate the protagonist's emotional journey from shame to pride. For instance, the parent could have a moment of realization when an expert identifies a priceless artifact.\n  - Emphasize psychological horror and betrayal by exploring the parent's feelings of betrayal by their child and the fear of losing their cherished items. For example, the parent might feel a deep sense of betrayal when they realize their child called the show, fearing the loss of their collection.\n  - Create a continuous cycle of confrontation and misunderstanding between the parent and the Hoarders TV show team, leading to a climactic revelation. For instance, the parent could repeatedly try to explain the value of their items, only to be dismissed until the final discovery.\n  - Use a non-linear and episodic plot structure by incorporating flashbacks or fragmented memories of how the parent acquired each artifact, providing context and depth to the collection. For example, include brief scenes of the parent finding or receiving each significant item.\n  - Incorporate repeated encounters with experts who initially dismiss the items as junk but gradually recognize their value, creating a cyclical pattern of near-loss and validation. For instance, an expert might initially scoff at a dusty old vase, only to later realize it's a rare Ming dynasty artifact.\n  - Develop the narrative through dialogue-driven encounters that reveal the history and significance of the artifacts, as well as the parent's past actions and their consequences. For example, a conversation between the parent and an expert could reveal the story behind a particular artifact and its historical importance.\n\n- **Creativity**:\n  - Subvert the typical hoarder trope by focusing on the parent's personal reflections and societal perceptions of their collection. For example, the parent could muse on how society undervalues historical artifacts and the importance of preservation.\n  - Use subtlety and ambiguity to create a sense of mystery and unease about the true value of the items. For instance, the parent might hint at the significance of certain items without fully revealing their history until the climax.\n  - Reflect the internal states of the characters through the setting, such as the cluttered yet meticulously organized home that mirrors the parent's mind. For example, describe the home as a labyrinth of history, with each room representing a different era.\n  - Integrate elements of cosmic horror and moral ambiguity by exploring the darker side of historical preservation, such as the lengths the parent went to acquire certain artifacts. For instance, the parent might have a morally ambiguous past involving black market dealings.\n  - Use a single, intimate encounter to explore themes of acceptance and emotional resolution, such as the moment the parent and child reconcile over the true value of the collection. For example, the child might finally understand the parent's passion and dedication.\n  - Subvert the 'clueless child' trope by emphasizing their confusion and miscommunication with the parent, leading to a climactic moment of understanding. For instance, the child might initially see the collection as junk but gradually realize its significance.\n  - Employ a surreal and whimsical approach to the concept of historical artifacts, incorporating bizarre and imaginative elements. For example, describe the artifacts in fantastical terms, such as \"a sword that once belonged to a forgotten king, its blade still gleaming with ancient magic.\"\n  - Personify the artifacts in various human forms, adding a layer of intrigue and unpredictability to the narrative. For instance, the parent might describe the artifacts as having personalities or spirits, each with its own story to tell.\n\n- **Development (Character and Setting)**:\n  - Develop the parent character through introspection and societal interactions, revealing their internal conflict and desire to be seen as more than just a hoarder. For example, the parent might reflect on their passion for history and the misunderstandings it has caused.\n  - Use dialogue to reveal the inner thoughts and emotions of the characters, often incorporating humor to lighten the tone. For instance, the parent might make witty remarks about the absurdity of the situation.\n  - Show character development through reactions to extreme stress and moral dilemmas, such as the parent's fear of losing their collection and the ethical implications of their past actions. For example, the parent might struggle with the decision to reveal the true value of the artifacts.\n  - Use detailed, emotionally charged interactions to reveal the characters' inner states, such as the parent's vulnerability and fear of judgment. For instance, the parent might break down in tears when explaining the significance of a particular artifact.\n  - Highlight the protagonist's internal conflict through their interactions with the Hoarders TV show team and their child, revealing their struggle to be understood. For example, the parent might repeatedly try to justify their collection, only to be met with skepticism.\n  - Develop the setting through brief, vivid descriptions of the home and its unique and fantastical aspects, focusing on the historical artifacts. For example, describe the home as a treasure trove of history, with each room filled with relics from different eras.\n  - Show the protagonist's evolving relationship with their collection, highlighting a journey from fear of judgment to acceptance and pride. For instance, the parent might initially hide certain items but gradually reveal them as the experts recognize their value.\n  - Reveal depth and transformation through the characters' interactions and reflections, such as the parent's realization of the true value of their collection and the child's newfound appreciation for history. For example, the child might start to see the artifacts as more than just clutter.\n\n- **Language Use**:\n  - Use a conversational and introspective tone to convey the protagonist's thoughts and emotions, capturing their complex relationship with their collection. For example, the parent might think, \"I know it looks like junk to them, but each piece has a story, a history that deserves to be remembered.\"\n  - Employ descriptive language to evoke a strong sense of place and mood, creating an immersive atmosphere. For instance, describe the home as \"a labyrinth of history, each room a portal to a different era, filled with relics that whisper of the past.\"\n  - Use casual and humorous dialogue to enhance character dynamics, lightening the tone of the narrative. For example, the parent might joke, \"Welcome to my museum of forgotten treasures. Admission is free, but appreciation is mandatory.\"\n  - Employ vivid and unsettling imagery to enhance the sense of mystery and unease about the artifacts. For instance, describe an artifact as \"a mask with hollow eyes, staring into the soul of anyone who dares to look too closely.\"\n  - Blend direct dialogue and introspective narrative to convey emotional depth and realism, capturing the characters' internal struggles. For example, the parent might think, \"I've spent my life collecting these pieces, but now I wonder if it was all worth it,\" while saying, \"These aren't just things; they're pieces of history.\"\n  - Use dialogue to convey tension and character dynamics, highlighting the misunderstandings and conflicts between the characters. For instance, the child might say, \"I just wanted to help,\" to which the parent responds, \"Help? By calling them? You don't understand what these mean to me.\"\n  - Employ a formal and authoritative tone when describing the historical significance of the artifacts, mimicking the style of a professional appraisal. For example, an expert might say, \"This vase is a rare Ming dynasty artifact, its value immeasurable.\"\n  - Use vivid and symbolic imagery to convey the presence and nature of the artifacts, creating a striking visual that symbolizes their historical importance. For instance, describe an artifact as \"a sword with a blade that gleams like the edge of a reaper's scythe, its history etched in every scratch and dent.\"\n  - Blend whimsical and sardonic tones to convey the parent's perspective, adding a layer of detached amusement to the narrative. For example, the parent might think, \"How noble of them to try and 'save' me from my own collection,\" while saying, \"These aren't just things; they're my life's work.\"\n\n</story_rules>",
    "<thinking>  \nAnalyze the Author Writing Sheet for all four categories in depth to infer patterns, unique traits, and key elements of the author’s storytelling style. Reflect on how these elements can be adapted to suit the Writing Prompt. Use this analysis to craft **Story Rules** enriched with tailored examples inspired by the Evidence, ensuring alignment with both the Writing Prompt and the Author Writing Sheet.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative to focus on the protagonist's internal conflict regarding the strange rule they broke and the unexpected consequences. For example, the protagonist might reflect on their confusion and fear about why their parents gave them magical items instead of punishment.\n  - Center the plot around a pivotal encounter that encapsulates the protagonist's emotional journey. This could be the moment they use the wand for the first time and realize the gravity of their actions.\n  - Emphasize psychological horror and betrayal by introducing a twist where the protagonist feels betrayed by their parents' cryptic response and the dangerous situations they now face.\n  - Create a continuous cycle of confrontation and misunderstanding as the protagonist tries to understand the purpose of the magical items and the rule they broke, leading to repeated encounters with magical creatures or challenges.\n  - Consider structuring the narrative as a series of fragmented diary entries or letters to their parents, creating a non-linear and episodic plot that captures the protagonist's evolving thoughts and experiences.\n  - Incorporate repeated encounters with a mysterious figure (possibly Death or a guardian) who provides cryptic guidance, creating a cyclical pattern of near-death experiences and survival.\n  - Use dialogue-driven encounters to reveal past actions and their consequences, such as a conversation with a magical mentor or an old family friend who explains the history behind the rule and the magical items.\n\n- **Creativity**:\n  - Subvert typical fantasy tropes by focusing on the protagonist's personal reflections and societal perceptions of magic. For example, the protagonist might muse on the impracticality of using a wand in everyday life or the absurdity of their parents' rule.\n  - Use subtlety and ambiguity to reinterpret the prompt, creating a sense of mystery and unease. Introduce magical elements gradually, leaving their full nature ambiguous until the climax.\n  - Reflect the protagonist's internal states through the setting. For instance, describe the protagonist's home as eerily quiet and filled with strange, magical artifacts that mirror their confusion and fear.\n  - Integrate elements of cosmic horror and moral ambiguity by introducing magical creatures or spells that have unforeseen and unsettling consequences.\n  - Use a single, intimate encounter to explore themes of acceptance and emotional resolution. This could be a heartfelt conversation with a magical creature or a moment of clarity when the protagonist understands their parents' intentions.\n  - Subvert the 'hero's journey' trope by emphasizing confusion and miscommunication. The protagonist might struggle to understand the purpose of their quest and the true nature of the magical items.\n  - Employ a surreal and whimsical approach to the concept of magic, incorporating bizarre and imaginative elements. For example, describe the wand as having a mind of its own or the spell book containing spells that produce unexpected results.\n  - Personify the magical items or creatures, adding a layer of intrigue and unpredictability to the narrative. The wand might speak in riddles, or the sword could have a personality of its own.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through introspection and societal interactions. Show their internal conflict and desire to understand their parents' actions and the magical items.\n  - Use dialogue to reveal the protagonist's inner thoughts and emotions, often incorporating humor. For example, the protagonist might make sarcastic remarks about their situation or the absurdity of the magical items.\n  - Develop characters through their reactions to extreme stress and moral dilemmas. The protagonist might face dangerous magical creatures or ethical decisions about using the wand's power.\n  - Create detailed, emotionally charged interactions that reveal the protagonist's inner states. For instance, describe their fear and determination during a confrontation with a magical creature.\n  - Highlight the protagonist's internal struggle through their interactions with other characters, such as a magical mentor or a friend who helps them navigate their new reality.\n  - Develop the setting through brief, vivid descriptions of magical locations, focusing on their unique and fantastical aspects. Describe the protagonist's home as filled with strange artifacts or the forest as having an otherworldly glow.\n  - Show the protagonist's evolving relationship with the magical items, highlighting a journey from confusion and fear to acceptance and mastery.\n  - Reveal depth and transformation through the protagonist's reflections and interactions, illustrating their growth and understanding of the magical world.\n\n- **Language Use**:\n  - Use a conversational and introspective tone to convey the protagonist's thoughts and emotions. For example, write, \"I liked the idea of magic, loved it even, but at the same time... having a wand and a spell book felt more like a curse than a gift.\"\n  - Employ descriptive language to evoke a strong sense of place and mood. Describe the protagonist's home as \"filled with an eerie silence, the kind that made you feel like you were being watched.\"\n  - Use casual and humorous dialogue to enhance character dynamics. The protagonist might joke about their parents' strange rule or the absurdity of their situation.\n  - Incorporate vivid and unsettling imagery to enhance the magical atmosphere. Describe the wand as \"glowing with an unsettling light, like the edge of a storm cloud.\"\n  - Blend direct dialogue and introspective narrative to convey emotional depth and realism. For example, \"I'm scared,\" the protagonist admitted after a moment. The tears were free now. It was the first time they'd said those words. They'd been avoiding it up until now, like speaking them would make it real.\"\n  - Use dialogue to convey tension and character dynamics. The protagonist might argue with a magical creature or express frustration with their parents' cryptic message.\n  - Employ a formal and authoritative tone when describing the spell book, mimicking the style of a professional manual while incorporating playful and cryptic language. For example, \"The first spell is simple, but beware, for magic is not to be taken lightly.\"\n  - Use vivid and symbolic imagery to convey the presence and nature of the magical items. Describe the sword as \"gleaming with a sharp silver light, like the edge of a reaper's scythe,\" creating a striking visual that symbolizes its power and danger.\n  - Blend whimsical and sardonic tones to convey the protagonist's perspective. For example, the protagonist might sarcastically comment, \"Well, I guess breaking the rules has its perks,\" highlighting their detached amusement and confusion.\n</story_rules>",
    "<thinking>  \nTo generate the Story Rules, I will analyze the Author Writing Sheet for each category—Plot, Creativity, Development (Character and Setting), and Language Use. I will identify the unique storytelling elements and techniques used by the author and tailor them to the given Writing Prompt. The Writing Prompt involves a conversation about applying to be a hero, focusing on the protagonist's past heroic deeds and a failed romantic pursuit. The Story Rules will guide the language model to create a narrative that reflects the author's style while aligning with the themes and tone of the Writing Prompt.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the narrative to focus on the internal conflict of the protagonist. Highlight the protagonist's struggle with their heroic identity and the emotional impact of not winning the girl's affection. For example, the protagonist might reflect on their heroic deeds and the emptiness they feel despite their achievements: \"Saving the world was supposed to fill the void, but her rejection left a chasm that no amount of heroism could bridge.\"\n  - Center the plot around a pivotal encounter that encapsulates the protagonist's emotional journey. Use the conversation about applying to be a hero as the central event, capturing the protagonist's transition from hope to acceptance of their romantic failure: \"The interviewer’s eyes softened, 'You did everything right, but sometimes, it’s just not meant to be.'\"\n  - Emphasize psychological horror and betrayal subtly by exploring the protagonist's feelings of betrayal by fate or destiny. For instance, the protagonist might feel that their heroic efforts should have guaranteed a happy ending: \"He clenched his fists, the weight of destiny's betrayal pressing down on him. 'I did everything right, so why does it feel so wrong?'\"\n  - Create a continuous cycle of confrontation and misunderstanding in the protagonist's interactions with the interviewer, reflecting their internal turmoil and unresolved feelings: \"Every question felt like a jab, reopening wounds he thought had healed. 'Couldn't you have tried harder?' 'Dude... She said no.'\"\n  - Use a dialogue-driven encounter to reveal past actions and their consequences. The conversation should unfold through a series of questions and answers that gradually reveal the protagonist's heroic deeds and the emotional cost of their unrequited love: \"The interviewer leaned forward, 'Tell me about the final battle.' He sighed, 'It was the hardest thing I've ever done, but losing her was harder.'\"\n\n- **Creativity**:  \n  - Subvert superhero tropes by focusing on the protagonist's personal reflections and societal perceptions. Highlight the protagonist's disdain for the expectation that heroes always get the girl: \"He chuckled bitterly, 'They never tell you in the comics that sometimes, the hero ends up alone.'\"\n  - Use subtlety and ambiguity to reinterpret the prompt, creating a sense of mystery and unease about the protagonist's past. For example, hint at the challenges and sacrifices the protagonist faced without explicitly detailing them: \"He stared into the distance, memories of battles fought and lives saved flickering in his mind. 'It wasn't just about saving the world... there was so much more.'\"\n  - Reflect the protagonist's internal state through the setting of the interview room. Describe the room as sterile and impersonal, mirroring the protagonist's feelings of isolation and detachment: \"The room was cold and clinical, a stark contrast to the warmth he once felt in her presence.\"\n  - Integrate elements of cosmic horror and moral ambiguity by hinting at the darker aspects of the protagonist's heroism. For instance, suggest that some of their actions had unintended consequences: \"He shuddered, recalling the shadows that lingered even after the light had returned. 'Not every victory is clean.'\"\n  - Use a single, intimate encounter to explore the theme of acceptance and emotional resolution. The conversation with the interviewer should serve as a moment of connection and understanding, helping the protagonist come to terms with their past: \"The interviewer’s voice softened, 'You did your best, and that's all anyone can ask.' He nodded, a weight lifting from his shoulders.\"\n\n- **Development (Character and Setting)**:  \n  - Develop the protagonist through introspection and societal interactions. Show their internal conflict and desire to be seen as more than just a hero: \"He sighed, 'Everyone sees the hero, but no one sees the person behind the mask.'\"\n  - Use dialogue to reveal the protagonist's inner thoughts and emotions, incorporating humor to lighten the tone: \"He smirked, 'Saving the world was the easy part. Dating? Now that's a real challenge.'\"\n  - Develop the protagonist through their reactions to extreme stress and moral dilemmas. Highlight their decision-making under pressure and the emotional toll it takes: \"He rubbed his temples, the weight of his choices pressing down on him. 'Every decision felt like a gamble, and I was always one step away from losing everything.'\"\n  - Use detailed, emotionally charged interactions to reveal the protagonist's inner states. Show their vulnerability and fear through their dialogue and reactions: \"He swallowed hard, 'I thought saving the world would make everything better, but it just made me realize how much I lost.'\"\n  - Develop the setting through brief, vivid descriptions that reflect the protagonist's emotional journey. For example, describe the interview room in a way that mirrors their feelings of isolation and detachment: \"The walls were a stark white, devoid of any warmth or comfort, much like his heart after she said no.\"\n\n- **Language Use**:  \n  - Use a conversational and introspective tone to convey the protagonist's thoughts and emotions. Capture their complex relationship with their role as a hero: \"He leaned back, a wistful smile on his lips. 'Being a hero is great and all, but it doesn't fill the void she left.'\"\n  - Employ descriptive language to evoke a strong sense of place and mood. Create an immersive atmosphere that reflects the protagonist's emotional state: \"The room felt like a void, echoing the emptiness he felt inside.\"\n  - Use casual and humorous dialogue to enhance character dynamics. Lighten the tone with witty exchanges: \"He chuckled, 'You know, saving the world is a lot easier than getting a date.'\"\n  - Use vivid and unsettling imagery to enhance the emotional depth of the narrative. For example, describe the protagonist's memories of their heroic deeds in a way that highlights the emotional cost: \"The memories were like ghosts, haunting him with every step he took.\"\n  - Blend direct dialogue and introspective narrative to convey emotional depth and realism. Show the protagonist processing their emotions through their thoughts and words: \"He sighed, 'I did everything I could, but sometimes, that's just not enough.'\"\n  - Use dialogue to convey tension and character dynamics. Create sharp and filled with tension exchanges: \"The interviewer’s eyes narrowed, 'Couldn't you have tried harder?' He clenched his fists, 'Dude... She said no.'\"\n  - Employ a blend of whimsical and sardonic tones to convey the protagonist's perspective. Use sarcasm and whimsy to highlight their detached amusement: \"He smirked, 'Yeah, because saving the world wasn't hard enough. I should have just tried harder to get the girl.'\"\n</story_rules>",
    "<thinking>  \nTo generate the Story Rules, I will analyze the Author Writing Sheet for each category—Plot, Creativity, Development (Character and Setting), and Language Use. I will identify the unique storytelling elements and techniques used by the author and adapt them to the given Writing Prompt about a new employee at a prestigious amusement park with strange rules. I will ensure the rules are actionable, detailed, and aligned with both the author's style and the Writing Prompt.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative to focus on the internal conflict of the protagonist. For example, the protagonist, a new employee, might struggle with the bizarre nature of the rules and their implications, reflecting on their decision to work at the park and their fear of the unknown.\n  - Center the plot around a single pivotal encounter that encapsulates the protagonist's emotional journey. For instance, the protagonist might have a crucial interaction with a mascot that reveals the true nature of the park, leading to a significant shift in their understanding and emotions.\n  - Emphasize psychological horror and betrayal. The protagonist could discover that the park's mascots are not what they seem, leading to a sense of betrayal and fear as they uncover the dark secrets behind the park's operations.\n  - Create a continuous cycle of confrontation and misunderstanding. The protagonist might repeatedly encounter strange and unsettling situations with the mascots, each time growing more confused and anxious about the park's true nature.\n  - Use a non-linear and episodic plot structure, such as fragmented journal entries or reports from the protagonist, to provide snapshots of their experiences and discoveries within the park.\n  - Incorporate repeated encounters with unsettling elements, such as the mascots, creating a cyclical pattern of near-discoveries and escalating tension.\n  - Develop the plot through dialogue-driven encounters that reveal past actions and their consequences. The protagonist might have conversations with other employees or park officials that slowly unveil the history and hidden truths of the park.\n\n- **Creativity**:\n  - Subvert typical amusement park tropes by focusing on the protagonist's personal reflections and societal perceptions of the park. For example, the protagonist might muse on the contrast between the park's cheerful exterior and the eerie rules they must follow.\n  - Use subtlety and ambiguity to reinterpret the prompt, creating a sense of mystery and unease. The true nature of the mascots and the park's rules should be hinted at but not fully explained, leaving room for the reader's imagination.\n  - Reflect the protagonist's internal states through the setting. The park could have areas that mirror the protagonist's growing unease, such as dimly lit corridors or eerily quiet zones.\n  - Integrate elements of cosmic horror and moral ambiguity. The park's mascots might have otherworldly origins or purposes, adding a layer of horror and ethical dilemmas for the protagonist.\n  - Use a single, intimate encounter to explore themes of acceptance and emotional resolution. The protagonist might have a profound moment of connection with a mascot or another character that helps them come to terms with the park's reality.\n  - Subvert the 'friendly mascot' trope by emphasizing confusion and miscommunication. The protagonist might be bewildered by the mascots' behavior, leading to moments of tension and misunderstanding.\n  - Employ a surreal and whimsical approach to the concept of the amusement park, incorporating bizarre and imaginative elements that challenge the protagonist's perception of reality.\n  - Personify the mascots in various unsettling forms, adding intrigue and unpredictability to the narrative. Each mascot could have distinct, eerie characteristics that make the protagonist question their nature.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through introspection and interactions with the park's environment and other characters. The protagonist's thoughts and feelings about the strange rules and their experiences should be a central focus.\n  - Use dialogue to reveal the protagonist's inner thoughts and emotions, incorporating humor to lighten the tension. For example, the protagonist might make sarcastic remarks about the absurdity of the rules.\n  - Show character development through reactions to extreme stress and moral dilemmas. The protagonist's decisions and actions in response to the park's mysteries should highlight their growth and resilience.\n  - Create detailed, emotionally charged interactions that reveal the protagonist's inner states. For instance, a conversation with a fellow employee about the park's secrets could be a pivotal moment of vulnerability and fear.\n  - Highlight the protagonist's internal conflict through their interactions with the mascots and other employees. The protagonist's struggle to understand the park's rules and their implications should drive their character arc.\n  - Develop the setting through brief, vivid descriptions that emphasize the park's unique and fantastical aspects. The park should feel both enchanting and unsettling, with each area contributing to the overall atmosphere.\n  - Show the protagonist's evolving relationship with the park and its mascots, highlighting a journey from curiosity to fear and acceptance. The protagonist's changing perceptions of the park should be a key element of the narrative.\n  - Use interactions and reflections to reveal depth and transformation in the protagonist. The protagonist's thoughts and conversations about the park's rules and their experiences should illustrate their growth and changing perspective.\n\n- **Language Use**:\n  - Use a conversational and introspective tone to convey the protagonist's thoughts and emotions. For example, the protagonist might think, \"I signed up for a fun job at an amusement park, not a horror movie. What does 'Check for eyeholes' even mean?\"\n  - Employ descriptive language to evoke a strong sense of place and mood. Phrases like \"The park was a maze of bright lights and dark secrets, each corner hiding something more bizarre than the last\" can create an immersive atmosphere.\n  - Use casual and humorous dialogue to enhance character dynamics. The protagonist might joke with a fellow employee, saying, \"If I see one more mascot with glowing eyes, I'm quitting on the spot.\"\n  - Incorporate vivid and unsettling imagery to enhance the horror atmosphere. Descriptions like \"The mascot's eyes were empty, black voids that seemed to swallow the light\" can create a sense of dread.\n  - Blend direct dialogue and introspective narrative to convey emotional depth and realism. The protagonist might reflect, \"I couldn't shake the feeling that something was watching me, even when I was alone.\"\n  - Use dialogue to convey tension and character dynamics. Exchanges like \"What do you mean, 'Check for eyeholes'? Are you saying these things aren't costumes?\" can heighten the suspense.\n  - Employ a formal and authoritative tone for the park's rules, mimicking the style of a professional manual while incorporating playful and cryptic language. For example, \"Rule #7: There's only ever one of each mascot inside the park. Check for eyeholes. Failure to comply may result in immediate termination.\"\n  - Use vivid and symbolic imagery to convey the presence and nature of the mascots. Descriptions like \"The mascot's eyes glinted like polished obsidian, cold and unfeeling\" can create a striking visual that symbolizes their eerie nature.\n  - Blend whimsical and sardonic tones to convey the protagonist's perspective. The protagonist might think, \"Great, just what I needed—a job where the mascots might be actual monsters. How noble of me to stick around.\"\n\n</story_rules>",
    "<thinking>  \nTo generate the Story Rules, I will analyze the Author Writing Sheet for each category—Plot, Creativity, Development (Character and Setting), and Language Use. I will identify the unique storytelling elements and techniques used by the author and tailor them to the given Writing Prompt. The Writing Prompt involves a blood-soaked adventurer recounting their heroic deeds to impress a girl, which suggests a blend of epic adventure, humor, and character-driven narrative. I will ensure the Story Rules reflect these themes while maintaining the author's distinctive style.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative to focus on the internal conflict of the protagonist. For example, the adventurer should reflect on their motivations and the challenges of living up to their heroic deeds. Include moments where the adventurer questions whether their actions were truly for the girl or for their own sense of worth.\n  - Center the plot around a single pivotal encounter that encapsulates the protagonist's emotional journey. For instance, the adventurer's final confrontation with the Dragon King should be a moment of intense self-realization, where they understand the true nature of their quest.\n  - Emphasize psychological horror and betrayal. Introduce a subplot where the adventurer faces betrayal from a trusted ally, adding depth to their journey and highlighting the emotional stakes.\n  - Create a continuous cycle of confrontation and misunderstanding. The adventurer should repeatedly face challenges and misunderstandings, both with the Guild Leader and the girl they aim to impress, leading to humorous and tense interactions.\n  - Use a non-linear and episodic plot structure. Present the adventurer's recounting of their deeds through fragmented flashbacks, each focusing on a different heroic act, such as defeating the Dragon King or rescuing cats, to create a dynamic and engaging narrative.\n  - Incorporate repeated encounters with Death, creating a cyclical pattern of near-death experiences. The adventurer should narrowly escape death multiple times, each encounter adding to their legend and internal conflict.\n  - Use dialogue-driven encounters to reveal past actions and their consequences. The conversation between the Guild Leader and the adventurer should gradually unveil the true motivations and outcomes of the adventurer's deeds.\n\n- **Creativity**:\n  - Subvert traditional adventure tropes by focusing on the adventurer's personal reflections and societal perceptions. Highlight the adventurer's disdain for being seen as a mere hero and their musings on the impracticality of their lifestyle.\n  - Use subtlety and ambiguity to reinterpret the prompt, creating a sense of mystery and unease. For example, leave the true nature of the adventurer's feelings for the girl ambiguous, allowing for multiple interpretations.\n  - Reflect the internal states of the characters through the setting. Describe the Guild Hall as a place of both grandeur and decay, mirroring the adventurer's feelings of pride and disillusionment.\n  - Integrate elements of cosmic horror and moral ambiguity. Introduce a subplot involving a cursed artifact or a morally ambiguous decision the adventurer had to make during their quest.\n  - Use a single, intimate encounter to explore themes of acceptance and emotional resolution. The adventurer's final conversation with the girl should be a profound moment of connection and understanding, revealing the true impact of their deeds.\n  - Subvert the 'heroic quest' trope by emphasizing confusion and miscommunication. The adventurer's attempts to impress the girl should be filled with humorous misunderstandings and unexpected outcomes.\n  - Employ a surreal and whimsical approach to the adventurer's recounting of their deeds. Include bizarre and imaginative elements, such as talking animals or enchanted forests, to add a layer of whimsy to the narrative.\n  - Personify Death in various human forms, adding intrigue and unpredictability. Describe Death as appearing in different guises during the adventurer's near-death experiences, each encounter adding to the adventurer's legend.\n\n- **Development (Character and Setting)**:\n  - Develop the adventurer's character through introspection and societal interactions. Show their internal conflict and desire to be seen as more than just a hero through their reflections and interactions with the Guild Leader and other characters.\n  - Use dialogue to reveal the adventurer's inner thoughts and emotions, incorporating humor. For example, the adventurer's recounting of their deeds should include humorous and self-deprecating remarks that reveal their true feelings.\n  - Develop characters through their reactions to extreme stress and moral dilemmas. Highlight the adventurer's decision-making under pressure, such as choosing to save the cats over pursuing the bandits, to reveal their character.\n  - Use detailed, emotionally charged interactions to reveal the adventurer's inner states. The conversation with the girl should be filled with vulnerability and honesty, showcasing the adventurer's emotional journey.\n  - Develop the setting through brief, vivid descriptions of the adventurer's quests. Describe the Dragon King's lair, the Northern Bandit Tribes' hideout, and the trees where the cats were rescued in rich detail to create an immersive world.\n  - Highlight the adventurer's evolving relationship with Death, showing a journey from fear to acceptance. Describe how the adventurer's repeated near-death experiences have changed their perspective on life and heroism.\n  - Develop characters through their interactions and reflections, revealing depth and transformation. Show how the adventurer's deeds have changed them and those around them, such as the Guild Leader's evolving perception of the adventurer.\n\n- **Language Use**:\n  - Use a conversational and introspective tone to convey the adventurer's thoughts and emotions. For example, write lines like, \"I thought slaying the Dragon King would make me a hero, but now I just feel empty,\" to capture the adventurer's internal conflict.\n  - Employ descriptive language to evoke a strong sense of place and mood. Use phrases like \"the Dragon King's lair was a cavern of shadows and whispers\" to create an immersive atmosphere.\n  - Use casual and humorous dialogue to enhance character dynamics. Include exchanges like, \"You did all that for a girl? Man, you must really like her,\" to add humor and relatability to the narrative.\n  - Use vivid and unsettling imagery to enhance the horror atmosphere. Describe the adventurer's encounters with Death using striking visuals, such as \"Death's eyes were like the edge of a gleaming scythe, cold and unyielding.\"\n  - Blend direct dialogue and introspective narrative to convey emotional depth and realism. For example, write, \"'I did it all for her,' the adventurer admitted, his voice barely a whisper. 'But now, I'm not sure it was worth it.'\"\n  - Use dialogue to convey tension and character dynamics. Include sharp and tense exchanges between the adventurer and the Guild Leader, such as, \"You think this makes you a hero? Think again.\"\n  - Employ a formal and authoritative tone, mimicking the style of a professional recounting while incorporating playful and cryptic language. For example, write, \"The Guild Leader's voice was stern, but there was a twinkle of amusement in his eyes as he said, 'So, tell me more about these cats.'\"\n  - Use vivid and symbolic imagery to convey the presence and nature of Death. Describe Death's appearances with lines like, \"Death stood before me, a young girl with eyes like silver blades, her presence both terrifying and oddly comforting.\"\n\n</story_rules>"
]