[
    "<thinking>\nThe writing prompt involves a protagonist encountering an old college friend who once seemed perfect but now shows signs of imperfection. This scenario suggests themes of change, perception, and possibly disillusionment. The tone could range from nostalgic to melancholic, with a focus on introspection and the protagonist's emotional journey.\n\nThe user profile indicates a storytelling style that begins with establishing the protagonist's routine or current state, uses imaginative elements, and concludes with introspective reflections. The user prefers a clear narrative structure, detailed character development, and immersive settings. They employ a first-person perspective, rich vocabulary, and varied sentence structures to create an engaging and emotionally resonant tone.\n\nCombining these insights, the Story Rules will guide the creation of a narrative that starts with the protagonist's routine, introduces the old friend in a way that highlights the initial perception of perfection, and gradually reveals the cracks in their facade. The story will end with the protagonist reflecting on the changes and their emotional state, maintaining a tone of introspection and possibly unresolved conflict.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin by establishing the protagonist's current routine or state, setting a tone of introspection or nostalgia. For example, describe the protagonist's daily activities or a specific moment that leads to the encounter with the old friend.\n\n#### Story Ending\n- Conclude with the protagonist reflecting on the changes observed in the old friend and their own emotional state. Leave a sense of introspection or unresolved conflict, emphasizing the protagonist's feelings of disillusionment or nostalgia.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end. Start with the protagonist's routine, introduce the encounter with the old friend, reveal the cracks in their facade, and end with the protagonist's reflection. Ensure events are connected cohesively and follow a logical progression.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce imaginative elements that enhance the depth of the story. For example, use metaphors or symbolic imagery to represent the old friend's perceived perfection and the cracks in their facade.\n\n#### Engaging Themes and Imagery\n- Use vivid imagery and thematic depth to capture the mood of the prompt. Themes of change, perception, and disillusionment should be explored through detailed descriptions and introspective thoughts.\n\n#### Use of Tropes or Clichés\n- Subvert common tropes related to nostalgia and disillusionment. For example, instead of a dramatic revelation, use subtle observations and internal monologue to reveal the cracks in the old friend's facade.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist through detailed descriptions of their actions, habits, and introspective thoughts. Establish their role and arc through their observations and reflections on the old friend.\n\n#### Setting Establishment\n- Build immersive settings with descriptive details that bring the scenes to life. For example, describe the location where the protagonist encounters the old friend, making it vivid and relevant to the story.\n\n#### Supporting Characters and Interactions\n- Introduce the old friend as a supporting character who plays a crucial role in advancing the plot and highlighting the protagonist's emotional journey. Use their interactions to reveal the changes and cracks in the old friend's facade.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use the first-person perspective to provide depth and balance between action and introspection. This perspective will allow the reader to connect deeply with the protagonist's thoughts and emotions.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Use descriptive language and poetic devices to create a vivid and introspective tone.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the themes of change, perception, and disillusionment. Use word choices and recurring phrases to create a consistent atmosphere that enhances the reader's immersion and connection to the narrative.\n</story_rules>",
    "<thinking>\nThe writing prompt presents a scenario where the protagonist and their partner move into a peculiar, wedge-shaped house situated between two noisy train lines. The low rent is the initial draw, but as time passes, the protagonist begins to suspect that the house, referred to as the Triangle Zone, harbors more secrets than just its unusual shape. This setup suggests themes of mystery, the unknown, and possibly supernatural or psychological elements.\n\nThe user profile indicates a storytelling style that emphasizes clear context and the protagonist's routine at the beginning, introspective and unresolved endings, and a linear narrative structure. The user incorporates unique, imaginative elements and vivid imagery, often subverting common tropes. Characters are developed through detailed actions and introspective thoughts, with immersive settings that enhance the narrative. The first-person perspective is used to add depth, with varied sentence structures and rich vocabulary creating an engaging and emotionally resonant tone.\n\nTo align the story with the user's style, the rules should guide the creation of a clear beginning that establishes the protagonist's routine in the new house, a middle that introduces the mysterious elements of the Triangle Zone, and an introspective ending that reflects on the protagonist's emotional state. Unique and imaginative elements should be added to enhance the mystery, and vivid descriptions should create an immersive setting. The first-person perspective should be used to convey the protagonist's internal monologue, with varied sentence structures and rich vocabulary to enhance the narrative's impact.\n\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin by establishing the protagonist's routine in the new wedge-shaped house, highlighting the initial attraction to its low rent and the peculiarities of living between two roaring train lines.\n- Introduce the protagonist's partner and their initial reactions to the house, setting a tone of curiosity and slight unease.\n\n#### Story Ending\n- Conclude with the protagonist reflecting on their emotional state and the unresolved mysteries of the Triangle Zone. Leave a sense of introspection and lingering questions about the house's secrets.\n- Emphasize the protagonist's feelings of isolation or connection to the house, creating a poignant and thought-provoking resolution.\n\n#### Narrative Structure\n- Follow a clear linear progression: start with the protagonist's routine, introduce the mysterious elements of the house, and build towards an introspective ending.\n- Ensure events are connected cohesively, with each development logically following the previous one, while maintaining a sense of growing unease and curiosity.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce imaginative details about the house, such as strange noises, unexplained occurrences, or peculiar architectural features that hint at its secrets.\n- Add unique elements that enhance the mystery, such as a hidden room, an old diary, or a recurring dream that the protagonist experiences.\n\n#### Engaging Themes and Imagery\n- Use vivid imagery to describe the house and its surroundings, emphasizing the contrast between the mundane and the mysterious.\n- Create engaging themes of curiosity, the unknown, and the psychological impact of living in such an unusual place.\n\n#### Use of Tropes or Clichés\n- Subvert common tropes related to haunted houses or mysterious locations by adding unique twists, such as the house's influence on the protagonist's dreams or the partner's gradual change in behavior.\n- Avoid clichéd explanations for the house's mysteries, instead leaving some elements ambiguous to maintain intrigue.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist through detailed descriptions of their actions, thoughts, and reactions to the house's mysteries.\n- Establish the protagonist's arc by showing their growing obsession with uncovering the secrets of the Triangle Zone and the impact on their relationship with their partner.\n\n#### Setting Establishment\n- Create an immersive setting with detailed descriptions of the wedge-shaped house, the roaring train lines, and the surrounding area.\n- Use sensory details to bring the setting to life, such as the constant noise of the trains, the odd angles of the house, and the eerie atmosphere.\n\n#### Supporting Characters and Interactions\n- Introduce the protagonist's partner as a key supporting character, highlighting their interactions and differing reactions to the house.\n- Use interactions with neighbors or other secondary characters to add depth to the mystery and provide different perspectives on the house.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use the first-person perspective to provide depth and insight into the protagonist's thoughts and emotions.\n- Employ internal monologue to convey the protagonist's growing obsession and unease, creating a strong connection with the reader.\n\n#### Stylistic Elements\n- Utilize varied sentence structures and rich vocabulary to enhance the narrative's impact, creating a vivid and introspective tone.\n- Include descriptive language and poetic devices to create an immersive and emotionally resonant story.\n\n#### Tone and Mood Alignment\n- Maintain a tone of curiosity and unease, reflecting the protagonist's fascination and growing discomfort with the house.\n- Use word choices and recurring phrases to reinforce the themes of mystery and the unknown, creating a consistent and engaging atmosphere.\n\n</story_rules>"
]