[
    "<thinking>\n1. **Plot**: The Author Written Story presents a more intimate and immediate narrative, focusing on the personal experiences and emotions of Chichi and her mother, Awo, as they navigate the societal backlash and personal tragedy following Chichi's decision to have a C-section. The story is structured around key moments of tension and emotional depth, such as the initial decision, the community's reaction, the birth, and the aftermath of the tragedy. The plot is tightly woven with cultural and personal stakes, emphasizing the conflict between tradition and modernity. In contrast, the Base Story follows a more linear and broader narrative arc, with a focus on the community's gradual acceptance and Chichi's eventual healing and empowerment.\n\n2. **Creativity**: The Author Written Story creatively integrates cultural elements and personal fears into the narrative, using vivid imagery and cultural practices to highlight the tension between tradition and modernity. The story employs a rich tapestry of cultural references, such as the traditional childbirth practices and the community's reaction to Chichi's decision, to create a unique and immersive narrative. The Base Story, while also addressing the theme of tradition versus modernity, does so in a more conventional manner, focusing on the broader societal changes and Chichi's eventual acceptance.\n\n3. **Development (Character and Setting)**: The Author Written Story delves deeply into the characters' inner worlds, particularly Chichi's fears and Awo's conflicting emotions. The setting is vividly depicted, with the village's cultural practices and societal norms playing a crucial role in shaping the characters' experiences. The story uses detailed descriptions and cultural context to create a rich and immersive setting. In contrast, the Base Story provides a more generalized depiction of the characters and setting, focusing on the broader societal changes and the eventual reconciliation between tradition and modernity.\n\n4. **Language Use**: The Author Written Story employs a rich and evocative language style, using vivid imagery, cultural references, and emotional depth to create an immersive narrative. The story uses a mix of dialogue and descriptive passages to convey the characters' emotions and the cultural context. The language is often poetic and metaphorical, enhancing the emotional impact of the narrative. The Base Story, while also using descriptive language, tends to be more straightforward and less culturally specific, focusing on the broader themes of resilience and empowerment.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a vivid depiction of the cultural setting and the protagonist's controversial decision, using a specific event or conversation to introduce the central conflict. For example, depict Chichi and Emefa walking back from the river, discussing the implications of Chichi's decision to have a C-section.\n  - Structure the narrative around key emotional and cultural moments, such as the community's reaction, the birth, and the aftermath of the tragedy. Use these moments to explore the tension between tradition and modernity, and the personal stakes involved.\n\n- **Creativity**:\n  - Integrate cultural elements and personal fears into the narrative, using vivid imagery and cultural practices to highlight the tension between tradition and modernity. For instance, describe the traditional childbirth practices and the community's reaction to Chichi's decision in detail.\n  - Use cultural references and personal experiences to create a unique and immersive narrative. For example, depict Chichi's discovery of the C-section in a library book and her subsequent decision to pursue this modern method of childbirth.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters by delving into their inner worlds and emotions. Focus on Chichi's fears and determination, as well as Awo's conflicting emotions and support for her daughter. Use dialogue and internal monologue to convey their thoughts and feelings.\n  - Create an immersive setting by vividly depicting the village's cultural practices and societal norms. Use detailed descriptions and cultural context to enhance the narrative. For example, describe the village market and the community's reaction to Chichi's decision.\n\n- **Language Use**:\n  - Employ rich and evocative language, using vivid imagery, cultural references, and emotional depth to create an immersive narrative. Use a mix of dialogue and descriptive passages to convey the characters' emotions and the cultural context.\n  - Use poetic and metaphorical language to enhance the emotional impact of the narrative. For example, describe the childbirth process as \"breaking away from your body while still in it\" to convey the intensity of the experience.\n</story_rules>",
    "<thinking>\n1. **Plot**: The Author Written Story presents a complex and layered narrative that delves deeply into the protagonist's internal conflict and her relationship with her manipulative mother. The story is structured in a way that gradually reveals the protagonist's struggle with her identity and her desire for autonomy. The narrative is divided into three parts, each building on the previous one, culminating in a climactic moment of personal rebellion and self-assertion. The plot is driven by the protagonist's internal monologue and her interactions with her mother and the journalist, which serve to highlight her internal conflict and the blurred lines between loyalty and rebellion. In contrast, the Base Story follows a more linear and straightforward plot, focusing on the protagonist's gradual journey towards independence, with external events and interactions driving the narrative.\n\n2. **Creativity**: The Author Written Story employs a unique and imaginative approach to the prompt by exploring the protagonist's psychological and emotional landscape in depth. The story uses vivid and symbolic imagery, such as the market scene and the interactions with the journalist, to convey the protagonist's internal struggle and her complex relationship with her mother. The narrative is rich with metaphor and symbolism, creating a layered and nuanced exploration of the themes of identity, power, and rebellion. The Base Story, on the other hand, takes a more conventional approach, focusing on external events and interactions to convey the protagonist's journey towards independence.\n\n3. **Development (Character and Setting)**: The Author Written Story develops its characters with depth and complexity, particularly the protagonist and her mother. The protagonist is portrayed as a conflicted and introspective character, grappling with her sense of self and her relationship with her mother. The mother is depicted as a manipulative and controlling figure, whose influence looms large over the protagonist's life. The setting is vividly described, with the market and the journalist's house serving as symbolic backdrops for the protagonist's internal conflict. The Base Story, in contrast, focuses more on the protagonist's external journey and interactions, with less emphasis on the internal development of characters and settings.\n\n4. **Language Use**: The Author Written Story employs a rich and evocative language style, characterized by vivid imagery, metaphor, and symbolism. The narrative is introspective and reflective, with a strong focus on the protagonist's internal monologue and emotional landscape. The language is poetic and lyrical, creating a sense of depth and complexity in the narrative. The Base Story uses a more straightforward and descriptive language style, focusing on external events and interactions to convey the narrative. The dialogue in the Author Written Story is sparse but impactful, serving to highlight the protagonist's internal conflict and her complex relationship with her mother.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Structure the narrative in three distinct parts, each building on the previous one to reveal the protagonist's internal conflict and journey towards self-assertion. Use internal monologue and key interactions to drive the plot.\n  - Focus on the protagonist's internal struggle with her identity and her relationship with her manipulative mother. Highlight the blurred lines between loyalty and rebellion through pivotal scenes, such as the market incident and the encounter with the journalist.\n\n- **Creativity**:\n  - Employ vivid and symbolic imagery to convey the protagonist's internal struggle and complex relationships. Use scenes like the market bargaining and the journalist's house to symbolize the protagonist's emotional and psychological state.\n  - Integrate metaphor and symbolism throughout the narrative to create a layered and nuanced exploration of themes such as identity, power, and rebellion. For example, use the image of the \"shadow of a mother\" to represent the protagonist's internal conflict.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a conflicted and introspective character, deeply affected by her mother's manipulative influence. Use her internal monologue to reveal her emotional and psychological landscape.\n  - Portray the mother as a controlling and manipulative figure, whose influence looms large over the protagonist's life. Use settings like the market and the journalist's house as symbolic backdrops for the protagonist's internal conflict.\n\n- **Language Use**:\n  - Employ rich and evocative language, characterized by vivid imagery, metaphor, and symbolism. Use introspective and reflective narrative style to convey the protagonist's internal monologue and emotional landscape.\n  - Use sparse but impactful dialogue to highlight the protagonist's internal conflict and complex relationships. For example, use phrases like \"The problem with my mother is that she thinks everyone a fool, even me\" to convey the protagonist's perspective and emotional state.\n</story_rules>"
]