[
    "<thinking>\nThe writing prompt presents a post-apocalyptic setting where the protagonist, Jonas, wanders through a graveyard filled with familiar names, clinging to hope that his lost loved ones might still be alive. Key thematic elements include loss, hope, and survival in a desolate world. The tone is somber and reflective, with potential for deep emotional exploration and introspection.\n\nThe user profile indicates a preference for starting stories with a reflective or conflict-driven tone, emphasizing unresolved internal struggles or ongoing turmoil in the endings. The narrative structure is clear and cohesive, driven by the main character's introspection. The user introduces unique psychological elements and vivid imagery, often subverting common tropes by focusing on emotional and psychological impacts. Main characters are well-developed through reflections and interactions, with immersive settings established through specific details. Supporting characters advance the plot and highlight the main character's internal struggles. The user employs a third-person perspective, reflective and introspective language, and maintains a tone aligned with the prompt's themes.\n\nCombining these insights, the Story Rules will guide the creation of a narrative that begins with Jonas's reflective thoughts in the graveyard, explores his internal struggles and hope, and concludes with a sense of unresolved turmoil. The story will include vivid imagery of the post-apocalyptic setting, well-developed characters, and introspective language to align with the user's style.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with Jonas reflecting on the names in the graveyard, setting a somber and reflective tone. Use his thoughts to establish the central theme of loss and hope.\n\n#### Story Ending\n- Conclude with Jonas finding a small, ambiguous sign of hope, leaving his internal struggle unresolved. Emphasize the ongoing turmoil and his determination to keep searching.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end. Ensure smooth transitions between Jonas's reflections, his interactions with the environment, and any encounters he has. Use his introspection to drive the narrative forward.\n\n---\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique psychological elements, such as Jonas's memories of his loved ones and how they influence his current actions and thoughts. Add original details about the post-apocalyptic world that build upon the prompt.\n\n#### Engaging Themes and Imagery\n- Use vivid imagery to describe the graveyard and the desolate world around Jonas. Engage themes of loss, hope, and survival, drawing the reader into Jonas's emotional journey.\n\n#### Use of Tropes or Clichés\n- Subvert common post-apocalyptic tropes by focusing on Jonas's emotional and psychological state rather than just the physical challenges. Highlight his internal conflict and hope in a unique way.\n\n---\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop Jonas through his reflections on the past and his interactions with the graveyard. Establish his motivations clearly, showing his hope and determination to find his loved ones.\n\n#### Setting Establishment\n- Build an immersive post-apocalyptic setting with detailed descriptions of the graveyard and the surrounding desolation. Use specific details to make the setting vivid and relevant to Jonas's journey.\n\n#### Supporting Characters and Interactions\n- Introduce supporting characters through Jonas's memories and any brief encounters he has. Use these interactions to reveal more about Jonas's internal struggles and to advance the plot.\n\n---\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person perspective to deeply explore Jonas's thoughts and emotions. Balance action with introspection to provide depth to the narrative.\n\n#### Stylistic Elements\n- Employ reflective and introspective language, using varied sentence structures and rich vocabulary to enhance the narrative. Include rhetorical devices like introspection and reflection to create impact.\n\n#### Tone and Mood Alignment\n- Maintain a somber and reflective tone throughout the story, aligning with the themes of loss and hope. Use word choices and descriptions to reinforce the mood and convey Jonas's emotional state effectively.\n\n</story_rules>",
    "<thinking>\nThe writing prompt presents a scenario where characters are trapped in the afterlife at their old high school, dealing with themes of unresolved issues, escape, and the consequences of breaking rules. The tone is likely to be reflective and tense, with elements of mystery and emotional depth.\n\nThe user profile indicates a preference for starting stories with a reflective or conflict-driven tone, emphasizing internal struggles and unresolved turmoil in the endings. The narrative structure is clear and cohesive, driven by the main character's introspection. The user introduces unique psychological elements and vivid imagery, often subverting common tropes to add depth. Characters are well-developed through reflections and interactions, with immersive settings established through specific details. The third-person perspective is used to explore the main character's thoughts and emotions, with reflective and introspective language enhancing the narrative.\n\nCombining these insights, the Story Rules will guide the creation of a story that begins with a reflective tone, develops through introspective and conflict-driven events, and concludes with unresolved internal struggles. The narrative will include unique psychological elements, vivid imagery, and well-developed characters, all presented through a third-person perspective with reflective language.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a reflective scene where the protagonist contemplates their existence in the afterlife at their old high school. Establish a tone of dissatisfaction and longing for resolution, setting the stage for the central theme of escape and unresolved issues.\n\n#### Story Ending\n- Conclude with a sense of ongoing turmoil and unresolved internal struggles. Highlight the emotional and psychological impact of the escape and the consequences of breaking the rules, leaving the protagonist and other characters in a state of reflection and uncertainty.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end. Ensure a cohesive flow driven by the protagonist's introspection and interactions with other ghosts. Transition smoothly between events, connecting the exploration of personal struggles and the quest for escape.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique psychological elements, such as the protagonist's internal conflicts and the dynamics between the ghosts. Add original details that build upon the prompt, like specific memories tied to the high school setting and the emotional weight of their past lives.\n\n#### Engaging Themes and Imagery\n- Use engaging themes such as identity, unresolved issues, and the desire for freedom. Incorporate vivid imagery of the high school setting, the spectral existence of the characters, and the emotional atmosphere of the afterlife.\n\n#### Use of Tropes or Clichés\n- Subvert common tropes related to ghost stories and the afterlife by focusing on the emotional and psychological impact of the characters' situation. Avoid clichés by adding depth to the characters' internal struggles and their interactions.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist through their reflections on their past life and current existence. Establish clear motivations for wanting to escape and explore their internal conflicts and emotional state.\n\n#### Setting Establishment\n- Build an immersive setting by describing the high school in detail, including specific locations and memories associated with it. Use interactions and sensory details to make the afterlife setting vivid and relevant to the story's themes.\n\n#### Supporting Characters and Interactions\n- Introduce supporting characters that complement the protagonist and contribute to the plot. Use their interactions to reveal old resentments, impossible dreams, and the temptation to break the rules, adding emotional depth and advancing the story.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person perspective to provide depth and balance between action and introspection. Ensure the tone aligns with the reflective and tense atmosphere of the afterlife setting.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Use rhetorical devices like introspection, reflection, and vivid descriptions to create impact and convey the emotional weight of the characters' situation.\n\n#### Tone and Mood Alignment\n- Maintain a reflective and tense tone that aligns with the prompt's themes. Use word choices and recurring themes of internal conflict, identity, and the desire for freedom to reinforce the narrative mood and create a cohesive story.\n</story_rules>",
    "<thinking>\nThe writing prompt presents a supernatural mystery involving Simon and the ghost of his best friend Maddie. Key thematic elements include the discovery of the supernatural, the uncovering of a decades-old tragedy, and the quest to help Maddie reclaim her stolen body. The tone is likely to be suspenseful and eerie, with potential for emotional depth given the personal connection between Simon and Maddie.\n\nThe user profile indicates a preference for reflective and conflict-driven beginnings, unresolved internal struggles in endings, and a clear narrative structure. The user’s stories often include psychological depth, unique elements, and vivid imagery. Main characters are well-developed through introspection and interactions, and settings are immersive with specific details. The user employs a third-person perspective with reflective and introspective language, maintaining a tone that aligns with the story’s themes.\n\nCombining these insights, the Story Rules will guide the creation of a narrative that begins with Simon’s reflective conflict about Maddie’s ghost, develops through the uncovering of the school’s haunting secrets, and concludes with an unresolved but emotionally impactful ending. The story will include unique supernatural elements, vivid imagery, and well-developed characters, all conveyed through a third-person perspective with introspective language.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with Simon reflecting on his recent experiences with Maddie’s ghost, establishing a tone of confusion and conflict. Use introspection to highlight his initial dismissal of the ghost as a figment of his imagination.\n\n#### Story Ending\n- Conclude with Simon facing unresolved internal struggles, perhaps with a sense of ongoing turmoil about the supernatural events. Ensure the ending leaves room for emotional depth and reflection on the impact of the tragedy.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end. Start with Simon’s reflective conflict, transition to the discovery of the school’s haunting secrets, and end with an emotionally impactful resolution. Ensure smooth transitions between events, driven by Simon’s introspection and actions.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique supernatural elements, such as the specific nature of the ghosts haunting the school and the details of the decades-old tragedy. Add psychological depth to Simon’s experiences and interactions with the ghosts.\n\n#### Engaging Themes and Imagery\n- Use vivid imagery to describe the eerie and suspenseful atmosphere of the school. Engage themes of loss, friendship, and the quest for justice, reflecting Simon’s emotional journey and the haunting mystery.\n\n#### Use of Tropes or Clichés\n- Subvert common supernatural tropes by focusing on the emotional and psychological impact of the hauntings on Simon. Avoid clichés by adding original details and depth to the ghostly encounters and the backstory of the tragedy.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop Simon through his reflections, interactions with Maddie’s ghost, and his determination to uncover the truth. Ensure his motivations and emotional journey are clear and well-established.\n\n#### Setting Establishment\n- Build an immersive setting with detailed descriptions of the school and its haunted areas. Use specific details to create a vivid and eerie atmosphere that enhances the supernatural elements of the story.\n\n#### Supporting Characters and Interactions\n- Introduce supporting characters, such as other students or teachers, who contribute to the plot and highlight Simon’s internal struggles. Use their interactions to advance the story and add emotional depth.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person perspective to explore Simon’s thoughts and emotions deeply. Balance action and introspection to provide a comprehensive view of his experiences and the unfolding mystery.\n\n#### Stylistic Elements\n- Employ reflective and introspective language to enhance the narrative. Use varied sentence structures and rich vocabulary to create impact, incorporating rhetorical devices like introspection and vivid descriptions.\n\n#### Tone and Mood Alignment\n- Maintain a tone that reflects the suspenseful and eerie themes of the prompt. Use word choices and recurring themes of loss, friendship, and justice to create a cohesive and emotionally resonant mood.\n</story_rules>",
    "<thinking>\nThe writing prompt presents a ghost trapped in a high school, who has been lying to other spirits about how to move on, fearing abandonment. The key thematic elements include fear of loneliness, deception, and the supernatural. The tone is likely to be reflective and tense, with potential for both introspection and conflict as the truth begins to unravel.\n\nThe user profile indicates a preference for starting stories with a reflective or conflict-driven tone, emphasizing unresolved internal struggles in the endings. The narrative structure is clear and cohesive, driven by the main character's introspection. The user introduces unique psychological elements and vivid imagery, often subverting common tropes by focusing on emotional and psychological impacts. Main characters are well-developed through reflections and interactions, with immersive settings and effective supporting characters. The language use is reflective and introspective, with a third-person perspective and a tone that aligns with the prompt's themes.\n\nCombining these insights, the Story Rules will guide the creation of a story that begins with a reflective tone, develops through introspection and conflict, and concludes with unresolved internal struggles. The narrative will include unique psychological elements, vivid imagery, and well-developed characters and settings, all conveyed through reflective and introspective language.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a reflective scene where the protagonist, the ghost, contemplates their existence and the lies they've told to other spirits. Establish a tone of tension and introspection, setting the stage for the central theme of fear and deception.\n\n#### Story Ending\n- Conclude with a sense of unresolved internal struggle. The protagonist should face the consequences of their lies, leaving them in a state of ongoing turmoil or reflection about their actions and the future.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end. Ensure a cohesive flow driven by the protagonist's introspection and interactions with other spirits. Transition smoothly between events, maintaining a logical progression and purposeful disruptions where relevant.\n\n---\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique psychological elements, such as the protagonist's fear of loneliness and the complex emotions tied to their deception. Add original details that build upon the supernatural setting, like specific ghostly abilities or unique interactions between spirits.\n\n#### Engaging Themes and Imagery\n- Use vivid imagery to capture the eerie and reflective mood of the high school setting. Engage with themes of fear, deception, and the desire for connection, drawing the reader into the protagonist's emotional and psychological state.\n\n#### Use of Tropes or Clichés\n- Subvert common ghost story tropes by focusing on the emotional and psychological impact of the protagonist's actions. Avoid clichés by adding depth to the protagonist's motivations and the consequences of their lies.\n\n---\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist through their reflections on their past life, their lies, and their fear of being left alone. Ensure their motivations and internal struggles are clear and well-established.\n\n#### Setting Establishment\n- Build an immersive high school setting with detailed descriptions of specific locations, like classrooms, hallways, and the places where the protagonist interacts with other spirits. Make the setting relevant and vivid, enhancing the story's eerie and reflective tone.\n\n#### Supporting Characters and Interactions\n- Introduce secondary spirits that complement the protagonist and contribute meaningfully to the plot. Use their interactions to add emotional depth, reveal the protagonist's lies, and advance the story.\n\n---\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person perspective to provide depth and balance between action and introspection. Ensure the tone aligns with the reflective and tense mood of the story, allowing for deep exploration of the protagonist's thoughts and emotions.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Use rhetorical devices like introspection, reflection, and vivid descriptions to create impact and convey the protagonist's emotional state.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the prompt's themes of fear, deception, and the supernatural. Use word choices and recurring themes of internal conflict and loneliness to reinforce this alignment, creating a cohesive and immersive narrative.\n</story_rules>",
    "<thinking>\nThe writing prompt presents a unique setting: a town where it's always winter but never Christmas. The central character, a young boy, decides to bring the holiday back despite the townsfolk's weariness and division. Key thematic elements include perseverance, hope, and community. The tone is likely to be a mix of somber and hopeful, with potential for both conflict and resolution.\n\nThe user profile indicates a preference for reflective and conflict-driven beginnings, unresolved or contemplative endings, and a clear narrative structure. The user’s stories often delve into psychological depth, with well-developed main characters and immersive settings. The language is introspective, with a third-person perspective and varied sentence structures.\n\nCombining these insights, the Story Rules will guide the creation of a narrative that starts with a reflective tone, develops the young boy’s motivations and the town’s atmosphere, and concludes with a sense of ongoing struggle or hope. The story will include unique elements and vivid imagery, subverting common tropes to add depth and originality.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a reflective scene where the young boy contemplates the perpetual winter and the absence of Christmas, setting a somber yet determined tone.\n- Introduce the central theme of hope and perseverance early on, perhaps through the boy’s internal monologue or a symbolic action, like him looking at an old, dusty Christmas ornament.\n\n#### Story Ending\n- Conclude with a sense of unresolved struggle or a glimmer of hope. The boy’s efforts to bring back Christmas should lead to a small but significant change, leaving room for future possibilities.\n- Reflect on the boy’s internal growth and the town’s subtle shift in attitude, emphasizing ongoing turmoil or the beginning of a transformation.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end, ensuring a cohesive flow driven by the boy’s introspection and actions.\n- Transition smoothly between the boy’s reflections, his interactions with the townsfolk, and the steps he takes to bring back Christmas, maintaining a logical progression.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique psychological and emotional elements, such as the boy’s memories of past Christmases or his dreams of a festive future, adding depth to his motivations.\n- Incorporate original details about the town’s history and the reasons behind the perpetual winter, creating a rich and immersive backdrop.\n\n#### Engaging Themes and Imagery\n- Use vivid imagery to depict the stark, cold town and the boy’s warm, hopeful vision of Christmas. Contrast the bleak winter landscape with colorful, nostalgic memories or dreams.\n- Explore themes of community, resilience, and the power of hope, engaging the reader through the boy’s journey and the townsfolk’s reactions.\n\n#### Use of Tropes or Clichés\n- Subvert common tropes by focusing on the emotional and psychological impact of the boy’s quest. Avoid clichéd resolutions by emphasizing the ongoing nature of his struggle and the gradual change in the town’s atmosphere.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the young boy through his reflections, interactions, and clear motivations. Show his determination and hope despite the town’s weariness and division.\n- Highlight his internal conflicts and growth, making him a relatable and compelling protagonist.\n\n#### Setting Establishment\n- Build an immersive setting with detailed descriptions of the town’s perpetual winter, the absence of Christmas decorations, and the townsfolk’s weary demeanor.\n- Use specific details and interactions to make the setting relevant and vivid, enhancing the story’s atmosphere.\n\n#### Supporting Characters and Interactions\n- Introduce supporting characters that reflect the town’s division and weariness, such as skeptical neighbors or a nostalgic elder who remembers past Christmases.\n- Use interactions to advance the plot and highlight the boy’s impact on the community, adding emotional depth and social dynamics.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person perspective to explore the boy’s thoughts and emotions deeply. Balance action and introspection to create a rich narrative.\n- Employ dialogue and monologue effectively to convey the boy’s internal conflict and emotional state, enhancing the story’s depth.\n\n#### Stylistic Elements\n- Utilize varied sentence structures and rich vocabulary to enhance the narrative. Include reflective and introspective language to align with the user’s style.\n- Incorporate rhetorical devices like symbolism and vivid descriptions to create impact and convey the story’s themes.\n\n#### Tone and Mood Alignment\n- Maintain a tone that reflects the prompt’s themes of hope and perseverance amidst a somber setting. Use word choices and recurring themes to reinforce this alignment.\n- Ensure the mood transitions from reflective and somber to cautiously hopeful, mirroring the boy’s journey and the town’s subtle transformation.\n\n</story_rules>"
]