[
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet to identify key storytelling elements and techniques. The prompt involves a post-apocalyptic setting with themes of loss, hope, and memory, which align well with the author's style of exploring past and present tensions, internal conflicts, and speculative elements. I will create rules that incorporate these elements, ensuring they are actionable and detailed, with examples inspired by the author's previous works. The rules will be organized into the categories of Plot, Creativity, Development (Character and Setting), and Language Use, each tailored to the prompt's narrative potential.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the narrative around Jonas's internal conflict between accepting the loss of his loved ones and clinging to hope. Use his journey through the graveyard as a metaphor for this struggle, similar to how Mikkel's drawings bridge past and present.  \n  - Introduce speculative elements, such as Jonas encountering surreal visions or echoes of his past, to explore themes of identity and reality. For example, Jonas might see fleeting images of his family in the mist, questioning their reality.  \n  - Employ a non-linear narrative structure, using flashbacks to reveal Jonas's memories of his loved ones, enhancing the story's complexity. These flashbacks should interweave with his present journey, much like Shauna's memories of Jackie.  \n  - Resolve the narrative with Jonas in a state of introspection, leaving the question of his loved ones' fate open-ended. This mirrors the unresolved tension seen in Michael's story about discerning reality from dreams.  \n\n- **Creativity**:  \n  - Blend genres by incorporating speculative fiction elements into the character-driven narrative. For instance, Jonas might find a mysterious artifact in the graveyard that triggers memories or visions, adding a unique twist to his journey.  \n  - Reinterpret the prompt by focusing on Jonas's psychological and emotional dimensions, rather than external action. His internal monologue should reflect his struggle with hope and despair, akin to Michael's internal struggle with meeting his younger self.  \n  - Use metaphorical elements, such as the graveyard symbolizing Jonas's mindscape, to deepen the narrative's thematic resonance. The names on the gravestones could represent different aspects of his identity and past.  \n  - Explore the concept of duality by presenting parallel realities or identities. Jonas might imagine alternate lives where his loved ones survived, enriching the narrative with his internal conflict and desires.  \n\n- **Development (Character and Setting)**:  \n  - Develop Jonas through his internal conflicts and emotional arcs, focusing on his introspection as he navigates the graveyard. His character should evolve as he confronts memories and hopes.  \n  - Create an immersive setting that reflects Jonas's emotional state and thematic concerns. The graveyard should be described in a way that mirrors his feelings of loss and hope, similar to the nature hike setting reflecting interpersonal conflicts.  \n  - Use Jonas's relationships with his lost loved ones to explore his identity and personal growth. Flashbacks or visions of interactions with his best friend, family, and Martha should highlight his struggle to move forward.  \n  - Contrast Jonas's past and present selves to highlight his development and internal conflicts. His memories of happier times should underscore his current despair and hope.  \n\n- **Language Use**:  \n  - Employ vivid, sensory imagery to create an immersive atmosphere and convey Jonas's emotions. Describe the graveyard's sights, sounds, and smells to reflect his internal state, much like the sensory details in the nature hike story.  \n  - Use introspective and reflective language to explore Jonas's internal thoughts and emotions. His reflections on the names he sees should reveal his hopes and fears, similar to Taissa's introspection about her achievements.  \n  - Use a conversational tone in Jonas's internal monologue to create a realistic and relatable character interaction with himself. This should capture his internal dialogue and emotional tension.  \n  - Employ varied sentence structures to enhance the narrative's pacing and emotional impact. Use short, fragmented sentences to convey Jonas's moments of despair and longer, flowing sentences for his hopeful reflections.  \n  - Use metaphor and symbolism to enrich the narrative's thematic depth. The graveyard itself can serve as a metaphor for Jonas's struggle with identity and memory, much like Mikkel's drawings.  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves ghosts trapped in an afterlife setting, which naturally lends itself to themes of memory, identity, and unresolved tension—elements the author frequently explores. The narrative should incorporate the tension between past and present, internal conflicts, and speculative elements, as highlighted in the Author Writing Sheet. The setting of an old high school provides a rich backdrop for exploring characters' emotional states and past relationships. Language should be vivid and introspective, with a conversational tone in dialogue to reflect the characters' interactions. I will create detailed, actionable Story Rules that incorporate these elements, ensuring they are tailored to the Writing Prompt.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:  \n  - Structure the narrative around the tension between the past and present. Use the high school setting as a bridge between the characters' past lives and their current existence in the afterlife. For example, have a character recall a pivotal high school event that influences their current ghostly predicament.\n  - Introduce internal conflicts that drive the narrative. Focus on the emotional and psychological struggles of the ghosts, such as the resentment and jealousy stirred by one ghost's escape. Highlight a character's internal debate about breaking the rules to escape.\n  - Resolve the narrative by leaving characters in a state of introspection or unresolved tension. For instance, end with a character contemplating the consequences of their actions, leaving their fate ambiguous.\n  - Incorporate speculative elements to explore themes of identity and reality. Use the concept of the afterlife to question what it means to truly 'move on' or 'cross over.'\n  - Employ a non-linear narrative structure. Use flashbacks to reveal key moments from the characters' high school days that impact their current situation, such as a past betrayal or unfulfilled dream.\n\n- **Creativity**:  \n  - Blend genres by incorporating elements of speculative fiction into the character-driven narrative. Use the supernatural setting to explore deeper themes of identity and belonging.\n  - Reinterpret the prompt by focusing on the psychological and emotional dimensions of being trapped in the afterlife. Highlight a character's internal struggle with the temptation to break the rules.\n  - Integrate imaginative elements to explore themes of identity and self-discovery. For example, have a character discover a hidden talent or aspect of themselves that they never realized in life.\n  - Use metaphorical or symbolic elements to deepen the narrative's thematic resonance. For instance, the high school could symbolize the characters' unfinished business or unresolved issues.\n  - Explore the concept of duality by using parallel realities or identities. Show how the characters' past and present selves conflict or align, enriching the narrative.\n\n- **Development (Character and Setting)**:  \n  - Develop characters through their internal conflicts and emotional arcs. Focus on introspection, such as a character reflecting on their life choices and how they led to their current state.\n  - Create an immersive setting that reflects the characters' emotional states. Use the high school environment to mirror their feelings of nostalgia, regret, or longing.\n  - Use relationships to explore characters' identities and personal growth. Highlight how past friendships or rivalries influence their current interactions as ghosts.\n  - Contrast characters' past and present selves to highlight their development and internal conflicts. For example, show how a character's high school persona differs from their ghostly self.\n  - Use dialogue and interactions to reveal characters' motivations and emotional states. Craft conversations that capture the tension and camaraderie among the ghosts.\n\n- **Language Use**:  \n  - Employ vivid, sensory imagery to create an immersive atmosphere. Describe the eerie, nostalgic feel of the high school, using details like the echo of footsteps in empty hallways or the smell of old textbooks.\n  - Use introspective and reflective language to explore characters' internal thoughts and emotions. Capture a character's inner monologue as they grapple with their desires and fears.\n  - Use a conversational tone in dialogue to create realistic and relatable character interactions. Reflect the ghosts' shared history and current dynamics through their speech.\n  - Employ varied sentence structures to enhance the narrative's pacing and emotional impact. Use short, abrupt sentences to convey tension or longer, flowing sentences for introspection.\n  - Use metaphor and symbolism to enrich the narrative's thematic depth. For example, describe the high school as a 'prison of memories' to symbolize the characters' entrapment in the past.  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet to identify key storytelling elements that can be adapted to this narrative. The prompt involves themes of ghosts, uncovering secrets, and a decades-old tragedy, which align well with the author's style of exploring past and present tensions, internal conflicts, and speculative elements. I will create rules that incorporate these elements, ensuring they reflect the author's unique style while being tailored to the prompt's themes.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative around the tension between Simon's current life and the past tragedy that haunts the school. Use Simon's memories of Maddie to bridge these timelines, creating a dual narrative that explores both the present and the past.\n  - Introduce internal conflicts for Simon, focusing on his struggle to accept the reality of Maddie's ghost and the implications of the other spirits. This internal tension should drive the narrative forward, as Simon grapples with fear, guilt, and the need to help his friend.\n  - Resolve the story by leaving Simon in a state of introspection or unresolved tension. For example, after uncovering the truth, Simon might still question his own reality or feel haunted by the knowledge of the school's dark history.\n  - Incorporate speculative elements, such as the ghosts and the mystery of the stolen body, to explore deeper themes of identity and reality. Use these elements to symbolize Simon's internal conflict and his quest for truth.\n  - Employ a non-linear narrative structure, using flashbacks to reveal the events leading to the tragedy. These flashbacks can be triggered by Simon's interactions with the ghosts or his own memories of Maddie.\n\n- **Creativity**:\n  - Blend genres by incorporating elements of horror and mystery into a character-driven narrative. Use the supernatural aspects to add a unique twist to Simon's journey of self-discovery and friendship.\n  - Reinterpret the prompt by focusing on Simon's psychological and emotional dimensions, such as his fear of losing Maddie again and his determination to help her. This approach should prioritize internal struggles over external action.\n  - Integrate imaginative elements, like the ghosts' ability to influence the living world, to explore themes of identity and self-discovery. For instance, Simon might learn something about himself through his interactions with the spirits.\n  - Use metaphorical or symbolic elements to deepen the narrative's thematic resonance. Maddie's ghost could symbolize unresolved guilt or the weight of past mistakes that Simon must confront.\n  - Explore the concept of duality by presenting parallel realities or identities, such as Simon's life before and after discovering the truth about Maddie and the other ghosts.\n\n- **Development (Character and Setting)**:\n  - Develop Simon's character through his internal conflicts and emotional arc, focusing on his introspection about friendship, loss, and courage. His growth should be evident as he confronts the school's secrets.\n  - Create an immersive setting that reflects the characters' emotional states and thematic concerns. The school should feel eerie and oppressive, mirroring Simon's fear and the ghosts' unrest.\n  - Use relationships to explore Simon's identity and personal growth. His bond with Maddie, both past and present, should highlight his struggle to move forward and his loyalty to his friend.\n  - Contrast Simon's past and present selves to highlight his development and internal conflicts. His memories of Maddie before her death should underscore his current determination to help her.\n  - Use dialogue and interactions to reveal characters' motivations and emotional states. Conversations with Maddie's ghost and other spirits should uncover their desires and the tragedy's impact on them.\n\n- **Language Use**:\n  - Employ vivid, sensory imagery to create an immersive atmosphere and convey Simon's emotions. Describe the cold chill of a ghostly presence or the oppressive silence of the haunted school.\n  - Use introspective and reflective language to explore Simon's internal thoughts and emotions. His reflections on Maddie's death and the unfolding mystery should be conveyed through thoughtful, poignant language.\n  - Use a conversational tone in dialogue to create realistic and relatable character interactions. Simon's conversations with Maddie should capture the mix of fear, nostalgia, and urgency.\n  - Employ varied sentence structures to enhance the narrative's pacing and emotional impact. Use short, abrupt sentences to convey moments of fear or tension, and longer, flowing sentences for introspection.\n  - Use metaphor and symbolism to enrich the narrative's thematic depth. The school's haunting could symbolize the weight of history and the need to confront the past to move forward.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt \"Trapped as a ghost in the high school where you died, you’ve spent decades lying to the other spirits about how to move on, fearing the day they’d leave you behind—until they start figuring out the truth,\" I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The author’s style emphasizes the tension between past and present, internal conflicts, speculative elements, and introspective resolutions. These elements will be crucial in crafting a narrative that explores the ghost's internal struggle and the unfolding truth. The author’s use of non-linear narratives, metaphorical elements, and vivid imagery will guide the creation of a story that is both immersive and emotionally resonant. I will ensure that the rules reflect these stylistic traits while being tailored to the ghostly theme of the Writing Prompt.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:  \n  - Structure the narrative around the tension between the ghost's past life and its current existence in the high school. Use memories of the ghost's life and death to create a bridge between past and present, similar to Mikkel's drawings. For example, the ghost might recall specific events from its life that are triggered by interactions with the other spirits.\n  - Introduce internal conflicts that drive the narrative, focusing on the ghost's emotional and psychological struggles with the fear of being left behind. This mirrors Michael's internal conflict about meeting his younger self. For instance, the ghost might grapple with guilt and loneliness as the other spirits begin to uncover the truth.\n  - Resolve the narrative by leaving the ghost in a state of introspection or unresolved tension, rather than providing a clear resolution. Reflect the ongoing internal struggle, akin to Michael's fear of losing his family again. The ghost might end the story contemplating its own path to moving on.\n  - Incorporate speculative or surreal elements to explore deeper themes of identity and reality. Use the ghostly existence and the high school setting as metaphors for the ghost's internal conflict and uncertainty about its place in the afterlife.\n  - Employ a non-linear narrative structure, using flashbacks or shifts in time to enhance the story's complexity. Interweave the ghost's memories of life with its current interactions with the other spirits, similar to Shauna's memories of Jackie.\n\n- **Creativity**:  \n  - Blend genres by incorporating elements of speculative fiction into the character-driven narrative. Use the ghostly theme to add a unique twist to the exploration of personal identity and loss, as seen in the story of shifting realities.\n  - Reinterpret the prompt in an unconventional way, focusing on the psychological and emotional dimensions of the ghost's situation. Highlight the ghost's internal struggle and the emotional weight of its choices, rather than external action.\n  - Integrate imaginative elements to explore themes of identity and self-discovery. For example, the ghost might use its spectral abilities to uncover hidden truths about its past life and death.\n  - Use metaphorical or symbolic elements to deepen the narrative's thematic resonance. The high school could symbolize the ghost's inability to move on, much like Mikkel's drawings symbolize his attempt to hold onto his past.\n  - Explore the concept of duality, using parallel realities or identities to enrich the narrative. The ghost's dual existence as both a former student and a spirit can reflect its internal conflict and the duality of its desires.\n\n- **Development (Character and Setting)**:  \n  - Develop the ghost character through its internal conflicts and emotional arcs, focusing on introspection. Highlight the ghost's struggle with its identity and the fear of being left behind, similar to Taissa's internal struggle.\n  - Create an immersive setting that reflects the ghost's emotional state and thematic concerns. The high school should mirror the ghost's feelings of entrapment and nostalgia, akin to the challenging hike setting.\n  - Use relationships with other spirits to explore the ghost's identity and personal growth. The interactions with other spirits can highlight the ghost's struggle to move forward, much like Shauna's relationship with Jeff and Jackie.\n  - Contrast the ghost's past and present selves to highlight its development and internal conflicts. The ghost's memories of its life can underscore its growth and ongoing struggle, similar to Michael's encounter with his younger self.\n  - Use dialogue and interactions to reveal the ghost's motivations and emotional states. The conversations with other spirits can reveal the ghost's fear and loneliness, akin to the dialogue between Jessica and her friends.\n\n- **Language Use**:  \n  - Employ vivid, sensory imagery to create an immersive atmosphere and convey the ghost's emotions. Describe the high school in detail, using sensory details to evoke the ghost's nostalgia and longing, similar to the descriptions of the nature hike.\n  - Use introspective and reflective language to explore the ghost's internal thoughts and emotions. Convey the ghost's introspection about its past life and current existence through reflective language, as seen in Taissa's story.\n  - Use a conversational tone in dialogue to create realistic and relatable character interactions. Capture the tension and awkwardness in the ghost's conversations with other spirits, similar to the dialogue between Shauna and Jeff.\n  - Employ varied sentence structures to enhance the narrative's pacing and emotional impact. Reflect the ghost's fluctuating emotions and the story's tension through varied sentence structures, as seen in Michael's story.\n  - Use metaphor and symbolism to enrich the narrative's thematic depth. The ghost's existence and the high school setting can serve as metaphors for its struggle with identity and memory, similar to Mikkel's drawings.  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a young boy in a perpetually wintry town attempting to bring back Christmas, despite the townsfolk's reluctance. This scenario offers rich potential for exploring themes of memory, identity, and internal conflict, which are central to the author's style.\n\n**Plot**: The author often uses memory and the tension between past and present as pivotal elements. For this story, the boy's memories of Christmas could serve as a bridge between the past and the present, driving the narrative. The internal conflict of the townsfolk, who may have reasons for resisting Christmas, can create narrative tension. The story might end with introspection or unresolved tension, reflecting the ongoing struggle to reconcile past traditions with present realities.\n\n**Creativity**: The author blends speculative elements with character-driven narratives. The perpetual winter could be a speculative element symbolizing the town's emotional state. The boy's quest to bring back Christmas can be reinterpreted to focus on the psychological and emotional dimensions, such as his internal struggle with the town's resistance and his own memories of the holiday.\n\n**Development (Character and Setting)**: Characters are developed through internal conflicts and emotional arcs. The boy's determination and introspection can drive his development, while the town's setting—a cold, unchanging winter—mirrors the emotional state of its inhabitants. Relationships, such as the boy's interactions with townsfolk, can explore themes of identity and personal growth.\n\n**Language Use**: The author uses vivid imagery and introspective language. Descriptions of the wintry town should be immersive, conveying both the physical cold and the emotional chill. The boy's internal thoughts and emotions can be explored through reflective language, while dialogue with townsfolk can reveal their motivations and emotional states.\n\nUsing these insights, I will craft detailed Story Rules that guide the narrative to align with the Writing Prompt while reflecting the author's unique style.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:  \n  - Structure the narrative around the tension between the boy's memories of Christmas and the town's current state. Use his memories as a pivotal element to drive the story forward. For example, the boy might recall a specific Christmas tradition that he wants to revive, which serves as a bridge between his past experiences and the present situation.\n  - Introduce internal conflicts among the townsfolk, focusing on their emotional and psychological struggles with the idea of Christmas. Perhaps some townspeople have painful memories associated with the holiday, creating a central tension in the story.\n  - Resolve the narrative by leaving the boy and the townsfolk in a state of introspection or unresolved tension. For instance, the story might end with the boy contemplating the impact of his actions, leaving the future of Christmas in the town uncertain.\n  - Incorporate speculative elements, such as the perpetual winter, to explore deeper themes of identity and reality. This could symbolize the town's emotional stagnation and resistance to change.\n  - Use a non-linear narrative structure, incorporating flashbacks to past Christmases that highlight the contrast between then and now, enhancing the story's complexity.\n\n- **Creativity**:  \n  - Blend speculative fiction elements with a character-driven narrative. The perpetual winter can be a unique twist that adds depth to the exploration of the town's identity and emotional state.\n  - Reinterpret the prompt by focusing on the psychological and emotional dimensions of the boy's quest. Highlight his internal struggle with the town's resistance and his own longing for the holiday.\n  - Integrate imaginative elements, such as the boy's creative attempts to bring back Christmas, to explore themes of identity and self-discovery. Perhaps he creates a symbolic representation of Christmas that challenges the townsfolk's perceptions.\n  - Use metaphorical or symbolic elements to deepen the narrative's thematic resonance. The winter could symbolize the emotional coldness of the town, while the boy's efforts to bring back Christmas represent warmth and hope.\n  - Explore the concept of duality, using the contrast between the boy's memories and the town's current state to enrich the narrative.\n\n- **Development (Character and Setting)**:  \n  - Develop the boy's character through his internal conflicts and emotional arc, focusing on his introspection about the town's resistance and his memories of Christmas.\n  - Create an immersive setting that reflects the characters' emotional states and thematic concerns. The cold, unchanging winter should mirror the emotional chill and division among the townsfolk.\n  - Use relationships, such as the boy's interactions with various townsfolk, to explore themes of identity and personal growth. These interactions can reveal different perspectives on the holiday and the town's history.\n  - Contrast the boy's past and present self to highlight his development and internal conflicts. His memories of past Christmases can underscore his growth and determination.\n  - Use dialogue and interactions to reveal characters' motivations and emotional states. Conversations with townsfolk can uncover their reasons for resisting Christmas and their personal struggles.\n\n- **Language Use**:  \n  - Employ vivid, sensory imagery to create an immersive atmosphere. Describe the biting cold, the crunch of snow underfoot, and the stark, barren landscape to convey the town's emotional state.\n  - Use introspective and reflective language to explore the boy's internal thoughts and emotions. His reflections on past Christmases and his current quest should be rich in emotional depth.\n  - Use a conversational tone in dialogue to create realistic and relatable character interactions. The boy's conversations with townsfolk should capture the tension and hope of his mission.\n  - Employ varied sentence structures to enhance the narrative's pacing and emotional impact. Use shorter sentences to convey urgency and longer, reflective passages for introspection.\n  - Use metaphor and symbolism to enrich the narrative's thematic depth. The perpetual winter can symbolize the town's emotional stagnation, while the boy's efforts to bring back Christmas represent a thawing of hearts.  \n</story_rules>"
]