[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a humorous and potentially romantic scenario with elements of fantasy and surprise. The rules will need to guide the narrative towards a light-hearted exploration of the protagonist's obliviousness and the girlfriend's vampire nature, culminating in a comedic or heartwarming revelation. The examples will illustrate how to incorporate these elements effectively, ensuring the story remains engaging and true to the prompt's themes.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a series of everyday interactions between you and your girlfriend, highlighting your obliviousness to her vampire nature. Use humorous situations where her vampiric traits are subtly hinted at but go unnoticed by you. For example, describe a dinner date where she insists on ordering rare steak and you think it's just a quirky preference.\n  - Develop the plot through a series of escalating events that bring you closer to discovering the truth, such as noticing her aversion to sunlight or her peculiar sleeping habits. Use these moments to build comedic tension and curiosity.\n  - Conclude the story with a humorous or heartwarming revelation of both her vampire identity and your immunity. Ensure the resolution is satisfying and reinforces the bond between you and your girlfriend, such as a scene where she finally confesses, and you respond with a light-hearted acceptance.\n\n- **Creativity**:\n  - Incorporate elements of fantasy and humor to explore the unique dynamics of your relationship. Use creative scenarios that play on vampire tropes, such as her avoiding garlic or mirrors, and your oblivious interpretations of these actions.\n  - Introduce unexpected twists that add depth to the narrative, such as a scene where you accidentally thwart a vampire hunter's plan without realizing it, thinking it's just a prank or misunderstanding.\n\n- **Development (Character and Setting)**:\n  - Develop your character as endearingly oblivious yet caring, using internal monologue and interactions to reveal your personality. Highlight your genuine affection for your girlfriend, even as you remain unaware of her true nature.\n  - Portray your girlfriend as a charming and slightly mischievous vampire, using her actions and dialogue to hint at her supernatural traits. For example, describe her playful attempts to hide her fangs or her quick reflexes during a game of catch.\n  - Create a setting that blends everyday life with subtle supernatural elements, such as a cozy apartment with blackout curtains or a favorite nighttime hangout spot. Use these details to enhance the story's atmosphere and support the narrative.\n\n- **Language Use**:\n  - Employ a light-hearted and humorous tone, using witty dialogue and playful descriptions to create an engaging narrative. Use phrases that reflect your obliviousness, such as \"I always thought she just had a thing for night shifts.\"\n  - Use vivid imagery and sensory details to bring scenes to life, especially during moments of near-revelation. For example, describe the eerie yet beautiful glow of her eyes in the moonlight, which you dismiss as a trick of the light.\n  - Craft natural and revealing dialogue that reflects the dynamics of your relationship and advances the plot. Use rhetorical devices like irony and understatement to enhance the comedic elements of the story.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The prompt involves themes of mystery, horror, and emotional complexity, requiring a balance of suspense and character-driven narrative. The rules must guide the LLM to create a story that explores the protagonist's emotional turmoil, the mystery of the wife's return, and the implications of her unexplained survival. The examples will illustrate how to build tension, develop characters, and use language to convey the story's eerie and emotional tone.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's emotional state, reflecting on the loss and the impact of the wife's death. Use this to set the stage for the shocking revelation at the door.\n  - Develop the plot through a series of tense and emotional interactions between the protagonist and the wife. Use the wife's explanation as a central mystery, gradually revealing details that deepen the intrigue.\n  - Conclude the story with a twist that challenges the protagonist's understanding of reality and their relationship. Ensure the ending leaves room for interpretation, maintaining the story's suspenseful and mysterious tone.\n  - Example: Start with the protagonist sitting in a dimly lit room, surrounded by reminders of their wife, when the doorbell rings, leading to the shocking encounter.\n\n- **Creativity**:\n  - Incorporate elements of horror and mystery, using the wife's unexplained return to explore themes of life, death, and the supernatural. Use creative descriptions to enhance the eerie atmosphere.\n  - Introduce unexpected plot developments, such as the wife's cryptic hints about her survival and the presence of otherworldly forces. Use these elements to add depth and complexity to the narrative.\n  - Example: Describe the wife's eyes as having an unnatural glow, hinting at a supernatural influence without explicitly revealing the source.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a deeply emotional and conflicted character, using internal monologue to convey their turmoil and confusion. Highlight their struggle to reconcile the wife's return with their grief.\n  - Portray the wife as enigmatic and slightly unsettling, using her behavior and dialogue to create tension and mystery. Ensure her character remains ambiguous, leaving the reader questioning her true nature.\n  - Create a setting that reflects the story's tone, using dim lighting, shadows, and atmospheric details to enhance the sense of unease and suspense.\n  - Example: Use the setting of the protagonist's home, filled with memories of the wife, to contrast with the unsettling presence of the returned wife.\n\n- **Language Use**:\n  - Employ a tense and atmospheric tone, using descriptive language to create vivid imagery and convey the story's emotional depth. Use sensory details to immerse the reader in the protagonist's experience.\n  - Use dialogue to reveal character dynamics and advance the plot, ensuring it reflects the tension and mystery of the situation. Incorporate pauses and hesitations to convey the characters' emotional states.\n  - Example: Use phrases like \"Her voice was both familiar and foreign, sending chills down my spine,\" to convey the protagonist's conflicted emotions and the story's eerie tone.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize a blend of humor, unexpected twists, and the integration of fantastical elements into everyday scenarios. The rules should guide the narrative to explore the humorous and unexpected consequences of a wish gone awry, while maintaining a light-hearted and engaging tone. The examples should illustrate how to incorporate these elements effectively, ensuring the story remains cohesive and entertaining.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist making a wish on a shooting star, setting the stage for an unexpected and humorous twist. Use a direct and engaging opening to draw the reader into the narrative.\n  - Develop the plot around the sudden arrival of a UFO and the ensuing chaos. Use this event to explore themes of unexpected consequences and the humorous clash between mundane life and the extraordinary.\n  - Conclude the story with a resolution that ties back to the original wish, using a humorous or ironic twist to highlight the protagonist's new understanding of their desires. For example, the protagonist might find themselves in a comical situation where they have to explain the UFO to their neighbors.\n\n- **Creativity**:\n  - Blend elements of science fiction and comedy to create a whimsical and engaging narrative. Use the UFO and its occupants as a source of humor and unexpected developments.\n  - Incorporate imaginative scenarios that explore the consequences of the wish, such as the protagonist attempting to communicate with the alien occupants or dealing with the aftermath of the crash.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and humorous character, using their reactions and interactions to drive the narrative. Highlight their initial excitement and subsequent confusion as the situation unfolds.\n  - Create a vivid setting that contrasts the ordinary with the extraordinary, such as a typical suburban neighborhood disrupted by the UFO crash. Use specific details to enhance the atmosphere and highlight the absurdity of the situation.\n\n- **Language Use**:\n  - Employ a conversational and humorous tone, using witty dialogue and playful descriptions to create an engaging and entertaining narrative. Use rhetorical questions and casual expressions to enhance the relatability of the story.\n  - Use vivid imagery and sensory details to bring the setting and characters to life, creating a dynamic and immersive reading experience. For example, describe the UFO's appearance and the reactions of the protagonist and their neighbors in detail.\n  - Incorporate playful and humorous language to convey the protagonist's bewilderment and the whimsical nature of the story. Use direct and engaging language to maintain a lively and fast-paced narrative.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The prompt involves a mysterious and potentially dark family secret, which suggests a narrative that combines suspense, revelation, and emotional depth. The rules will need to guide the creation of a story that builds tension and curiosity, leading to a significant and possibly unsettling revelation. The examples will illustrate how to effectively convey the protagonist's emotional journey and the atmosphere of mystery and suspense.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a depiction of the protagonist's routine experience of being locked in the basement, emphasizing the normalcy and love in their family life. Use this to establish a sense of mystery and tension.\n  - Develop the plot by gradually revealing clues about the parents' actions and the protagonist's growing curiosity. Use a series of small discoveries or overheard conversations to build suspense.\n  - Conclude with a dramatic revelation that explains the parents' actions, ensuring it is both surprising and emotionally impactful. For example, reveal that the parents are protecting the protagonist from a family curse that manifests on the first Monday of each month.\n\n- **Creativity**:\n  - Incorporate elements of mystery and suspense, using the basement setting to create an atmosphere of intrigue. Use creative descriptions to enhance the sense of the unknown, such as describing the basement as \"a place of shadows and whispers.\"\n  - Introduce a unique twist in the revelation that adds depth to the family dynamic. For example, the protagonist might discover they have a hidden ability or connection to a supernatural lineage.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a curious and determined individual, using their internal monologue to convey their thoughts and emotions. Highlight their relationship with their parents, showing both love and a desire for understanding.\n  - Create a vivid setting by describing the basement in detail, using sensory language to evoke its atmosphere. For example, describe the \"cold, damp air and the faint smell of earth\" to enhance the mood.\n  - Portray the parents as loving but secretive, using their actions and dialogue to hint at their protective motives.\n\n- **Language Use**:\n  - Employ a tone that balances warmth and suspense, using descriptive language to create a sense of mystery. Use phrases that evoke curiosity and tension, such as \"the creak of the basement door echoed like a secret waiting to be uncovered.\"\n  - Use dialogue to reveal character dynamics and advance the plot. For example, include a conversation where the parents express their love and concern, adding layers to their actions.\n  - Maintain a first-person perspective to create intimacy and immediacy, allowing readers to connect with the protagonist's experiences and emotions.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize a blend of humor, unexpected twists, and character-driven narratives. They also highlight the importance of vivid settings and dynamic character interactions. For the new prompt, I will focus on creating a narrative that explores the protagonist's journey through alternate universes, emphasizing the unexpected deviations in historical events and the realization of being lost in multiverses. The rules will guide the LLM to create a story that is both engaging and reflective of the protagonist's internal and external conflicts, using a mix of humor and introspection. I will ensure the rules are detailed, actionable, and include examples that align with the prompt's themes and objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's excitement and anticipation as they prepare to use their time machine for the first time. Describe their motivations and the historical events they wish to witness, such as the signing of the Declaration of Independence or the fall of the Berlin Wall.\n  - Develop the plot by detailing the protagonist's experiences as they arrive at each historical event, only to find unexpected deviations. For example, describe how the signing of the Declaration of Independence is interrupted by a futuristic parade.\n  - Introduce the realization that the machine is not a time machine but a multiverse travel device. Use a pivotal moment, such as encountering a version of themselves in an alternate universe, to highlight this discovery.\n  - Conclude the story with the protagonist's determination to find their way back home, using their ingenuity and newfound understanding of the multiverse. Ensure the ending is open-ended, suggesting further adventures or challenges.\n\n- **Creativity**:\n  - Use the concept of multiverse travel to explore imaginative and unexpected variations of historical events. For example, depict a universe where dinosaurs coexist with humans during the Renaissance.\n  - Incorporate elements of humor and irony, such as the protagonist's initial confidence in their invention contrasted with the chaotic and unpredictable outcomes of their travels.\n  - Introduce unique and whimsical universes that challenge the protagonist's perceptions and adaptability, such as a world where gravity works in reverse or where everyone communicates through dance.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a curious and resourceful individual, driven by a desire to explore and understand the world. Use their internal monologue to reveal their thoughts and emotions as they navigate the multiverse.\n  - Create dynamic settings that reflect the deviations in historical events and the unique characteristics of each universe. Use vivid descriptions to immerse the reader in each new world, highlighting the contrasts and similarities to the protagonist's original universe.\n  - Introduce secondary characters in each universe who provide insight or assistance to the protagonist, such as a wise historian in a world where history is recorded through holograms.\n\n- **Language Use**:\n  - Employ a conversational and engaging tone, using humor and introspection to convey the protagonist's journey and experiences. Use phrases like \"I couldn't believe my eyes\" to express surprise and wonder.\n  - Use descriptive language to create vivid imagery of the alternate universes and historical deviations. For example, describe the vibrant colors and sounds of a universe where music is a form of currency.\n  - Craft dialogue that reflects the unique cultures and perspectives of each universe, using it to advance the plot and reveal character dynamics. Ensure the language is accessible and relatable, enhancing the story's appeal and engagement.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a genie offering infinite, benevolent wishes, which suggests themes of abundance, trust, and the exploration of desires without the typical constraints or consequences associated with wish-granting. The rules will need to guide the narrative towards exploring the implications of such limitless potential, focusing on the character's journey and the positive outcomes of their wishes. I will ensure the rules are detailed, actionable, and include examples that align with the prompt's themes and tone, as demonstrated in the few-shot examples.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's initial reaction to the genie’s offer of infinite, benevolent wishes. Use this moment to establish the protagonist's personality and initial desires. For example, have the protagonist express disbelief or excitement, setting the stage for their journey.\n  - Develop the plot by exploring a series of wishes that reflect the protagonist's evolving understanding of their desires and values. Ensure each wish leads to a positive and meaningful outcome, highlighting the transformative power of the genie’s offer. For instance, the protagonist might wish for world peace, leading to a global celebration of unity.\n  - Conclude the narrative with a reflection on the protagonist's growth and the impact of their wishes on their life and the world. Use this resolution to emphasize themes of gratitude, fulfillment, and the responsible use of power.\n\n- **Creativity**:\n  - Incorporate imaginative and unexpected wishes that challenge traditional narratives of wish-granting. Use the genie’s benevolent nature to explore creative scenarios that highlight the protagonist's unique perspective. For example, the protagonist might wish for a library that contains every book ever written, leading to a magical journey through literature.\n  - Use the infinite nature of the wishes to explore diverse and fantastical settings, characters, and experiences. Ensure each wish adds depth and richness to the narrative, enhancing the story's sense of wonder and possibility.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a multidimensional character with clear motivations and a dynamic emotional arc. Use their wishes to reveal their personality, values, and growth. For instance, the protagonist might start with self-centered wishes but gradually shift towards altruistic desires.\n  - Create a vivid and immersive setting that reflects the magical and limitless nature of the genie’s offer. Use detailed descriptions to bring the genie's world to life, such as a lamp that transforms into a grand palace with each wish, symbolizing the expansion of possibilities.\n\n- **Language Use**:\n  - Employ a warm and optimistic tone, using language that reflects the positive and transformative nature of the genie’s offer. Use dialogue to convey the protagonist's evolving relationship with the genie and their growing understanding of their desires.\n  - Use vivid and descriptive language to create a sense of wonder and magic, enhancing the narrative's emotional impact. For example, describe the genie’s appearance and the magical effects of the wishes with rich sensory details, such as \"The air shimmered with golden light as the genie spoke, each word a promise of endless possibilities.\"\n  - Maintain a dynamic pacing that balances introspection with action, ensuring the story remains engaging and emotionally resonant throughout.\n</story_rules>"
]