[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided follow a clear structure with categories: **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contains detailed, actionable rules that guide the narrative process. The rules are written in the second person and provide specific instructions without comparative or relative terms.\n\nFor the new writing prompt, the rules should focus on the dramatic and humorous elements of the prophecy and the over-preparation of the people. The narrative should explore the Great Evil's reaction to the unexpected resistance and the dynamics between the characters involved.\n\n<story_rules>\n- **Plot**:\n  - Start the story with the Great Evil awakening, emphasizing his initial confusion and surprise at the overwhelming resistance.\n  - Develop the narrative around the Great Evil's attempts to navigate and overcome the various defenses set up by the people.\n  - Include moments of humor and irony as the Great Evil encounters the over-prepared defenses, highlighting the absurdity of the situation.\n  - Conclude the story with a twist that either sees the Great Evil finding an unexpected way to escape or being humorously thwarted by the people's preparations.\n\n- **Creativity**:\n  - Use humor and irony to highlight the contrast between the Great Evil's expectations and the reality of the situation.\n  - Incorporate imaginative descriptions of the defenses, such as the automated holy turrets and the evil containment system, to create a vivid and engaging setting.\n  - Explore the Great Evil's personality and reactions in a unique and creative way, emphasizing his frustration and bewilderment.\n\n- **Development (Character and Setting)**:\n  - Develop the Great Evil as a multidimensional character, using internal monologue and dialogue to convey his thoughts and emotions.\n  - Create a detailed and immersive setting that emphasizes the over-preparation of the people, with vivid descriptions of the various defenses.\n  - Introduce secondary characters, such as the blessed knights and the leaders of the resistance, to add depth and complexity to the narrative.\n\n- **Language Use**:\n  - Use descriptive and vivid language to create a sense of tension and humor, particularly in the scenes involving the defenses and the Great Evil's reactions.\n  - Employ a mix of formal and casual language to reflect the contrast between the epic prophecy and the absurdity of the situation.\n  - Focus on dialogue and internal monologue to develop the Great Evil's character and convey his emotions and thoughts.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should start with the protagonist's initial reaction to the unexpected encounter with the superpowered teenagers.\n   - Develop the narrative by exploring the protagonist's past decision to donate genetic material and the implications of that choice.\n   - Include interactions between the protagonist and the teenagers, focusing on their abilities and the reason they sought out the protagonist.\n   - Conclude with a resolution that addresses the protagonist's new role and the future of their relationship with the teenagers.\n\n2. **Creativity**:\n   - Use a mix of humor and seriousness to balance the protagonist's shock and the teenagers' unique abilities.\n   - Introduce imaginative elements that highlight the teenagers' superpowers and their impact on the protagonist's life.\n   - Incorporate unexpected twists, such as the secret organization's true intentions or the teenagers' mission.\n\n3. **Development (Character and Setting)**:\n   - Develop the protagonist's character through their reactions, internal monologue, and interactions with the teenagers.\n   - Provide detailed descriptions of the teenagers, emphasizing their distinct personalities and superpowers.\n   - Create a setting that reflects the protagonist's ordinary life being disrupted by extraordinary events.\n\n4. **Language Use**:\n   - Use a conversational and engaging tone for the protagonist's internal monologue and dialogue.\n   - Employ descriptive language to vividly portray the teenagers' superpowers and the protagonist's reactions.\n   - Maintain a balance between humor and seriousness to reflect the story's mix of shock and wonder.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's immediate reaction to the group of superpowered teenagers at their door, focusing on their shock and confusion.\n  - Develop the narrative by revealing the protagonist's past decision to donate genetic material to a secret organization, including their motivations and the secrecy involved.\n  - Include detailed interactions between the protagonist and the teenagers, highlighting the teenagers' superpowers and their reasons for seeking out the protagonist.\n  - Conclude the story with a resolution that addresses the protagonist's acceptance of their new role and the future dynamics with the teenagers, possibly hinting at further adventures or challenges.\n\n- **Creativity**:\n  - Use a blend of humor and seriousness to balance the protagonist's shock and the teenagers' unique abilities, creating a dynamic and engaging narrative.\n  - Introduce imaginative elements that showcase the teenagers' superpowers in creative and unexpected ways, adding depth and excitement to the story.\n  - Incorporate unexpected twists, such as the secret organization's true intentions or a hidden agenda, to add complexity and intrigue to the plot.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist's character through their reactions, internal monologue, and evolving relationship with the teenagers, providing a deep and nuanced portrayal of their emotional journey.\n  - Provide detailed descriptions of the teenagers, emphasizing their distinct personalities, superpowers, and the impact of their abilities on the protagonist's life.\n  - Create a setting that reflects the protagonist's ordinary life being disrupted by extraordinary events, using vivid descriptions to enhance the contrast between the mundane and the superpowered.\n\n- **Language Use**:\n  - Use a conversational and engaging tone for the protagonist's internal monologue and dialogue, making their reactions and thoughts relatable and compelling.\n  - Employ descriptive language to vividly portray the teenagers' superpowers and the protagonist's reactions, creating a vivid and immersive narrative.\n  - Maintain a balance between humor and seriousness to reflect the story's mix of shock, wonder, and the protagonist's evolving acceptance of their new reality.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should start with the protagonist's realization of their roommate's true identity, creating an immediate sense of tension and danger.\n   - Develop a backstory for the roommate that explains their skills and past as an assassin, revealed through dialogue or flashbacks.\n   - Include a confrontation scene where the protagonist must navigate the threat posed by the roommate, balancing fear and the need to survive.\n   - Conclude with a resolution that either resolves the immediate danger or sets up a future conflict, emphasizing the protagonist's resourcefulness or the roommate's next move.\n\n2. **Creativity**:\n   - Use irony and dark humor to contrast the protagonist's initial perception of the roommate with the shocking reality.\n   - Incorporate unique and unexpected elements in the roommate's skills and hobbies, making them both intriguing and unsettling.\n   - Blend elements of thriller and dark comedy to create a unique tone that keeps the reader engaged.\n\n3. **Development (Character and Setting)**:\n   - Develop the protagonist as an ordinary person thrust into an extraordinary situation, using internal monologue to convey their thoughts and fears.\n   - Flesh out the roommate's character through their actions, dialogue, and the protagonist's observations, highlighting their dual nature.\n   - Create a detailed setting that reflects the mundane aspects of the protagonist's life, contrasting sharply with the danger they now face.\n\n4. **Language Use**:\n   - Use a conversational and informal tone for the protagonist's internal monologue and dialogue, emphasizing their shock and disbelief.\n   - Employ vivid and precise descriptions to create a sense of immediacy and tension in key scenes.\n   - Incorporate dialogue that reveals character motivations and advances the plot, maintaining a balance between humor and suspense.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Start with the protagonist's realization of their roommate's true identity, creating an immediate sense of tension and danger.\n  - Develop a backstory for the roommate that explains their skills and past as an assassin, revealed through dialogue or flashbacks.\n  - Include a confrontation scene where the protagonist must navigate the threat posed by the roommate, balancing fear and the need to survive.\n  - Conclude with a resolution that either resolves the immediate danger or sets up a future conflict, emphasizing the protagonist's resourcefulness or the roommate's next move.\n\n- **Creativity**:\n  - Use irony and dark humor to contrast the protagonist's initial perception of the roommate with the shocking reality.\n  - Incorporate unique and unexpected elements in the roommate's skills and hobbies, making them both intriguing and unsettling.\n  - Blend elements of thriller and dark comedy to create a unique tone that keeps the reader engaged.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as an ordinary person thrust into an extraordinary situation, using internal monologue to convey their thoughts and fears.\n  - Flesh out the roommate's character through their actions, dialogue, and the protagonist's observations, highlighting their dual nature.\n  - Create a detailed setting that reflects the mundane aspects of the protagonist's life, contrasting sharply with the danger they now face.\n\n- **Language Use**:\n  - Use a conversational and informal tone for the protagonist's internal monologue and dialogue, emphasizing their shock and disbelief.\n  - Employ vivid and precise descriptions to create a sense of immediacy and tension in key scenes.\n  - Incorporate dialogue that reveals character motivations and advances the plot, maintaining a balance between humor and suspense.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided follow a clear structure with categories: **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contains detailed, actionable rules that guide the narrative process. The rules are written in the second person and are standalone, providing direct instructions without comparative terms.\n\nFor the new writing prompt, the rules should focus on the emotional and psychological aspects of the shapeshifter's crisis, the protagonist's efforts to help their friend, and the exploration of themes such as identity and friendship. The tone should balance tension and empathy, with a mix of introspection and action.\n\n<story_rules>\n- **Plot**:\n  - Start the story with the protagonist's growing concern over their friend's lack of response, leading to their decision to visit the friend's home.\n  - Upon arrival, depict the protagonist's shock and concern upon discovering their friend's current state and inability to revert to their human form.\n  - Include a series of attempts by the protagonist to help their friend remember how to shapeshift back, incorporating both practical and emotional approaches.\n  - Build tension through the friend's increasing frustration and fear, and the protagonist's determination to find a solution.\n  - Conclude the story with a breakthrough moment where the friend regains their human form, emphasizing the emotional bond and mutual support between the characters.\n\n- **Creativity**:\n  - Use imaginative descriptions of the friend's various shapeshifted forms, highlighting the diversity and complexity of their abilities.\n  - Incorporate flashbacks or memories that reveal the history of the protagonist's friendship with the shapeshifter, adding depth to their relationship.\n  - Explore the psychological and existential themes of identity, self-acceptance, and the fear of losing oneself.\n  - Introduce unique methods or rituals the protagonist uses to help their friend remember their human form, blending elements of fantasy and realism.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as empathetic, resourceful, and deeply loyal, using internal monologue and dialogue to convey their thoughts and emotions.\n  - Portray the shapeshifter friend as multifaceted, showing their vulnerability, fear, and the struggle with their identity crisis.\n  - Create a detailed setting of the friend's home, using descriptions that reflect their personality and the current chaotic state due to their crisis.\n  - Include interactions with secondary characters, such as neighbors or mutual friends, to add layers to the narrative and provide different perspectives on the situation.\n\n- **Language Use**:\n  - Employ descriptive and emotive language to convey the intensity of the friend's crisis and the protagonist's concern.\n  - Use dialogue to reveal character emotions, advance the plot, and highlight the deep bond between the protagonist and their friend.\n  - Balance the pacing with moments of introspection, action, and dialogue, ensuring the narrative remains engaging and dynamic.\n  - Maintain a tone that blends tension and empathy, reflecting the seriousness of the crisis and the strength of the friendship.\n</story_rules>"
]