[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The demonstrations emphasize starting with a strong narrative hook, developing characters through dialogue and internal monologue, and using humor or introspection to explore deeper themes. The rules should guide the LLM to create a story that reflects the hero's disillusionment and the cyclical nature of conflict, while also introducing a new threat that challenges the hero's perspective. The examples should illustrate how to convey the hero's complex emotions and the irony of their situation, using vivid language and a mix of humor and gravity.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the hero reflecting on their past victories and the futility of their efforts, using internal monologue to express their disillusionment. For example, \"For every beast I slew, a hundred men rose to take its place, each more monstrous than the last.\"\n  - Introduce the new outsider threat as a catalyst for the hero's introspection, using it to highlight the cyclical nature of conflict. Ensure the plot focuses on the hero's internal struggle rather than the external battle, such as, \"As the sky darkened with the wings of the new threat, the hero sighed, 'Here we go again.'\"\n  - Conclude the story with the hero's resigned acceptance or a decision to break the cycle, emphasizing themes of futility and hope. For instance, \"With a weary smile, the hero whispered, 'Perhaps this time, they'll learn.'\"\n\n- **Creativity**:\n  - Use irony and introspection to explore the hero's complex emotions and the absurdity of their situation. Highlight the contrast between the hero's legendary status and their internal disillusionment, such as, \"The hero, once a beacon of hope, now found solace in the shadows of forgotten battles.\"\n  - Incorporate elements of dark humor to underscore the futility of the hero's efforts and the cyclical nature of conflict. For example, \"As the new threat loomed, the hero chuckled, 'At least this one has wings. A nice change from the usual ground crawlers.'\"\n\n- **Development (Character and Setting)**:\n  - Develop the hero as a multidimensional character through their reflections and interactions with the new threat. Use dialogue and internal monologue to reveal their disillusionment and complex emotions, such as, \"The hero muttered to the wind, 'Is this all there is? A never-ending dance of death?'\"\n  - Create a setting that reflects the hero's internal state, using vivid descriptions to convey the desolation and beauty of the world they protect. For instance, \"The battlefield lay silent, a tapestry of scars etched into the earth, each one a testament to battles won and lost.\"\n\n- **Language Use**:\n  - Employ a reflective and introspective tone, using vivid imagery and metaphor to convey the hero's emotions and the story's themes. Use phrases like \"a tapestry of scars\" to create a rich, immersive narrative.\n  - Use concise, impactful language to maintain a balance between introspection and action. Focus on the hero's internal journey, using dialogue and monologue to reveal their thoughts and feelings.\n  - Incorporate rhetorical questions and irony to engage the reader and highlight the story's themes. For example, \"The hero wondered, 'Will they ever learn, or am I doomed to fight their battles forever?'\"\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character development, and language use. The demonstrations emphasize starting with a strong hook, developing characters through dialogue and interactions, and using humor or introspection to explore deeper themes. The rules should guide the narrative to explore the protagonist's unique situation, the demon lord's motivations, and the implications of being spared. I will ensure the rules are specific, actionable, and include examples that align with the prompt's themes of unexpected mercy and introspection.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with the aftermath of the battle, focusing on the protagonist's confusion and disbelief at being spared. Use internal monologue to express their initial shock and fear, such as \"Why am I still alive when everyone else is gone?\"\n  - Develop the plot around the protagonist's interactions with the demon lord, exploring the reasons behind their survival. Include a scene where the demon lord reveals a personal or strategic reason for sparing the protagonist, like \"I see potential in you that your companions lacked.\"\n  - Conclude the story with the protagonist facing a moral or existential dilemma, such as choosing between loyalty to their fallen comrades or understanding the demon lord's perspective. Use this to set up potential future conflicts or alliances.\n\n- **Creativity**:\n  - Subvert typical hero-villain dynamics by exploring the demon lord's complexity and possible benevolence. Use the protagonist's perspective to challenge preconceived notions of good and evil, such as \"Perhaps the demon lord isn't the monster we believed him to be.\"\n  - Incorporate elements of dark humor or irony, particularly in the protagonist's internal monologue or dialogue with the demon lord. For example, \"So, do I get a consolation prize for being the last one standing?\"\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a multifaceted character, using their internal conflict and interactions with the demon lord to reveal their personality and motivations. Highlight their struggle with survivor's guilt and curiosity about the demon lord's intentions.\n  - Portray the demon lord as a complex antagonist with depth and nuance. Use dialogue and actions to reveal their motivations and personality, such as \"I spare those who intrigue me, not out of mercy, but curiosity.\"\n  - Set the story in the demon lord's lair, using vivid descriptions to create an atmosphere of tension and uncertainty. Describe the lair's grandeur and foreboding presence to enhance the narrative's mood.\n\n- **Language Use**:\n  - Employ a tone that balances tension and introspection, using the protagonist's internal monologue to convey their emotional journey. Use rhetorical questions and vivid imagery to enhance the narrative, such as \"What does he see in me that he didn't see in the others?\"\n  - Use concise and impactful dialogue to reveal character dynamics and advance the plot. Ensure the dialogue reflects the characters' personalities and the story's themes, such as the demon lord's cryptic yet revealing statements.\n  - Incorporate a mix of formal and informal language to reflect the protagonist's shifting emotions and the demon lord's enigmatic nature. Use this contrast to highlight the tension and complexity of their interactions.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a hero who, despite saving the world multiple times, is criticized for collateral damage and subsequently disappears, leading to rampant crime. The rules will need to address themes of heroism, societal expectations, and the consequences of absence. I will ensure the rules are actionable, specific, and include examples that align with the prompt's narrative potential and tone.\n\n1. **Plot**: The plot should focus on the hero's internal conflict and the societal impact of their absence. The narrative should explore the hero's decision to disappear and the resulting chaos, leading to a resolution that addresses the hero's relationship with society.\n\n2. **Creativity**: The story should creatively explore the concept of heroism and societal expectations, using unique scenarios and imaginative elements to highlight the hero's struggles and the world's response to their absence.\n\n3. **Development (Character and Setting)**: Characters should be developed through their interactions and responses to the hero's absence. The setting should reflect the chaos and disorder resulting from the hero's disappearance, emphasizing the societal impact.\n\n4. **Language Use**: The language should convey the hero's internal conflict and the societal chaos with a tone that balances seriousness and irony. Dialogue and descriptions should be vivid and engaging, reflecting the story's themes and emotional depth.\n\nI will now generate the **Story Rules** based on these insights.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a scene that highlights the hero's frustration with constant criticism despite their efforts to save the world. Use internal monologue to express their disillusionment, such as, \"After all I've done, they still see only the rubble.\"\n  - Develop the plot by showing the hero's decision to disappear, focusing on their internal conflict and the tipping point that led to this choice. For example, depict a moment where the hero overhears a particularly harsh critique that pushes them over the edge.\n  - Explore the societal impact of the hero's absence, illustrating the rise in crime and chaos. Use scenes of disorder and public outcry to emphasize the consequences, such as, \"Without the hero, the city fell into a state of panic and lawlessness.\"\n  - Conclude the story with a resolution that addresses the hero's relationship with society, possibly through a realization or a new approach to heroism. For instance, the hero might decide to return with a new understanding of their role and limitations.\n\n- **Creativity**:\n  - Use imaginative scenarios to explore the concept of heroism and societal expectations. For example, depict a scene where the hero reflects on their past victories and the unintended consequences, using metaphors like \"a double-edged sword\" to convey the complexity of their role.\n  - Incorporate unique elements that highlight the hero's struggles, such as a magical artifact that allows them to witness the world's reaction to their absence in real-time, adding depth to their internal conflict.\n\n- **Development (Character and Setting)**:\n  - Develop the hero as a complex character with depth and vulnerability, using their internal monologue and interactions to reveal their motivations and struggles. For example, show the hero grappling with feelings of inadequacy and frustration.\n  - Portray the setting as a reflection of the societal impact of the hero's absence, using vivid descriptions of chaos and disorder. Highlight the contrast between the hero's previous victories and the current state of the world, such as, \"The once vibrant city now lay in ruins, a testament to the hero's absence.\"\n\n- **Language Use**:\n  - Employ a tone that balances seriousness and irony, using dialogue and descriptions to convey the hero's internal conflict and the societal chaos. For example, use phrases like \"a hero's burden\" to emphasize the weight of expectations.\n  - Use vivid and engaging language to create a dynamic narrative, focusing on the emotional depth and complexity of the story. Incorporate rhetorical questions and metaphors to enhance the narrative, such as, \"Was saving the world worth the cost of losing oneself?\"\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as tone, character dynamics, and narrative structure. The prompt suggests a narrative centered around themes of self-worth, recognition, and interpersonal relationships. The rules will need to guide the development of a plot that explores these themes, using creativity to subvert expectations and develop characters and settings that enhance the emotional depth of the story. Language use will be crucial in conveying the emotional intensity and sincerity of the dialogue. I will ensure the rules are actionable, specific, and include examples that align with the prompt's objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Start the story with a scene that highlights the protagonist's modesty or self-doubt, setting the stage for the central conflict. For example, depict the protagonist downplaying their achievements in a group setting.\n  - Develop the plot through a confrontation or heartfelt conversation where another character expresses frustration with the protagonist's humility. Use this moment to reveal the stakes and emotional investment of the other character, such as, \"Do you have any idea how much your work has changed my life?\"\n  - Conclude the story with a resolution that emphasizes the protagonist's realization of their importance and the impact they have on others. Ensure the ending is emotionally satisfying, with the protagonist acknowledging their value.\n\n- **Creativity**:\n  - Use creative dialogue and scenarios to explore the theme of self-worth. For instance, have the protagonist's achievements be something unconventional or unexpected, like inventing a device that brings joy to others.\n  - Incorporate elements of humor or irony to subvert typical narratives of humility, such as a character who is unaware of their own fame or influence in a humorous way.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and modest character, using internal monologue to reveal their thoughts and feelings about their achievements. Highlight their journey from self-doubt to self-acceptance.\n  - Create a supporting character who is passionate and expressive, serving as a catalyst for the protagonist's transformation. Use their dialogue to convey sincerity and urgency, such as, \"You are the reason I wake up every day with hope.\"\n  - Set the story in a relatable and everyday environment that enhances the emotional stakes, such as a workplace, community center, or family gathering.\n\n- **Language Use**:\n  - Employ a sincere and emotionally charged tone, using dialogue to convey the intensity of the characters' feelings. Use rhetorical questions and emphatic statements to highlight the urgency of the situation.\n  - Use vivid and descriptive language to create an immersive experience, focusing on the characters' emotions and interactions. For example, describe the protagonist's internal struggle with phrases like, \"A warmth spread through my chest as I realized the truth in their words.\"\n  - Maintain a balance between dialogue and internal monologue to provide depth to the characters and their relationships, ensuring the narrative remains engaging and emotionally resonant.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The demonstrations emphasize starting with a strong hook, developing characters through dialogue and interactions, and using humor or introspection to explore deeper themes. The new prompt involves themes of change, adaptation, and cultural clash, which can be explored through the elves' reactions to the unexpected city. The rules will guide the narrative to focus on the elves' perspective, their interactions with the city's inhabitants, and the cultural and emotional implications of their discovery. Examples will illustrate how to convey these themes effectively, ensuring the rules are actionable and specific to the prompt.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with the elves' arrival at the expected empty plain, using their initial shock and confusion to set the stage for the narrative. For example, describe an elder elf's disbelief as they consult ancient maps, only to find a bustling city where none should exist.\n  - Develop the plot around the elves' attempts to understand and integrate with the city, focusing on the cultural and generational differences. Highlight the tension between the elves' nomadic traditions and the city's established way of life, such as an elf struggling to comprehend the concept of permanent dwellings.\n  - Conclude the story with a resolution that emphasizes adaptation and mutual understanding, such as the elves finding a way to coexist with the city's inhabitants, perhaps by sharing their knowledge of the land.\n\n- **Creativity**:\n  - Explore the theme of time and change by incorporating elements that highlight the elves' long lifespans and the rapid development of human civilization. Use creative metaphors to illustrate the elves' perception of time, such as comparing the city's growth to a \"sapling that became a forest overnight.\"\n  - Introduce unique cultural practices of the elves that contrast with the city's customs, using these differences to create humor and insight. For instance, depict an elf's confusion at a bustling market, mistaking it for a chaotic festival.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their reactions to the city and interactions with its inhabitants. Portray the elves as wise yet bewildered, using dialogue to reveal their perspectives and internal conflicts. For example, an elf might express nostalgia for the open plains while marveling at the city's architecture.\n  - Create a vivid setting by contrasting the natural beauty of the elves' traditional lands with the bustling, constructed environment of the city. Use sensory details to immerse the reader in the elves' experience, such as the overwhelming noise and vibrant colors of the city compared to the serene landscapes they remember.\n\n- **Language Use**:\n  - Employ a reflective and descriptive tone, using language that conveys the elves' long history and deep connection to the land. Use poetic descriptions to capture the beauty and complexity of both the natural and urban settings.\n  - Use dialogue to highlight cultural misunderstandings and the elves' attempts to bridge the gap between their traditions and the city's modernity. Incorporate humor and introspection to add depth to the characters' interactions and the narrative's themes.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, plot structure, character development, and language use. The demonstrations often blend humor with fantasy, incorporate unexpected twists, and focus on character interactions and internal conflicts. The rules should guide the narrative to explore themes of identity, legacy, and the consequences of naming, while maintaining a humorous and whimsical tone. The examples should illustrate the application of these rules in a way that aligns with the prompt's unique premise of a legendary figure confronting modern legalities. The rules will be structured under the categories of Plot, Creativity, Development (Character and Setting), and Language Use, ensuring comprehensive guidance for storytelling. \n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Start the story with the parents' decision to name their daughter after the legendary warrior fey queen, highlighting their intentions and expectations. Use a phrase like, \"We thought naming her Morrigan would imbue her with strength and courage.\"\n  - Introduce the conflict with Queen Morrigan's unexpected arrival, accompanied by lawyers, demanding to see the contract. Create tension and humor by depicting the parents' confusion and disbelief, such as, \"We never imagined we'd need a contract for a name!\"\n  - Develop the plot through a negotiation or confrontation between the parents and Queen Morrigan, focusing on the absurdity of the situation. Use dialogue to explore themes of identity and legacy, leading to a resolution that emphasizes understanding and compromise.\n\n- **Creativity**:\n  - Incorporate elements of fantasy and modernity by blending the mythical presence of Queen Morrigan with contemporary legal proceedings. Use this juxtaposition to create humor and highlight the absurdity of the situation.\n  - Explore the theme of names and their power, using the narrative to question the significance of naming and its impact on identity. For example, have Queen Morrigan explain the ancient traditions and the importance of names in the fey world.\n\n- **Development (Character and Setting)**:\n  - Develop the parents as relatable and well-meaning characters, using their dialogue and reactions to convey their motivations and emotions. Highlight their initial excitement and subsequent panic when confronted by Queen Morrigan.\n  - Portray Queen Morrigan as both regal and intimidating, with a touch of humor in her interactions. Use her character to explore the cultural clash between the fey world and modern society.\n  - Set the story in a suburban home, contrasting the mundane setting with the fantastical presence of Queen Morrigan and her entourage. Use descriptions to enhance the contrast and create a vivid backdrop for the narrative.\n\n- **Language Use**:\n  - Employ a humorous and whimsical tone, using witty dialogue and internal monologue to convey the parents' bewilderment and the surreal nature of the situation. For example, use phrases like, \"I never thought I'd be negotiating with a fey queen over breakfast.\"\n  - Use vivid and imaginative language to describe Queen Morrigan and her entourage, emphasizing their otherworldly presence. Focus on sensory details to create a rich and immersive setting.\n  - Maintain a light-hearted and engaging narrative style, balancing humor with moments of introspection and emotional depth. Use dialogue to drive the story and reveal character dynamics.\n</story_rules>"
]