[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a high-stakes scenario with a focus on urgency, ritualistic elements, and the tension between faith and impending danger. The rules will need to reflect the dramatic tension and the protagonist's internal and external conflicts. I will ensure the rules are actionable, specific, and include examples that align with the prompt's themes and narrative potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the narrative in the midst of the ritual, immediately establishing the high stakes and urgency of the situation. Describe the protagonist's focus on the summoning while being acutely aware of the approaching threat. For example, \"The air crackled with energy as the incantations flowed from your lips, each word a desperate plea for divine intervention.\"\n  - Structure the plot around the tension between completing the ritual and the encroaching danger. Use alternating scenes of the ritual's progress and the enemy's advance to build suspense. Conclude with a climactic moment where the deity's presence is felt just as the enemy breaches the sanctuary, leaving the outcome ambiguous.\n\n- **Creativity**:\n  - Infuse the narrative with rich, imaginative details of the ritual and the deity being summoned. Describe the offerings and symbols used in the ritual, such as \"the sacred herbs smoldering in the brazier, releasing a fragrant smoke that spiraled towards the heavens.\"\n  - Explore the protagonist's internal conflict and faith, using the ritual as a metaphor for their belief and desperation. Highlight the contrast between the serene ritual and the chaos of the approaching threat.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a devoted and determined figure, driven by faith and the responsibility to protect their followers. Use internal monologue to reveal their fears and hopes, such as \"You could feel the weight of every soul depending on you, their whispered prayers mingling with your own.\"\n  - Create a vivid setting that enhances the narrative's tension and atmosphere. Describe the sacred space of the ritual, contrasting it with the encroaching chaos outside. For example, \"The temple's stone walls seemed to pulse with ancient power, a fragile barrier against the storm of steel and fury beyond.\"\n\n- **Language Use**:\n  - Employ a dramatic and evocative language style to convey the urgency and gravity of the situation. Use sensory details to immerse the reader in the ritual and the impending conflict, such as \"The ground trembled with the march of the enemy, a relentless drumbeat echoing your racing heart.\"\n  - Use repetition and rhythm in the incantations to create a sense of ritualistic cadence and urgency. For example, \"With each breath, you chanted the sacred words, a mantra of hope against the tide of despair.\"\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a character who is excited about a battle after a long period of boredom, which suggests themes of anticipation, existential fulfillment, and the joy of combat. The rules will need to reflect these themes and provide guidance on how to develop the narrative, characters, and setting in a way that captures the unique tone and potential of the prompt. I will ensure that each rule is actionable, specific, and includes examples inspired by the few-shot demonstrations.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with an immediate confrontation between the protagonist and the antagonist, setting the stage for the battle. Use dialogue to reveal the protagonist's excitement and the antagonist's confusion, such as, \"Why are you so... happy? I'm here to kill you.\"\n  - Structure the narrative around the battle itself, focusing on the protagonist's joy and the existential fulfillment they derive from the fight. Highlight the contrast between the protagonist's enthusiasm and the antagonist's initial intent.\n  - Conclude the story with a resolution that reflects the outcome of the battle and its impact on both characters. For example, the protagonist could express gratitude regardless of the outcome, saying, \"For this battle, the greatest of life's pleasures, I thank you.\"\n\n- **Creativity**:\n  - Explore the theme of existential boredom and the search for meaning through combat. Use imaginative elements to enhance the narrative, such as the protagonist's long history and the mystical nature of their existence.\n  - Infuse the story with a sense of grandeur and timelessness, emphasizing the protagonist's anticipation and the significance of the battle. For example, describe the setting as an ancient arena that has witnessed countless battles over millennia.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a complex character who finds joy and purpose in combat. Use their dialogue and actions to reveal their history and motivations, such as their excitement at finally facing a worthy opponent.\n  - Create a vivid and immersive setting that reflects the epic nature of the battle. Use detailed descriptions to bring the arena to life, highlighting its ancient and mystical qualities, such as \"the stone walls echoing with the memories of past warriors.\"\n\n- **Language Use**:\n  - Employ a dramatic and elevated language style to convey the epic nature of the battle and the protagonist's excitement. Use vivid imagery and powerful metaphors to enhance the narrative, such as \"the clash of blades singing the song of ages.\"\n  - Use dialogue to reveal character motivations and emotions, ensuring that each line contributes to the development of the plot and characters. For example, the protagonist's joyful exclamations can contrast with the antagonist's initial confusion and determination.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves themes of friendship, betrayal, and redemption, requiring a focus on emotional depth and character dynamics. The rules must guide the narrative to explore the complex relationship between the hero and the villain, emphasizing their shared history and the emotional weight of their final conversation. I will ensure the rules are actionable, specific, and enriched with examples that align with the prompt's themes and tone.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a vivid scene that captures the aftermath of a climactic battle, focusing on the hero's emotional turmoil as they confront the fallen villain. For example, describe the hero standing amidst the ruins, the air thick with smoke and the scent of iron.\n  - Structure the narrative around a poignant conversation that reveals the history and motivations of both characters. Use flashbacks to provide context and depth, illustrating key moments from their shared past that led to their current opposition.\n  - Conclude the story with a resolution that reflects the complexity of their relationship, such as the hero's realization of the villain's humanity or a final act of redemption from the villain. Ensure the ending leaves a lasting emotional impact, highlighting themes of forgiveness and loss.\n\n- **Creativity**:\n  - Explore the duality of the hero and villain, using symbolic elements to represent their contrasting paths. For instance, describe the hero's light-infused armor and the villain's shadowy cloak, emphasizing their divergent choices and ideologies.\n  - Infuse the narrative with imaginative details that enhance the emotional depth of the story, such as a shared childhood memory that resurfaces during their conversation, serving as a poignant reminder of their bond.\n\n- **Development (Character and Setting)**:\n  - Develop the hero and villain as complex, multidimensional characters with rich backstories. Use their dialogue to reveal their inner conflicts and the emotional weight of their shared history. For example, have the villain express regret for their choices, while the hero grapples with feelings of betrayal and loss.\n  - Create a setting that reflects the gravity of the moment, such as a desolate battlefield or a crumbling cityscape. Use sensory details to immerse the reader in the scene, describing the eerie silence and the flickering shadows cast by distant fires.\n\n- **Language Use**:\n  - Employ a reflective and emotive language style, using vivid imagery and metaphor to convey the characters' emotions and the story's themes. For example, describe the villain's eyes as \"once bright with dreams, now dimmed by the weight of their deeds.\"\n  - Use dialogue to drive the emotional core of the narrative, crafting lines that reveal the depth of the characters' relationship and their internal struggles. Ensure the conversation is poignant and impactful, capturing the essence of their bond and the tragedy of their separation.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used in crafting the rules. The demonstrations emphasize creating a narrative that is deeply tied to the prompt's themes, using vivid examples and maintaining a consistent tone. For this prompt, the focus will be on introducing a character through indirect means, such as through the perspectives of other characters, environmental details, and narrative implications. The rules will need to guide the creation of a compelling character introduction without the character's direct presence, ensuring the narrative remains engaging and informative.\n\nKey elements to consider include:\n1. **Plot**: The narrative should revolve around the character's influence or legacy, using events or situations that highlight their traits and impact.\n2. **Creativity**: Employ imaginative methods to reveal the character's essence, such as through artifacts, rumors, or the reactions of other characters.\n3. **Development (Character and Setting)**: Develop the character's presence through detailed descriptions of their environment, possessions, or the changes they have wrought.\n4. **Language Use**: Use evocative language to paint a vivid picture of the character's influence, ensuring the reader can infer their personality and significance.\n\nThe rules will be structured to provide comprehensive guidance on achieving these objectives, with examples inspired by the few-shot demonstrations to illustrate each point effectively.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Center the narrative around the impact or legacy of the character, using events or situations that highlight their influence. For example, describe a town's annual festival dedicated to the character, showcasing their importance to the community and the traditions they inspired.\n  - Use a pivotal event or conflict that the character indirectly influences, such as a decision made by the town council based on the character's past actions or teachings. This can reveal the character's values and the respect or fear they command.\n\n- **Creativity**:\n  - Introduce the character through imaginative means, such as letters, diaries, or artifacts that reveal their personality and history. For instance, describe a well-worn journal filled with the character's sketches and notes, providing insights into their thoughts and passions.\n  - Use rumors, stories, or the perspectives of other characters to build a multifaceted image of the character. Highlight differing opinions or myths about the character to add depth and intrigue, such as a local legend that paints them as both a hero and a trickster.\n\n- **Development (Character and Setting)**:\n  - Develop the character's presence through detailed descriptions of their environment or possessions. For example, describe a room filled with the character's belongings, each item carefully chosen to reflect their tastes and lifestyle, such as a collection of rare books or exotic artifacts.\n  - Use the setting to reflect the character's influence, such as a garden they designed or a building they constructed. Describe how these places bear the mark of the character's personality, like a garden with an unusual arrangement of plants that mirrors the character's eccentricity.\n\n- **Language Use**:\n  - Employ evocative and descriptive language to convey the character's essence and influence. Use sensory details to create a vivid picture of their impact, such as the lingering scent of their favorite perfume in a room or the sound of their favorite music playing in the background.\n  - Use indirect characterization techniques, such as the reactions and emotions of other characters when discussing or encountering reminders of the character. For example, describe a character's wistful smile when they recall a shared memory, hinting at the character's charm and warmth.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The new prompt presents a narrative where a character realizes they are not the protagonist but rather a cautionary tale, which suggests themes of hubris, power dynamics, and a dramatic downfall. The rules will need to reflect these themes and provide guidance on how to craft a compelling story that aligns with the prompt's tone and objectives.\n\n1. **Plot**: The plot should focus on the character's realization and the subsequent events leading to their downfall. The narrative should be structured to build tension and culminate in a dramatic and memorable ending.\n\n2. **Creativity**: The story should creatively explore themes of power, control, and the illusion of protagonism. Unique narrative devices or twists should be employed to enhance the story's impact.\n\n3. **Development (Character and Setting)**: Characters should be developed with depth, particularly the protagonist and the antagonist. The setting should reflect the power dynamics and contribute to the story's tension.\n\n4. **Language Use**: The language should be dramatic and evocative, using dialogue and descriptive elements to convey the story's themes and emotional weight.\n\nI will now craft the **Story Rules** with these considerations in mind, ensuring they are actionable, specific, and enriched with examples inspired by the few-shot demonstrations.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's overconfidence and belief in their role as the hero. Use a scene where they are preparing for a confrontation, convinced of their impending victory. For example, describe them rallying allies or making a bold declaration of intent.\n  - Structure the narrative to gradually reveal the antagonist's superior power and control, leading to the protagonist's realization of their true role as a cautionary tale. Use a pivotal moment where the protagonist is outmaneuvered or betrayed, highlighting their vulnerability.\n  - Conclude with a dramatic and memorable ending that underscores the protagonist's downfall. Ensure the antagonist delivers a final, impactful line that encapsulates the story's themes, such as \"Now... Let's give you a memorable ending.\"\n\n- **Creativity**:\n  - Explore the theme of illusion versus reality by incorporating narrative devices that reveal the protagonist's misconceptions. Use flashbacks or visions to show how the protagonist misinterpreted events or signs.\n  - Introduce a unique twist that subverts typical hero narratives, such as the protagonist's allies turning against them or the antagonist revealing a hidden agenda that renders the protagonist's efforts futile.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a complex character with a mix of hubris and genuine intent. Use internal monologue to reveal their motivations and growing doubts as the story progresses.\n  - Craft the antagonist as a formidable and charismatic figure, whose presence dominates the narrative. Use dialogue to convey their confidence and control, making them a compelling foil to the protagonist.\n  - Set the story in a dynamic environment that reflects the power struggle, such as a grand castle or a battlefield. Use the setting to heighten tension and symbolize the protagonist's journey from confidence to realization.\n\n- **Language Use**:\n  - Employ dramatic and evocative language to convey the story's emotional weight and themes. Use vivid imagery and powerful metaphors to enhance the narrative's impact, such as describing the protagonist's fall as \"a star plummeting from the heavens.\"\n  - Use dialogue to reveal character dynamics and advance the plot. Ensure the antagonist's lines are particularly impactful, delivering key revelations and thematic statements with authority and flair.\n  - Maintain a tense and suspenseful tone throughout the story, using pacing and sentence structure to build anticipation and highlight the protagonist's journey from hubris to downfall.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, narrative structure, and thematic depth. The prompt presents a high-stakes emotional scenario, focusing on existential questions and moral dilemmas. The rules must guide the LLM to create a narrative that captures the intensity of the protagonist's emotional state and the philosophical underpinnings of their crisis. The examples should illustrate how to convey the protagonist's frustration and the tension of the situation, while also exploring broader themes of justice and morality.\n\nThe rules will be organized into the specified categories: **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category will include detailed, actionable instructions with examples that align with the prompt's themes and tone. The rules will ensure the narrative is both emotionally resonant and philosophically engaging, providing comprehensive guidance for storytelling that reflects the prompt's complexity.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the narrative in media res, immediately immersing the reader in the tension of the scene. Start with the protagonist on the ledge, confronting the person trying to talk them down. For example, \"The wind whipped around them as they stood on the ledge, eyes locked with the one who dared to offer platitudes.\"\n  - Develop the plot around the protagonist's demand for a genuine answer to their existential question. Use the conversation to explore themes of justice, morality, and the apparent randomness of the universe. Ensure the dialogue is intense and charged with emotion, driving the narrative forward.\n  - Conclude with a moment of introspection or revelation, where the protagonist either steps back from the ledge or makes a decisive choice. This resolution should reflect the complexity of their internal struggle and the impact of the conversation.\n\n- **Creativity**:\n  - Explore the philosophical and existential themes of the prompt by incorporating imaginative metaphors and analogies. Use these to deepen the narrative's exploration of justice and morality. For example, describe the protagonist's view of the world as \"a cosmic roulette wheel, spinning without rhyme or reason.\"\n  - Subvert typical narratives of redemption or moral clarity by maintaining the protagonist's skepticism and demand for authenticity. Avoid simplistic resolutions, instead embracing the complexity and ambiguity of the situation.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a deeply conflicted and introspective character, driven by a sense of injustice and disillusionment. Use their internal monologue to reveal their thoughts and emotions, such as \"Every good deed felt like a drop in an ocean of indifference.\"\n  - Create a vivid and atmospheric setting that reflects the protagonist's emotional state. Use sensory details to enhance the tension and mood, such as the \"howling wind and the dizzying height of the ledge.\"\n  - Develop the secondary character as a foil to the protagonist, offering a contrasting perspective on the situation. Use their dialogue to challenge the protagonist's worldview and add depth to the conversation.\n\n- **Language Use**:\n  - Employ a raw and emotive language style, using sharp, impactful sentences to convey the intensity of the protagonist's emotions. For example, use phrases like \"I don't want your empty reassurances\" to capture their frustration and anger.\n  - Use dialogue to drive the narrative and reveal character dynamics. Ensure the conversation is authentic and charged with emotion, reflecting the high stakes of the situation.\n  - Incorporate rhetorical questions and vivid imagery to enhance the narrative's philosophical depth and emotional impact. Use these elements to engage the reader and provoke reflection on the themes of justice and morality.\n</story_rules>"
]