[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize a blend of humor, creativity, and introspection, often subverting traditional narratives with unique twists. They also focus on character-driven plots and immersive settings, using vivid language and specific examples to enhance storytelling.\n\nFor the new writing prompt, the rules will need to reflect the unique blend of a modern zombie apocalypse with medieval elements. The plot should focus on the protagonist's journey and transformation, using the medieval armory as a central theme. Creativity will involve integrating historical and fantastical elements into the modern setting. Character and setting development will focus on the protagonist's adaptation to their new role and the juxtaposition of medieval and modern worlds. Language use will need to balance humor and action, using vivid descriptions and engaging dialogue to bring the story to life.\n\nI will ensure each rule is actionable, specific, and includes examples inspired by the few-shot demonstrations, aligning with the new writing prompt's themes and narrative potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's decision to raid a medieval armory instead of a gun store, highlighting their unique perspective and resourcefulness. Use this decision as the inciting incident that sets the narrative in motion.\n  - Develop the plot through a series of encounters with zombies, focusing on the protagonist's adaptation to using medieval weaponry and armor. Include a pivotal scene where the protagonist's unconventional choice proves advantageous, such as deflecting a zombie attack with their armor.\n  - Conclude the story with the protagonist reclaiming their home, using their medieval gear to overcome challenges and secure their safety. Emphasize the protagonist's growth and newfound confidence in their abilities.\n\n- **Creativity**:\n  - Integrate elements of medieval history and fantasy into the modern zombie apocalypse setting. Use the protagonist's knowledge of medieval combat techniques to add depth and authenticity to their actions.\n  - Introduce unique twists on traditional zombie narratives, such as using a long sword to decapitate zombies or employing armor to withstand bites. Highlight the contrast between modern and medieval approaches to survival.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a resourceful and determined individual with a deep appreciation for history. Use their internal monologue to reveal their motivations and thought processes, such as their fascination with medieval weaponry.\n  - Create an immersive setting that juxtaposes the chaos of the zombie apocalypse with the order and tradition of medieval armory. Use detailed descriptions of the protagonist's gear and surroundings to enhance the story's atmosphere.\n\n- **Language Use**:\n  - Employ a blend of humor and action-oriented language to convey the protagonist's unique approach to the zombie apocalypse. Use vivid imagery and dynamic verbs to describe combat scenes, such as \"The sword sliced through the air with a satisfying whoosh.\"\n  - Use dialogue to reveal character traits and advance the plot, incorporating witty exchanges and internal reflections. For example, have the protagonist quip about feeling like a knight in shining armor while battling zombies.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves themes of self-discovery, divinity, and the impact of belief, which will guide the creation of specific and actionable rules. I will ensure the rules are comprehensive, detailed, and include examples that align with the prompt's themes and narrative potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with an ordinary scene that is disrupted by the arrival of the protagonist's first follower. Use this moment to introduce the protagonist's initial disbelief and confusion about their divine status. For example, depict the protagonist receiving a cryptic message or encountering a stranger who claims to be their follower.\n  - Develop the plot by exploring the protagonist's journey of self-discovery and the challenges of accepting their newfound divinity. Introduce conflicts that arise from the responsibilities and expectations of being a god, such as the follower's demands or the protagonist's struggle to understand their powers.\n  - Conclude the story with a resolution that emphasizes the protagonist's acceptance of their divine role and the impact of their actions on their follower. Highlight the transformation in the protagonist's understanding of themselves and their place in the world.\n\n- **Creativity**:\n  - Incorporate imaginative elements that reflect the protagonist's divine nature and the mystical aspects of their powers. Use symbols, rituals, or artifacts that signify the protagonist's godhood, such as a glowing mark or an ancient relic that activates their abilities.\n  - Explore the theme of belief and its power to shape reality. Illustrate how the follower's faith influences the protagonist's abilities and the world around them, creating a dynamic interplay between belief and divinity.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and multidimensional character who undergoes significant growth throughout the story. Use internal monologue and interactions with the follower to reveal their personality, doubts, and evolving understanding of their divine identity.\n  - Create a setting that reflects the protagonist's journey and the mystical elements of the story. Use vivid descriptions to establish a sense of wonder and otherworldliness, such as a hidden sanctuary or a landscape that changes in response to the protagonist's emotions.\n\n- **Language Use**:\n  - Employ a reflective and introspective narrative voice that captures the protagonist's internal conflict and transformation. Use descriptive language to convey the mystical and divine aspects of the story, enhancing the reader's immersion in the narrative.\n  - Use dialogue to reveal character dynamics and advance the plot. Ensure that the follower's speech reflects their reverence and belief in the protagonist's divinity, while the protagonist's dialogue conveys their initial skepticism and eventual acceptance.\n  - Incorporate rhetorical questions and vivid imagery to emphasize the protagonist's internal struggle and the story's themes. For example, use phrases like \"Could I truly be a god?\" to highlight the protagonist's disbelief and curiosity.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize a blend of humor, introspection, and subversion of traditional tropes. They often focus on internal conflicts, character dynamics, and the juxtaposition of fantastical elements with mundane or modern concepts. The rules should reflect these elements while being tailored to the new prompt's unique theme of skepticism in magic akin to skepticism in software. The examples should illustrate the wizard's rationale and the party's reactions, using humor and modern analogies to enhance the narrative. The language should be conversational and witty, capturing the tone of a skeptical yet knowledgeable wizard. The rules will be organized into the specified categories, ensuring comprehensive guidance for storytelling. \n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a scene where the party faces a seemingly insurmountable problem, prompting the expectation of a magical solution. Use this setup to introduce the wizard's skepticism and rationale for not relying on magic.\n  - Develop the plot through a dialogue-driven exploration of the wizard's past experiences with magic, highlighting instances where magic failed or had unintended consequences. Use these anecdotes to build tension and humor.\n  - Conclude the story with a resolution that emphasizes the value of practical solutions and teamwork over reliance on magic. For example, the party might solve the problem through clever non-magical means, reinforcing the wizard's perspective.\n\n- **Creativity**:\n  - Integrate modern analogies and humor to draw parallels between magic and software, such as comparing spellcasting to debugging or software updates. Use these comparisons to enhance the narrative's relatability and humor.\n  - Subvert traditional fantasy tropes by portraying magic as unreliable and fraught with bugs, similar to software. Highlight the wizard's pragmatic approach and the party's varied reactions to this perspective.\n\n- **Development (Character and Setting)**:\n  - Develop the wizard as a pragmatic and experienced character, using their dialogue and internal monologue to reveal their skepticism and past experiences. Highlight their role as a mentor or voice of reason within the party.\n  - Create a dynamic party setting with diverse characters who each have unique perspectives on magic. Use their interactions to explore different attitudes towards magic and problem-solving, enhancing the story's depth and humor.\n\n- **Language Use**:\n  - Employ a conversational and witty tone, using humor and modern references to convey the wizard's skepticism and the party's reactions. Use phrases like \"Magic is like beta software—full of bugs and crashes at the worst times\" to illustrate the wizard's perspective.\n  - Use dialogue to drive the narrative and reveal character dynamics. Ensure that each character's voice is distinct and contributes to the story's humor and thematic exploration.\n  - Incorporate rhetorical questions and humorous analogies to enhance the narrative's engagement and relatability. For example, \"Why rely on a spell when a good old-fashioned rope will do the trick?\" to emphasize practical solutions.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a witch with omniscient knowledge of her woods, yet she encounters an unexpected visitor. This scenario suggests themes of mystery, surprise, and potential conflict or revelation. The rules will need to guide the narrative to explore these themes while maintaining the tone and style demonstrated in the few-shot examples. I will ensure the rules are actionable, specific, and include examples that align with the prompt's objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the witch's routine return to her hut, emphasizing her usual certainty and control over her domain. Use this to set up the surprise and tension when she discovers the teenager. For example, describe her confident stride through the woods, noting familiar sounds and sights.\n  - Develop the plot by focusing on the witch's investigation into the teenager's presence and intentions. Use dialogue and subtle clues to build suspense and reveal layers of mystery. For instance, have the teenager speak in riddles or provide cryptic answers that challenge the witch's understanding.\n  - Conclude with a revelation or twist that redefines the witch's perception of her powers or the woods. This could involve the teenager possessing knowledge or abilities that disrupt the witch's usual omniscience, leading to a new understanding or alliance.\n\n- **Creativity**:\n  - Incorporate elements of folklore and magical realism to enrich the narrative. Use the woods as a living entity with its own secrets and mysteries that even the witch may not fully comprehend. For example, describe trees that whisper ancient secrets or paths that shift and change.\n  - Introduce unique magical elements or artifacts that the teenager might possess, which could explain their ability to evade the witch's awareness. This could be a charm or a spell that cloaks their presence, adding depth to the mystery.\n\n- **Development (Character and Setting)**:\n  - Develop the witch as a complex character with a blend of confidence and vulnerability. Use her internal monologue to explore her thoughts and emotions as she grapples with the unexpected situation. For example, show her initial irritation turning to curiosity and concern.\n  - Create a vivid and immersive setting by detailing the woods' sensory elements, such as the rustling leaves, the scent of earth, and the play of light and shadow. Use these details to reflect the witch's mood and the story's tension.\n\n- **Language Use**:\n  - Employ a lyrical and evocative language style to capture the mystical and mysterious atmosphere of the woods. Use rich descriptions and metaphors to enhance the narrative's tone. For instance, describe the woods as \"a tapestry of shadows and whispers, where secrets wove themselves into the very air.\"\n  - Use dialogue to reveal character dynamics and advance the plot. Ensure the teenager's speech is enigmatic and thought-provoking, contrasting with the witch's more direct and authoritative tone. This contrast can highlight the tension and intrigue of their interaction.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves an immortal character with a modern origin, which suggests a blend of humor, irony, and contemporary references. The rules will need to reflect this tone and provide guidance on how to explore the unique perspective of a modern immortal being. I will ensure the rules are actionable, specific, and include examples that align with the prompt's themes and narrative potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a humorous or ironic situation that highlights the protagonist's immortality and modern origin. For example, have the protagonist in a casual conversation where they are expected to know ancient history, only to reveal their limited knowledge due to their birth year.\n  - Develop the plot through a series of interactions that explore the protagonist's unique perspective on immortality in a modern context. Use these interactions to reveal both the advantages and limitations of their condition, such as their ability to witness technological advancements but lack of historical insight.\n  - Conclude the story with a reflective moment where the protagonist embraces their unique position, finding humor and acceptance in their modern immortality. For instance, they might decide to use their eternal life to become an expert in modern pop culture instead.\n\n- **Creativity**:\n  - Incorporate elements of humor and irony by juxtaposing the protagonist's immortality with their modern cultural references. Use this contrast to create comedic situations, such as the protagonist being mistaken for an ancient sage but only knowing 80s and 90s trivia.\n  - Explore the concept of immortality in a contemporary setting by integrating current events, technology, and cultural phenomena. For example, have the protagonist use social media to connect with other immortals or attend a history class to catch up on what they missed.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and humorous character who navigates the challenges of immortality with a modern sensibility. Use their internal monologue to reveal their thoughts on living forever in a rapidly changing world.\n  - Create a setting that reflects the protagonist's modern life, such as a bustling city or a tech-savvy environment. Use specific details, like the protagonist's collection of vintage 80s memorabilia, to enhance the setting and character development.\n\n- **Language Use**:\n  - Use a conversational and witty tone to reflect the protagonist's modern perspective and sense of humor. Employ contemporary slang and references to enhance the narrative's authenticity and relatability.\n  - Incorporate dialogue that highlights the protagonist's unique situation, using humor and irony to convey their experiences. For example, have them quip about their immortality in everyday situations, like \"Sure, I can live forever, but I still can't figure out TikTok.\"\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves themes of secrecy, danger, and the societal implications of using magic. The rules will need to reflect these themes, providing guidance on how to develop a narrative that explores the tension between the allure of magic and the risks it poses. I will ensure the rules are actionable, specific, and include examples that align with the prompt's objectives, drawing inspiration from the detailed examples in the few-shot demonstrations.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a scene that highlights the protagonist's internal conflict about using magic. Use an inciting incident where the protagonist is tempted to use magic in a public setting, such as a market or a crowded street, to establish the stakes and tension.\n  - Develop the plot through a series of escalating encounters that reveal the dangers of using magic. Introduce a shadowy organization or group that monitors and hunts mages, creating a sense of urgency and danger.\n  - Conclude the story with a resolution that emphasizes the protagonist's choice between embracing their magical abilities or living in secrecy. Use a climactic moment where the protagonist must decide whether to use magic to save someone at great personal risk.\n\n- **Creativity**:\n  - Integrate unique magical elements that reflect the societal fear and fascination with magic. Create spells or magical artifacts that have unintended consequences, such as a charm that attracts unwanted attention or a spell that leaves a visible mark on the user.\n  - Use the setting to enhance the narrative's tension and mystery. Describe hidden magical communities or secret gatherings where mages share knowledge and support each other, adding depth to the world-building.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a complex character with a rich backstory that explains their relationship with magic. Use internal monologue and flashbacks to reveal their motivations and fears.\n  - Create a vivid setting that reflects the societal tension surrounding magic. Use detailed descriptions of the environment, such as the oppressive atmosphere of a city under surveillance or the contrasting freedom of a hidden magical enclave.\n\n- **Language Use**:\n  - Employ a tone that balances tension and intrigue, using descriptive language to convey the protagonist's internal struggle and the external dangers they face. Use phrases that evoke a sense of secrecy and caution, such as \"whispers in the shadows\" or \"the ever-watchful eyes.\"\n  - Use dialogue to reveal character dynamics and advance the plot. Ensure that conversations reflect the characters' awareness of the risks associated with magic, using coded language or euphemisms to discuss magical topics.\n</story_rules>"
]