[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as narrative structure, tone, and character dynamics. The prompt suggests a romantic and potentially bittersweet theme, focusing on the complexities of love across different species. The rules will need to address the emotional depth, the fantasy setting, and the internal and external conflicts arising from such a relationship. I will ensure the rules are detailed, actionable, and include examples that align with the prompt's themes and narrative potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a moment of intimacy or vulnerability between the elf and the human, setting the stage for the emotional revelation. Use this scene to establish the depth of their relationship and the impending conflict. For example, describe a quiet evening under the stars where the elf hesitates before speaking.\n  - Develop the plot around the internal and external conflicts arising from their love. Explore the elf's past experiences and the societal pressures that influence their decision. Use flashbacks to reveal the elf's history and the lessons learned from past relationships with humans.\n  - Conclude the story with a poignant moment of understanding or acceptance, leaving the future of their relationship open-ended. Allow the characters to express their emotions honestly, even if it means parting ways. For instance, depict a scene where they part with a promise to cherish their memories.\n\n- **Creativity**:\n  - Incorporate elements of fantasy and magic to enrich the narrative and highlight the differences between the elf and human worlds. Use these elements to create a sense of wonder and complexity in their relationship. For example, describe the elf's ethereal beauty and the magical aura that surrounds them.\n  - Use symbolism and metaphor to convey the emotional depth of their love and the challenges they face. For instance, use the changing seasons as a metaphor for the fleeting nature of their time together.\n\n- **Development (Character and Setting)**:\n  - Develop the elf and human characters through their interactions and internal monologues. Use dialogue to reveal their personalities, desires, and fears. For example, allow the elf to express their reluctance and the human to convey their unwavering love.\n  - Create a rich and immersive setting that reflects the fantasy elements of the story. Use detailed descriptions to evoke the beauty and mystery of the elf's world, contrasting it with the human's more mundane surroundings. For instance, describe an enchanted forest where the elf feels at home.\n\n- **Language Use**:\n  - Employ a lyrical and emotive tone, using poetic language to capture the beauty and tragedy of their love. Use vivid imagery and sensory details to evoke the emotions and atmosphere of the story. For example, describe the elf's voice as \"a melody that lingers in the air, haunting and beautiful.\"\n  - Use dialogue to convey the characters' emotions and the complexity of their relationship. Allow the characters to speak with honesty and vulnerability, reflecting their deep connection and the challenges they face. For instance, have the elf say, \"I have seen the years pass like leaves in the wind, and I fear losing you to time.\"\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a high-stakes, fantastical scenario with a focus on personal growth and redemption. The rules will need to guide the narrative through a series of challenges that reflect the protagonist's inner struggles and sins. The tone should balance tension and introspection, with a focus on character development and thematic depth. Examples will be inspired by the few-shot demonstrations, ensuring they are specific and actionable.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's arrival in Hell, using vivid descriptions to establish the setting and the gravity of their situation. Introduce the concept of the seven tasks early on, creating a sense of urgency and intrigue. For example, describe the protagonist's initial confusion and fear as they are greeted by a mysterious figure who explains the rules.\n  - Structure the narrative around the completion of each task, using each one to explore a different aspect of the protagonist's character and past sins. Ensure each task is unique and thematically linked to the sin it represents. For instance, a task related to greed might involve resisting the temptation of endless wealth.\n  - Conclude the story with the protagonist's final task, leading to a moment of self-realization or transformation. Leave the ending open to interpretation, allowing the reader to ponder the protagonist's fate and growth.\n\n- **Creativity**:\n  - Use imaginative and symbolic elements to represent each of the seven sins and their corresponding tasks. Incorporate surreal and fantastical imagery to enhance the otherworldly setting. For example, depict a task for envy as a labyrinth of mirrors reflecting the protagonist's insecurities.\n  - Blend elements of horror and dark fantasy to create a tense and immersive atmosphere. Use unexpected twists and challenges to keep the reader engaged and the protagonist on edge.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through introspection and their reactions to each task. Use internal monologue and flashbacks to reveal their past actions and motivations. For example, include a memory of a pivotal moment that led to one of their sins.\n  - Create a vivid and dynamic setting that reflects the themes of the story. Use Hell as a metaphorical landscape that changes with each task, mirroring the protagonist's internal journey. Describe the environment in detail, such as a fiery wasteland for wrath or a desolate desert for sloth.\n\n- **Language Use**:\n  - Employ a tense and introspective tone, using descriptive language to convey the protagonist's emotional and psychological state. Use sensory details to immerse the reader in the setting and the protagonist's experiences.\n  - Use dialogue sparingly, focusing instead on the protagonist's internal thoughts and reflections. When dialogue is used, ensure it is impactful and reveals key information or character dynamics.\n  - Incorporate vivid and symbolic imagery to enhance the narrative's thematic depth. Use metaphors and similes to draw connections between the protagonist's sins and their tasks, such as comparing a task for pride to climbing an insurmountable mountain.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as narrative structure, tone, and character development. The prompt involves a blend of fantasy and meta-narrative, requiring a focus on character dynamics, plot twists, and creative world-building. The rules must guide the LLM in creating a story that explores themes of fate, identity, and agency within a fictional world perceived as a 'video game'. The examples will illustrate how to integrate these elements effectively, ensuring the narrative is engaging and coherent.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with an intimate scene between the maid and the noblewoman, establishing their relationship and the noblewoman's revelation about the 'video game' world. Use dialogue to convey the noblewoman's urgency and the maid's initial skepticism.\n  - Develop the plot through a series of strategic plans and actions devised by the maid and noblewoman to alter the game's narrative. Include moments of tension and uncertainty as they navigate the constraints of the 'game' world.\n  - Conclude with a pivotal scene where the noblewoman faces a critical choice that could alter her fate. Use this moment to explore themes of agency and destiny, leaving the resolution open-ended to suggest ongoing challenges.\n\n- **Creativity**:\n  - Incorporate meta-narrative elements by having the noblewoman reference specific 'game' mechanics or plot points. Use these references to create humor and tension, such as the noblewoman explaining a 'game over' scenario.\n  - Blend fantasy and reality by depicting the maid's growing belief in the noblewoman's story through subtle changes in the world, like NPCs behaving predictably or 'glitches' in the environment.\n  - Use imaginative scenarios where the maid and noblewoman test the boundaries of the 'game' world, such as attempting to alter a scripted event or discovering hidden 'game' features.\n\n- **Development (Character and Setting)**:\n  - Develop the maid as a pragmatic and resourceful character who gradually becomes a believer in the noblewoman's story. Use her internal monologue to reveal her evolving perspective and emotional investment.\n  - Portray the noblewoman as a complex character, balancing her fear of her fate with determination to change it. Use her knowledge of the 'game' to drive the plot and reveal her vulnerability.\n  - Create a richly detailed setting that reflects the 'game' world, using descriptions of the castle and surrounding areas to enhance the fantasy atmosphere. Include elements that hint at the world's artificial nature, like repetitive NPC dialogue or static scenery.\n\n- **Language Use**:\n  - Employ a formal yet accessible tone, reflecting the historical fantasy setting while maintaining clarity. Use period-appropriate language in dialogue to enhance authenticity.\n  - Use descriptive language to create vivid imagery of the setting and characters, focusing on sensory details to immerse the reader in the 'game' world.\n  - Incorporate humor and irony through the noblewoman's references to 'game' mechanics, using these moments to highlight the absurdity and stakes of their situation.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as narrative structure, tone, and thematic depth. The prompt involves themes of love, adventure, and the passage of time, requiring a balance of emotional depth and fantasy elements. The rules will need to guide the narrative through a poignant exploration of the protagonist's relationship with the elf, the implications of her confession, and the emotional journey that follows. I will ensure the rules are detailed, actionable, and include examples that align with the prompt's themes and objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a scene that establishes the bond between the protagonist and the elf, using a shared adventure to highlight their camaraderie and growing affection. For example, describe a moment where they work together to overcome a challenge, showcasing their teamwork and mutual respect.\n  - Introduce the elf's confession under a serene and magical setting, such as a moonlit forest, to create an intimate and emotional atmosphere. Use this moment to reveal the elf's age and the significance of her final year, setting the stage for the protagonist's emotional journey.\n  - Conclude the story with a reflective scene that captures the protagonist's acceptance and understanding of the elf's fate. Allow for a moment of quiet contemplation, where the protagonist cherishes the time spent together and resolves to make the most of their remaining time.\n\n- **Creativity**:\n  - Incorporate elements of fantasy and magic to enrich the narrative, such as describing the ethereal beauty of the elf and the mystical qualities of the world they inhabit. Use these elements to enhance the emotional impact of the story.\n  - Explore themes of love, mortality, and the passage of time through the protagonist's internal reflections and interactions with the elf. Use the elf's confession as a catalyst for exploring these themes, creating a narrative that is both poignant and thought-provoking.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through introspection and dialogue, revealing their emotional depth and growing attachment to the elf. Use their internal monologue to convey their thoughts and feelings about the elf's confession and the implications of her limited time.\n  - Create an immersive setting that reflects the fantasy world and the emotional tone of the story. Use vivid descriptions of the natural environment, such as a moonlit forest or a starlit sky, to enhance the narrative's magical and emotional qualities.\n\n- **Language Use**:\n  - Employ a lyrical and evocative tone, using descriptive language to capture the beauty and emotion of the story. Use metaphors and imagery to convey the protagonist's feelings and the magical qualities of the world.\n  - Use dialogue to reveal character dynamics and emotional undercurrents, allowing the characters' words to convey their affection and the weight of the elf's confession. Ensure the dialogue is natural and reflective of the characters' personalities and relationship.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as narrative structure, tone, and character development. The new prompt involves themes of time, regret, and emotional turmoil, which suggests a narrative that blends elements of science fiction with deep emotional exploration. The rules will need to guide the creation of a story that captures the complexity of dealing with alternate timelines and the emotional weight of repeated failures. I will ensure the rules are comprehensive, actionable, and include examples that align with the prompt's themes and objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with an immediate sense of urgency and emotional intensity. Use the friend's sobbing and fragmented speech to create an atmosphere of confusion and tension. For example, start with the friend bursting into the protagonist's home, tears streaming down their face, as they struggle to articulate their fears about \"resetting again.\"\n  - Develop the plot through a series of revelations and flashbacks that gradually uncover the friend's experiences with alternate timelines. Use these revelations to build suspense and deepen the emotional impact. For instance, include a flashback to a pivotal moment where the friend first realized they were trapped in a cycle of resets.\n  - Conclude the story with an open-ended resolution that leaves the protagonist and the reader questioning the nature of reality and the possibility of breaking free from the cycle. Avoid providing a definitive answer, instead allowing for ambiguity and introspection.\n\n- **Creativity**:\n  - Incorporate elements of science fiction and speculative fiction to explore the concept of timelines and resets. Use imaginative scenarios to illustrate the friend's experiences and the emotional toll of repeated failures. For example, describe a scene where the friend recounts a timeline where they almost succeeded, only to have it slip away at the last moment.\n  - Blend emotional depth with speculative elements, using the friend's turmoil as a lens to explore themes of regret, hope, and the desire for redemption. Use the concept of timelines as a metaphor for the choices and paths we take in life.\n\n- **Development (Character and Setting)**:\n  - Develop the friend as a complex character with a rich emotional landscape. Use their dialogue and actions to reveal their desperation and determination to \"get it right.\" For example, depict the friend as someone who has tried countless strategies to change their fate, each time growing more weary and desperate.\n  - Create a setting that reflects the emotional and thematic elements of the story. Use the protagonist's home as a safe haven that contrasts with the chaos of the friend's experiences. Describe the setting in a way that enhances the story's emotional impact, such as a dimly lit room that mirrors the friend's despair.\n\n- **Language Use**:\n  - Employ a tone that balances urgency with introspection, using fragmented sentences and emotional dialogue to convey the friend's distress. Use rhetorical questions and internal monologue to reflect the protagonist's confusion and empathy.\n  - Use vivid imagery and sensory details to create an immersive experience. Describe the friend's appearance and demeanor in detail, such as their tear-streaked face and trembling hands, to evoke empathy and understanding.\n  - Craft dialogue that captures the emotional intensity of the situation. Use the friend's rambling speech to convey their desperation and the weight of their experiences, while the protagonist's responses reflect their struggle to comprehend and support their friend.\n</story_rules>",
    "<thinking>\nTo create the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as narrative structure, tone, and character development. The prompt involves themes of royalty, societal expectations, and personal choice, which require a blend of political intrigue, personal introspection, and societal dynamics. The rules will need to guide the narrative through the protagonist's internal conflict, the societal impact of her decision, and the development of her relationship with the chosen suitor. I will ensure the rules are detailed, actionable, and include examples that align with the prompt's themes and objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a scene that highlights the protagonist's daily life as a princess, emphasizing the pressure and expectations placed upon her. Use this to set the stage for the decision she is about to make. For example, describe a morning routine where she is bombarded with letters and gifts from suitors.\n  - Introduce the pivotal moment where the protagonist accepts a suitor's proposal, focusing on her internal decision-making process and the immediate reactions of those around her. Use this moment to create tension and intrigue, such as a whispered conversation with a trusted advisor.\n  - Conclude the story with the societal fallout of her decision, showcasing the scandal and its impact on the kingdom. Use a public event, like a royal announcement, to illustrate the mixed reactions from the court and the public.\n\n- **Creativity**:\n  - Incorporate elements of political intrigue and personal introspection to explore the protagonist's motivations and the implications of her choice. Use her interactions with suitors to reveal her values and desires, such as a private conversation where she discusses her vision for the kingdom.\n  - Use symbolic elements, like a family heirloom or a traditional ceremony, to deepen the narrative and connect the protagonist's personal choice to the kingdom's history and future.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a complex character with a strong sense of duty and personal desires. Use internal monologue and dialogue to reveal her thoughts and emotions, such as her reflections on the responsibilities of being a princess.\n  - Create a vivid setting that reflects the opulence and constraints of royal life. Use detailed descriptions of the palace and court to enhance the story's atmosphere, such as the grandeur of the throne room contrasted with the intimacy of the protagonist's private chambers.\n\n- **Language Use**:\n  - Employ a formal and regal tone, using language that reflects the protagonist's status and the story's setting. Use eloquent dialogue and descriptive language to convey the grandeur and complexity of royal life.\n  - Use vivid imagery and sensory details to create an immersive experience for the reader. Describe the textures, sounds, and scents of the royal court to enhance the narrative's richness, such as the rustle of silk gowns and the scent of fresh flowers in the palace gardens.\n</story_rules>"
]