[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided show a clear structure with categories: Plot, Creativity, Development (Character and Setting), and Language Use. Each category contains detailed, actionable rules that guide the narrative process. The rules are tailored to the specific writing prompt, ensuring alignment with its themes and tone.\n\nFor the new writing prompt, the rules should focus on creating a tense, investigative atmosphere, incorporating elements of mystery and procedural drama. The characters should be developed through their interactions and reactions to the gruesome discovery, and the setting should enhance the sense of urgency and danger. The language should be precise, professional, and reflective of the investigative context.\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the discovery of the victim and the initial shock and confusion of the investigators.\n  - Drive the plot through the investigation, focusing on the detectives' efforts to understand the nature of the crime and identify the perpetrator(s).\n  - Include key scenes where the detectives canvas the area, interview witnesses, and piece together clues, building tension and suspense.\n  - Conclude the story with a significant revelation or twist that sheds light on the motive or identity of the attacker(s), leaving room for further investigation or resolution.\n\n- **Creativity**:\n  - Incorporate elements of mystery and procedural drama to create a gripping and immersive narrative.\n  - Use the unique and gruesome nature of the crime to add a layer of intrigue and complexity to the investigation.\n  - Employ unexpected twists and red herrings to keep the reader engaged and guessing throughout the story.\n  - Integrate forensic details and investigative techniques to add authenticity and depth to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the main characters, particularly the detectives, through their interactions, dialogue, and reactions to the crime scene and evidence.\n  - Portray the detectives as professional, determined, and resourceful, using their behavior and dialogue to highlight these traits.\n  - Create a vivid and tense setting, focusing on the crime scene, the surrounding area, and key locations relevant to the investigation.\n  - Use the setting to enhance the atmosphere of urgency and danger, providing detailed descriptions that immerse the reader in the story.\n\n- **Language Use**:\n  - Use precise, professional language to reflect the investigative context and the seriousness of the crime.\n  - Employ concise and impactful dialogue to drive the narrative and reveal character dynamics.\n  - Use descriptive language to create a vivid and immersive atmosphere, focusing on sensory details and the immediate surroundings.\n  - Maintain a tone of tension and urgency throughout the story, using language that reflects the high stakes and complexity of the investigation.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided show a clear structure with categories: **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contains detailed, actionable rules that guide the narrative process. The rules are tailored to the specific themes and tones of the prompts, ensuring they are comprehensive and directly applicable.\n\nFor the new writing prompt about Wood Elves and their true nature, the rules should focus on revealing the hidden, potentially dangerous aspects of Nature and the Wood Elves' connection to it. The tone should balance the serene, harmonious facade with the underlying, more sinister reality.\n\n<story_rules>\n- **Plot**:\n  - Begin the story by establishing the common perception of Wood Elves as peaceful and harmless, setting up the contrast for the reveal.\n  - Introduce a situation or character that challenges this perception, leading to the discovery of the true nature of Wood Elves.\n  - Develop the plot through a series of events that gradually unveil the darker, more dangerous aspects of Nature and the Wood Elves' role in it.\n  - Conclude with a powerful revelation or confrontation that solidifies the true nature of the Wood Elves, leaving a lasting impact on the reader.\n\n- **Creativity**:\n  - Use vivid and imaginative descriptions of Nature to create a sense of wonder and mystery.\n  - Incorporate elements of folklore and mythology to enrich the world-building and add depth to the Wood Elves' connection with Nature.\n  - Employ unexpected twists and turns to keep the reader engaged and to subvert their expectations about the Wood Elves.\n  - Blend serene, beautiful imagery with darker, more ominous undertones to create a compelling contrast.\n\n- **Development (Character and Setting)**:\n  - Develop the Wood Elves as complex characters with a dual nature, showing both their harmonious and dangerous sides.\n  - Create a rich, immersive setting that highlights the beauty and danger of Nature, using detailed descriptions to bring it to life.\n  - Show the protagonist's journey of discovery, focusing on their reactions and growth as they learn the truth about the Wood Elves.\n  - Use secondary characters to provide different perspectives on the Wood Elves and Nature, adding depth to the narrative.\n\n- **Language Use**:\n  - Use poetic and evocative language to describe the natural world, creating a sense of awe and reverence.\n  - Employ a balanced tone that shifts between serene and ominous, reflecting the dual nature of the Wood Elves and Nature.\n  - Use dialogue to reveal character motivations and to build tension, especially during key moments of revelation.\n  - Maintain a consistent narrative voice that guides the reader through the unfolding mystery, ensuring clarity and engagement.\n</story_rules>",
    null
]