[
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with a strong hook, using dialogue to drive the narrative, and incorporating humor or irony. They also focus on character dynamics and setting as integral to the plot, with a conversational tone and vivid descriptions. For the new prompt, which involves a mysterious and gruesome crime, the rules will need to reflect a tone that balances tension with intrigue, using detailed examples to illustrate the investigation process and character interactions. The rules will guide the LLM to create a narrative that is engaging, suspenseful, and rich in detail, while maintaining a clear and direct style.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Start the story with a tense and intriguing conversation between the detective and the medical examiner, immediately establishing the gravity of the crime. For example, have the medical examiner describe the unusual nature of the wounds in a clinical yet concerned manner.\n  - Drive the plot through the detective's investigation, using a series of interviews and discoveries to unravel the mystery. Include a scene where the detective canvasses the area, encountering uncooperative or suspicious locals.\n  - Conclude with a cliffhanger or revelation that suggests a larger conspiracy or unexpected twist, such as discovering a hidden connection between the victim and a local organization.\n\n- **Creativity**:\n  - Incorporate elements of dark humor and irony to lighten the tension, such as the detective making a sardonic comment about the \"Julius Caesar treatment.\"\n  - Use creative descriptions of the crime scene and evidence to enhance the story's atmosphere. For instance, describe the array of weapons used in the attack in a way that highlights their diversity and the assailant's intent.\n\n- **Development (Character and Setting)**:\n  - Develop the detective as a seasoned and slightly cynical character, using their internal monologue and interactions to reveal their personality and approach to the case.\n  - Introduce secondary characters, such as a rookie partner or a quirky local, to add depth and complexity to the narrative. Use their perspectives to provide alternative insights into the investigation.\n  - Set the story in a gritty urban environment, using detailed descriptions of the streets and buildings to create a vivid backdrop for the investigation. Highlight the contrast between the bustling city life and the dark undercurrents of crime.\n\n- **Language Use**:\n  - Employ a conversational and engaging tone, using dialogue to reveal character dynamics and advance the plot. For example, use exchanges between the detective and witnesses to build tension and intrigue.\n  - Use vivid and precise language to describe the crime scene and evidence, creating a strong visual impact. Incorporate sensory details to immerse the reader in the setting and atmosphere.\n  - Maintain a brisk pacing with short, impactful sentences and quick exchanges, keeping the narrative dynamic and engaging. Use rhetorical devices such as irony and understatement to enhance the story's tone and depth.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves Wood Elves and their complex relationship with Nature, challenging the perception of them as peaceful beings. The rules will need to reflect this duality, incorporating elements of surprise and depth in character portrayal, as well as vivid descriptions of the natural world. The examples will illustrate how to convey the hidden dangers of Nature and the true nature of the Wood Elves, using a blend of fantasy and realism. The language should be evocative and immersive, capturing the mystical and sometimes menacing aspects of the natural world. The rules will be structured to guide the narrative in revealing the unexpected truths about the Wood Elves and their environment.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a scene that contrasts the serene appearance of the Wood Elves' environment with an underlying tension. For example, describe a tranquil forest setting where the Wood Elves are seen tending to plants, only to reveal a hidden danger lurking beneath the surface.\n  - Develop the plot through a series of encounters that challenge the protagonist's assumptions about the Wood Elves and Nature. Use these encounters to gradually unveil the true, formidable aspects of Nature that the Wood Elves embody.\n  - Conclude the story with a revelation or transformation that highlights the complexity and power of Nature, leaving the reader with a deeper understanding of the Wood Elves' true nature.\n\n- **Creativity**:\n  - Incorporate elements of fantasy and realism to create a rich and immersive world. Use imaginative descriptions of the natural environment, such as trees that whisper secrets or rivers that change course to protect the forest.\n  - Explore the duality of the Wood Elves, portraying them as both guardians and embodiments of Nature's untamed aspects. For instance, depict a Wood Elf using natural elements in unexpected ways, like summoning a storm to ward off intruders.\n\n- **Development (Character and Setting)**:\n  - Develop the Wood Elves as complex characters with a deep connection to Nature. Use their actions and interactions with the environment to reveal their true capabilities and motivations.\n  - Create a vivid and dynamic setting that reflects the story's themes. Use detailed descriptions of the forest and its inhabitants to convey the beauty and danger of Nature, such as a grove that transforms into a maze to confuse outsiders.\n\n- **Language Use**:\n  - Employ evocative and immersive language to capture the mystical and sometimes menacing aspects of the natural world. Use sensory details to bring the setting to life, such as the scent of moss or the sound of rustling leaves.\n  - Use a tone that balances wonder and tension, reflecting the dual nature of the Wood Elves and their environment. Incorporate poetic and lyrical elements to enhance the narrative's depth and emotional impact.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with an engaging event, using humor and irony, developing characters through dialogue and interactions, and employing vivid language. I will apply these elements to the new prompt, ensuring the rules are specific, actionable, and include detailed examples.\n\nFor the **Plot**, I will focus on creating a narrative that begins with the inciting incident of the hex and follows the friends' quest to find the hag. The **Creativity** rules will explore the blend of horror and humor, using the melting curse as a central theme. In **Development (Character and Setting)**, I will emphasize the dynamics among the friends and the foreign setting's role in the story. Finally, for **Language Use**, I will ensure the tone is engaging and vivid, with a focus on the sensory experience of the curse and the urgency of the quest.\n\nEach rule will be accompanied by examples that illustrate how to implement these elements in the context of the new writing prompt, ensuring comprehensive and granular guidance. The rules will be structured to provide clear, actionable instructions that align with the prompt's themes and narrative potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the pivotal moment when the friends disrespect the old woman, leading to the hex. Use this event to immediately engage the reader and set the stakes. For example, describe the friends laughing at the woman's warnings, only to feel an ominous chill as she utters the curse.\n  - Structure the plot around the friends' urgent quest to find the hag and reverse the curse. Use a series of escalating challenges and encounters that highlight the effects of the curse, such as one friend starting to melt under the sun's rays.\n  - Conclude the story with a resolution that reflects the characters' growth or understanding, whether they find the hag or face the consequences of their actions. For instance, have the friends learn a lesson about respect and humility, leading to a bittersweet ending.\n\n- **Creativity**:\n  - Blend elements of horror and dark humor, using the melting curse as a central theme. Create imaginative scenarios that explore the absurdity and terror of the situation, such as the friends frantically seeking shade while their skin begins to sizzle.\n  - Incorporate cultural and mythical elements from the foreign land to enrich the narrative. Use local legends or folklore to add depth and authenticity to the story, such as the hag being a well-known figure in local tales.\n\n- **Development (Character and Setting)**:\n  - Develop the group of friends as distinct characters with unique personalities and dynamics. Use their interactions and reactions to the curse to reveal their traits and relationships. For example, portray one friend as the skeptic who initially dismisses the curse, only to panic as the effects become real.\n  - Set the story in a vividly described foreign land, using the setting to enhance the atmosphere and tension. Highlight the contrast between the friends' familiarity with their home and the unfamiliarity of their surroundings, such as navigating narrow, sun-drenched streets in search of the hag.\n\n- **Language Use**:\n  - Employ vivid and sensory-rich language to convey the urgency and horror of the curse. Use descriptive imagery to capture the physical sensations of melting, such as the feeling of skin blistering under the sun.\n  - Maintain a fast-paced and engaging tone, using dialogue and action to drive the narrative forward. Incorporate humor and irony to balance the horror elements, such as characters making light of their predicament even as they face dire consequences.\n  - Use short, impactful sentences to create tension and immediacy, especially during moments of crisis or confrontation. For example, describe the friends' frantic search with quick, clipped phrases that mirror their desperation.\n</story_rules>"
]