[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a hero with modern values clashing with a traditional kingdom, which suggests a narrative ripe for humor, conflict, and social commentary. The rules will need to guide the LLM in balancing these elements while maintaining a coherent and engaging story. I will ensure the rules are specific, actionable, and include examples that align with the prompt's themes and tone.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the king's initial reaction to the hero's unexpected values, highlighting the cultural clash and setting the stage for conflict. For example, describe the king's shock and confusion as the hero openly criticizes the kingdom's practices during a royal audience.\n  - Develop the narrative through a series of escalating confrontations between the hero and the kingdom's traditionalists, using these interactions to explore themes of change and resistance. For instance, depict a council meeting where the hero's ideas cause an uproar among the nobles.\n  - Conclude with a resolution that suggests potential for change, such as the king reluctantly considering reforms or the hero finding unexpected allies. Ensure the ending leaves room for further development, reflecting the ongoing nature of social change.\n\n- **Creativity**:\n  - Use humor and irony to highlight the absurdity of the kingdom's outdated practices and the hero's modern perspective. For example, have the hero sarcastically comment on the kingdom's laws, using contemporary language to emphasize the contrast.\n  - Introduce creative twists that challenge the status quo, such as the hero inadvertently inspiring a grassroots movement among the kingdom's oppressed. Use these twists to add depth and complexity to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the hero as a principled and outspoken character, using their modern values to drive the narrative and create conflict. Use internal monologue to reveal their motivations and reactions to the kingdom's practices.\n  - Create a vivid setting that reflects the kingdom's traditional values and resistance to change. Use detailed descriptions of the royal court, the marketplace, and other key locations to immerse the reader in the story's world.\n  - Develop secondary characters, such as the king and his advisors, to represent various perspectives on the hero's ideas. Use dialogue and interactions to reveal their personalities and motivations.\n\n- **Language Use**:\n  - Employ a tone that balances humor and seriousness, using witty dialogue and sharp observations to convey the hero's perspective. For example, have the hero use modern idioms and expressions to highlight the cultural clash.\n  - Use descriptive language to create vivid imagery and enhance the story's atmosphere. For instance, describe the opulence of the royal court and the stark contrast with the lives of the kingdom's commoners.\n  - Incorporate rhetorical questions and direct address to the reader to engage them with the hero's perspective and encourage reflection on the story's themes.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves themes of regret, the consequences of education in forbidden arts, and the psychological impact on students. The rules will need to reflect these themes, providing a narrative that explores the council's decision, the students' experiences, and the broader implications of teaching forbidden arts. I will ensure the rules are detailed, actionable, and include examples that align with the prompt's objectives, using a style consistent with the few-shot demonstrations.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a council meeting where the initial decision to allow the teaching of forbidden arts is revisited. Use this setting to introduce the central conflict and the council's growing regret. For example, describe a heated debate among council members as they review reports of student trauma.\n  - Develop the narrative by focusing on the experiences of a specific student who has been deeply affected by the forbidden arts. Use flashbacks to reveal their journey and the psychological impact of their studies. For instance, depict a scene where the student struggles with nightmares or hallucinations as a result of their training.\n  - Conclude with a resolution that highlights the council's realization of their mistake and their plans to address the issue. This could involve implementing new guidelines or support systems for students. Ensure the ending reflects a sense of accountability and hope for change.\n\n- **Creativity**:\n  - Explore the concept of forbidden arts with imaginative and unsettling details, emphasizing the psychological and emotional challenges faced by students. For example, describe a particular spell or ritual that leaves a lasting mental scar on the protagonist.\n  - Introduce a unique twist that adds depth to the narrative, such as a student discovering a hidden truth about the forbidden arts that challenges the council's understanding. Use this twist to create tension and intrigue, encouraging readers to question the nature of knowledge and power.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a complex and relatable character, focusing on their internal struggles and growth. Use their experiences with the forbidden arts to reveal their vulnerabilities and resilience. For example, depict their interactions with peers and mentors to highlight their isolation and determination.\n  - Create a vivid setting that reflects the dark and mysterious nature of the forbidden arts. Use sensory details to immerse readers in the academy's atmosphere, such as dimly lit corridors, ancient tomes, and eerie sounds. Ensure the setting enhances the story's themes and emotional impact.\n\n- **Language Use**:\n  - Employ a reflective and introspective tone, using first-person or close third-person narration to convey the protagonist's thoughts and emotions. Use rich imagery and metaphor to describe the effects of the forbidden arts on the students' minds.\n  - Use dialogue to reveal character dynamics and advance the plot, ensuring conversations reflect the tension and complexity of the situation. For example, craft a dialogue between the protagonist and a mentor that explores the ethical implications of their studies.\n  - Incorporate vivid descriptions and sensory details to create an immersive experience, using language that captures the haunting and enigmatic nature of the forbidden arts. For instance, describe the protagonist's mental landscape with phrases like \"a labyrinth of shadows and whispers.\"\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The new prompt presents a unique twist on the concept of magic, where ignorance is power, which requires a creative and humorous approach. The rules will need to reflect this irony and explore the implications of such a magical system on the protagonist and their world. I will ensure the rules are detailed, actionable, and include examples that align with the prompt's themes and tone.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story by introducing the protagonist, a mage who struggles with the paradox of magic. Use their internal monologue to highlight their frustration and the societal implications of the magical system. For example, describe a scene where the protagonist fails a simple spell due to overthinking, setting the stage for their journey.\n  - Develop the narrative around the protagonist's quest to balance knowledge and power. Introduce a mentor or rival who embodies the opposite approach to magic, creating tension and driving the plot forward. For instance, depict a scene where the protagonist witnesses a \"stupid\" mage effortlessly casting powerful spells, sparking their determination to find a solution.\n  - Conclude with a resolution that embraces the irony of the magical system, such as the protagonist finding a way to \"unlearn\" certain knowledge to regain power. Use this resolution to highlight the theme of embracing one's limitations and the value of different types of intelligence.\n\n- **Creativity**:\n  - Embrace the irony and humor inherent in the magical system by incorporating absurd and comedic elements. Use exaggerated scenarios to illustrate the consequences of the magical paradox, such as a mage accidentally turning themselves into a chicken while trying to cast a complex spell.\n  - Introduce a unique magical artifact or location that embodies the theme of ignorance as power, such as a library where the books erase your memory as you read them. Use this element to add depth and intrigue to the narrative, providing a setting for key plot developments.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and introspective character, focusing on their internal conflict and growth. Use their interactions with other mages to highlight the diversity of approaches to magic and the societal norms surrounding intelligence and power.\n  - Create a setting that reflects the magical system's paradox, such as an academy where students are encouraged to forget what they learn. Use vivid descriptions to convey the whimsical and surreal nature of the world, enhancing the story's humor and thematic depth.\n\n- **Language Use**:\n  - Employ a humorous and ironic tone, using witty dialogue and playful language to convey the story's themes. Use metaphors and similes to enhance the comedic effect, such as comparing a powerful mage's spellcasting to a toddler's tantrum.\n  - Use first-person narration to provide insight into the protagonist's thoughts and emotions, allowing the reader to connect with their journey. Incorporate rhetorical questions and self-deprecating humor to reflect the protagonist's internal struggle and the absurdity of the magical system.\n</story_rules>"
]