[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed and structured rules under the categories of Plot, Creativity, Development (Character and Setting), and Language Use. Each category contained specific, actionable instructions that were tailored to the unique aspects of the writing prompt. The rules were comprehensive, covering various narrative aspects such as pacing, character dynamics, and setting descriptions.\n\nFor the new writing prompt, the rules should focus on the themes of immortality, cosmic events, and the protagonist's confrontation with a powerful council. The tone should be grand and philosophical, reflecting the high stakes and existential nature of the narrative.\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist standing before the council, facing accusations of cheating the natural order of the universe.\n  - Introduce the protagonist's backstory through flashbacks, revealing their journey through immortality and the events leading to the end of their universe.\n  - Develop a central conflict around the protagonist's struggle to prove their worthiness and the council's skepticism.\n  - Conclude with a dramatic revelation or twist that challenges the council's judgment and leaves the protagonist's fate ambiguous.\n\n- **Creativity**:\n  - Use grand and cosmic imagery to depict the rebirth of universes and the council's ethereal presence.\n  - Incorporate philosophical and existential themes, exploring the nature of immortality, the cycle of life and death, and the ethics of cosmic events.\n  - Blend elements of science fiction and fantasy to create a unique and immersive narrative experience.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a complex and introspective character, exploring their emotions, motivations, and moral dilemmas.\n  - Create a majestic and otherworldly setting for the council's chamber, using detailed descriptions to evoke a sense of awe and grandeur.\n  - Flesh out the council members as enigmatic and powerful beings, each with distinct personalities and perspectives on the protagonist's actions.\n\n- **Language Use**:\n  - Employ rich and evocative language to create vivid imagery and convey the story's grand and philosophical tone.\n  - Use dialogue to reveal character traits and advance the narrative, ensuring it reflects the high stakes and existential themes.\n  - Vary the pacing to match the narrative's emotional beats, using slower, reflective passages to build tension and faster, dramatic scenes to heighten excitement.\n  - Utilize metaphors, similes, and other literary devices to enhance the narrative's imagery and emotional impact.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should be structured around the protagonist's struggle to prevent an unworthy leader from taking control.\n   - Include key events such as the protagonist discovering the prophecy, their attempts to undermine the chosen leader, and the climax where the protagonist confronts the leader.\n   - Ensure the story has a clear beginning, middle, and end, with rising tension and a resolution.\n\n2. **Creativity**:\n   - Incorporate elements of political intrigue, deception, and manipulation.\n   - Use the concept of the stars and celestial omens to add a mystical and foreboding atmosphere.\n   - Create unique and unexpected twists that keep the reader engaged and surprised.\n\n3. **Development (Character and Setting)**:\n   - Develop the protagonist as a determined, resourceful, and morally complex character.\n   - Flesh out the chosen leader as ambitious, charismatic, but ultimately flawed.\n   - Create a rich and immersive setting, with detailed descriptions of the political landscape, celestial phenomena, and key locations.\n\n4. **Language Use**:\n   - Use a formal and dramatic tone to reflect the high stakes and tension of the narrative.\n   - Employ vivid and evocative descriptions to bring the setting and characters to life.\n   - Use dialogue to reveal character motivations and advance the plot, ensuring it is sharp and impactful.\n\n<story_rules>\n- **Plot**:\n  - Structure the narrative around the protagonist's mission to prevent the chosen leader from taking control.\n  - Begin with the protagonist discovering the prophecy and realizing the threat posed by the chosen leader.\n  - Include key events such as the protagonist's strategic moves to undermine the leader, gathering allies, and facing moral dilemmas.\n  - Build towards a climax where the protagonist confronts the chosen leader, leading to a resolution that addresses the prophecy and the protagonist's goals.\n\n- **Creativity**:\n  - Incorporate elements of political intrigue, deception, and manipulation to create a complex and engaging narrative.\n  - Use the concept of celestial omens and the stars to add a mystical and foreboding atmosphere to the story.\n  - Introduce unique and unexpected twists that challenge the protagonist and keep the reader engaged.\n  - Blend elements of fantasy and realism to create a rich and immersive world.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a determined, resourceful, and morally complex character who is willing to take drastic measures to protect what they have built.\n  - Flesh out the chosen leader as ambitious, charismatic, but ultimately flawed, highlighting their weaknesses and the threat they pose.\n  - Create a rich and immersive setting with detailed descriptions of the political landscape, celestial phenomena, and key locations such as the protagonist's stronghold and the leader's base of operations.\n  - Use secondary characters to add depth to the story, including allies, rivals, and neutral parties who influence the protagonist's journey.\n\n- **Language Use**:\n  - Use a formal and dramatic tone to reflect the high stakes and tension of the narrative.\n  - Employ vivid and evocative descriptions to bring the setting and characters to life, focusing on the grandeur of the celestial omens and the intensity of the political struggle.\n  - Use sharp and impactful dialogue to reveal character motivations, advance the plot, and heighten the drama.\n  - Maintain a consistent and engaging narrative style that keeps the reader invested in the protagonist's mission and the unfolding events.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided show a clear structure with categories: **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contains detailed, actionable rules that guide the narrative process. The rules are written in the second person and are standalone, providing direct instructions without comparative terms.\n\nFor the new writing prompt, \"Don't press the button.\" \"This button?\" \"No, this one-oh.\", the story rules should focus on creating a humorous and suspenseful narrative, with a clear sequence of events leading to unexpected consequences. The characters should be well-developed, with distinct personalities and motivations, and the setting should enhance the comedic and tense atmosphere. The language should be engaging, with witty dialogue and vivid descriptions.\n\n<story_rules>\n- **Plot**:\n  - Start the story with an immediate sense of urgency or curiosity, drawing the reader into the situation involving the button.\n  - Develop a sequence of escalating events that result from pressing the wrong button, creating a mix of humor and suspense.\n  - Introduce a central conflict or problem that arises from the button press, driving the narrative forward.\n  - Conclude with a resolution that ties up the immediate consequences of the button press, while leaving room for future mishaps or adventures.\n\n- **Creativity**:\n  - Use imaginative and unexpected consequences for pressing the button to keep the reader engaged and entertained.\n  - Blend humor and tension to create a unique and engaging narrative, using the button press as a catalyst for chaos and comedy.\n  - Incorporate elements of surprise and irony, playing with the reader's expectations and delivering unexpected twists.\n  - Create a dynamic and lively atmosphere, using the button press as a focal point for a series of humorous and dramatic events.\n\n- **Development (Character and Setting)**:\n  - Develop the characters with distinct personalities and motivations, using their reactions to the button press to reveal their traits.\n  - Create a setting that enhances the comedic and tense atmosphere, providing a backdrop for the unfolding events.\n  - Use detailed descriptions to bring the setting to life, emphasizing its impact on the characters and their actions.\n  - Establish relationships between the characters through their interactions and dialogue, highlighting their dynamics and conflicts.\n\n- **Language Use**:\n  - Use witty and engaging dialogue to convey the characters' personalities and advance the narrative.\n  - Employ descriptive language to create vivid imagery and enhance the reader's immersion in the story.\n  - Vary the pacing to match the narrative's emotional beats, using faster scenes for comedic and tense moments and slower passages for reflection and buildup.\n  - Use humor and irony to add depth and complexity to the narrative, playing with the reader's expectations and delivering unexpected twists.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided show a clear structure divided into categories: Plot, Creativity, Development (Character and Setting), and Language Use. Each category contains detailed, actionable rules that guide the narrative process. The rules are written in the second person and are standalone, providing direct instructions without comparative terms.\n\nFor the new writing prompt, the rules should focus on the humorous and ironic nature of the curse, the dynamics between the characters, and the potential for both comedic and dramatic moments. The narrative should explore the protagonist's struggle with the curse and the resulting interactions.\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the moment the curse is cast, immediately establishing the central conflict.\n  - Develop a series of events where the protagonist's inability to lie leads to humorous, awkward, and potentially revealing situations.\n  - Introduce a subplot involving the protagonist's attempt to find a way to break or cope with the curse.\n  - Conclude with a resolution that either sees the protagonist coming to terms with the curse or finding a clever way to mitigate its effects.\n\n- **Creativity**:\n  - Use the curse as a tool to explore themes of honesty, deception, and the social consequences of truth-telling.\n  - Incorporate a mix of humor and irony, highlighting the protagonist's struggle with oversharing and the reactions of those around them.\n  - Create unique and unexpected scenarios where the curse leads to surprising revelations and character development.\n  - Include elements of magic and fantasy to enhance the story's whimsical and unpredictable nature.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a complex character who is both frustrated and bemused by their predicament. Show their growth as they navigate the challenges of the curse.\n  - Create a diverse cast of secondary characters, each with their own reactions to the protagonist's newfound honesty. Use these interactions to reveal different facets of the protagonist's personality.\n  - Set the story in a vibrant, magical world where curses and enchantments are commonplace. Use detailed descriptions to bring this setting to life and enhance the narrative.\n  - Explore the relationships between characters, focusing on how the curse affects their dynamics and interactions.\n\n- **Language Use**:\n  - Use witty and sharp dialogue to convey the humor and irony of the protagonist's situation. Ensure the dialogue feels natural and character-driven.\n  - Employ descriptive language to create vivid imagery and enhance the reader's immersion in the magical setting.\n  - Vary the pacing to match the narrative's emotional beats, using slower, reflective passages to build tension and faster, comedic scenes to heighten excitement.\n  - Use internal monologue to provide insight into the protagonist's thoughts and feelings, adding depth to their character and the overall narrative.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed and structured rules under the categories of **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contained specific, actionable instructions that were tailored to the unique aspects of the writing prompt. The rules were comprehensive, covering various narrative aspects such as pacing, tone, character dynamics, and setting.\n\nFor the new writing prompt about a vampire dealing with zombies and the challenge of finding an edible meal, the **Story Rules** should reflect the dark, humorous, and slightly ironic tone of the prompt. The rules should guide the narrative to explore the vampire's struggles in a world overrun by zombies, focusing on the unique challenges and interactions that arise from this situation.\n\n<story_rules>\n- **Plot**:\n  - Structure the narrative around the vampire's quest to find a suitable meal in a world overrun by zombies.\n  - Include scenes that highlight the vampire's frustration and the absurdity of the situation, balancing dark humor with moments of tension.\n  - Develop a series of encounters with zombies and other potential food sources, each presenting unique challenges and comedic elements.\n  - Conclude with a resolution that either finds the vampire a suitable meal or leaves the situation humorously unresolved.\n\n- **Creativity**:\n  - Incorporate elements of dark humor and irony, emphasizing the vampire's disdain for zombies and the absurdity of their predicament.\n  - Use imaginative and unconventional scenarios to depict the vampire's interactions with zombies and other creatures.\n  - Blend horror and comedy to create a unique tone that reflects the vampire's perspective on the zombie apocalypse.\n  - Explore the vampire's unique abilities and limitations in creative ways, highlighting their struggle to adapt to the new world.\n\n- **Development (Character and Setting)**:\n  - Develop the vampire's character through their internal monologue, actions, and interactions with zombies and other characters.\n  - Create a vivid and detailed setting that reflects the chaos and decay of a world overrun by zombies.\n  - Introduce secondary characters, such as other survivors or supernatural beings, to add depth and complexity to the narrative.\n  - Highlight the vampire's unique perspective and experiences, contrasting them with the human and zombie characters.\n\n- **Language Use**:\n  - Use a darkly humorous and slightly ironic tone, with witty dialogue and sharp observations from the vampire's perspective.\n  - Employ vivid and descriptive language to create a rich and immersive setting, emphasizing the decay and chaos of the zombie apocalypse.\n  - Maintain a balance between horror and comedy, using language that enhances both the tension and the absurdity of the situation.\n  - Use varied sentence structures and pacing to keep the narrative engaging and dynamic, reflecting the vampire's shifting emotions and experiences.\n</story_rules>"
]