[
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a fantastical scenario with a blend of technology and mythical creatures, suggesting a narrative that combines elements of science fiction and fantasy. The rules will need to guide the creation of a story that explores the intersection of these genres, focusing on the implications and challenges of installing cybernetics on a dragon. The examples will illustrate how to integrate these elements into a cohesive and engaging narrative, ensuring alignment with the prompt's themes and tone.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with an unexpected request that immediately captures the protagonist's attention, such as a mysterious client asking for cybernetic enhancements on a dragon. Use this moment to introduce the central conflict and set the tone for the narrative.\n  - Develop the plot by exploring the protagonist's journey to understand the implications of merging technology with myth. Include obstacles such as ethical dilemmas, technical challenges, and the dragon's unpredictable nature.\n  - Conclude with a resolution that reflects the protagonist's growth and the broader impact of their actions. For example, the successful integration of cybernetics could lead to a new understanding of technology's role in the natural world.\n\n- **Creativity**:\n  - Blend elements of science fiction and fantasy to create a unique narrative that explores the intersection of technology and mythology. Use imaginative concepts like cybernetic wings or enhanced fire-breathing capabilities to enrich the story.\n  - Introduce innovative technology that challenges the protagonist's skills and beliefs, such as a neural interface that allows communication with the dragon. Ensure these elements are integral to the plot and character development.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a skilled but skeptical engineer, whose expertise is challenged by the fantastical nature of the task. Use internal monologue to reveal their thoughts and conflicts, such as their initial disbelief and eventual acceptance.\n  - Create an immersive setting that combines elements of a high-tech lab with a mystical environment. Use descriptions of the dragon's lair and the advanced technology to enhance the story's atmosphere and thematic depth.\n\n- **Language Use**:\n  - Employ a tone that balances wonder and skepticism, using vivid imagery and technical jargon to convey the protagonist's perspective. For example, describe the dragon's scales as \"gleaming like polished metal\" to emphasize the blend of natural and artificial elements.\n  - Use dialogue to reveal character dynamics and advance the plot, incorporating humor and tension as the protagonist navigates the challenges of the task. Ensure the language reflects the story's blend of genres, maintaining a consistent and engaging narrative voice.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a scenario with unexpected acceptance of a change, suggesting themes of transformation, misunderstanding, and acceptance. The rules will need to guide the narrative to explore these themes, using humor or irony as seen in the few-shot examples. The examples will illustrate how to incorporate these elements effectively, ensuring the rules are actionable and specific to the prompt's context.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with an immediate conflict or misunderstanding between two characters, reflecting the prompt's dialogue. For example, have one character frantically trying to reverse a transformation, while the other calmly accepts it.\n  - Develop the plot by exploring the reasons behind the transformation and the characters' differing perspectives. Use flashbacks or dialogue to reveal past events that led to the current situation, such as a magical experiment gone awry.\n  - Conclude with a resolution that emphasizes acceptance and understanding, allowing the characters to reconcile their differences. Ensure the ending reflects the themes of transformation and acceptance, leaving room for future developments.\n\n- **Creativity**:\n  - Incorporate elements of fantasy or science fiction to explain the transformation, such as a magical spell or advanced technology. Use these elements to add depth and intrigue to the narrative.\n  - Use irony and humor to highlight the characters' differing reactions to the transformation. For example, depict the frantic character's attempts to \"fix\" the situation as comically ineffective, while the transformed character remains unfazed.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their reactions and interactions, focusing on their emotional responses to the transformation. Use internal monologue to reveal their thoughts and motivations, such as the frantic character's guilt or the transformed character's newfound perspective.\n  - Create a setting that enhances the story's themes, such as a laboratory or magical realm. Use the setting to reflect the characters' emotional states and the narrative's tone, such as a chaotic lab filled with bubbling potions or a serene garden where the transformation feels natural.\n\n- **Language Use**:\n  - Employ a tone that balances urgency and humor, using vivid descriptions and dialogue to convey the characters' emotions and the story's themes. For example, describe the frantic character's actions with phrases like \"frantically waving a wand\" or \"desperately flipping through a spellbook.\"\n  - Use dialogue to drive the narrative and reveal character dynamics, ensuring it reflects the characters' personalities and the story's tone. Incorporate rhetorical devices, such as irony and metaphor, to enhance the narrative's engagement and thematic depth.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with an immediate conflict or tension, using unique and imaginative elements, developing characters through their internal struggles and interactions, and employing vivid and engaging language. For the new prompt, I will focus on creating a narrative that explores themes of empathy, danger, and moral conflict, using a setting that enhances the tension and emotional stakes. The rules will include specific examples to illustrate how to implement these elements effectively.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with an immediate sense of urgency and danger, as the protagonist defies the alarm system's warning by choosing to help the injured woman. Use sensory details to convey the tension, such as \"the blaring alarm echoed through the corridors, but your focus was solely on the woman's labored breathing.\"\n  - Develop the plot around the protagonist's internal conflict between following orders and acting on empathy. Introduce a backstory or memory that influences their decision, such as a past experience with a loved one in need.\n  - Conclude with an open-ended resolution that leaves the protagonist's fate uncertain, emphasizing the moral complexity of their choice. For example, end with the protagonist hearing footsteps approaching, unsure if they are friend or foe.\n\n- **Creativity**:\n  - Incorporate elements of suspense and moral ambiguity, creating a narrative that challenges the protagonist's beliefs and decisions. Use the setting and situation to explore themes of trust and survival.\n  - Introduce imaginative elements, such as the nature of the \"subjects\" and their abilities, to add depth and intrigue to the story. For example, describe the injured woman as having an unusual aura or markings that hint at her origin.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a multidimensional character, focusing on their internal struggle and emotional journey. Use internal monologue and dialogue to reveal their thoughts and motivations, such as \"I couldn't just leave her there, not when she looked so human, so vulnerable.\"\n  - Create an immersive setting that enhances the story's tension and emotional stakes. Use vivid descriptions to convey the environment, such as \"the dimly lit room was filled with shadows, the only light coming from the flickering emergency signs.\"\n\n- **Language Use**:\n  - Employ a tense and engaging tone, using vivid imagery and sensory details to convey the protagonist's experience. Use phrases like \"the cold metal of the barricade pressed against your back\" to create an immersive narrative.\n  - Use dialogue and internal monologue to reveal character depth and advance the plot. Incorporate rhetorical devices, such as metaphor and imagery, to enhance the story's emotional impact, as seen in \"her eyes, though filled with pain, held a spark of something undeniably human.\"\n  - Maintain a brisk pacing to reflect the urgency of the situation, and shift the tone from tension to introspection as the protagonist grapples with their decision.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with an engaging scene, developing a unique twist or conflict, and using vivid language to convey emotions and themes. The new writing prompt involves a homeless character in a medical trial, which suggests themes of desperation, entrapment, and possibly ethical dilemmas. The rules will need to reflect these themes while providing a clear narrative structure and character development. I will ensure the rules are actionable, specific, and include examples that align with the prompt's tone and objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist entering the medical facility, highlighting their initial hope and desperation for quick cash. Use sensory details to describe the sterile environment and the protagonist's apprehension, such as \"the cold, clinical smell of antiseptic filled the air.\"\n  - Develop the plot around the growing tension and unease as the protagonist realizes they are not allowed to leave. Introduce subtle hints of something amiss, like locked doors or evasive staff, to build suspense.\n  - Conclude with a dramatic revelation or escape attempt, leaving the protagonist with a choice that reflects their resilience or desperation. Ensure the ending is open-ended, allowing for reader interpretation.\n\n- **Creativity**:\n  - Incorporate elements of psychological thriller and mystery to enhance the narrative's tension. Use the medical trial setting to explore themes of trust, ethics, and survival.\n  - Introduce a unique twist, such as the protagonist discovering they are part of a larger, more sinister experiment. Use this twist to challenge the protagonist's perception of reality and their own identity.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a complex character with a rich backstory, using internal monologue to reveal their motivations and fears. Highlight their vulnerability and determination, such as \"the weight of the world on their shoulders, yet a flicker of hope in their eyes.\"\n  - Create an immersive setting by detailing the medical facility's sterile and oppressive atmosphere. Use the setting to reflect the protagonist's emotional state and the story's themes, such as \"the fluorescent lights buzzed overhead, casting harsh shadows on the white walls.\"\n\n- **Language Use**:\n  - Employ a tense and suspenseful tone, using vivid imagery and sensory details to convey the protagonist's anxiety and the facility's unsettling atmosphere. For example, describe the protagonist's heartbeat as \"a drum pounding in their chest.\"\n  - Use dialogue and internal monologue to reveal character depth and advance the plot. Incorporate rhetorical devices, such as metaphor and simile, to enhance the story's emotional impact, like \"the staff's smiles were as thin as the paper gowns they wore.\"\n  - Maintain a brisk pacing to reflect the urgency of the situation, shifting the tone from initial hope to growing dread as the protagonist realizes the gravity of their predicament.\n</story_rules>",
    "<thinking>\nThe few-shot demonstrations provide a clear framework for crafting Story Rules that are detailed, actionable, and tailored to the specific writing prompt. They emphasize the importance of aligning the rules with the prompt's themes, tone, and narrative potential. Each category—Plot, Creativity, Development (Character and Setting), and Language Use—requires comprehensive guidance with concrete examples to illustrate the application of the rules.\n\nFor the new writing prompt, the focus will be on themes of trust, betrayal, and sacrifice within a fantasy setting. The narrative should explore the protagonist's internal conflict and the dynamics within the Hero's Party. The tone should balance tension and resolution, with a focus on the protagonist's calm demeanor amidst the chaos. The examples will draw from the prompt's context, ensuring they are relevant and illustrative of the rules.\n\nThe Story Rules will guide the LLM in crafting a narrative that captures the complexity of the protagonist's role and the emotional weight of their decision. The rules will emphasize the need for a nuanced portrayal of character motivations and the impact of the protagonist's actions on the party and the overall narrative.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the aftermath of a victorious battle, setting the stage for the unexpected twist of betrayal. Use the prompt to introduce immediate tension as the Hero's Party finds themselves paralyzed and confused.\n  - Develop the plot around the protagonist's internal conflict and the necessity of their actions. Reveal the protagonist's reasoning through a calm and rational explanation, highlighting the theme of self-sacrifice as a necessary component of victory.\n  - Conclude with a resolution that leaves room for ambiguity and reflection. Ensure the ending emphasizes the protagonist's acceptance of their role and the impact of their decision on the party's future.\n\n- **Creativity**:\n  - Incorporate elements of fantasy and moral complexity, using the protagonist's profession as a source of tension and intrigue. For example, depict the protagonist as a necromancer whose skills are essential yet feared.\n  - Use magical elements to enhance the narrative, such as a spell that paralyzes the party, adding depth to the protagonist's actions and the story's themes.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a multidimensional character, focusing on their internal struggle and the burden of their role. Use internal monologue and dialogue to reveal their motivations and the weight of their decision.\n  - Create a setting that reflects the story's fantasy elements, such as a battlefield or a mystical realm. Use the setting to enhance the narrative's tension and emotional impact, ensuring it complements the characters' interactions.\n\n- **Language Use**:\n  - Employ a formal and contemplative tone, using precise language to convey the protagonist's calm demeanor and the gravity of the situation. Use dialogue to reveal character motivations and advance the plot.\n  - Incorporate vivid descriptions and sensory details to create an immersive atmosphere. Use phrases like \"the air was thick with magic\" and \"the weight of destiny hung heavy\" to enhance the story's emotional depth and thematic resonance.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with an engaging scene, developing characters through internal conflict and dialogue, and using vivid language to convey tone and emotion. The new prompt involves a villain and hero dynamic with a personal twist, requiring a balance of tension, humor, and character development. I will ensure the rules reflect these elements, providing actionable guidance and examples that align with the prompt's themes of conflict, family dynamics, and unexpected alliances.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with an immediate sense of tension and irony as you, the villain, arrive at the hero's house. Use the initial encounter to set the stage for a complex and humorous interaction. For example, describe the awkward moment when you both realize each other's identities, with a line like, \"The door swung open, and there stood my nemesis, apron-clad and holding a spatula.\"\n  - Develop the plot through a series of humorous and tense exchanges that reveal both characters' conflicting emotions and shared concerns for their children. Use this interaction to explore themes of rivalry and unexpected common ground. For instance, have a conversation where you both reluctantly agree on the importance of family values, despite your differences.\n  - Conclude with a resolution that leaves room for future encounters, such as a mutual understanding or a temporary truce for the sake of your children. Ensure the ending maintains the story's comedic and ironic tone, like agreeing to a \"ceasefire\" during family gatherings.\n\n- **Creativity**:\n  - Incorporate elements of humor and irony by playing with the traditional hero-villain dynamic in a domestic setting. Use creative scenarios, such as the hero offering you a cup of tea while discussing your children's relationship, to highlight the absurdity of the situation.\n  - Introduce imaginative elements that reflect your villainous nature, such as using a gadget to discreetly monitor the conversation or having a pet sidekick that adds comedic relief. For example, a small robot companion that offers sarcastic commentary on the situation.\n\n- **Development (Character and Setting)**:\n  - Develop your character through internal monologue and dialogue that reveal your conflicting emotions as a villain and a parent. Use these moments to explore your protective instincts and grudging respect for the hero. For instance, think to yourself, \"I could vaporize them right now, but my son would never forgive me.\"\n  - Create a setting that contrasts the domestic and the extraordinary, such as a suburban home with subtle hints of your villainous lifestyle. Describe the hero's home with details that reflect their personality, like trophies from past victories or family photos that humanize them.\n\n- **Language Use**:\n  - Employ a tone that balances humor and tension, using witty dialogue and internal monologue to convey the absurdity of the situation. Use phrases that highlight the irony of the encounter, such as, \"Who knew my arch-nemesis had such a lovely taste in curtains?\"\n  - Use vivid and descriptive language to enhance the setting and character interactions. Incorporate sensory details to create an immersive experience, like the smell of freshly baked cookies mingling with the faint scent of ozone from your last battle.\n  - Maintain a first-person perspective to provide insight into your thoughts and emotions, allowing the reader to connect with your character's unique perspective as both a villain and a parent.\n</story_rules>"
]