[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, plot structure, character development, and language use. The few-shot examples often blend humor with fantasy or horror, use vivid and imaginative descriptions, and focus on character interactions and internal conflicts. The new prompt involves an elder god being summoned for a birthday celebration, which suggests a blend of humor, fantasy, and the absurdity of divine beings interacting with mortals. The rules will need to reflect this tone and provide guidance on how to develop the plot, characters, and setting in a way that captures the unique premise of the prompt. I will ensure the rules are actionable, specific, and include examples that align with the prompt's themes and narrative potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the moment of summoning, using a dramatic and humorous tone to introduce the elder god's arrival in the mortal realm. Describe the setting with vivid details, such as a grand ritual site adorned with birthday decorations, to highlight the absurdity of the situation.\n  - Develop the plot by exploring the elder god's reactions to the unexpected celebration. Use interactions with the followers to drive the narrative, focusing on the god's confusion and amusement at the mortals' attempts to honor them.\n  - Conclude the story with a humorous twist, such as the elder god deciding to partake in the festivities, leading to unexpected consequences for the followers. For example, the god might inadvertently unleash divine chaos while trying to blow out the candles.\n\n- **Creativity**:\n  - Embrace the absurdity of the premise by incorporating fantastical and humorous elements into the celebration. Describe the followers' attempts to please the elder god with offerings that blend traditional rituals with birthday party elements, such as a sacrificial cake or a piñata filled with mystical artifacts.\n  - Use the elder god's perspective to explore the novelty of experiencing a birthday celebration, highlighting their ancient wisdom contrasted with the simplicity of mortal customs.\n\n- **Development (Character and Setting)**:\n  - Develop the elder god as a character with a blend of ancient wisdom and curiosity about mortal customs. Use their internal monologue to reveal their thoughts and feelings about the celebration, such as bemusement at the mortals' efforts.\n  - Create a vivid setting that combines elements of a traditional summoning ritual with birthday party decorations. Use sensory details to enhance the atmosphere, such as the scent of incense mingling with the aroma of cake, or the flickering of ritual candles alongside colorful streamers.\n\n- **Language Use**:\n  - Employ a humorous and whimsical tone throughout the narrative, using playful language and vivid imagery to capture the absurdity of the situation. Use dialogue to convey the followers' reverence and excitement, contrasting with the elder god's bemused responses.\n  - Use rhetorical devices such as irony and hyperbole to enhance the comedic effect. For example, describe the elder god's attempt to understand the concept of a birthday wish, leading to exaggerated and humorous outcomes.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with an immediate conflict or intriguing situation, using humor or tension, and developing characters through their interactions and internal conflicts. They also highlight the importance of vivid, sensory-rich language and maintaining a consistent tone throughout the narrative.\n\nFor the new writing prompt, the rules will need to focus on the mysterious and potentially ominous nature of praying to an unknown god. The plot should revolve around the protagonist's discovery and the consequences of invoking this forgotten deity. Creativity will involve blending elements of mystery and the supernatural, while character development will focus on the protagonist's internal journey and interactions with the divine. Language use should create an atmosphere of suspense and wonder, using vivid descriptions to convey the stillness and forgotten nature of the god.\n\nI will ensure the rules are actionable, specific, and include examples inspired by the few-shot demonstrations, aligning with the new writing prompt's themes and narrative potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist in a moment of desperation or need, prompting them to pray to multiple gods. Use this moment to establish the protagonist's emotional state and the urgency of their situation.\n  - Develop the plot by introducing the mysterious name that appears in the protagonist's mind. Describe the protagonist's decision to pray to this unknown deity, highlighting their curiosity and apprehension.\n  - Conclude the narrative with a significant change in the environment or the protagonist's perception, such as the air becoming unnaturally still. Use this change to suggest the presence and power of the forgotten god, leaving the story open-ended and filled with potential consequences.\n\n- **Creativity**:\n  - Blend elements of mystery and the supernatural to create a unique and engaging narrative. Use the unknown god as a central element, exploring themes of forgotten power and divine intervention.\n  - Incorporate imaginative descriptions of the protagonist's prayers and the resulting stillness, such as \"the air thickened, as if the world held its breath in reverence of a name long unspoken.\"\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist's character through their internal conflict and emotional journey. Use their prayers as a means to explore their hopes, fears, and desires.\n  - Create a setting that reflects the protagonist's emotional state and the supernatural elements of the story. Use vivid descriptions to convey the stillness and tension in the air, such as \"the world seemed to pause, every sound swallowed by an expectant silence.\"\n\n- **Language Use**:\n  - Employ a tone of suspense and wonder, using vivid and sensory-rich language to create an immersive atmosphere. Use descriptive language to convey the stillness and forgotten nature of the god, such as \"the name echoed in the silence, a whisper of forgotten power.\"\n  - Use rhetorical devices, such as personification and metaphor, to enhance the narrative's emotional impact. For example, describe the air as \"holding its breath, waiting for the world to remember.\"\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with an immediate conflict, using humor and absurdity, developing characters through interactions, and employing vivid, engaging language. I will apply these elements to the new prompt, ensuring the rules are specific, actionable, and include detailed examples.\n\nFor the new prompt, the plot will focus on the protagonist's dilemma and the comedic potential of impersonating a minion. Creativity will involve the absurdity of the situation and the protagonist's attempts to fit into the villainous world. Character development will focus on the protagonist's relationship with the roommate and the villains, while the setting will highlight the contrast between the protagonist's normal life and the villainous underworld. Language use will employ humor and vivid descriptions to enhance the comedic and absurd tone.\n\nI will ensure each rule is accompanied by a concrete example inspired by the few-shot demonstrations, maintaining the style and structure observed in the examples. The rules will be organized into the specified categories, providing comprehensive and granular guidance for the new writing prompt.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist discovering their roommate's secret and the immediate need to pay rent. Use a humorous and urgent tone to set the stage, such as the protagonist finding a villain costume in the closet and receiving a threatening letter from the villains.\n  - Develop the plot by focusing on the protagonist's attempts to impersonate the roommate and navigate the villainous world. Include comedic mishaps and misunderstandings, such as the protagonist struggling to understand villain jargon or accidentally activating a gadget.\n  - Conclude the story with a humorous resolution, such as the protagonist inadvertently impressing the villains with their unintentional antics, securing the rent money, and gaining unexpected respect.\n\n- **Creativity**:\n  - Embrace the absurdity of the situation by incorporating exaggerated villainous elements, such as over-the-top costumes, bizarre gadgets, and eccentric villain personalities. For example, describe a villain meeting with a \"lair full of lava lamps and a throne made of old comic books.\"\n  - Use the protagonist's perspective to highlight the contrast between their normal life and the villainous world, creating humor through their reactions and internal monologue.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist's character through their internal conflict and interactions with the roommate and villains. Highlight their reluctance and eventual acceptance of the situation, using dialogue and actions to reveal their personality.\n  - Create a vivid setting by contrasting the protagonist's mundane apartment with the extravagant and chaotic villain lair. Use specific details, such as \"walls lined with stolen art\" and \"henchmen practicing evil laughs,\" to enhance the setting's impact.\n\n- **Language Use**:\n  - Employ a humorous and engaging tone, using witty dialogue and playful language to reflect the story's comedic elements. Use rhetorical devices, such as hyperbole and irony, to enhance the humor.\n  - Use vivid and specific descriptions to create an immersive experience, such as describing the protagonist's awkward attempts to fit into the villain costume or their reactions to the villains' eccentric demands.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with an immediate conflict or tension, using creative and imaginative elements to enhance the narrative, developing characters through their interactions and internal conflicts, and employing vivid and engaging language. For the new prompt, the rules will need to focus on the tension between the protagonist's knowledge and the threat of revealing it, the moral and ethical dilemmas faced, and the suspenseful atmosphere created by the looming danger. Examples will be inspired by the few-shot demonstrations, ensuring they are specific and actionable. The rules will be organized into the specified categories, providing comprehensive guidance for storytelling aligned with the new prompt's themes and tone.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's discovery of the forbidden knowledge, using a setting that emphasizes secrecy and tension, such as a hidden library or a secluded location. For example, describe the protagonist finding an ancient book with cryptic symbols that suddenly triggers the ominous warning.\n  - Develop the plot by exploring the protagonist's internal conflict and the external pressures they face. Introduce a series of events that test their resolve, such as encounters with people who unknowingly depend on the knowledge for survival.\n  - Conclude the story with a dramatic decision point, where the protagonist must choose between revealing the knowledge and facing the consequences or finding an alternative solution. Use a cliffhanger or ambiguous ending to maintain suspense and intrigue.\n\n- **Creativity**:\n  - Incorporate imaginative elements that enhance the mystery and danger of the knowledge. For instance, describe the knowledge as a glowing, ethereal script that only the protagonist can see, adding a supernatural aspect to the narrative.\n  - Use symbolic and metaphorical language to convey the weight and significance of the knowledge. For example, liken the knowledge to a \"Pandora's box\" that holds both salvation and destruction.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist's character through their internal struggle and moral dilemmas. Use their thoughts and actions to reveal their values and priorities, such as their desire to protect others versus their fear of the consequences.\n  - Create a setting that reflects the story's tension and stakes. Use detailed descriptions to immerse the reader in the environment, such as a stormy night that mirrors the protagonist's turmoil or a bustling city that contrasts with their isolation.\n\n- **Language Use**:\n  - Employ a suspenseful and engaging tone, using vivid and sensory-rich language to create an immersive atmosphere. Use short, impactful sentences to convey urgency and tension.\n  - Use dialogue and internal monologue to reveal the protagonist's thoughts and emotions. For example, include lines like \"The weight of the world rested on my shoulders, and the silence was deafening\" to convey the gravity of their situation.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a creature that appears terrifying but offers an unexpected gesture of help, creating a juxtaposition between fear and potential salvation. The rules will need to reflect this tension and the protagonist's desperate situation.\n\n1. **Plot**: The plot should focus on the protagonist's initial fear and desperation, followed by a gradual realization of the creature's intentions. The narrative should explore the protagonist's internal conflict and eventual acceptance of the creature's help.\n\n2. **Creativity**: The story should creatively blend elements of horror and unexpected kindness. The creature's appearance and actions should be vividly described to enhance the contrast between its terrifying appearance and its benevolent gesture.\n\n3. **Development (Character and Setting)**: The protagonist's character should be developed through their internal monologue and reactions to the creature. The setting should emphasize the protagonist's dire situation, using sensory details to convey their physical and emotional state.\n\n4. **Language Use**: The language should be vivid and evocative, using sensory details to create an immersive experience. The tone should balance horror and hope, reflecting the protagonist's fear and the creature's unexpected kindness.\n\nI will now craft the **Story Rules** for the new writing prompt, ensuring they are specific, actionable, and enriched with examples inspired by the few-shot demonstrations.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a vivid description of the protagonist's physical and emotional state, emphasizing their starvation and inability to flee. Use internal monologue to convey their fear and desperation.\n  - Develop the plot by introducing the creature's unexpected gesture of help, creating a tension between the protagonist's fear and the potential for salvation. For example, describe the protagonist's initial terror at the sight of the creature, followed by confusion and hope as it offers the apple tree.\n  - Conclude the narrative with a moment of acceptance or realization, as the protagonist decides to trust the creature. Use this resolution to highlight the theme of unexpected kindness in the face of fear.\n\n- **Creativity**:\n  - Use vivid and imaginative descriptions to create a stark contrast between the creature's terrifying appearance and its benevolent actions. For instance, describe the creature's features in detail, such as \"its eyes glowed like embers in the dark, casting eerie shadows,\" while also highlighting its gentle demeanor.\n  - Incorporate elements of horror and hope, using the creature's actions to subvert the protagonist's expectations. For example, describe the creature's voice as \"a garbled symphony of growls and whispers,\" yet its words convey a simple, kind offer.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist's character through their internal monologue and reactions to the creature. Use their thoughts to reveal their fear, skepticism, and eventual hope. For example, describe their initial thoughts as \"a cacophony of dread and disbelief,\" gradually shifting to \"a flicker of hope amidst the darkness.\"\n  - Create a setting that emphasizes the protagonist's dire situation, using sensory details to convey their physical and emotional state. For instance, describe the barren landscape as \"a wasteland of dust and decay,\" reflecting the protagonist's starvation and isolation.\n\n- **Language Use**:\n  - Employ vivid and evocative language to create an immersive experience, using sensory details to enhance the narrative. For example, describe the sound of the creature's voice as \"a haunting melody that resonated through the silence.\"\n  - Balance the tone between horror and hope, reflecting the protagonist's fear and the creature's unexpected kindness. Use language that captures the tension and eventual resolution, such as \"a fragile truce forged in the shadows of despair.\"\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves themes of betrayal, unexpected alliances, and introspection, which will guide the creation of specific and actionable rules. I will ensure the rules are comprehensive, providing detailed guidance on how to develop the narrative, characters, and setting, while maintaining a tone that reflects the complexity and emotional depth of the scenario. Examples will be inspired by the few-shot demonstrations, ensuring they are relevant and illustrative of the new prompt's themes.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a vivid description of the protagonist's last memory before losing consciousness, emphasizing the betrayal and defeat. Use sensory details to convey the pain and confusion, such as \"the cold ground beneath you and the distant sound of your friends' retreating footsteps.\"\n  - Develop the plot by focusing on the protagonist's initial confusion and suspicion upon waking up, gradually revealing the villain's unexpected kindness. Use dialogue to explore the villain's motives, such as \"I saved you because I see potential in you, not because I need a pawn.\"\n  - Conclude the narrative with an open-ended resolution, suggesting a potential alliance or understanding between the protagonist and the villain. Use a reflective tone to highlight the protagonist's internal conflict and new perspective.\n\n- **Creativity**:\n  - Subvert traditional hero-villain dynamics by portraying the villain as a complex character with their own code of honor. Use their actions and dialogue to reveal unexpected depth, such as tending to the protagonist's wounds with care.\n  - Incorporate elements of moral ambiguity and introspection, allowing the protagonist to question their previous beliefs and alliances. Use internal monologue to explore these themes, such as \"Why did my friends leave me, and why did my enemy save me?\"\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist's character through their emotional journey from betrayal to a reluctant acceptance of the villain's aid. Use their internal conflict to drive character growth, such as grappling with feelings of anger and gratitude.\n  - Create a setting that reflects the tension and uncertainty of the situation, such as a dimly lit room filled with medical supplies and the faint scent of herbs. Use specific details to enhance the atmosphere, like \"the flickering candle casting shadows on the walls.\"\n\n- **Language Use**:\n  - Employ a tone that balances tension and introspection, using descriptive language to convey the protagonist's physical and emotional state. Use vivid imagery to enhance the narrative, such as \"the bandages wrapped tightly around your wounds, a testament to the care you received.\"\n  - Use dialogue to reveal character motivations and drive the plot, ensuring it reflects the complexity of the situation. For example, have the villain say, \"I don't expect you to trust me, but I couldn't let you die like that.\"\n</story_rules>"
]