[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as narrative structure, tone, and thematic focus. The demonstrations often emphasize internal conflict, unexpected twists, and the blending of genres, such as fantasy with elements of suspense or humor. They also highlight the importance of character development through dialogue and introspection, as well as the use of vivid settings to enhance the narrative.\n\nFor the new prompt, the rules will need to address the tension and suspense inherent in the scenario, focusing on the protagonist's internal conflict and the dynamics within the group. The narrative should explore themes of trust, survival, and the psychological impact of the encounter with the mimics. The language should be descriptive and immersive, capturing the urgency and emotional stakes of the situation.\n\nI will ensure the rules are comprehensive, providing detailed guidance on plot development, creativity, character and setting development, and language use. Each rule will be accompanied by concrete examples inspired by the few-shot demonstrations, tailored to the specific themes and tone of the new writing prompt.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Structure the narrative around the immediate aftermath of the encounter with the mimics, focusing on the protagonist's internal conflict and decision to stop following the group. Begin with a tense scene that highlights the group's relief and the protagonist's hesitation. For example, describe the protagonist's sudden realization of a lingering threat or a sense of betrayal.\n  - Develop the plot by exploring the protagonist's reasoning for stopping, using flashbacks or internal monologue to reveal past experiences or doubts about the group's safety. Conclude with a twist that challenges the group's perception of safety, such as the protagonist discovering a hidden danger or a betrayal within the group.\n\n- **Creativity**:\n  - Incorporate elements of suspense and psychological tension, using the mimics as a metaphor for deeper fears or mistrust within the group. For example, explore the idea that the mimics could have infiltrated the group, creating paranoia and uncertainty.\n  - Use the setting creatively to enhance the narrative's tension, such as a claustrophobic environment that heightens the sense of danger. Describe the surroundings in detail, using sensory language to immerse the reader in the protagonist's perspective.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a complex character with a strong internal conflict. Use internal monologue and dialogue to reveal their fears, doubts, and motivations. For example, describe the protagonist's struggle to trust their friends after the encounter with the mimics.\n  - Create a vivid and immersive setting that reflects the story's themes and tone. Use detailed descriptions to convey the environment's atmosphere, such as the eerie silence or the oppressive darkness that surrounds the group.\n\n- **Language Use**:\n  - Employ a tense and suspenseful tone, using descriptive language to convey the protagonist's emotional state and the story's atmosphere. Use rhetorical devices such as foreshadowing and irony to enhance the narrative's impact.\n  - Use dialogue to reveal character dynamics and advance the plot. Ensure the dialogue reflects the characters' personalities and the story's themes, such as trust and survival. For example, use short, clipped sentences to convey urgency and tension.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, narrative structure, and thematic focus. The demonstrations often blend humor with existential themes, using a conversational tone and first-person perspective to create an engaging narrative. The rules should guide the LLM to explore the absurdity and inconvenience of repeated resurrections, using humor and introspection to drive the story. The protagonist's frustration and the surreal nature of the necromancer service should be central to the narrative. I will ensure the rules are detailed, actionable, and include examples that align with the prompt's unique potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's realization of their repeated deaths and the absurdity of their situation. Use a humorous and exasperated tone to convey their frustration, such as describing the inconvenience of waking up in strange places after each resurrection.\n  - Develop the narrative by focusing on the protagonist's attempts to cancel the necromancer service. Include obstacles and comedic mishaps, such as dealing with unhelpful customer service or arcane cancellation policies.\n  - Conclude with a resolution that highlights the protagonist's determination to regain control over their life and death. For example, describe their relief and newfound peace after finally canceling the service, using humor to underscore the absurdity of the situation.\n\n- **Creativity**:\n  - Incorporate imaginative elements related to the arcane web and necromancer services, such as bizarre terms of service or magical glitches. Use these elements to enhance the story's humor and surreal atmosphere.\n  - Explore the concept of repeated resurrections with creative scenarios, such as the protagonist waking up in increasingly ridiculous situations or locations. Use these scenarios to add depth and humor to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and humorous character, using their internal monologue to reveal their frustration and determination. Highlight their personality through witty observations and sarcastic remarks about their situation.\n  - Create a setting that blends the mundane with the magical, such as a typical office environment for the necromancer service with arcane elements. Use vivid descriptions to immerse the reader in the protagonist's world and enhance the story's humor.\n\n- **Language Use**:\n  - Employ a conversational and humorous tone, using first-person narration to create intimacy and immediacy. Use witty and sarcastic language to convey the protagonist's frustration and add levity to the narrative.\n  - Use dialogue and internal monologue to reveal character emotions and advance the plot. Ensure the language reflects the story's themes of absurdity and frustration, using phrases like \"I can't believe I'm dealing with this again\" to highlight key emotional beats.\n  - Incorporate rhetorical devices and figures of speech to enhance the narrative's humor and create a unique storytelling style. Use vivid and imaginative language to describe the arcane elements and the protagonist's experiences.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, narrative structure, and thematic focus. The demonstrations often blend humor with existential themes, using a conversational tone and first-person perspective to create an engaging narrative. The rules should guide the LLM to explore the absurdity and inconvenience of repeated resurrections, using humor and introspection to drive the story. The protagonist's frustration and the surreal nature of the necromancer service should be central to the narrative. I will ensure the rules are detailed, actionable, and include examples that align with the prompt's unique elements.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's latest resurrection, highlighting their frustration and the absurdity of the situation. Use a humorous internal monologue to express their exasperation, such as \"Waking up in a coffin for the fifth time this month was getting old, literally.\"\n  - Develop the narrative by focusing on the protagonist's attempts to cancel the necromancer service. Include obstacles like arcane customer service challenges or cryptic cancellation policies, creating a comedic yet relatable struggle.\n  - Conclude with a resolution that reflects the protagonist's determination to regain control over their life (and death). For example, have them finally reach a customer service representative who offers a bizarre solution, like transferring the subscription to a rival necromancer.\n\n- **Creativity**:\n  - Incorporate elements of dark comedy and satire, using the concept of a necromancer service as a metaphor for modern subscription woes. Highlight the absurdity of the situation with creative details, such as a \"resurrection hotline\" or \"undead loyalty program.\"\n  - Use imaginative settings and scenarios, like a surreal afterlife waiting room or a mystical call center, to enhance the story's humor and fantasy elements.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and humorous character, using their internal monologue to reveal their personality and frustrations. For example, describe their growing impatience with lines like, \"I swear, if I have to listen to one more hold music rendition of 'Staying Alive,' I'm going to lose it.\"\n  - Create a vivid setting that reflects the story's themes, such as a cluttered, arcane office filled with scrolls and magical artifacts. Use descriptive language to immerse the reader in the protagonist's world and enhance the comedic tone.\n\n- **Language Use**:\n  - Employ a conversational and humorous tone, using first-person narration to create intimacy and immediacy. Use witty and sarcastic language to convey the protagonist's exasperation and the absurdity of their situation.\n  - Use rhetorical devices like hyperbole and irony to enhance the comedic elements. For example, describe the protagonist's frustration with exaggerated statements like, \"At this rate, I'll be the first person to die of boredom after death.\"\n  - Craft natural and engaging dialogue, particularly during interactions with customer service or other characters. Ensure the dialogue reflects the story's humor and the protagonist's personality, adding depth and entertainment to the narrative.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, narrative structure, and thematic focus. The demonstrations often blend humor with a deeper exploration of character dynamics and unexpected twists. They also emphasize a strong sense of setting and character development, often using a first-person perspective to create intimacy and immediacy. The language is typically conversational, with a balance of humor and introspection.\n\nFor the new prompt, the rules will need to reflect the comedic and absurd nature of the situation, focusing on the juxtaposition between the expected chaos of a demonic possession and the mundane reality of office life. The narrative should explore the characters' adaptation to this bizarre situation, highlighting the humor and irony in their acceptance of the demon as a preferable manager. The setting will be crucial in grounding the fantastical elements in a relatable reality, and the language should maintain a light, humorous tone while exploring the characters' perspectives.\n\nI will ensure the rules are detailed, actionable, and include examples that align with the prompt's themes and tone, drawing inspiration from the few-shot demonstrations to maintain consistency in style and structure.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a humorous depiction of the office environment under the demon's management, highlighting the unexpected improvements in workplace morale and productivity. For example, describe how the demon's supernatural abilities streamline tedious tasks, much to the employees' delight.\n  - Develop the narrative by exploring the characters' growing acceptance and even appreciation of the demon's presence. Use specific incidents, such as the demon resolving a long-standing office conflict with ease, to illustrate this shift in perspective.\n  - Conclude with a comedic twist that reinforces the absurdity of the situation, such as the demon receiving an \"Employee of the Month\" award, leaving the protagonist to reflect on the bizarre normalcy of their new reality.\n\n- **Creativity**:\n  - Infuse the narrative with imaginative elements that blend the supernatural with the mundane, such as the demon using its powers to enhance office parties or improve the coffee machine. Use these elements to add humor and depth to the story.\n  - Subvert traditional horror tropes by portraying the demon as a surprisingly competent and charismatic manager, challenging the characters' and readers' expectations. Highlight the irony in the employees' preference for the demon over their previous manager.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and humorous character who navigates the absurdity of their situation with wit and sarcasm. Use internal monologue to reveal their thoughts and reactions to the demon's management style.\n  - Create a vivid and relatable office setting that contrasts with the supernatural elements. Use specific details, such as the layout of the office or the personalities of the coworkers, to ground the story in reality and enhance the comedic impact.\n\n- **Language Use**:\n  - Employ a conversational and humorous tone, using witty dialogue and internal monologue to convey the protagonist's perspective. Use language that captures the absurdity and irony of the situation, such as describing the demon's management techniques with corporate jargon.\n  - Use rhetorical devices like irony and hyperbole to enhance the comedic elements of the narrative. Ensure the language reflects the story's themes of adaptation and unexpected normalcy, engaging the reader with its humor and relatability.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize a blend of humor, irony, and introspection, often subverting traditional narrative tropes. They also focus on character-driven narratives with rich, immersive settings and a balance of tension and resolution. \n\nFor the new prompt, the rules will need to address the ironic twist of the protagonist's unexpected wealth in hell, exploring themes of morality, identity, and the afterlife. The narrative should incorporate dark humor and existential reflection, with a focus on the protagonist's internal conflict and the surreal setting of hell. The language should be vivid and engaging, using a first-person perspective to create intimacy and immediacy.\n\nI will ensure the rules are comprehensive, providing detailed guidance on plot development, creative elements, character and setting development, and language use, with examples inspired by the few-shot demonstrations.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's arrival in hell, immediately confronting the irony of their newfound wealth. Use a scene that highlights their confusion and disbelief, such as a demon accountant presenting their soul balance with a smirk.\n  - Develop the narrative by exploring the protagonist's attempts to understand how they accumulated so many souls. Use flashbacks or encounters with other souls to reveal unexpected actions or consequences from their past life.\n  - Conclude the story with a resolution that reflects the protagonist's acceptance of their situation, perhaps by finding a way to use their wealth for a greater purpose in hell. For example, they might decide to invest in a soul rehabilitation program, adding a layer of redemption to the narrative.\n\n- **Creativity**:\n  - Incorporate dark humor and irony throughout the narrative, using the protagonist's situation to explore themes of morality and identity. For instance, have the protagonist joke about their \"killer\" investment portfolio.\n  - Create a unique and surreal depiction of hell, using imaginative details to enhance the setting. Describe hell as a bustling marketplace where souls are traded like stocks, with demons acting as brokers and advisors.\n  - Subvert traditional afterlife tropes by focusing on the bureaucratic and transactional nature of hell, adding depth and intrigue to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and introspective character, using their internal monologue to reveal their confusion and moral dilemmas. Highlight their journey from disbelief to acceptance, using humor and reflection to add depth.\n  - Establish a vivid and immersive setting that reflects the story's themes and tone. Use detailed descriptions to create a bustling, surreal version of hell, complete with soul exchanges and demonic advisors. Ensure the setting enhances the narrative and provides opportunities for character development.\n\n- **Language Use**:\n  - Employ a conversational and introspective tone, using first-person narration to create intimacy and immediacy. Use humor and irony to convey the protagonist's perspective and enhance the narrative's themes.\n  - Use vivid and descriptive language to create an immersive setting and convey the protagonist's emotions. Incorporate rhetorical devices such as irony and hyperbole to enhance the story's humor and impact.\n  - Craft natural and engaging dialogue that reflects the characters' personalities and the story's themes. Use dialogue to reveal character dynamics and advance the plot, ensuring it contributes to the overall narrative.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as tone, structure, and creativity. The demonstrations often blend humor with tension, use vivid character development, and employ a mix of dialogue and introspection to drive the narrative. The new prompt involves a humorous and potentially absurd scenario, which suggests a need for a balance between comedic elements and the underlying tension of containing a great evil. The rules will need to guide the narrative to explore the implications of such a simplistic solution, develop characters who are both aware of the absurdity and committed to their plan, and use language that captures the humor and gravity of the situation.\n\nThe rules will be organized into the specified categories: **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category will include detailed, actionable instructions with examples that align with the new writing prompt's themes and tone. The examples will be inspired by the style and level of detail in the few-shot demonstrations, ensuring the rules are comprehensive and enable precise emulation of the desired storytelling style.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a scene that highlights the absurdity of the plan to contain the great evil in a box. Use dialogue to introduce the characters' differing perspectives on the plan, such as one character's skepticism and another's unwavering confidence. For example, have a character question, \"And what happens if it gets out?\" to which the other replies, \"We have a bigger box ready.\"\n  - Develop the narrative by exploring the consequences and potential flaws of the plan. Introduce a subplot where the characters must deal with unexpected challenges, such as the box showing signs of wear or the evil attempting to communicate with them. Use these challenges to build tension and humor.\n  - Conclude the story with a resolution that either reinforces the plan's success or highlights its failure in a humorous twist. For instance, reveal that the box was never needed because the evil was misunderstood and harmless.\n\n- **Creativity**:\n  - Infuse the story with imaginative elements that enhance the humor and absurdity of the situation. Describe the box with exaggerated features, such as \"reinforced with dragon scales and enchanted with ancient runes,\" to emphasize its supposed effectiveness.\n  - Incorporate fantastical elements that challenge the characters' perceptions of the great evil. For example, have the evil manifest as a misunderstood creature that simply wants to be left alone, adding depth and humor to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop characters who embody contrasting viewpoints on the plan. Use dialogue and internal monologue to reveal their motivations and personalities. For example, portray one character as a pragmatic realist who questions the plan's feasibility, while the other is an optimistic idealist who believes in its simplicity.\n  - Create a setting that reflects the story's themes and tone. Use vivid descriptions to establish a world where magic and the mundane coexist, such as a bustling marketplace where the box is being prepared amidst everyday life. Ensure the setting enhances the narrative's humor and tension.\n\n- **Language Use**:\n  - Employ a lighthearted and witty tone, using humor and irony to convey the story's themes. Use playful language to describe the characters' interactions and the box's features, such as \"a box so big it could house a small village.\"\n  - Use dialogue to drive the narrative and reveal character dynamics. Ensure the dialogue is sharp and reflective of the characters' personalities, using rhetorical questions and sarcasm to enhance the humor.\n  - Incorporate vivid and imaginative descriptions to create an engaging and immersive narrative. Use language that captures the absurdity and gravity of the situation, balancing humor with the underlying tension of containing a great evil.\n</story_rules>"
]