[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a magic school setting, a public demonstration, and an unexpected encounter with authority figures, suggesting themes of performance, evaluation, and potential conflict or revelation. The rules will need to guide the narrative to explore these themes, ensuring a balance of tension, character development, and imaginative elements. I will incorporate examples that align with the prompt's magical and academic setting, ensuring the rules are actionable and specific.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's public demonstration, focusing on the anticipation and pressure of performing magic in front of peers and faculty. For example, describe the protagonist's nervousness as they prepare to showcase a complex spell they've been practicing all year.\n  - Introduce a turning point when the protagonist returns to the classroom to find the teachers and principal waiting. Use this moment to create tension and uncertainty, as the protagonist wonders about the reason for this unexpected meeting.\n  - Conclude the narrative with a revelation or decision that impacts the protagonist's future at the school. This could involve a special opportunity, a challenge, or a secret being revealed, such as the protagonist being offered a mentorship with a renowned wizard.\n\n- **Creativity**:\n  - Incorporate imaginative magical elements in the protagonist's demonstration, showcasing unique spells or magical creatures. For instance, describe a spell that creates a living tapestry of light and sound, captivating the audience with its beauty and complexity.\n  - Use the setting of the magic school to explore creative and whimsical aspects of magical education. Include details about enchanted classrooms, animated textbooks, or magical creatures that assist in teaching.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and determined student, highlighting their dedication to mastering magic and their personal motivations. Use internal monologue to reveal their thoughts and feelings about the demonstration and the unexpected meeting.\n  - Create a vivid and immersive setting by describing the magic school's unique features, such as floating staircases, talking portraits, and a library filled with sentient books. Use sensory details to bring the school to life and emphasize its magical atmosphere.\n\n- **Language Use**:\n  - Employ a descriptive and engaging language style, using vivid imagery and sensory details to convey the magic and wonder of the school. For example, describe the protagonist's spell as \"a symphony of colors and sounds that danced through the air, leaving trails of shimmering light.\"\n  - Use dialogue to reveal character dynamics and advance the plot, ensuring that conversations between the protagonist and the teachers are tense and revealing. For instance, include a line where the principal says, \"Your demonstration was... unexpected. We need to discuss your future here.\"\n  - Maintain a tone that balances wonder and tension, reflecting the protagonist's excitement and apprehension. Use varied sentence structures to create rhythm and maintain reader engagement throughout the narrative.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used. The demonstrations emphasize a blend of genres, character depth, and creative plot twists. They also focus on vivid language and immersive settings. For the new prompt, I will ensure the rules reflect the themes of love, acceptance, and the supernatural, while incorporating the unique dynamics of a vampire and human relationship. The rules will be organized into the specified categories and include detailed examples to illustrate their application.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with the Vampire Queen receiving the news of her son's love interest, setting a tone of curiosity and anticipation. For example, describe her initial reaction as a mix of surprise and intrigue, as she ponders the implications of a human partner for her son.\n  - Develop a central conflict around the societal expectations and potential challenges of a vampire-human relationship. Introduce a subplot where the Queen must navigate the political ramifications within the vampire court, illustrating her strategic thinking and maternal instincts.\n  - Conclude with a resolution that emphasizes acceptance and unity, such as the Queen hosting a grand event to formally introduce the human partner to the vampire society, showcasing her support and the potential for harmony between the two worlds.\n\n- **Creativity**:\n  - Incorporate elements of gothic romance and supernatural intrigue to enhance the narrative's depth. Use the vampire setting to explore themes of immortality, love, and societal norms, adding layers of complexity to the story.\n  - Introduce imaginative twists, such as the human partner possessing a unique trait or ability that intrigues the vampire court, creating opportunities for unexpected alliances and challenges.\n\n- **Development (Character and Setting)**:\n  - Develop the Vampire Queen as a multifaceted character, balancing her regal authority with her personal desires and maternal instincts. Use her interactions with her son and the human partner to reveal her depth and complexity.\n  - Create an immersive setting that reflects the grandeur and mystery of the vampire world. Use detailed descriptions of the Queen's castle, the opulent vampire court, and the contrasting human world to enhance the story's atmosphere and thematic richness.\n\n- **Language Use**:\n  - Employ a rich and evocative language style, using vivid imagery and descriptive language to convey the opulence and mystery of the vampire world. For example, describe the Queen's castle as \"a towering edifice of shadow and elegance, where whispers of ancient power linger in every corridor.\"\n  - Use dialogue to reveal character dynamics and advance the plot. Ensure that conversations between the Queen, her son, and the human partner are laden with subtext and emotional depth, reflecting the complexities of their relationships.\n  - Maintain a tone that balances gothic elegance with emotional warmth, capturing the duality of the vampire world and the human heart. Use rhetorical devices such as metaphor and symbolism to enrich the narrative and highlight key themes.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The demonstrations emphasize a blend of genres, unexpected twists, and deep character introspection. They also highlight the importance of vivid settings and the use of supernatural or fantastical elements to drive the narrative. For the new prompt, I will focus on the transformation of the ship, the protagonist's connection to their past life, and the mission that remains unfinished. I will ensure the rules are actionable, specific, and include examples that align with the prompt's themes of mystery, reincarnation, and adventure.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's discovery of the shipwreck, emphasizing the emotional and mysterious connection they feel. For example, describe how the protagonist is inexplicably drawn to the wreck, feeling a sense of déjà vu and curiosity.\n  - Introduce the transformation of the ship into a ghost ship as a pivotal moment that reveals the protagonist's past life as its captain. Use this transformation to set the stage for the protagonist's new mission, creating a sense of urgency and destiny.\n  - Conclude the narrative with the protagonist accepting their role and embarking on the mission, leaving room for future adventures. For instance, depict the protagonist stepping aboard the ghost ship, ready to face the unknown challenges ahead.\n\n- **Creativity**:\n  - Incorporate elements of mystery and the supernatural to enhance the narrative's intrigue. Use the ship's transformation and the protagonist's reincarnation as central themes that drive the story forward.\n  - Explore the concept of unfinished business and destiny, using the ghost ship as a metaphor for the protagonist's unresolved past. For example, describe how the ship's haunting presence symbolizes the weight of the protagonist's forgotten responsibilities.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a complex character with a deep connection to their past life. Use internal monologue and flashbacks to reveal their growing awareness of their identity and mission.\n  - Create an immersive setting by vividly describing the shipwreck and its transformation into a ghost ship. Use sensory details to convey the eerie atmosphere and the ship's otherworldly presence, such as the creaking of the hull and the ghostly glow of the sails.\n\n- **Language Use**:\n  - Employ a descriptive and atmospheric language style to convey the story's mysterious and supernatural tone. Use vivid imagery and sensory details to create an immersive experience for the reader.\n  - Use dialogue and internal monologue to reveal the protagonist's thoughts and emotions, emphasizing their connection to the ship and their past life. For example, include lines where the protagonist questions their identity and destiny, adding depth to their character.\n  - Maintain a pacing that builds tension and anticipation, using short, impactful sentences during moments of transformation and revelation to heighten the narrative's impact.\n</story_rules>"
]