[
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as tone, plot structure, character development, and language use. The few-shot examples often blend humor with tension, incorporate unique twists, and focus on character dynamics. The new prompt suggests a humorous and slightly tense scenario involving a character's reluctance to explore a mysterious cave, emphasizing a practical and perhaps skeptical perspective. The rules will need to reflect this tone, ensuring the narrative is engaging and aligns with the prompt's themes of mystery, humor, and practicality.\n\nThe rules will be organized into categories: **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category will include specific, actionable instructions with examples that align with the prompt's objectives. The examples will be inspired by the style and detail level of the few-shot demonstrations, ensuring they are illustrative and relevant to the new writing prompt. The rules will be written in the second person to provide clear guidance for a language model to follow. \n\nI will ensure the rules are comprehensive, covering all narrative aspects relevant to the prompt, and provide detailed guidance to enable precise emulation of the desired storytelling style. The rules will avoid comparative terms and be absolute and specific, allowing for independent application.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Start the story with a humorous and tense exchange between the protagonist and their adventurous friend, setting up the conflict of whether to explore the cave. Use dialogue to establish the protagonist's reluctance and practical mindset, such as, \"You wanna go in the spooky cave hole covered in creepy cave paintings and symbols, you feel free.\"\n  - Develop the plot by introducing a series of comedic and suspenseful events as the friend attempts to convince the protagonist to explore the cave. Include a moment where the protagonist's practical approach, like using a cement mixer, creates an unexpected obstacle or humorous situation.\n  - Conclude with a resolution that reinforces the protagonist's practicality, such as successfully sealing the cave entrance, while leaving room for a humorous twist or future adventure.\n\n- **Creativity**:\n  - Incorporate elements of humor and mystery by blending the protagonist's practical actions with the eerie setting of the cave. Use the cement mixer as a comedic tool that contrasts with the supernatural elements, creating a unique narrative dynamic.\n  - Introduce imaginative details about the cave paintings and symbols, suggesting a mysterious backstory that adds depth to the setting. Use these details to enhance the tension and intrigue without overshadowing the comedic tone.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a pragmatic and humorous character, using their dialogue and actions to reveal their skepticism and practicality. Contrast this with the adventurous and curious nature of their friend, creating dynamic character interactions.\n  - Set the story in a remote and atmospheric location, using vivid descriptions to convey the cave's mysterious and eerie ambiance. Highlight the contrast between the natural setting and the protagonist's modern, practical tools, such as the cement mixer.\n\n- **Language Use**:\n  - Employ a conversational and humorous tone, using witty dialogue and playful banter to engage the reader. Use informal language to reflect the protagonist's practical and down-to-earth personality.\n  - Use vivid and descriptive language to create an immersive atmosphere, particularly when describing the cave and its mysterious elements. Balance humor and tension in the narrative, ensuring the language maintains a light-hearted yet suspenseful tone.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, plot structure, creativity, character development, and language use. The few-shot examples often blend humor with fantasy or supernatural elements, creating a narrative that is both engaging and whimsical. The rules should reflect a balance of humor, creativity, and character-driven storytelling, with a focus on the protagonist's unique journey and the fantastical elements of their job. The examples should illustrate how to incorporate these elements effectively, ensuring the narrative remains cohesive and entertaining.\n\nThe new writing prompt involves a humorous and fantastical scenario where the protagonist works for a Pandimensional Lost and Found. The story should explore the protagonist's journey, the whimsical nature of their job, and the ongoing quest for the elusive sock. The rules will guide the LLM in crafting a narrative that captures the humor and absurdity of the situation while developing a relatable and engaging protagonist.\n\nI will ensure the rules are specific, actionable, and include examples that align with the prompt's themes and tone. The rules will be organized into the specified categories, providing comprehensive guidance for plot development, creativity, character and setting development, and language use.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a humorous and mundane activity, such as the protagonist searching for a lost sock, which leads to the unexpected job offer from the Pandimensional Lost and Found. Use this setup to establish the protagonist's initial disbelief and curiosity.\n  - Develop the plot through a series of whimsical and fantastical missions that highlight the protagonist's skills and the bizarre nature of their job. Include a variety of lost items and dimensions to explore, each with its own unique challenges and comedic elements.\n  - Conclude the narrative with a reflective moment where the protagonist realizes the significance of their journey and the relationships they've formed, even if the sock remains elusive. Use this resolution to emphasize themes of purpose and fulfillment beyond material possessions.\n\n- **Creativity**:\n  - Incorporate imaginative and diverse dimensions that the protagonist visits, each with its own set of rules and inhabitants. Use these settings to explore creative scenarios and challenges, such as retrieving a lost item from a dimension where gravity works in reverse.\n  - Use humor and absurdity to enhance the narrative, such as describing the protagonist's interactions with eccentric characters or the unexpected consequences of their missions. For example, have the protagonist negotiate with a sentient cloud to retrieve a lost umbrella.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a resourceful and adaptable character, using their experiences and interactions to reveal their growth and resilience. Highlight their determination and humor in the face of bizarre challenges.\n  - Create a rich and varied setting by describing the Pandimensional Lost and Found office and the different dimensions the protagonist visits. Use vivid imagery and sensory details to bring these settings to life, such as the chaotic yet organized nature of the office or the vibrant colors of a candy-themed dimension.\n\n- **Language Use**:\n  - Employ a light-hearted and humorous tone, using witty dialogue and playful narration to engage the reader. Use first-person perspective to provide an intimate connection with the protagonist's thoughts and experiences.\n  - Use descriptive language to enhance the whimsical and fantastical elements of the story, ensuring the reader can visualize the unique dimensions and characters. For example, describe a dimension where time flows backward, and the protagonist must think in reverse to solve a problem.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with a strong hook, developing characters through dialogue and internal conflict, and using vivid language to create an immersive atmosphere. The new writing prompt involves themes of memory, nostalgia, and addiction, which require a nuanced approach to character development and emotional depth. I will ensure the rules reflect these themes and provide detailed examples to guide the narrative effectively.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist experiencing a sudden and vivid memory that triggers a feeling of nostalgia. Use this moment to establish the central conflict of the narrative, focusing on the protagonist's emotional response and the significance of the memory. For example, describe the protagonist walking past a bakery and being overwhelmed by the scent of freshly baked bread, which evokes a forgotten childhood memory.\n  - Develop the plot by illustrating the protagonist's growing obsession with recapturing the feeling of nostalgia. Use a series of escalating events where the protagonist seeks out familiar places, objects, or people in an attempt to trigger more memories. Ensure these attempts lead to both positive and negative consequences, highlighting the addictive nature of nostalgia.\n  - Conclude the narrative with a moment of realization or self-awareness, where the protagonist acknowledges the impact of their obsession on their life. Use this resolution to explore themes of acceptance and the complexity of memory, leaving the protagonist with a sense of hope or understanding.\n\n- **Creativity**:\n  - Incorporate imaginative elements that explore the concept of memory and nostalgia in unique ways. Use metaphors and symbolism to represent the protagonist's internal struggle, such as describing memories as elusive butterflies that the protagonist tries to catch.\n  - Blend elements of magical realism to enhance the narrative, such as objects or places that seem to hold a magical quality in triggering memories. For example, describe a music box that, when played, transports the protagonist to a vivid memory of a family gathering.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a complex and relatable character, using internal monologue and dialogue to explore their emotional journey. Highlight their vulnerability and the impact of memory loss on their identity, using phrases like \"For the first time in years, I felt like I was truly alive.\"\n  - Create a rich and immersive setting that reflects the protagonist's emotional state and enhances the narrative. Use sensory details to evoke the atmosphere of key locations, such as a childhood home or a favorite park, ensuring these settings play a crucial role in triggering memories.\n\n- **Language Use**:\n  - Employ a reflective and introspective tone, using vivid and descriptive language to convey the protagonist's emotional experiences. Use sensory details to create an immersive atmosphere, such as \"The scent of cinnamon and sugar wrapped around me like a warm embrace, pulling me back to a time I thought I'd lost forever.\"\n  - Use a mix of short, impactful sentences and longer, flowing passages to control pacing and reflect the protagonist's emotional journey. Ensure dialogue is natural and reveals character depth, focusing on the protagonist's interactions with others as they navigate their addiction to nostalgia.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, narrative structure, and character dynamics. The prompt presents a scenario involving an unexpected gift and themes of worthiness and intention. The rules will need to guide the development of a plot that explores these themes, using creativity to subvert expectations and develop characters who navigate complex emotional landscapes. The language should reflect a tone that balances sincerity with underlying tension or mystery, as seen in the few-shot examples. Each rule will include concrete examples to illustrate how to apply these elements effectively.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a direct and impactful dialogue that introduces the gift and the giver's intentions. Use this moment to establish the central conflict or tension, such as the recipient's internal struggle with feelings of unworthiness. For example, start with the line, \"I know you want to refuse my gift, because you don't think you deserve it.\"\n  - Develop the plot by exploring the recipient's journey of acceptance or rejection of the gift. Include moments of introspection and external conflict that challenge their beliefs about worthiness and intention. Conclude with a resolution that reflects a change in the recipient's perspective, whether they accept the gift or not.\n\n- **Creativity**:\n  - Introduce a unique and imaginative gift that holds symbolic or magical significance, adding depth to the narrative. Use this gift to explore themes of power, responsibility, or transformation. For example, the gift could be an ancient artifact that grants insight into one's true self.\n  - Subvert expectations by revealing the giver's true motivations, which may be altruistic, manipulative, or enigmatic. Use this revelation to add complexity and intrigue to the story, challenging the recipient's initial assumptions.\n\n- **Development (Character and Setting)**:\n  - Develop the recipient as a complex character with a rich internal world, using their thoughts and reactions to the gift to reveal their personality and backstory. Highlight their internal conflict and growth throughout the narrative.\n  - Create a setting that enhances the story's themes and mood, such as a mystical forest or a grand, ancient hall. Use vivid descriptions to immerse the reader in the environment and reflect the emotional tone of the narrative.\n\n- **Language Use**:\n  - Employ a tone that balances sincerity with underlying tension or mystery, using dialogue and narrative voice to convey the characters' emotions and intentions. For example, use lines like, \"By no means have you earned this blessing. But this has nothing to do with what you deserve.\"\n  - Use descriptive and evocative language to create a rich sensory experience, focusing on the details of the gift and the setting. Ensure the language reflects the story's themes and emotional depth, maintaining reader engagement through dynamic pacing and vivid imagery.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, plot structure, character development, and language use. The new prompt involves themes of immortality, recent transformation, and the implications of eternal life. The rules must guide the narrative to explore these themes with depth and creativity, while maintaining a tone that can balance humor and introspection, as seen in the few-shot examples. I will ensure the rules are specific, actionable, and include examples that align with the prompt's unique narrative potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's initial reaction to their newfound immortality, using introspective narration to convey their mixed emotions. For example, start with the protagonist reflecting on the mundane aspects of eternal life, such as, \"I never thought I'd be stuck at twenty-five forever, but here I am, still getting carded at bars.\"\n  - Develop the plot through a series of encounters that highlight the protagonist's adjustment to immortality, such as meeting other immortals or facing challenges that test their new reality. Use these encounters to explore the implications of eternal life, both humorous and serious.\n  - Conclude the narrative with a moment of acceptance or a new understanding of immortality, leaving room for future exploration. For instance, have the protagonist find solace in a new hobby or relationship that gives meaning to their eternal existence.\n\n- **Creativity**:\n  - Incorporate unique and imaginative elements that explore the concept of immortality in unconventional ways. Use humor and irony to highlight the protagonist's struggles and triumphs, such as dealing with mundane annoyances like renewing a driver's license every few years.\n  - Introduce fantastical elements that contrast with the protagonist's everyday life, such as a secret society of immortals or magical artifacts that influence their journey. Use these elements to add depth and intrigue to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and introspective character, using their internal monologue and interactions to reveal their personality and emotional journey. Highlight their initial disbelief and gradual acceptance of immortality through their thoughts and actions.\n  - Create a setting that reflects the protagonist's dual existence, blending the ordinary with the extraordinary. Use familiar environments, like a coffee shop or a park, to ground the story, while introducing magical or surreal elements that enhance the narrative.\n\n- **Language Use**:\n  - Employ a conversational and reflective tone, using witty dialogue and introspective narration to engage the reader. Use humor and irony to convey the protagonist's perspective on immortality, such as, \"Turns out, eternal youth isn't all it's cracked up to be when you're stuck in a perpetual quarter-life crisis.\"\n  - Use vivid imagery and sensory details to create an immersive atmosphere, particularly when describing the protagonist's experiences and emotions. Ensure the language is accessible and engaging, with a balance of humor and introspection to maintain reader interest.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a confrontation with Santa Claus, who is portrayed as a defender of humanity against a potentially apocalyptic threat. The tone should balance between whimsical and serious, reflecting the fantastical nature of Santa and the gravity of the situation. The rules will need to guide the narrative towards a resolution that emphasizes themes of redemption, belief in goodness, and the power of collective niceness.\n\n1. **Plot**: The plot should begin with an immediate conflict involving Santa and an antagonist threatening the world. The narrative should progress through a series of challenges or debates, leading to a resolution where Santa's belief in humanity's goodness prevails.\n\n2. **Creativity**: The story should creatively blend elements of fantasy and holiday lore, using Santa's magical abilities and iconic elements (like the Naughty and Nice lists) to drive the plot and add depth to the narrative.\n\n3. **Development (Character and Setting)**: Characters should be developed through their interactions and dialogue, with Santa portrayed as wise, compassionate, and determined. The setting should be a blend of the magical and the mundane, such as Santa's workshop or a snowy landscape, to enhance the fantastical elements.\n\n4. **Language Use**: The language should be vivid and engaging, using a mix of whimsical and serious tones to reflect the dual nature of the narrative. Dialogue should be impactful and reveal character motivations and themes.\n\nI will now generate the **Story Rules** based on these insights.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a dramatic confrontation between Santa and an antagonist who threatens to destroy the world. Use Santa's firm declaration, \"I won't let you destroy this world,\" to set the stakes and establish the central conflict.\n  - Develop the plot through a series of challenges or debates where Santa defends humanity's goodness, using examples from his Naughty and Nice lists. Ensure the narrative includes moments of tension and doubt, but ultimately leads to a resolution where Santa's belief in humanity prevails.\n  - Conclude with a resolution that emphasizes themes of redemption and the power of collective niceness, such as the antagonist being swayed by Santa's arguments or a magical intervention that showcases humanity's goodness.\n\n- **Creativity**:\n  - Incorporate elements of fantasy and holiday lore, such as Santa's magical abilities, reindeer, and the iconic Naughty and Nice lists. Use these elements to drive the plot and add depth to the narrative.\n  - Introduce imaginative scenarios that blend the whimsical with the serious, such as a magical courtroom where Santa presents evidence of humanity's goodness or a showdown at the North Pole.\n\n- **Development (Character and Setting)**:\n  - Develop Santa as a wise, compassionate, and determined character, using his dialogue and actions to reveal his belief in humanity's goodness. Portray the antagonist as initially skeptical or hostile, but capable of change.\n  - Set the story in a blend of magical and mundane environments, such as Santa's workshop or a snowy landscape. Use vivid descriptions to enhance the fantastical elements and create an immersive atmosphere.\n\n- **Language Use**:\n  - Employ a mix of whimsical and serious tones, using vivid and engaging language to reflect the dual nature of the narrative. Use descriptive imagery to bring the setting and characters to life.\n  - Use impactful dialogue to reveal character motivations and themes, ensuring that Santa's words are both wise and heartfelt. For example, have Santa say, \"My lists have never lied. In the end, most humans are Nice, and I will prove it.\"\n</story_rules>"
]