[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, plot structure, character development, and language use. The demonstrations often blend humor with unexpected twists, use vivid character interactions, and incorporate imaginative scenarios. The new prompt involves a humorous and supernatural situation, requiring a balance of comedy, surprise, and character dynamics. I will ensure the rules guide the narrative to explore the protagonist's playful nature, the unexpected consequences of their actions, and the reactions of those involved. The rules will include examples to illustrate how to effectively convey humor, surprise, and character development in this context.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's decision to play along with the exorcism, setting a humorous and mischievous tone. Use internal monologue to express their amusement and curiosity about the situation.\n  - Develop the plot by introducing the exorcist's arrival and the protagonist's playful antics, leading to the unexpected consequence of the exorcist spontaneously combusting. Ensure this event is portrayed with a mix of shock and humor, maintaining the light-hearted tone.\n  - Conclude the narrative with the protagonist's reflection on the incident, exploring their feelings of surprise and the potential implications. Use this resolution to highlight the protagonist's growth or change in perspective.\n\n- **Creativity**:\n  - Incorporate elements of dark humor and supernatural phenomena to enhance the story's uniqueness. Use the protagonist's playful nature to explore imaginative scenarios, such as pretending to speak in tongues or making exaggerated gestures during the exorcism.\n  - Introduce unexpected twists, such as the exorcist's reaction to the \"curse\" and the comedic aftermath of their combustion. Use these elements to maintain reader engagement and add depth to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a mischievous and curious individual, using their internal monologue and interactions with the exorcist to reveal their personality. Highlight their playful approach to the situation and their reaction to the unexpected outcome.\n  - Characterize the exorcist as earnest and slightly overzealous, providing a contrast to the protagonist's playful demeanor. Use their interactions to create comedic tension and enhance the story's humor.\n  - Set the story in a familiar, domestic environment, such as the protagonist's home, to ground the supernatural elements in reality. Use detailed descriptions of the setting to enhance the atmosphere and support the narrative's tone.\n\n- **Language Use**:\n  - Employ a conversational and humorous tone, using witty dialogue and internal monologue to reflect the protagonist's playful nature. For example, describe the protagonist's thoughts with phrases like, \"I couldn't resist the urge to ham it up a bit.\"\n  - Use vivid and dynamic language to convey the supernatural elements and the comedic aspects of the story. Incorporate sensory details to enhance the reader's experience, such as describing the exorcist's dramatic gestures or the sudden burst of flames.\n  - Maintain a brisk pacing, using quick transitions and sharp dialogue to keep the narrative engaging and dynamic. Use language that balances humor and surprise, ensuring the story remains light-hearted despite the supernatural events.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, plot structure, creativity, character development, and language use. The few-shot examples often blend humor with fantastical or science fiction elements, focusing on character interactions and unexpected twists. The rules should guide the narrative to explore themes of surprise, adaptation, and humor, while maintaining a light-hearted and engaging tone. The examples should illustrate how to incorporate these elements effectively, ensuring the story remains cohesive and entertaining.\n\nFor the new prompt, the story will revolve around a human protagonist suddenly thrust into an intergalactic scenario, marrying multiple princesses. The plot should explore the protagonist's reactions and interactions with the princesses, highlighting cultural differences and humorous misunderstandings. Creativity will involve imaginative depictions of alien cultures and customs. Character development will focus on the protagonist's adaptability and the unique traits of each princess. Language use will emphasize humor, vivid descriptions, and engaging dialogue to bring the story to life.\n\nI will ensure the rules are specific, actionable, and include examples that align with the prompt's themes and objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist receiving the unexpected news of their selection to marry 15 galactic princesses. Use a humorous and bewildered tone to capture their initial reaction, such as, \"I thought it was a prank until the spaceship landed in my backyard.\"\n  - Develop the plot by exploring the protagonist's interactions with each princess, focusing on the challenges and comedic situations arising from cultural differences and expectations. For example, describe a scene where the protagonist struggles to understand a princess's unique courting ritual involving telepathic dance.\n  - Conclude the narrative with the protagonist finding a way to balance the relationships, perhaps by discovering a shared interest or common goal among the princesses, leading to a harmonious resolution.\n\n- **Creativity**:\n  - Create diverse and imaginative alien cultures for each princess, incorporating unique customs, appearances, and technologies. For instance, one princess might come from a water-based planet and require a special suit to survive on land, adding a layer of complexity to their interactions.\n  - Use humor to highlight the absurdity and novelty of the situation, such as the protagonist's attempts to learn alien etiquette or the princesses' reactions to Earth customs. Include a scene where the protagonist accidentally offends a princess by offering a handshake, which is considered a marriage proposal on her planet.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as adaptable and open-minded, using their internal monologue to convey their thoughts and feelings about the overwhelming situation. Highlight their growth as they learn to navigate the complexities of intergalactic relationships.\n  - Characterize each princess with distinct personalities and traits, using dialogue and interactions to reveal their individual quirks and preferences. For example, one princess might be a fierce warrior with a soft spot for Earth music, leading to a bonding moment over a shared playlist.\n  - Create a vivid setting by describing the various environments and technologies of the galactic realm, such as the opulent spaceship that serves as the venue for the wedding ceremonies. Use sensory details to immerse the reader in the alien worlds.\n\n- **Language Use**:\n  - Employ a light-hearted and humorous tone throughout the story, using witty dialogue and playful descriptions to engage the reader. For instance, describe the protagonist's reaction to the spaceship as \"a cross between a disco ball and a giant jellyfish.\"\n  - Use vivid and imaginative language to bring the alien cultures and settings to life, incorporating specific details and creative metaphors. Include phrases like \"the air shimmered with the scent of stardust and alien spices\" to enhance the narrative's richness.\n  - Incorporate engaging dialogue that reflects the characters' personalities and cultural backgrounds, using humor and irony to highlight misunderstandings and cultural exchanges. Ensure the dialogue is dynamic and contributes to character development and plot progression.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize a blend of humor, introspection, and unexpected twists, often incorporating elements of fantasy or science fiction. They also highlight the importance of character development and immersive settings, using vivid descriptions and engaging dialogue.\n\nFor the new writing prompt, the story will revolve around the unexpected revelation of the grandfather's ability to speak and the mystery of what \"getting started\" entails. The narrative should explore themes of family, legacy, and hidden talents or secrets. The tone should balance intrigue with warmth, reflecting the familial bond and the protagonist's journey of discovery.\n\nI will ensure the rules are specific, actionable, and include detailed examples inspired by the few-shot demonstrations. The rules will guide the LLM in creating a narrative that aligns with the prompt's themes and potential, using a second-person narrative to provide clear instructions.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's routine of caring for their nonverbal grandfather, establishing a sense of normalcy and familial duty. Use this setup to create a contrast with the grandfather's sudden ability to speak.\n  - Develop the plot by revealing a hidden family secret or mission that the grandfather has been waiting to share. Use the phrase \"Finally, let's get started\" as a catalyst for the protagonist's journey into uncovering this secret.\n  - Conclude the narrative with a resolution that highlights the protagonist's growth and understanding of their family legacy. Ensure the ending is satisfying and ties back to the initial revelation, such as the protagonist embracing their new role or responsibility.\n\n- **Creativity**:\n  - Incorporate elements of mystery and intrigue by introducing a hidden talent or secret project that the grandfather has been working on. Use this element to drive the narrative and engage the reader's curiosity.\n  - Use imaginative scenarios, such as the grandfather revealing a hidden workshop or a collection of mysterious artifacts, to add depth and interest to the story. Ensure these elements are woven seamlessly into the narrative and contribute to the overall plot.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a caring and curious individual, whose relationship with their grandfather is central to the story. Use their internal monologue to convey their thoughts and emotions as they navigate the unfolding mystery.\n  - Characterize the grandfather as a wise and enigmatic figure, whose nonverbal state has hidden a wealth of knowledge and experience. Use dialogue and actions to reveal his personality and motivations.\n  - Create an immersive setting by vividly describing the grandfather's home and any secret locations or items revealed during the story. Use sensory details to enhance the atmosphere and draw the reader into the narrative.\n\n- **Language Use**:\n  - Employ a reflective and engaging tone, using first-person narration to create intimacy and connection with the reader. Focus on the protagonist's thoughts and feelings to drive the narrative.\n  - Use descriptive language to convey the mystery and intrigue of the grandfather's revelation. Incorporate vivid imagery and sensory details to enhance the reader's experience and immersion in the story.\n  - Include dialogue that reflects the grandfather's wisdom and the protagonist's curiosity, using it to reveal key plot points and character dynamics. Ensure the language is clear and engaging, maintaining the reader's interest throughout the narrative.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize a blend of humor, introspection, and imaginative scenarios, often incorporating unexpected twists and character dynamics. The new writing prompt involves themes of time, technological advancement, and the protagonist's adjustment to an unexpected reality, which can be explored through a mix of humor and introspection. I will ensure the rules are specific, actionable, and include detailed examples that align with the prompt's themes and potential narrative arcs.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's awakening from a long journey, emphasizing their anticipation of being a pioneer on a new planet. Use internal monologue to express their excitement and expectations.\n  - Introduce the twist of encountering other humans who arrived via a faster spaceship, highlighting the protagonist's surprise and initial disappointment. Use dialogue to reveal the technological advancements that occurred during their journey.\n  - Develop the plot by focusing on the protagonist's adaptation to the new reality, exploring themes of obsolescence and reintegration. Conclude with the protagonist finding a new purpose or role in this advanced society, such as becoming a historian or cultural liaison.\n\n- **Creativity**:\n  - Incorporate elements of humor and irony, particularly in the protagonist's reactions to the unexpected situation. Use their internal monologue to reflect on the absurdity of their predicament, such as \"I thought I'd be the first, but it turns out I'm just late to the party.\"\n  - Introduce imaginative technological advancements that occurred during the protagonist's journey, such as teleportation devices or AI companions, to enhance the futuristic setting and add depth to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a curious and adaptable individual, using their internal monologue and interactions with the new society to reveal their personality and growth. Highlight their initial feelings of being out of place and their journey towards acceptance and integration.\n  - Create a vivid setting that contrasts the protagonist's expectations with the reality of the advanced society. Use detailed descriptions of the new planet's environment and the technological innovations to immerse the reader in the world.\n\n- **Language Use**:\n  - Employ a reflective and humorous tone, using the protagonist's internal monologue to convey their thoughts and emotions. Use informal language and rhetorical questions to create a relatable and engaging narrative voice.\n  - Use descriptive language to vividly depict the advanced technology and the new planet's environment, enhancing the reader's immersion in the story. For example, describe the bustling spaceport with \"gleaming ships zipping by like shooting stars\" and the protagonist's awe at the \"towering skyscrapers that seemed to touch the sky.\"\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves themes of deception, underestimation, and hidden strength, which should be reflected in the rules. The narrative should focus on the protagonist's unique abilities and the misconceptions of others, using a blend of intrigue and revelation. The rules will guide the LLM to create a story that highlights the protagonist's intelligence and resourcefulness, despite their blindness, and the eventual realization of those who underestimate them. Examples will be inspired by the detailed and imaginative scenarios in the few-shot demonstrations, ensuring the rules are comprehensive and actionable.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story by establishing the protagonist's role as the king's closest advisor, emphasizing their perceived vulnerability due to blindness. Use an initial scene where others underestimate the protagonist, setting the stage for the unfolding revelation.\n  - Develop the plot through a series of interactions where the protagonist's intelligence and strategic mind are subtly revealed. Use these interactions to build tension and anticipation, leading to a climactic moment where the protagonist's true capabilities are unveiled.\n  - Conclude with a satisfying resolution where those who underestimated the protagonist are left in awe or regret, highlighting the protagonist's triumph and the folly of assumptions. For example, depict a scene where the protagonist outmaneuvers a would-be assassin using their acute senses and strategic foresight.\n\n- **Creativity**:\n  - Incorporate elements of intrigue and mystery by exploring the protagonist's unique methods of perception and strategy. Use creative scenarios where the protagonist's blindness becomes an advantage, such as navigating a darkened room with ease while others struggle.\n  - Introduce imaginative elements that enhance the narrative, such as a secret network of informants or a hidden talent for deciphering coded messages. Use these elements to add depth and complexity to the protagonist's character and abilities.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a multifaceted character, showcasing their intelligence, resourcefulness, and resilience. Use internal monologue and interactions with other characters to reveal their strategic mind and depth of character.\n  - Create a rich setting that reflects the political and social dynamics of the court. Use detailed descriptions to convey the opulence and intrigue of the royal environment, enhancing the story's atmosphere and tension.\n\n- **Language Use**:\n  - Employ a sophisticated and articulate tone, using precise and evocative language to convey the protagonist's thoughts and observations. Focus on sensory details that highlight the protagonist's heightened non-visual senses, such as sound and touch.\n  - Use dialogue to reveal character dynamics and advance the plot, ensuring each conversation adds depth and intrigue. For example, include a scene where the protagonist subtly manipulates a conversation to gather crucial information, demonstrating their strategic acumen.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize a blend of humor, introspection, and imaginative scenarios, often incorporating elements of fantasy or science fiction. They also focus on character development through internal monologue and interactions with unique settings. \n\nFor the new writing prompt, the rules will need to guide the creation of a narrative that explores themes of mystery and nostalgia, with a focus on the protagonist's journey through the abandoned theme park. The rules will incorporate elements of suspense and discovery, using vivid descriptions and a reflective tone to engage the reader. The protagonist's motivations and emotional journey will be central to the narrative, with the setting playing a crucial role in enhancing the story's atmosphere.\n\nI will ensure the rules are specific, actionable, and include detailed examples inspired by the few-shot demonstrations, aligning with the new writing prompt's themes and narrative potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's arrival at the abandoned theme park, setting the stage for a journey of discovery and introspection. Use the protagonist's internal monologue to express their curiosity and determination to uncover the park's secrets.\n  - Develop the plot by introducing mysterious and unexpected elements within the park, such as hidden messages or remnants of past events. Use these discoveries to build suspense and drive the narrative forward.\n  - Conclude the story with a revelation or personal insight that provides closure to the protagonist's quest, emphasizing the emotional and thematic significance of their journey. For example, the protagonist might find a forgotten diary that reveals the park's history and its impact on their family.\n\n- **Creativity**:\n  - Incorporate elements of mystery and nostalgia into the narrative, using the theme park's abandoned attractions and decaying structures to evoke a sense of wonder and intrigue.\n  - Use imaginative scenarios to enhance the story's atmosphere, such as animatronic figures that seem to come to life or a hidden room filled with memorabilia. These elements should contribute to the protagonist's exploration and the park's enigmatic allure.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a curious and determined individual, driven by a personal connection to the theme park. Use their internal monologue and interactions with the environment to reveal their motivations and emotional journey.\n  - Create a vivid and immersive setting by describing the theme park's attractions, overgrown pathways, and eerie silence. Use sensory details to enhance the reader's experience and convey the park's atmosphere, such as the creaking of rusted rides or the smell of damp earth.\n\n- **Language Use**:\n  - Employ a reflective and descriptive tone, using the protagonist's internal monologue to convey their thoughts and emotions. Focus on creating a sense of mystery and nostalgia through detailed descriptions and evocative language.\n  - Use vivid imagery and sensory details to bring the theme park to life, capturing its decaying beauty and haunting presence. For example, describe the way the moonlight casts shadows on the abandoned roller coaster, or the sound of leaves rustling in the wind.\n  - Incorporate dialogue sparingly, using it to reveal key information or enhance the protagonist's interactions with the environment. Ensure the language reflects the protagonist's perspective and emotional journey.\n</story_rules>"
]