[
    "<thinking>\nTo create the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, narrative style, and thematic focus. The few-shot examples often blend humor with speculative fiction, use a conversational tone, and focus on character introspection and development. The new prompt involves a twist on the classic idea of the Abyss, presenting it as a personable character. This suggests a narrative that combines existential themes with humor and character interaction. I will ensure the rules reflect these elements, providing detailed guidance on plot, creativity, character and setting development, and language use, with examples to illustrate each rule.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's initial encounter with the Abyss, setting up expectations of dread and fear. Quickly subvert these expectations by revealing the Abyss as a friendly and approachable character. For example, describe the protagonist preparing for a terrifying experience, only to be greeted by the Abyss offering a cup of tea and a friendly chat.\n  - Develop the narrative around the evolving relationship between the protagonist and the Abyss. Use their interactions to explore themes of perception, fear, and understanding. For instance, depict the protagonist's gradual realization that the Abyss is more interested in discussing philosophy and sharing jokes than embodying existential dread.\n  - Conclude the story with a resolution that highlights the protagonist's changed perspective on the Abyss and themselves. This could involve the protagonist finding peace or gaining new insights into their own fears and assumptions.\n\n- **Creativity**:\n  - Reimagine the concept of the Abyss as a character with depth and personality. Use humor and irony to contrast the traditional view of the Abyss with its actual demeanor. For example, portray the Abyss as a well-read, witty individual who enjoys discussing literature and existential topics over a game of chess.\n  - Incorporate elements of fantasy and whimsy to enhance the narrative's imaginative quality. Describe the Abyss's domain as a surreal, ever-changing landscape that reflects its mood and interests, such as a library with infinite books or a garden of glowing plants.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a curious and introspective individual, initially driven by fear but gradually opening up to the Abyss's friendly nature. Use internal monologue to convey their evolving thoughts and feelings.\n  - Characterize the Abyss as a multidimensional being with a unique perspective on existence. Use dialogue to reveal its personality, interests, and wisdom, making it a compelling and relatable character.\n  - Create a setting that reflects the Abyss's dual nature, combining elements of darkness and light, mystery and familiarity. Use vivid descriptions to bring this setting to life, such as a vast, starry void that feels both infinite and intimate.\n\n- **Language Use**:\n  - Employ a conversational and humorous tone, using irony and wit to subvert expectations and engage the reader. Use phrases that highlight the contrast between the protagonist's fears and the Abyss's actual nature, such as \"I expected eternal darkness, but got eternal tea time instead.\"\n  - Use descriptive language to evoke the surreal and fantastical elements of the setting, enhancing the story's imaginative quality. For example, describe the Abyss's domain with sensory details that capture its otherworldly beauty and charm.\n  - Maintain a first-person perspective to create an intimate connection with the reader, allowing them to experience the protagonist's journey and transformation firsthand.\n</story_rules>",
    "<thinking>\nTo create the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used. The demonstrations emphasize a blend of humor, introspection, and unique narrative devices, often focusing on the protagonist's internal journey and the unexpected twists in their situation. The rules should guide the LLM to craft a narrative that explores the protagonist's relationship with the villainess, the social dynamics at the wedding, and the humorous and awkward situations that arise. The examples should illustrate these elements clearly, ensuring the narrative remains engaging and true to the prompt's potential.\n\nThe rules will be organized into the specified categories: **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category will include detailed, actionable instructions with examples that align with the new writing prompt's themes and tone. The rules will be written in the second person to provide clear guidance for the LLM. I will ensure the rules are comprehensive, covering all relevant narrative aspects, and avoid using comparative or relative terms. The examples will be inspired by the few-shot demonstrations, reflecting the same depth and granularity. \n\nNow, I will proceed to generate the **Story Rules** for the new writing prompt. \n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's initial reaction to the unexpected invitation, highlighting their surprise and internal conflict. For example, describe the protagonist's thoughts as they process the request, considering the implications of attending a wedding with a villainess.\n  - Develop the narrative around the protagonist's preparation for the wedding, focusing on their attempts to navigate the social dynamics and potential dangers of the event. Include scenes where the protagonist strategizes how to handle interactions with other guests and the villainess's family.\n  - Introduce comedic and awkward situations at the wedding, such as misunderstandings or unexpected encounters with other villains. Use these moments to explore the protagonist's adaptability and wit.\n  - Conclude the story with a resolution that reflects the protagonist's growth and newfound understanding of their role. For instance, depict a moment of camaraderie or mutual respect between the protagonist and the villainess.\n\n- **Creativity**:\n  - Incorporate elements of dark humor and irony to highlight the absurdity of the situation. Use the wedding setting to juxtapose traditional romantic tropes with the unconventional dynamics of a villainous entourage.\n  - Create imaginative scenarios that play on the theme of villainy, such as a wedding cake with hidden traps or a dance floor that doubles as a strategic battleground. Use these elements to add depth and intrigue to the narrative.\n  - Explore the protagonist's internal monologue to reveal their thoughts on the villainess's family and the peculiarities of the wedding. Use this introspection to add layers to the story and provide insight into the protagonist's character.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a resourceful and adaptable character, using their internal monologue to convey their thoughts and emotions. Highlight their loyalty to the villainess and their ability to handle unexpected challenges.\n  - Characterize the villainess as a complex and charismatic figure, balancing her villainous traits with moments of vulnerability or humor. Use dialogue and interactions to reveal her motivations and relationship with the protagonist.\n  - Set the story in a lavish and opulent wedding venue, using detailed descriptions to create a vivid and immersive setting. Emphasize the contrast between the elegant surroundings and the underlying tension of a villainous gathering.\n\n- **Language Use**:\n  - Employ a witty and conversational tone, using humor and sarcasm to reflect the protagonist's perspective. Use first-person narration to create an intimate connection with the reader and convey the protagonist's internal journey.\n  - Use vivid and descriptive language to paint a picture of the wedding setting and the characters' interactions. Focus on sensory details to enhance the reader's immersion in the story.\n  - Incorporate rhetorical devices such as irony and hyperbole to emphasize the comedic and absurd elements of the narrative. For example, describe the protagonist's attempts to blend in with the villainous crowd using exaggerated expressions and humorous observations.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as narrative structure, tone, and creativity. The prompt involves a unique blend of romance, divine intervention, and unexpected revelation, which requires a balance of emotional depth and whimsical elements. The rules will need to guide the narrative through the protagonist's internal conflict and the unexpected encounter with the cashier. The examples will illustrate how to incorporate these elements effectively, ensuring the story remains engaging and true to the prompt's themes.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a brief flashback to the protagonist's childhood, establishing the creation of the secret phrase with God. Use this to set the stage for the current dilemma and emotional stakes.\n  - Develop the narrative around the protagonist's internal conflict upon hearing the secret phrase from the cashier. Focus on their immediate emotional response and the subsequent questioning of their current relationship.\n  - Introduce tension by exploring the protagonist's decision-making process. Should they confront their partner, pursue the cashier, or question the validity of the phrase? Use this tension to drive the narrative forward.\n  - Conclude with an open-ended resolution that leaves room for interpretation. For example, the protagonist might decide to keep the encounter a secret, or they might choose to explore the possibility of a new connection.\n\n- **Creativity**:\n  - Incorporate elements of magical realism by treating the secret phrase as a divine sign. Use subtle hints of divine intervention throughout the story, such as serendipitous events or coincidences that guide the protagonist's actions.\n  - Use humor and irony to highlight the absurdity of the situation. For instance, describe the protagonist's disbelief and awkwardness when the cashier casually utters the phrase, creating a moment of unexpected comedy.\n  - Explore the theme of destiny versus choice by having the protagonist reflect on the nature of soulmates and the role of divine signs in their life. Use this reflection to add depth and complexity to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a thoughtful and introspective individual, using internal monologue to reveal their hopes, fears, and doubts. Highlight their emotional journey as they grapple with the implications of the secret phrase.\n  - Characterize the cashier as an ordinary yet intriguing figure, using brief interactions and descriptions to create a sense of mystery and allure. For example, describe the cashier's unexpected wisdom or unique perspective on life.\n  - Set the story in a mundane, everyday location, such as a grocery store, to contrast with the extraordinary nature of the secret phrase. Use detailed descriptions of the setting to ground the narrative in reality while allowing for moments of whimsy.\n\n- **Language Use**:\n  - Employ a conversational and introspective tone, using first-person narration to create an intimate connection with the reader. Use rhetorical questions and reflective language to convey the protagonist's internal conflict.\n  - Use vivid imagery and sensory details to enhance the emotional impact of key moments, such as the protagonist's reaction to hearing the secret phrase. For example, describe the rush of emotions and the sudden clarity or confusion that follows.\n  - Incorporate dialogue that reflects the protagonist's personality and emotional state, using humor and irony to add depth to their interactions with the cashier and their partner. Ensure the language captures the nuances of the protagonist's internal struggle and the story's whimsical elements.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as narrative style, tone, and structure. The demonstrations emphasize a blend of humor, introspection, and unique narrative devices. They often use a first-person perspective to create intimacy and employ a conversational tone to engage the reader. The rules will need to reflect these elements while being tailored to the new prompt's themes of feeding off negative emotions and the setting of a call center. I will ensure the rules are actionable, specific, and include examples that align with the prompt's narrative potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's decision to work at a call center, highlighting their strategic choice to maximize exposure to negative emotions. For example, describe the protagonist's first day on the job, eagerly anticipating the emotional buffet provided by frustrated callers.\n  - Structure the narrative around the protagonist's interactions with various callers, using each call as a vignette to explore different negative emotions. Ensure the plot progresses through these interactions, leading to a climax where the protagonist faces an unexpected emotional challenge, such as a call that evokes empathy instead of negativity.\n  - Conclude with the protagonist's reflection on their experiences, contemplating the complexity of human emotions and their own existence. For instance, depict the protagonist pondering whether they can truly thrive on negativity alone.\n\n- **Creativity**:\n  - Infuse the narrative with dark humor and irony, using the protagonist's unique perspective to highlight the absurdity of their situation. For example, describe the protagonist's amusement at the irony of being thanked for their \"help\" while secretly feeding on the caller's frustration.\n  - Incorporate imaginative descriptions of how the protagonist perceives and absorbs negative emotions, such as visualizing them as colorful auras or tangible energy. Use these descriptions to add depth and creativity to the narrative.\n  - Explore the protagonist's internal conflict and curiosity about positive emotions, adding a layer of complexity to their character. For instance, depict moments where the protagonist is momentarily intrigued by a caller's unexpected kindness.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a multidimensional entity with a distinct voice and personality. Use internal monologue to reveal their motivations, thoughts, and reactions to the emotions they encounter.\n  - Create a vivid setting by detailing the call center environment, emphasizing its monotonous and impersonal nature. Use sensory details to convey the atmosphere, such as the constant hum of computers and the distant chatter of other employees.\n  - Characterize the callers through their interactions with the protagonist, using dialogue to convey their emotions and personalities. For example, portray a particularly irate caller whose anger is so intense that it becomes a feast for the protagonist.\n\n- **Language Use**:\n  - Employ a conversational and witty tone, using the protagonist's internal monologue to engage the reader and provide insight into their unique perspective. Use humor and sarcasm to enhance the narrative's appeal.\n  - Utilize vivid and sensory language to describe the emotions the protagonist feeds on, creating a rich and immersive experience for the reader. For instance, describe anger as a \"spicy, electric current\" that invigorates the protagonist.\n  - Maintain a first-person perspective to create intimacy and immediacy, allowing the reader to experience the protagonist's journey and reflections firsthand. Use rhetorical questions and direct address to the reader to enhance engagement and connection.\n</story_rules>",
    "<thinking>\nTo create the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used. The demonstrations emphasize a blend of humor, introspection, and a unique twist on traditional narrative elements. They often incorporate a personal journey or transformation, with a focus on internal conflict and resolution. The rules are structured into categories: Plot, Creativity, Development (Character and Setting), and Language Use, each with specific, actionable instructions and examples.\n\nFor the new prompt, the rules will need to focus on the protagonist's journey from being ridiculed to becoming powerful and wealthy, highlighting themes of empowerment, self-acceptance, and societal change. The narrative should blend humor with introspection, using the protagonist's unique superpower as a central element. The rules will guide the development of a compelling character arc, a vivid setting that contrasts past and present, and a language style that captures the protagonist's voice and transformation.\n\nI will ensure the rules are comprehensive, providing detailed guidance on plot development, creative elements, character and setting development, and language use, with examples inspired by the few-shot demonstrations.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a flashback to the protagonist's childhood, highlighting moments of ridicule and misunderstanding about their 'feminine' superpower. Use this to establish the initial conflict and set the stage for their transformation.\n  - Develop the narrative around the protagonist's journey to self-acceptance and empowerment. Show how they harness their superpower to achieve success and recognition, overcoming societal stereotypes and personal insecurities.\n  - Incorporate a pivotal moment where the protagonist uses their superpower in an unexpected way to save the day, earning the respect and admiration of those who once mocked them. For example, depict a scenario where their power, initially seen as trivial, becomes crucial in averting a disaster.\n\n- **Creativity**:\n  - Reimagine traditional superhero tropes by focusing on the unique and 'feminine' aspects of the protagonist's power. Use this to challenge and subvert societal norms and expectations.\n  - Integrate humor and irony into the narrative, using the protagonist's past experiences and current success to highlight the absurdity of gender stereotypes. For instance, describe a scene where the protagonist humorously reflects on how their power, once mocked, is now celebrated.\n  - Create imaginative scenarios that showcase the versatility and strength of the protagonist's power, emphasizing its unexpected applications and benefits.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a multidimensional character with a rich inner life. Use internal monologue and reflections to explore their journey from insecurity to confidence and empowerment.\n  - Contrast the protagonist's past and present environments to highlight their growth and transformation. Describe their childhood setting as a place of misunderstanding and ridicule, and their current setting as one of success and recognition.\n  - Use secondary characters, such as former bullies or supportive allies, to enhance the protagonist's journey and highlight the societal changes brought about by their success.\n\n- **Language Use**:\n  - Employ a confident and reflective tone, using first-person narration to provide insight into the protagonist's thoughts and emotions. Use humor and irony to convey the protagonist's journey and transformation.\n  - Use vivid and descriptive language to capture the protagonist's experiences and the impact of their superpower. For example, describe the power's effects in detail, emphasizing its beauty and strength.\n  - Incorporate dialogue that reflects the protagonist's growth and newfound confidence, using it to highlight their interactions with others and their impact on society.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as narrative structure, tone, and character development. The few-shot examples emphasize a blend of humor, introspection, and creative reinterpretation of the prompt. They often use a first-person perspective to create intimacy and employ a conversational tone to engage the reader. The rules will need to reflect these elements while being tailored to the unique aspects of the new prompt, such as the twin dynamic and the protagonist's quest to resolve the conflict with their supervillain brother. I will ensure the rules are comprehensive, actionable, and include detailed examples to guide the storytelling process effectively.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a humorous or ironic incident where the protagonist is mistaken for their supervillain twin and gets caught in a superhero altercation. Use this event to establish the central conflict and the protagonist's motivation to resolve the situation.\n  - Develop the narrative around the protagonist's quest to confront their twin brother and negotiate a truce. Incorporate a series of comedic and action-packed encounters with superheroes, highlighting the protagonist's frustration and determination.\n  - Conclude the story with a climactic confrontation between the protagonist and their twin, where they must use wit and empathy to reach an understanding. Ensure the resolution is satisfying and leaves room for future adventures or reconciliations.\n\n- **Creativity**:\n  - Infuse the narrative with humor and irony, using the protagonist's misadventures as a source of comedic relief. For example, describe a scene where the protagonist tries to explain their identity to a superhero, only to be interrupted by another attack.\n  - Incorporate creative twists on superhero and supervillain tropes, such as the protagonist using unconventional methods to evade capture or employing everyday objects as makeshift defenses.\n  - Use the twin dynamic to explore themes of identity and family, adding depth to the narrative. For instance, depict the protagonist's internal struggle with their brother's choices and their own sense of self.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and resourceful character, using their internal monologue to convey their thoughts and emotions. Highlight their resilience and humor in the face of adversity.\n  - Characterize the twin brother as a charismatic yet misguided supervillain, providing glimpses of their shared past and the reasons behind their divergent paths.\n  - Set the story in a vibrant urban environment where superheroes and supervillains are a common sight. Use detailed descriptions to create a dynamic backdrop for the protagonist's adventures.\n\n- **Language Use**:\n  - Employ a conversational and witty tone, using first-person narration to create an intimate connection with the reader. Use humor and sarcasm to reflect the protagonist's personality and enhance the narrative's comedic elements.\n  - Use vivid and dynamic language to describe action scenes, ensuring they are engaging and easy to visualize. For example, depict a superhero battle with phrases like \"a whirlwind of capes and chaos.\"\n  - Incorporate dialogue that reflects the protagonist's quick wit and resourcefulness, using it to advance the plot and develop character relationships.\n</story_rules>"
]