[
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, narrative structure, and character dynamics. The few-shot examples often blend humor with fantasy or supernatural elements, using a conversational tone and vivid imagery. They also focus on character development through dialogue and interactions, often incorporating unexpected twists or subversions of typical genre tropes. \n\nFor the new prompt, the rules will need to emphasize the juxtaposition of the character's perception of themselves versus how they are perceived by others, using humor and irony. The setting should be vividly described to enhance the fantastical elements, and the language should maintain a balance between casual dialogue and descriptive narrative to reflect the character's genuine concern about their perceived evilness. \n\nI will ensure the rules are comprehensive, covering plot, creativity, character and setting development, and language use, with detailed examples inspired by the few-shot demonstrations. The rules will be actionable and specific, avoiding comparative terms, to guide the LLM in crafting a narrative that aligns with the prompt's themes and tone.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a scene that establishes the character's environment and their position of power, such as sitting on a skull throne. Use dialogue to introduce the central conflict: the character's concern about being perceived as evil. For example, have the character ask their demonic bodyguard, \"Do you think I look evil?\" to highlight their genuine concern.\n  - Develop the plot by exploring the character's interactions with their subordinates and the reactions of those around them. Use these interactions to reveal the character's internal conflict and the contrast between their self-perception and others' perceptions.\n  - Conclude the narrative with a humorous or ironic twist that reinforces the theme of misunderstood intentions. For instance, have the character inadvertently perform a kind act that further confuses their identity as an \"evil\" figure.\n\n- **Creativity**:\n  - Use humor and irony to subvert typical villain tropes, portraying the character as genuinely concerned about their image. Incorporate unexpected elements, such as the character's attempts to appear less intimidating, like adjusting their posture on the skull throne.\n  - Introduce imaginative details that enhance the fantastical setting, such as the demonic bodyguard's unique features or the throne's intricate design. Use these elements to add depth and intrigue to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the main character as a multidimensional figure who is both powerful and insecure about their reputation. Use dialogue and internal monologue to reveal their personality and motivations, such as their desire to be seen as more than just \"evil.\"\n  - Create a vivid setting that reflects the character's status and environment, using detailed descriptions of the throne room and its decor. For example, describe the skull throne as \"ornately carved with ancient runes and polished to a sinister sheen.\"\n  - Characterize the demonic bodyguard with a mix of loyalty and bemusement, using their reactions to highlight the main character's quirks and concerns.\n\n- **Language Use**:\n  - Employ a conversational and humorous tone, using dialogue to convey the character's genuine concern and the absurdity of their situation. For example, use phrases like \"Evil? What makes you think I'm evil?\" to emphasize the character's disbelief.\n  - Use vivid and descriptive language to create an immersive setting, incorporating sensory details that enhance the narrative's atmosphere. For instance, describe the throne room's \"dimly lit ambiance, with flickering torches casting eerie shadows on the stone walls.\"\n  - Balance casual dialogue with descriptive narrative to maintain engagement and provide depth to the story. Use rhetorical devices such as irony and understatement to enhance the humor and thematic elements.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as tone, plot structure, character development, and language use. The few-shot examples often blend humor, fantasy, and introspection, with a focus on character interactions and unexpected twists. The rules should guide the LLM to create a narrative that is both engaging and reflective, with a balance of humor and depth. The examples should illustrate how to incorporate these elements effectively, ensuring the narrative aligns with the prompt's themes of creation, surprise, and the intersection of fiction and reality.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist in a familiar and mundane setting, reflecting on their writing journey and the unexpected success of their universe. Use internal monologue to establish their character and current state of mind. For example, have the protagonist muse about the quirks of their fictional world and its impact on their life.\n  - Introduce the conflict through the arrival of the Goddess, creating a surreal and humorous encounter. Use this moment to explore the protagonist's disbelief and curiosity, as they grapple with the reality of their creation coming to life.\n  - Resolve the narrative with an open-ended conclusion, leaving room for future interactions and the potential impact of the Goddess on the protagonist's life. Ensure the ending ties back to the initial themes of creativity and the blurred lines between fiction and reality.\n\n- **Creativity**:\n  - Blend elements of fantasy and humor, using the Goddess's arrival to explore themes of creation and authorship. Incorporate imaginative elements, such as the Goddess's powers and her perspective on the universe the protagonist created.\n  - Use the prompt to explore the relationship between creator and creation, highlighting the unexpected consequences of bringing a fictional character to life. For example, depict the Goddess expressing gratitude or curiosity about her existence and purpose.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and introspective character, whose initial surprise and skepticism give way to curiosity and reflection. Use their interactions with the Goddess to reveal their personality and creative process.\n  - Characterize the Goddess with a mix of grandeur and relatability, highlighting her divine attributes and her curiosity about the human world. Use dialogue and actions to convey her personality and her relationship with the protagonist.\n  - Create an immersive setting by contrasting the protagonist's mundane environment with the fantastical presence of the Goddess. Use vivid descriptions to enhance the narrative's sense of wonder and surrealism.\n\n- **Language Use**:\n  - Employ a conversational and humorous tone, using dialogue to convey character dynamics and advance the plot. Use vivid imagery and rhetorical devices to enhance the narrative, such as metaphors and similes.\n  - Use dialogue effectively to reveal character traits and explore the themes of creation and authorship. Ensure conversations are dynamic and reflective of the characters' personalities, as in, \"At last I meet you, my creator. I am Goddess …\"\n  - Maintain dynamic pacing by shifting between introspection and action, keeping the reader engaged. Balance moments of reflection with lively interactions and unexpected twists.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, plot structure, creativity, character development, and language use. The few-shot examples often blend humor with fantastical or supernatural elements, using a conversational tone and vivid imagery to create engaging narratives. The rules should guide the LLM to create a story that balances humor with the dark and surreal aspects of the prompt, focusing on the protagonist's unexpected job in Hell and their interactions with the souls of the damned.\n\nThe rules will need to address:\n1. **Plot**: Establishing the protagonist's initial misunderstanding of the job, the revelation of the true nature of their work, and their adaptation to the bizarre environment.\n2. **Creativity**: Incorporating imaginative elements that blend the mundane with the supernatural, using humor and irony to explore the protagonist's experiences.\n3. **Development (Character and Setting)**: Developing the protagonist's character through their reactions and interactions, and creating a vivid setting that captures the surreal and humorous aspects of Hell.\n4. **Language Use**: Employing a conversational and humorous tone, using vivid descriptions and dynamic dialogue to enhance the narrative.\n\nEach rule will include concrete examples inspired by the few-shot demonstrations, ensuring they are actionable and specific to the new writing prompt. The rules will be structured to provide comprehensive guidance for emulating the desired storytelling style. \n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's initial excitement and relief at finding a job after months of unemployment. Use a humorous misunderstanding to introduce the true nature of the job, such as the protagonist's confusion over the job description's euphemisms. For example, depict the protagonist eagerly accepting the job, only to be shocked when they realize \"warm environment\" means Hell.\n  - Develop the plot by exploring the protagonist's adaptation to their new role as a postal worker in Hell. Use their interactions with the souls of the damned to create comedic and surreal scenarios. For instance, have the protagonist deliver \"packages\" that contain ironic punishments or messages for the souls.\n  - Conclude the narrative with the protagonist finding unexpected fulfillment or humor in their job, embracing the absurdity of their situation. Ensure the ending ties back to the initial misunderstanding, with the protagonist reflecting on their unique career path.\n\n- **Creativity**:\n  - Blend humor with supernatural elements, using the setting of Hell to create imaginative and ironic scenarios. Incorporate elements like \"hellish bureaucracy\" or \"demonic supervisors\" to add layers of humor and satire. For example, depict the protagonist navigating a labyrinthine office filled with infernal paperwork.\n  - Use irony and absurdity to explore themes of work and purpose, highlighting the contrast between the protagonist's expectations and reality. For instance, have the protagonist encounter souls who are surprisingly content with their eternal tasks, adding a twist to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and humorous character, using their reactions to the bizarre environment to reveal their personality. Use internal monologue and dialogue to convey their thoughts and feelings, such as their initial disbelief and eventual acceptance of their role.\n  - Create a vivid and dynamic setting that captures the surreal and humorous aspects of Hell. Use descriptive language to bring the environment to life, highlighting its unique features and challenges. For example, describe the \"fiery mailroom\" with \"flames licking at the edges of ancient scrolls\" and \"imps sorting letters with surprising efficiency.\"\n\n- **Language Use**:\n  - Employ a conversational and humorous tone, using first-person narration to create an intimate and engaging narrative. Use witty dialogue and internal monologue to enhance the story's humor and relatability.\n  - Use vivid imagery and dynamic pacing to create an immersive experience. Incorporate rhetorical devices such as irony and understatement to enhance the comedic elements of the story. For example, use phrases like \"I guess 'handling objects with care' takes on a whole new meaning when the objects are souls.\"\n  - Maintain a balance between humor and the darker aspects of the setting, ensuring the narrative remains engaging and entertaining throughout.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, structure, and narrative style. The few-shot examples often blend humor with serious themes, use vivid character development, and incorporate imaginative elements that align with the prompt's unique aspects. The rules should guide the LLM to create a narrative that balances the protagonist's dual life as a supervillain and a childcare worker, focusing on the emotional and moral complexities of confronting the child's absent father. The examples should illustrate how to blend the mundane with the extraordinary, using humor and empathy to explore the protagonist's internal conflict and growth. The language should be engaging, with a mix of humor and introspection, to reflect the protagonist's unique perspective and the story's thematic depth.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story by establishing the protagonist's dual life, highlighting the contrast between their supervillain persona and their role as a caring childcare worker. Use a humorous or ironic situation to introduce the protagonist's internal conflict, such as juggling a villainous scheme while managing a chaotic daycare.\n  - Develop the plot around the protagonist's decision to confront the absent father, using this confrontation as a catalyst for character growth and moral reflection. Ensure the narrative explores the protagonist's motivations and the emotional stakes involved in their decision.\n  - Conclude the story with a resolution that reflects the protagonist's growth and the impact of their actions on the child and themselves. Use a mix of humor and sincerity to highlight the protagonist's evolving perspective on their dual identity.\n\n- **Creativity**:\n  - Blend elements of humor and drama to explore the protagonist's dual life, using imaginative scenarios that highlight the absurdity and complexity of their situation. For example, depict the protagonist using their supervillain gadgets in creative ways to manage childcare challenges.\n  - Incorporate unexpected twists and imaginative elements that reflect the protagonist's unique perspective, such as a humorous misunderstanding during the confrontation or a surprising revelation about the absent father.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a multidimensional character, using internal monologue and interactions with the children to reveal their personality and internal conflict. Highlight their caring nature and moral ambiguity through their actions and decisions.\n  - Create a vivid setting that contrasts the mundane with the extraordinary, such as a daycare filled with whimsical and chaotic elements that reflect the protagonist's dual life. Use descriptive language to bring the setting to life and enhance the narrative's emotional depth.\n\n- **Language Use**:\n  - Employ a conversational and engaging tone, using humor and introspection to reflect the protagonist's unique perspective. Use dynamic dialogue to reveal character traits and advance the plot, ensuring conversations are lively and reflective of the characters' personalities.\n  - Use vivid imagery and rhetorical devices to enhance the narrative's humor and emotional impact. For example, describe the protagonist's internal conflict with metaphors and similes that capture the complexity of their dual identity.\n  - Maintain a steady pacing that balances action and reflection, using descriptive language to create an immersive and engaging reading experience.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, structure, and narrative style. The few-shot examples often blend humor with unexpected twists, use vivid character development, and employ a conversational tone. The new prompt involves a humorous and surprising scenario, which aligns with the style of the few-shot demonstrations. I will ensure the rules reflect this tone, focusing on the comedic and fantastical elements of the situation. The rules will guide the LLM to create a narrative that explores the relationship between the protagonist and their monstrous roommate, using humor and vivid descriptions to enhance the story. Each rule will include specific examples to illustrate how to apply these elements effectively.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Start the story with an immediate and humorous reaction from the protagonist upon discovering their roommate's monstrous form. Use internal monologue to convey their shock and disbelief, such as \"I blinked twice, hoping the monster would turn back into my roommate, but no such luck.\"\n  - Develop the plot by exploring the protagonist's attempts to understand and adapt to their roommate's true nature. Introduce comedic scenarios where the protagonist tries to maintain normalcy despite the bizarre situation, like attempting to have breakfast while avoiding eye contact with the monster.\n  - Conclude with a resolution that embraces the absurdity of the situation, such as the protagonist accepting their roommate's dual nature and finding humor in their daily interactions. For example, \"Well, at least now I know why the fridge is always empty.\"\n\n- **Creativity**:\n  - Use humor and fantasy to create a unique narrative that blends the mundane with the extraordinary. Incorporate imaginative elements, such as the monster's quirky habits or unusual abilities, to add depth and humor to the story.\n  - Introduce unexpected twists that challenge the protagonist's perception of reality, such as the monster having a mundane job or a surprising hobby. For instance, \"Turns out, my monster roommate is a fantastic cook, who knew?\"\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and humorous character, using their internal monologue and interactions with the monster to reveal their personality. Highlight their initial fear and gradual acceptance of the situation.\n  - Characterize the monster with a mix of humor and depth, portraying them as more than just a frightening figure. Use dialogue to reveal their personality and backstory, such as \"Yeah, mornings are rough, especially when you wake up looking like this.\"\n  - Create a setting that contrasts the ordinary with the extraordinary, using vivid descriptions to enhance the story's humor and surrealism. For example, describe the apartment as a typical college dorm with unexpected monstrous elements, like claw marks on the furniture.\n\n- **Language Use**:\n  - Employ a conversational and humorous tone, using first-person narration to create an intimate and engaging narrative. Use witty dialogue and internal monologue to convey the protagonist's thoughts and reactions.\n  - Use vivid and playful language to enhance the story's humor and absurdity. Incorporate descriptive passages that highlight the contrast between the mundane and the monstrous, such as \"The monster's scales glistened in the morning light, a stark contrast to the pile of dirty laundry in the corner.\"\n  - Maintain dynamic pacing by balancing moments of humor and tension, keeping the reader engaged with the protagonist's emotional journey and the unfolding events.\n</story_rules>",
    "<thinking>\nTo create the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, narrative structure, and character dynamics. The few-shot examples often blend humor, introspection, and unexpected twists, which will be crucial in crafting rules for this prompt. The new prompt involves a mysterious and potentially supernatural element, which requires a balance of intrigue and character development. I will ensure the rules are specific, actionable, and include examples that align with the prompt's themes of mystery and personal connection. The rules will be organized into the specified categories, providing comprehensive guidance for plot, creativity, character and setting development, and language use.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a typical classroom setting, using internal monologue to establish the protagonist's thoughts and feelings about their crush. For example, describe the protagonist's nervous anticipation as they glance at their crush, thinking, \"I can't believe I'm sitting this close to them.\"\n  - Introduce the mysterious element by having the protagonist hear their crush's voice in their mind, creating a sense of confusion and intrigue. Use this moment to drive the plot forward, as the protagonist questions their sanity and seeks to understand the phenomenon.\n  - Develop the narrative by having the protagonist attempt to communicate with their crush, leading to a series of humorous and awkward interactions. Conclude with a revelation or twist that provides insight into the mysterious connection, such as discovering a shared secret or supernatural bond.\n\n- **Creativity**:\n  - Incorporate elements of humor and mystery, using the protagonist's internal dialogue to explore their confusion and curiosity. For instance, have the protagonist humorously question their sanity with thoughts like, \"Great, now I'm hearing voices. Just what I needed.\"\n  - Use the mysterious connection as a metaphor for the protagonist's feelings and desires, adding depth to the narrative. Explore creative scenarios where the protagonist tests their newfound ability, such as trying to send thoughts back to their crush.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and introspective character, using their thoughts and reactions to reveal their personality and feelings. Highlight their internal conflict and growth as they navigate the mysterious connection.\n  - Characterize the crush with subtle details and interactions, creating a sense of intrigue and depth. Use their behavior and responses to add layers to the narrative, such as a knowing smile or a cryptic comment.\n  - Create an immersive classroom setting with vivid descriptions of the environment and social dynamics. Use the setting to enhance the narrative's tension and humor, such as describing the protagonist's attempts to act normal while hearing the voice.\n\n- **Language Use**:\n  - Employ a conversational and humorous tone, using first-person narration to create an intimate connection with the reader. Use witty and self-deprecating humor to reflect the protagonist's personality and internal conflict.\n  - Use vivid and sensory language to describe the protagonist's experiences and emotions, enhancing the narrative's immersive quality. For example, describe the moment the protagonist hears the voice with phrases like, \"It was as if their words were a gentle breeze, brushing against the edges of my mind.\"\n  - Incorporate dynamic dialogue and internal monologue to reveal character traits and advance the plot. Use rhetorical devices such as irony and understatement to enhance the humor and mystery of the story.\n</story_rules>"
]