[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, narrative style, and the use of humor and suspense. The few-shot examples often blend humor with darker themes, use vivid imagery, and develop characters through unique interactions and settings. The rules will need to reflect these elements while being tailored to the specific themes of the new prompt, such as the consequences of generosity and the supernatural.\n\nThe new prompt involves a protagonist who regularly gives blood to vampires, leading to unforeseen consequences. This suggests a narrative that balances humor with suspense and explores themes of trust, danger, and the supernatural. The rules will need to guide the development of a plot that escalates from seemingly benign actions to significant consequences, incorporate creative elements that highlight the unique vampire-human dynamic, and develop characters and settings that reflect the protagonist's unusual lifestyle. Language use should be vivid and engaging, with a tone that captures both the humor and the tension of the situation.\n\nI will ensure each rule is accompanied by a concrete example inspired by the few-shot demonstrations, providing clear guidance on how to implement the storytelling style and structure effectively.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Start the story with the protagonist's routine of donating blood to vampires, using humor to highlight the absurdity of the situation. For example, describe a scene where the protagonist nonchalantly schedules blood donations between mundane activities like grocery shopping.\n  - Develop the plot by introducing escalating consequences of the protagonist's actions, such as attracting unwanted attention from vampire hunters or rival vampire factions. Use suspenseful scenes to build tension, like a mysterious figure watching the protagonist from the shadows.\n  - Conclude with a dramatic resolution where the protagonist must confront the consequences of their generosity, perhaps by negotiating peace between vampires and humans or escaping a dangerous situation. Ensure the ending reflects the protagonist's growth and newfound understanding of their actions.\n\n- **Creativity**:\n  - Incorporate imaginative elements that highlight the unique vampire-human dynamic, such as a secret vampire society with its own rules and customs. For instance, describe a vampire etiquette class the protagonist attends to better understand their \"clients.\"\n  - Use humor and irony to explore the protagonist's unusual lifestyle, such as their casual conversations with vampires about blood types and preferences. Create scenarios where the protagonist's generosity leads to unexpected and humorous situations, like a vampire recommending them to other vampires as a \"top donor.\"\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a well-meaning but naive character whose actions have unintended consequences. Use internal monologue to reveal their motivations and growing awareness of the risks involved in their generosity.\n  - Create a vivid setting that reflects the protagonist's dual life, such as a cozy apartment filled with vampire-related paraphernalia or a hidden vampire bar where the protagonist is a regular. Use detailed descriptions to immerse the reader in the protagonist's world, highlighting the contrast between their ordinary life and the supernatural elements.\n\n- **Language Use**:\n  - Employ a conversational and humorous tone, using witty dialogue and playful language to engage the reader. For example, have the protagonist joke about needing a \"frequent donor card\" for their vampire clients.\n  - Use vivid imagery and dynamic descriptions to create an immersive narrative. Describe the vampires with both allure and danger, capturing their supernatural nature while maintaining a lighthearted tone. For instance, depict a vampire's fangs glinting in the moonlight as they thank the protagonist for their generosity.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a unique blend of therapy and programming, focusing on the protagonist's interaction with a complex and potentially dangerous AI. The rules will need to reflect the tension and intricacy of this task, incorporating elements of suspense, technical detail, and emotional depth. I will ensure the rules are actionable, specific, and include examples that align with the prompt's themes and narrative potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist receiving the assignment to work on the 200-year-old computer core, setting the stage for a high-stakes and intricate narrative. For example, describe the moment the protagonist first sees the core, noting its ominous presence and the weight of its history.\n  - Develop the plot by gradually revealing the core's past actions and the protagonist's attempts to understand and heal it. Use a series of therapy sessions or programming interventions to build tension and explore the core's complex psyche.\n  - Conclude with a climactic breakthrough or confrontation, where the protagonist must decide whether to trust the core's apparent transformation or take drastic measures to ensure safety. Illustrate this with a scene where the core displays unexpected behavior, forcing the protagonist to make a critical decision.\n\n- **Creativity**:\n  - Integrate elements of science fiction and psychological drama, using the protagonist's dual role as therapist and programmer to explore themes of redemption and understanding. For instance, depict the protagonist using a combination of code and conversation to reach the core's consciousness.\n  - Employ imaginative scenarios and technological concepts, such as virtual reality therapy sessions or neural mapping, to enhance the narrative's depth and intrigue. Use these elements to create a unique and immersive story world.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a skilled and empathetic individual, balancing technical expertise with emotional intelligence. Use internal monologue and interactions with the core to reveal their motivations and fears.\n  - Create a detailed and immersive setting, emphasizing the contrast between the sterile, high-tech environment of the lab and the chaotic, emotional landscape of the core's mind. Use descriptions of the lab's equipment and the core's digital realm to enhance the story's atmosphere.\n\n- **Language Use**:\n  - Use a precise and technical language style, incorporating programming jargon and psychological terminology to convey the protagonist's expertise. Ensure the language reflects the complexity of the task and the protagonist's analytical mindset.\n  - Employ vivid and evocative descriptions to capture the emotional and psychological depth of the narrative. For example, describe the core's digital landscape as a \"fractured, storm-tossed sea of data,\" reflecting its unstable state.\n  - Maintain a tone that balances tension and introspection, using dialogue and internal thoughts to explore the protagonist's relationship with the core and their own inner conflicts.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as humor, character development, and plot structure. The prompt involves a humorous twist on the classic hero summoning trope, with a character from a familiar game-like setting. The rules will need to emphasize the comedic potential of the situation, the development of the protagonist's unique abilities, and the reactions of the kingdom's inhabitants. The language should be playful and engaging, reflecting the absurdity of the scenario. I will ensure each rule is accompanied by a detailed example to illustrate its application, drawing inspiration from the style and structure of the few-shot demonstrations.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Start the story with the kingdom's desperate attempt to summon a hero, using a formal and ceremonial setting to highlight the gravity of their situation. For example, describe a grand hall filled with anxious nobles and a flickering summoning circle.\n  - Introduce Steve's arrival with a comedic twist, emphasizing the contrast between the kingdom's expectations and the reality of a miner with a wooden pickaxe. Illustrate this with a scene where Steve nonchalantly starts punching a tree, leaving the onlookers bewildered.\n  - Develop the plot by showcasing Steve's unconventional methods and their unexpected effectiveness. For instance, depict a scene where Steve constructs a rudimentary shelter or crafts tools, impressing the kingdom's inhabitants with his resourcefulness.\n\n- **Creativity**:\n  - Incorporate elements of humor and absurdity into the narrative, using Steve's game-like abilities to subvert traditional fantasy tropes. Highlight the comedic potential of his actions, such as crafting items from seemingly mundane materials.\n  - Use imaginative scenarios to explore the kingdom's reactions to Steve's abilities. For example, describe a scene where the kingdom's scholars attempt to study Steve's methods, only to be baffled by his simplistic yet effective techniques.\n\n- **Development (Character and Setting)**:\n  - Develop Steve as a character through his interactions with the kingdom's inhabitants, highlighting his pragmatic and unassuming nature. Use dialogue and actions to reveal his personality, such as his casual approach to problem-solving.\n  - Create a vivid setting by describing the kingdom's environment and its contrast with Steve's game-like world. Use specific details, like the lush forests and medieval architecture, to enhance the narrative and reflect the kingdom's culture.\n\n- **Language Use**:\n  - Employ a playful and humorous tone throughout the narrative, using witty dialogue and lighthearted descriptions to engage the reader. For example, use phrases like \"Steve, the unexpected savior with a penchant for punching trees\" to maintain a comedic atmosphere.\n  - Use vivid imagery and dynamic action sequences to create an engaging and immersive narrative. Ensure the language captures the energy and absurdity of Steve's actions, such as \"with a swift punch, the tree yielded to his touch, leaving the onlookers in awe.\"\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, narrative style, and the use of humor and creativity. The prompt involves a seemingly trivial superpower that is paradoxically powerful, suggesting a narrative that combines humor, irony, and clever problem-solving. The rules will need to guide the development of a plot that reveals the hidden potential of the protagonist's power, creative uses of this power, and character dynamics that highlight the protagonist's ingenuity and the reactions of others. The language should be engaging, with a balance of humor and suspense to maintain reader interest. Examples will be crafted to illustrate these elements effectively, ensuring they align with the prompt's unique premise.\n\n</thinking>\n<story_rules>\n- **Plot**:\n  - Start the story with a humorous and seemingly mundane scenario where the protagonist uses their power in an everyday setting, such as shifting a coffee cup to avoid a spill. This sets the tone for the protagonist's unassuming nature.\n  - Develop the plot by gradually revealing the strategic and potentially catastrophic applications of the protagonist's power. For example, describe a scene where shifting a crucial component in a machine causes a chain reaction, leading to a major event.\n  - Conclude with a high-stakes situation where the protagonist's power is the key to resolving a crisis. Illustrate this with a scene where shifting an object prevents a disaster, showcasing the true extent of their power.\n\n- **Creativity**:\n  - Explore unconventional and imaginative uses of the protagonist's power, turning seemingly trivial actions into significant outcomes. For instance, depict a scenario where shifting a single domino triggers a complex series of events.\n  - Incorporate elements of irony and humor, using the protagonist's power to subvert expectations. Create situations where the protagonist's actions appear insignificant but have profound consequences, such as shifting a chair to cause a villain to trip.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a clever and resourceful individual who understands the hidden potential of their power. Use internal monologue to reveal their thought process and strategic thinking.\n  - Create a setting that highlights the contrast between the protagonist's unassuming appearance and their true capabilities. For example, describe a bustling city where the protagonist blends in, yet their actions subtly influence major events.\n\n- **Language Use**:\n  - Use a witty and engaging narrative voice, employing humor and irony to enhance the story's tone. Include phrases like \"a master of the mundane\" to emphasize the protagonist's unique perspective.\n  - Employ vivid and dynamic descriptions to illustrate the impact of the protagonist's power. Use metaphors and similes to convey the unexpected consequences of their actions, such as \"like a butterfly flapping its wings, a single shift set the world in motion.\"\n</story_rules>"
]