[
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, narrative structure, and character dynamics. The few-shot examples often subvert traditional tropes, incorporate humor or irony, and focus on character development and internal conflict. The new prompt involves a hero who is morally ambiguous, which suggests a narrative that explores themes of morality, irony, and character complexity. The rules will need to guide the LLM in creating a story that highlights the unexpected nature of the hero's character, the irony in the villain's statement, and the dark humor or tension in the situation. I will ensure the rules are detailed, actionable, and include examples that align with the prompt's themes and objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a confrontation between the hero and the villain, immediately establishing the tension and stakes. Use the villain's statement as a catalyst for revealing the hero's true nature. For example, have the hero respond with a chilling smile or a cryptic remark that hints at their darker side.\n  - Develop the plot by exploring the hero's past actions and motivations, gradually revealing their morally ambiguous nature. Use flashbacks or dialogue to provide context and depth to the hero's character. For instance, show the hero making ruthless decisions that contrast with traditional heroic ideals.\n  - Conclude the narrative with a twist that subverts the reader's expectations, such as the hero sparing the villain for strategic reasons or revealing a greater threat. Ensure the resolution highlights the complexity of the hero's character and leaves a lasting impact.\n\n- **Creativity**:\n  - Subvert traditional hero-villain dynamics by portraying the hero as morally complex and the villain as more straightforward. Use irony and dark humor to emphasize the unexpected nature of the hero's character. For example, depict the hero casually discussing their past misdeeds with a nonchalant attitude.\n  - Incorporate elements of psychological tension and moral ambiguity, using the hero's internal conflict to drive the narrative. Explore themes of power, justice, and the blurred lines between good and evil.\n\n- **Development (Character and Setting)**:\n  - Develop the hero as a multidimensional character with a complex moral code. Use internal monologue and interactions with other characters to reveal their motivations and ethical dilemmas. Highlight their internal conflict and the reasons behind their actions.\n  - Create a setting that reflects the story's themes of moral ambiguity and tension. Use contrasting environments, such as a dark, foreboding lair for the villain and a deceptively serene location for the hero, to enhance the narrative's complexity.\n\n- **Language Use**:\n  - Employ a tone that balances tension and dark humor, using irony and sarcasm to convey the hero's complex nature. Use vivid and evocative language to create an immersive atmosphere and highlight key moments in the narrative.\n  - Use dialogue to reveal character motivations and advance the plot. Ensure the hero's speech reflects their morally ambiguous nature, using cryptic or ironic statements to engage the reader and add depth to the story.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, plot structure, creativity, character development, and language use. The few-shot examples often blend humor with unexpected twists, subvert traditional expectations, and use vivid, sometimes irreverent language. The new prompt involves a humorous misunderstanding with a demon, suggesting a narrative that combines elements of comedy, fantasy, and clever wordplay. The rules will need to guide the LLM in crafting a story that highlights the absurdity of the situation, develops the protagonist's and demon's characters, and uses language that enhances the comedic and fantastical elements of the narrative. I will ensure the rules are specific, actionable, and include examples that align with the prompt's themes and tone.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's discovery of the contract's typos, setting the stage for the comedic misunderstanding. Use phrases like \"As I scanned the demon's contract, my eyes caught on a glaring typo\" to establish the initial conflict.\n  - Develop the plot by focusing on the protagonist's decision to fulfill the contract literally, leading to the humorous delivery of 100 pairs of shoes. Include a scene where the protagonist nervously presents the shoes to the demon, expecting anger but receiving laughter instead.\n  - Conclude the narrative with the demon's unexpected reaction, revealing a twist that the demon appreciates the humor and creativity of the protagonist's interpretation. Use this resolution to highlight the demon's character and the protagonist's cleverness.\n\n- **Creativity**:\n  - Embrace the absurdity of the situation by incorporating imaginative and humorous elements, such as the protagonist's frantic search for shoes and the demon's unexpected appreciation for the gift. Use phrases like \"I never thought I'd be raiding shoe stores for a demon\" to enhance the comedic tone.\n  - Subvert traditional demon contract tropes by focusing on the lighthearted and whimsical aspects of the narrative. Highlight the protagonist's cleverness and the demon's unexpected sense of humor.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a resourceful and quick-thinking individual, using internal monologue to convey their thought process and emotions. Highlight their initial anxiety and eventual relief at the demon's reaction.\n  - Characterize the demon as a surprisingly jovial and unconventional figure, using dialogue and actions to reveal their appreciation for the protagonist's creativity. For example, describe the demon clapping and laughing as they receive the shoes.\n  - Set the story in a modern, mundane world with fantastical elements, using the protagonist's interactions with the demon to highlight the contrast between the ordinary and the extraordinary.\n\n- **Language Use**:\n  - Use a humorous and conversational tone, with witty dialogue and internal monologue to convey the protagonist's perspective. Employ vivid and playful language to enhance the comedic and fantastical elements of the story.\n  - Incorporate wordplay and puns related to the contract's typos, using these elements to add depth and humor to the narrative. For example, include phrases like \"I guess the demon was a sole collector after all\" to emphasize the cleverness of the situation.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as tone, plot structure, creativity, character development, and language use. The few-shot examples often blend humor, irony, and subversion of traditional tropes, which will be crucial in crafting rules for this prompt. The new prompt suggests a narrative that is whimsical, chaotic, and potentially satirical, given the premise of infinite wishes without restrictions. The rules will need to guide the LLM in creating a story that explores the consequences of such limitless power, focusing on humor, unexpected twists, and character dynamics. I will ensure the rules are detailed, actionable, and include examples that align with the prompt's themes and tone.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's initial disbelief and excitement upon receiving infinite wishes. Use this moment to establish the tone and set the stage for the ensuing chaos. For example, describe the protagonist's reaction as they test the limits of their newfound power with small, humorous wishes.\n  - Develop the plot through a series of escalating wishes that lead to increasingly absurd and unpredictable situations. Ensure each wish introduces a new layer of complexity or humor, such as wishing for a pet dragon that becomes a neighborhood nuisance.\n  - Conclude the narrative with a reflection on the consequences of infinite wishes, highlighting the protagonist's growth or realization. For instance, depict the protagonist learning the value of moderation after a wish inadvertently causes global chaos.\n\n- **Creativity**:\n  - Embrace the whimsical and chaotic nature of the prompt by incorporating imaginative and outlandish wishes. Encourage the protagonist to experiment with reality-bending scenarios, such as wishing for a world made of candy or a personal theme song that plays wherever they go.\n  - Use the absence of rules to explore themes of power, responsibility, and the human condition. For example, have the protagonist wish for world peace, only to discover the complexities and unintended consequences of such a wish.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and flawed character, whose initial excitement gives way to introspection and growth. Use their internal monologue to convey their evolving understanding of the power they wield.\n  - Create a dynamic setting that evolves with each wish, reflecting the protagonist's changing desires and the impact of their actions. For example, describe how the protagonist's home transforms into a fantastical castle after a wish, only to become a burden to maintain.\n\n- **Language Use**:\n  - Employ a humorous and irreverent tone, using witty dialogue and playful language to convey the story's whimsical nature. Use irony and sarcasm to highlight the absurdity of the protagonist's wishes and their consequences.\n  - Use vivid and imaginative descriptions to bring the protagonist's wishes to life, ensuring the reader can visualize the fantastical elements. For example, describe the vibrant colors and textures of a world made entirely of candy, emphasizing the sensory experience.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize subverting traditional tropes, using humor and irony, and developing complex characters and settings. I will apply these elements to the new prompt, focusing on the unexpected and humorous twist of being awakened by an uninterested knight. The rules will guide the narrative to explore themes of identity, expectation, and the subversion of fairy tale conventions, while maintaining a humorous and engaging tone.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's awakening, immediately establishing the unexpected and anticlimactic nature of the event. Use the knight's disinterest as a catalyst for the protagonist's internal conflict and exploration of their new reality. For example, describe the protagonist's confusion and disappointment as they realize their \"True love's kiss\" was not as romantic as expected.\n  - Develop the plot through the protagonist's interactions with the knight and their attempts to understand their place in the world after being asleep for so long. Include humorous and ironic situations, such as the protagonist's outdated knowledge of the world leading to comical misunderstandings.\n  - Conclude the narrative with the protagonist's acceptance of their new reality and a resolution that subverts traditional fairy tale endings. For instance, have the protagonist decide to forge their own path, independent of the knight or any romantic expectations.\n\n- **Creativity**:\n  - Subvert traditional fairy tale tropes by portraying the knight as uninterested and the protagonist as self-reliant and independent. Use this subversion to explore themes of identity and self-discovery.\n  - Incorporate elements of humor and irony, such as the protagonist's attempts to adapt to modern life and the knight's nonchalant attitude towards their role in the story. Use these elements to create a light-hearted and engaging narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a multidimensional character who evolves from being dependent on the fairy tale narrative to becoming self-sufficient and independent. Use internal monologue to reveal their thoughts and emotions as they navigate their new reality.\n  - Create a setting that blends elements of the fairy tale world with modern influences, using the protagonist's interactions with the environment to highlight the contrast between their expectations and reality. For example, describe the protagonist's surprise at modern technology and societal changes.\n\n- **Language Use**:\n  - Employ a humorous and conversational tone, using witty dialogue and internal monologue to convey the protagonist's confusion and adaptation to their new reality. Use irony and sarcasm to enhance the humor and subversion of traditional tropes.\n  - Use vivid and descriptive language to create an immersive narrative, focusing on the protagonist's sensory experiences and emotional responses. For example, describe the protagonist's initial awe and subsequent disappointment upon awakening to an uninterested knight.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, plot structure, creativity, character development, and language use. The few-shot examples often blend humor with unexpected twists, subvert traditional genre expectations, and focus on character interactions and internal conflicts. The new prompt involves a humorous and unexpected twist on a classic horror trope, which suggests a narrative that combines elements of comedy, fantasy, and satire.\n\n1. **Plot**: The plot should revolve around the unexpected summoning of \"Peter\" instead of a demon, focusing on the humorous and absurd nature of the situation. The narrative should explore the protagonist's and their friends' reactions to Peter's appearance and his ranting, leading to a resolution that highlights the absurdity of their actions.\n\n2. **Creativity**: The story should creatively subvert the traditional demon summoning trope by introducing a mundane and comical character like \"Peter.\" The narrative should incorporate elements of satire and parody, using Peter's character to comment on the misconceptions and clichés associated with demon summoning rituals.\n\n3. **Development (Character and Setting)**: The protagonist and their friends should be developed as curious and somewhat naive individuals, whose actions lead to unintended consequences. Peter should be characterized as an eccentric and verbose figure, whose presence and rants add humor and depth to the story. The setting should be a typical suburban or urban environment, contrasting with the supernatural expectations.\n\n4. **Language Use**: The language should be informal and humorous, with witty dialogue and internal monologue that reflect the protagonist's confusion and amusement. The narrative should employ irony and sarcasm to enhance the comedic tone and highlight the absurdity of the situation.\n\nBy focusing on these elements, the **Story Rules** will provide comprehensive guidance for crafting a narrative that aligns with the new writing prompt's themes and tone, while incorporating detailed examples inspired by the few-shot demonstrations.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist and their friends eagerly preparing for a demon summoning ritual, setting the stage for the unexpected twist. Use phrases like \"We gathered in the dimly lit basement, crosses turned upside down, ready for the thrill of summoning a demon.\"\n  - Develop the plot by introducing \"Peter\" as the unexpected result of the ritual, focusing on the group's confusion and Peter's comical ranting. Highlight the absurdity of the situation with examples such as Peter lecturing the group on the dangers of misusing rituals.\n  - Conclude the narrative with a resolution that emphasizes the humorous consequences of their actions, such as the group deciding to abandon their supernatural pursuits in favor of more mundane activities.\n\n- **Creativity**:\n  - Subvert the traditional demon summoning trope by introducing Peter as a mundane and comical character, using his presence to satirize the misconceptions about such rituals. For example, have Peter appear in a bathrobe, holding a cup of tea, and complaining about being disturbed.\n  - Incorporate elements of parody and satire, using Peter's character to comment on the clichés associated with horror movies and supernatural rituals. Use his rants to humorously debunk common myths and stereotypes.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist and their friends as curious and somewhat naive individuals, whose actions lead to unintended and humorous consequences. Use dialogue and internal monologue to convey their initial excitement and subsequent confusion.\n  - Characterize Peter as an eccentric and verbose figure, whose presence adds humor and depth to the story. Use his rants to reveal his personality and provide comedic commentary on the situation.\n  - Set the story in a typical suburban or urban environment, contrasting with the supernatural expectations. Use descriptions of the mundane setting to enhance the comedic tone, such as the group gathering in a cluttered basement filled with everyday items.\n\n- **Language Use**:\n  - Employ an informal and humorous tone, using witty dialogue and internal monologue to reflect the protagonist's confusion and amusement. Use phrases like \"This wasn't the demon we were expecting, but Peter sure had a lot to say about our 'ritual.'\"\n  - Use irony and sarcasm to enhance the comedic tone and highlight the absurdity of the situation. Incorporate rhetorical questions and humorous observations to engage the reader and maintain a light-hearted narrative.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with a strong conflict, using humor or irony, developing complex characters, and employing vivid language. For the new prompt, I will focus on the old god's internal conflict and the irony of their teachings being misinterpreted. I will incorporate examples that highlight the god's attempts to correct their followers and the challenges they face in doing so. The rules will guide the narrative to explore themes of power, misinterpretation, and redemption, using a blend of humor and seriousness to reflect the god's perspective.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the old god awakening to a world vastly changed, immediately confronting the irony of their teachings being twisted. Use this as the central conflict that drives the narrative. For example, describe the god's initial shock and confusion as they witness a ritual that is meant to honor them but is instead a display of cruelty.\n  - Develop the plot through the god's attempts to correct their followers, facing resistance and misunderstanding. Include scenes where the god tries to communicate their true teachings, only to be met with disbelief or further misinterpretation. Conclude with a resolution that sees the god finding a way to subtly influence change, perhaps by inspiring a new generation of followers who understand their true message.\n\n- **Creativity**:\n  - Use irony and satire to highlight the contrast between the god's original teachings and their followers' current practices. For instance, depict a scene where the god's symbol of peace is used as a banner for war, emphasizing the absurdity of the situation.\n  - Incorporate elements of fantasy and mythology, such as the god's powers and the rituals of their followers, to create a rich and immersive world. Use these elements to explore themes of power, belief, and the consequences of misinterpretation.\n\n- **Development (Character and Setting)**:\n  - Develop the old god as a complex character, blending wisdom with frustration and a desire for redemption. Use internal monologue to convey their thoughts and emotions as they navigate the changed world. Highlight their struggle to reconcile their past with the present, such as their memories of teaching kindness clashing with the current reality.\n  - Create a setting that reflects the god's influence, with temples and symbols that have been altered over time. Use vivid descriptions to convey the grandeur and decay of these places, emphasizing the passage of time and the distortion of the god's teachings.\n\n- **Language Use**:\n  - Employ a blend of formal and conversational language, using the god's perspective to convey a sense of ancient wisdom and modern frustration. Use vivid imagery and rhetorical devices to enhance the narrative, such as metaphors that compare the god's teachings to seeds that have grown into twisted vines.\n  - Use dialogue to reveal character dynamics and advance the plot. For example, include conversations between the god and their followers that highlight the misunderstandings and the god's attempts to clarify their teachings.\n</story_rules>"
]