[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The demonstrations emphasize starting with a strong hook, developing tension through character interactions, and resolving conflicts with a blend of humor and introspection. The new prompt involves a mysterious and potentially unsettling scenario, which requires a balance of suspense and emotional depth. I will ensure the rules guide the narrative to explore themes of identity, memory, and reality, while maintaining a tone that is both engaging and thought-provoking. The examples will illustrate how to effectively convey the protagonist's confusion and the unfolding mystery.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's routine morning, establishing a sense of normalcy before introducing the central mystery. For example, describe the protagonist's typical breakfast routine, such as \"pouring cereal into a bowl and reaching for the milk.\"\n  - Introduce the central conflict by having the protagonist notice their own face in the missing kids section of the newspaper. Use this moment to create immediate tension and intrigue, with a line like, \"My spoon clattered to the table as I stared at the paper.\"\n  - Develop the plot by exploring the protagonist's emotional and psychological response to the discovery. Use internal monologue and dialogue with family members to reveal confusion and disbelief, such as, \"Mom, why is my picture in the paper?\"\n  - Conclude with an open-ended resolution that suggests further exploration of the protagonist's identity and past. For instance, end with the protagonist deciding to investigate their past, thinking, \"I need to find out who I really am.\"\n\n- **Creativity**:\n  - Use the prompt to explore themes of identity, memory, and reality. Incorporate elements of mystery and suspense to engage the reader, such as the protagonist questioning their own memories and experiences.\n  - Introduce imaginative elements that challenge the protagonist's understanding of their life, like hints of a hidden past or unusual family dynamics. For example, have the protagonist recall fragmented memories that don't align with their current life.\n  - Blend realism with a touch of the surreal to create a compelling narrative. Use the protagonist's perspective to explore the boundaries between reality and perception.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and introspective character, focusing on their internal conflict and emotional journey. Use their thoughts and reactions to reveal their personality and fears.\n  - Create a setting that reflects the protagonist's sense of normalcy and security, such as a cozy kitchen with familiar details. Use the setting to contrast with the unsettling discovery, enhancing the story's tension.\n  - Use secondary characters, like family members, to highlight the protagonist's confusion and drive the narrative. For example, depict a parent's dismissive response to the protagonist's concerns, adding to the mystery.\n\n- **Language Use**:\n  - Employ a first-person narrative perspective to provide an intimate view of the protagonist's thoughts and emotions. Use direct and emotive language to convey the intensity of their experience.\n  - Use descriptive language to create vivid imagery and enhance the story's atmosphere. For example, describe the newspaper's texture and the protagonist's physical reactions to the discovery.\n  - Incorporate dialogue and internal monologue to reveal the protagonist's emotional state and drive the narrative. Use rhetorical questions and exclamations to emphasize their confusion and urgency, such as, \"How could this be possible?\"\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves themes of betrayal, protection, and unintended consequences, which will guide the creation of specific rules. The examples in the few-shot demonstrations often include direct dialogue, character dynamics, and a blend of humor and tension, which will be incorporated into the new rules. The rules will be structured to provide comprehensive guidance on how to develop the narrative, characters, and setting, while maintaining a tone that reflects the emotional and dramatic nature of the prompt. Each rule will be accompanied by a concrete example to illustrate its application, ensuring the rules are actionable and specific to the new writing prompt.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a confrontation between the parent and the trainer, immediately establishing the conflict and stakes. Use direct dialogue to reveal the misunderstanding and the consequences of the daughter's training. For example, start with the parent exclaiming, \"I never told you to train her, I told you to protect her!\"\n  - Develop the plot through a series of flashbacks that reveal the daughter's training process and the trainer's intentions. Use these flashbacks to build tension and provide context for the current conflict.\n  - Conclude with a resolution that addresses the emotional fallout and explores the potential for reconciliation or further conflict. For instance, have the daughter demonstrate her skills in a way that protects her family, leading to a complex emotional resolution.\n\n- **Creativity**:\n  - Explore themes of protection, betrayal, and unintended consequences through the narrative. Use the daughter's transformation into an assassin as a metaphor for the loss of innocence and the complexity of parental expectations.\n  - Incorporate imaginative elements such as unique training methods or settings that highlight the daughter's skills and the trainer's unconventional approach. For example, describe a training scene where the daughter uses her environment creatively to overcome challenges.\n\n- **Development (Character and Setting)**:\n  - Develop the parent as a character torn between their desire to protect their child and their anger at the unintended consequences of the training. Use internal monologue and dialogue to reveal their emotional turmoil.\n  - Portray the trainer as a well-intentioned but misunderstood figure, whose actions are driven by a belief in the necessity of the daughter's skills. Use their interactions with the parent to reveal their motivations and ethical dilemmas.\n  - Establish the setting as a place that reflects the tension and stakes of the narrative, such as a secluded training ground or a family home. Use descriptive language to create a vivid sense of place that enhances the story's emotional impact.\n\n- **Language Use**:\n  - Employ a dramatic and emotional tone, using direct and impactful dialogue to convey the intensity of the conflict. Use rhetorical questions and exclamations to emphasize the characters' emotions, such as \"But you turned my daughter into a bloody assassin!\"\n  - Use vivid imagery and descriptive language to enhance the narrative's emotional depth and create a sense of urgency. For example, describe the daughter's training scenes with dynamic and sensory-rich language to convey the intensity and skill involved.\n  - Maintain a balance between dialogue and narrative description, using each to reveal character motivations and advance the plot. Ensure the language reflects the high stakes and emotional complexity of the story.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, structure, and narrative style. The demonstrations often blend humor with introspection, use dialogue to drive the plot, and focus on character dynamics. The new prompt involves a ghost correcting inaccuracies at their own funeral, which suggests a blend of humor, irony, and perhaps a touch of poignancy. The rules will need to guide the LLM in creating a narrative that balances these elements, using the ghost's perspective to explore themes of truth, legacy, and self-perception. The examples will illustrate how to incorporate humor and character development within the context of a funeral setting, ensuring the story remains engaging and reflective. The rules will be organized into the specified categories, providing comprehensive guidance for plot, creativity, character and setting development, and language use. \n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the conclusion of the funeral eulogies, setting the stage for the ghost's appearance. Use this moment to introduce the ghost's perspective and their motivation to correct the record. For example, describe the ghost's frustration as they listen to the inaccuracies being shared.\n  - Develop the plot through a series of humorous and poignant interactions between the ghost and the attendees. Use these interactions to reveal the ghost's true character and the discrepancies between their self-perception and the eulogies. For instance, have the ghost interrupt a speaker to clarify a misunderstood event from their life.\n  - Conclude the story with a resolution that reflects the ghost's acceptance of their legacy, whether it aligns with their self-image or not. Use this moment to highlight themes of self-awareness and the complexity of human memory.\n\n- **Creativity**:\n  - Use the ghost's unique perspective to explore themes of truth and legacy with humor and irony. Incorporate imaginative elements, such as the ghost's ability to manipulate the environment or communicate in unconventional ways, to enhance the narrative.\n  - Blend humor with introspection by having the ghost react to the eulogies with witty commentary and self-reflection. For example, have the ghost chuckle at a particularly exaggerated story, thinking, \"I wish I had been that adventurous.\"\n\n- **Development (Character and Setting)**:\n  - Develop the ghost as a multidimensional character through their reactions and interactions. Use their dialogue to reveal their personality, values, and the truth about their life. For instance, portray the ghost as both amused and exasperated by the eulogies, providing a balanced view of their character.\n  - Establish the funeral setting with sensory details that enhance the atmosphere and mood. Use descriptions of the attendees' reactions and the setting's somber tone to contrast with the ghost's lively presence.\n\n- **Language Use**:\n  - Employ a conversational and humorous tone, using the ghost's dialogue to convey their personality and perspective. Use irony and wit to highlight the discrepancies between the eulogies and the ghost's reality.\n  - Use vivid imagery and sensory details to create an immersive setting, capturing the contrast between the funeral's solemnity and the ghost's lively commentary. For example, describe the ghost's ethereal form as they float above the mourners, casting a playful shadow over the proceedings.\n  - Incorporate rhetorical questions and direct address to engage the reader and enhance the ghost's narrative voice. For instance, have the ghost ponder, \"Did they really think I was that saintly?\" to emphasize their disbelief and humor.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a supernatural entity, a wish, and a developing romance, which suggests a blend of fantasy and romantic comedy. The rules will need to guide the narrative through the initial favor, the protagonist's wariness, the entity's persistence, and the eventual romantic development. The tone should be light-hearted and humorous, with a focus on character dynamics and the gradual evolution of their relationship. Examples will illustrate how to balance the supernatural elements with the romantic storyline, ensuring the narrative remains engaging and cohesive.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist performing a favor for the supernatural entity, establishing the context for the wish. For example, describe a scene where the protagonist helps the entity retrieve a lost item, setting the stage for their interaction.\n  - Develop the plot through the protagonist's reluctance to use the wish, creating humorous situations where the entity tries to convince him. Use scenarios like the entity offering increasingly absurd suggestions for the wish, highlighting the protagonist's skepticism.\n  - Conclude the story with the protagonist and the entity developing a romantic relationship, leading to their marriage. Ensure the resolution feels natural and earned, focusing on the growth of their bond over time.\n\n- **Creativity**:\n  - Incorporate imaginative elements that blend the supernatural with everyday life, such as the entity using her powers in mundane ways to assist the protagonist. For example, have her magically tidy his apartment or prepare elaborate meals.\n  - Use humor to explore the protagonist's wariness and the entity's persistence, creating a light-hearted tone. Include playful banter and misunderstandings that arise from their different perspectives and backgrounds.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a cautious and pragmatic individual, whose skepticism drives the narrative. Use internal monologue to reveal his thoughts and concerns about the wish and the entity's presence.\n  - Portray the supernatural entity as charming and persistent, with a playful demeanor that contrasts with the protagonist's wariness. Use dialogue to showcase her attempts to win him over and her growing affection.\n  - Set the story in a contemporary urban environment, using the setting to highlight the contrast between the mundane and the magical. Describe scenes where the entity's supernatural abilities subtly alter the everyday surroundings.\n\n- **Language Use**:\n  - Employ a conversational and humorous tone, using witty dialogue and internal monologue to convey the characters' personalities and the story's light-hearted nature. For example, use phrases like \"I promise, it's not a monkey's paw situation\" to emphasize the entity's attempts to reassure the protagonist.\n  - Use descriptive language to create vivid imagery of the supernatural elements, such as the entity's magical interventions in the protagonist's life. Incorporate sensory details to enhance the reader's immersion in the story.\n  - Maintain a first-person or close third-person perspective to provide insight into the protagonist's thoughts and feelings, allowing readers to connect with his journey and the evolving romance.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves themes of leadership, choice, and consequence, with a fantastical element introduced by the court mage's options. The rules will need to guide the narrative through a decision-making process, exploring the implications of each choice. The tone should balance the gravity of the situation with the fantastical elements, ensuring a compelling and immersive story.\n\n1. **Plot**: The plot should revolve around the protagonist's internal and external conflicts, focusing on the decision between the two paths offered by the court mage. The narrative should explore the consequences of each choice, using flashbacks or visions to illustrate potential outcomes.\n\n2. **Creativity**: The story should creatively integrate the fantasy elements, such as the potion and the concept of time manipulation. The narrative should explore the philosophical implications of the choices, using imaginative scenarios to highlight the stakes.\n\n3. **Development (Character and Setting)**: Characters should be developed through their interactions and decisions, with a focus on the protagonist's leadership qualities and moral dilemmas. The setting should reflect the kingdom's turmoil, using vivid descriptions to enhance the narrative's tension.\n\n4. **Language Use**: The language should be formal and reflective, capturing the gravity of the protagonist's decision. Descriptive language should be used to create a vivid sense of the setting and the protagonist's emotional state.\n\nWith these insights, I will generate the **Story Rules** for the new writing prompt, ensuring they are comprehensive, actionable, and enriched with examples inspired by the few-shot demonstrations.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a scene that highlights the kingdom's instability and the protagonist's burden as a ruler. For example, describe a tense council meeting where nobles argue over the kingdom's future, emphasizing the protagonist's isolation and responsibility.\n  - Introduce the court mage's offer as a pivotal moment, presenting the two options with equal weight and consequence. Use dialogue and internal monologue to explore the protagonist's thoughts and emotions as they consider each path.\n  - Develop the plot through a series of flashbacks or visions that illustrate the potential outcomes of each choice. For instance, show a vision of the kingdom flourishing if time is turned back, contrasted with a vision of the protagonist leading a lonely but heroic life.\n  - Conclude with the protagonist making a decision, leaving the story open-ended to suggest the ongoing impact of their choice. Use a final scene that reflects the protagonist's resolve and the kingdom's uncertain future.\n\n- **Creativity**:\n  - Integrate the fantasy elements seamlessly into the narrative, using the potion and time manipulation as metaphors for the protagonist's internal struggle. For example, describe the potion as a swirling, iridescent liquid that reflects the protagonist's conflicted emotions.\n  - Explore the philosophical implications of the choices, using imaginative scenarios to highlight the stakes. For instance, depict a scene where the protagonist envisions the kingdom's history rewritten, questioning the morality of altering time.\n  - Use creative symbolism to enhance the narrative, such as a recurring motif of a clock or hourglass to represent the passage of time and the weight of the protagonist's decision.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a complex and multidimensional character, focusing on their leadership qualities and moral dilemmas. Use dialogue and internal monologue to reveal their fears, hopes, and motivations.\n  - Create a vivid setting that reflects the kingdom's turmoil, using descriptive language to convey the tension and uncertainty. For example, describe the castle as a grand but crumbling structure, symbolizing the kingdom's fragility.\n  - Develop secondary characters, such as the court mage and the nobles, through their interactions with the protagonist. Use these characters to highlight the protagonist's conflicts and challenges, providing a contrast to their perspective.\n\n- **Language Use**:\n  - Employ a formal and reflective tone, using complex sentence structures and philosophical language to convey the gravity of the protagonist's decision. Use rhetorical devices to emphasize key themes and ideas.\n  - Use descriptive language to create a vivid sense of the setting and the protagonist's emotional state. For example, describe the court mage's chamber as filled with ancient tomes and mystical artifacts, enhancing the story's fantastical elements.\n  - Incorporate introspective narrative perspective to reflect on the nature of leadership and consequence. Use direct and emotive language to convey the protagonist's internal conflict and the story's themes.\n</story_rules>",
    "<thinking>\nTo create the **Story Rules** for the new writing prompt \"The Vampire Space Program,\" I will analyze the few-shot demonstrations to identify key storytelling elements such as humor, creativity, character dynamics, and plot development. The prompt suggests a blend of science fiction and supernatural elements, with a humorous twist on the concept of vampires in space. The rules will need to guide the narrative to explore the unique advantages and challenges of using vampires for space exploration, while maintaining a light-hearted and imaginative tone. I will ensure the rules are comprehensive, actionable, and include detailed examples inspired by the few-shot demonstrations, focusing on the unique aspects of the prompt such as the vampires' abilities and the implications for space travel.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the revelation of the Vampire Space Program as a groundbreaking initiative. Introduce the concept through a humorous press conference or a scientific briefing, highlighting the vampires' unique abilities that make them ideal for space travel. For example, describe a scientist enthusiastically explaining, \"They don't need food, water, or air! It's the perfect solution!\"\n  - Develop the plot by exploring the challenges and unexpected consequences of the program. Include humorous scenarios such as vampires adapting to zero gravity or dealing with the lack of night and day cycles in space. Use these situations to create tension and comedy, such as a vampire struggling to find a dark corner on a brightly lit space station.\n  - Conclude with a successful mission or a humorous twist that leaves room for future adventures. For instance, have the vampires discover a new planet that is perfectly suited to their needs, leading to the establishment of a vampire colony.\n\n- **Creativity**:\n  - Infuse the narrative with imaginative elements that blend science fiction and supernatural lore. Use the vampires' abilities to create unique solutions to space travel challenges, such as using their enhanced senses to navigate through asteroid fields.\n  - Incorporate humor by subverting traditional vampire tropes in the context of space exploration. For example, depict a vampire struggling with the concept of \"daylight savings\" on a space station or using their charm to negotiate with alien species.\n  - Explore the cultural and societal implications of the Vampire Space Program, such as how humans and vampires coexist and collaborate on missions. Use these interactions to add depth and humor to the story.\n\n- **Development (Character and Setting)**:\n  - Develop characters by highlighting their unique traits and how they adapt to the space environment. Focus on the vampires' personalities and how they interact with human crew members. For example, portray a vampire captain who is both charismatic and slightly aloof, leading the mission with a mix of confidence and humor.\n  - Create a setting that combines futuristic technology with gothic elements, reflecting the blend of science fiction and supernatural themes. Describe the space station with both sleek, modern design and dark, atmospheric corners where vampires feel at home.\n  - Use character interactions to reveal the dynamics between humans and vampires, emphasizing themes of cooperation and mutual respect. For instance, depict a human scientist and a vampire engineer working together to solve a technical problem, using their respective strengths to succeed.\n\n- **Language Use**:\n  - Employ a light-hearted and humorous tone throughout the narrative, using witty dialogue and playful descriptions to engage the reader. Use puns and wordplay related to vampire lore and space travel to enhance the comedic effect.\n  - Use vivid imagery and descriptive language to create a sense of wonder and excitement about the Vampire Space Program. For example, describe the vampires' first view of Earth from space with awe and humor, capturing their unique perspective.\n  - Maintain a conversational and accessible style, using first-person or third-person limited perspective to provide insight into the characters' thoughts and emotions. Use direct and engaging language to keep the reader entertained and invested in the story.\n</story_rules>"
]