[
    "<thinking>\n1. **Plot**: The Author Written Story intricately weaves Jonas's journey through the graveyard with a deep exploration of his memories and relationships. It focuses on the emotional weight of each grave, providing a detailed backstory for each person Jonas remembers. The narrative is non-linear, reflecting on past events and their impact on Jonas's present state. The story ends with Jonas standing by Martha's grave, contemplating the possibility of altering the timeline, which aligns with the prompt's theme of hope amidst despair. In contrast, the Base Story follows a more linear progression, with Jonas encountering a spectral Martha who encourages him to continue his quest, providing a more direct resolution to the narrative.\n\n2. **Creativity**: The Author Written Story creatively integrates elements of time travel and personal history, using the graveyard as a metaphor for Jonas's tangled past and uncertain future. It delves into the complexities of familial and friendship bonds, exploring themes of regret, forgiveness, and the hope of redemption. The Base Story, while also imaginative, leans more towards a straightforward supernatural encounter, with Martha's apparition providing guidance and closure.\n\n3. **Development (Character and Setting)**: The Author Written Story offers a rich, introspective look at Jonas's character, revealing his inner turmoil and resilience. The setting of the graveyard is vividly described, with each grave serving as a touchstone for Jonas's memories and emotions. The narrative provides a deep sense of place and history, tying the characters' pasts to the present. The Base Story, while also character-focused, emphasizes Jonas's immediate emotional reactions and the spectral encounter, with less emphasis on the broader historical context.\n\n4. **Language Use**: The Author Written Story employs a reflective and somber tone, using detailed descriptions and introspective language to convey Jonas's emotional state. The narrative is rich with internal monologue and nuanced reflections on past events. The language is precise and evocative, capturing the weight of Jonas's memories and the desolation of the post-apocalyptic setting. The Base Story uses more direct and dramatic language, with a focus on dialogue and action to drive the narrative forward.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Structure the narrative around Jonas's journey through the graveyard, using each grave as a catalyst for exploring his memories and relationships. Ensure the plot is non-linear, reflecting on past events and their impact on Jonas's present state.\n  - Conclude the story with Jonas standing by Martha's grave, contemplating the possibility of altering the timeline, maintaining a theme of hope amidst despair.\n\n- **Creativity**:\n  - Integrate elements of time travel and personal history, using the graveyard as a metaphor for Jonas's tangled past and uncertain future. Explore themes of regret, forgiveness, and the hope of redemption.\n  - Use the setting to reflect Jonas's internal struggles, with the graveyard serving as a physical manifestation of his emotional journey.\n\n- **Development (Character and Setting)**:\n  - Provide a rich, introspective look at Jonas's character, revealing his inner turmoil and resilience through detailed internal monologue and reflections on past events.\n  - Describe the graveyard vividly, with each grave serving as a touchstone for Jonas's memories and emotions. Ensure the setting conveys a deep sense of place and history, tying the characters' pasts to the present.\n\n- **Language Use**:\n  - Employ a reflective and somber tone, using detailed descriptions and introspective language to convey Jonas's emotional state. For example, \"Jonas paused by Aleksander’s grave for a moment, thinking of old memories such as Aleksander helping Jonas and Bartosz with their homework.\"\n  - Use precise and evocative language to capture the weight of Jonas's memories and the desolation of the post-apocalyptic setting. Include nuanced reflections on past events, such as Jonas's contemplation of his father's grave and the family photograph.\n</story_rules>",
    "<thinking>\n1. **Plot**: The Author Written Story presents a more complex and layered narrative structure compared to the Base Story. It delves into the intricacies of the characters' pasts and their emotional struggles, particularly focusing on Rhonda's perspective. The story is not just about the escape from the afterlife but also about the unresolved issues and personal growth of the characters. The narrative is interspersed with flashbacks and reflections, providing depth to the characters' motivations and the dynamics within the group. The conflict is internal, revolving around the characters' desires and resentments, rather than external events. The resolution is subtle, with Rhonda contemplating her own path to crossing over, rather than a definitive escape as seen in the Base Story.\n\n2. **Creativity**: The Author Written Story creatively explores the theme of being trapped in the afterlife by focusing on the psychological and emotional aspects of the characters. It uses the setting of the high school as a metaphor for the characters' unfinished business and unresolved emotions. The story incorporates elements of mystery and suspense, particularly through the character of Martin and his dubious intentions. The narrative also includes imaginative elements, such as the concept of possessing a body to escape, which adds a layer of moral complexity to the story.\n\n3. **Development (Character and Setting)**: The Author Written Story excels in character development, providing detailed backstories and emotional arcs for each character. Rhonda is portrayed as a complex character with a mix of resentment and hope, and her interactions with other characters reveal their individual struggles and coping mechanisms. The setting of Split River High is vividly described, with specific locations like the art room and the dining room serving as significant backdrops for the characters' emotional journeys. The setting is not just a physical space but a reflection of the characters' inner turmoil.\n\n4. **Language Use**: The Author Written Story employs a conversational and introspective tone, with a focus on the characters' internal dialogues and reflections. The language is rich with imagery and emotion, capturing the characters' frustrations and desires. The use of rhetorical questions and direct address to the reader creates an intimate connection with the audience. The dialogue is realistic and reveals the characters' personalities and relationships. The pacing is deliberate, allowing for moments of introspection and tension to build gradually.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Structure the narrative around the internal conflicts and emotional struggles of the characters, particularly focusing on their pasts and unresolved issues. Use flashbacks and reflections to provide depth to the characters' motivations and the dynamics within the group.\n  - Introduce conflict through the characters' desires and resentments, rather than external events. Allow the resolution to be subtle, focusing on personal growth and contemplation rather than a definitive escape.\n\n- **Creativity**:\n  - Explore the theme of being trapped in the afterlife by focusing on the psychological and emotional aspects of the characters. Use the setting of the high school as a metaphor for the characters' unfinished business and unresolved emotions.\n  - Incorporate elements of mystery and suspense, such as a character with dubious intentions or a morally complex escape plan, to add depth and intrigue to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters with detailed backstories and emotional arcs. Use interactions between characters to reveal their individual struggles and coping mechanisms.\n  - Describe the setting of Split River High vividly, using specific locations as significant backdrops for the characters' emotional journeys. Ensure the setting reflects the characters' inner turmoil and contributes to the narrative's themes.\n\n- **Language Use**:\n  - Employ a conversational and introspective tone, focusing on the characters' internal dialogues and reflections. Use rich imagery and emotion to capture the characters' frustrations and desires.\n  - Utilize rhetorical questions and direct address to the reader to create an intimate connection with the audience. Ensure dialogue is realistic and reveals the characters' personalities and relationships.\n  - Maintain a deliberate pacing, allowing for moments of introspection and tension to build gradually. Use phrases like \"part of Rhonda was happy for her, but another part resented her for it\" to convey complex emotions and internal conflicts.\n</story_rules>",
    "<thinking>\n1. **Plot**: The Author Written Story presents a more complex and layered plot compared to the Base Story. It begins with Simon's disbelief in Maddie's ghost, thinking she is a figment of his imagination. The narrative unfolds with Simon's gradual realization of Maddie's reality through specific incidents and clues, such as the mention of Janet Hamilton and the 1958 fire. The story is structured around Simon's internal conflict and his journey from skepticism to belief, culminating in his decision to help Maddie. The Base Story, on the other hand, follows a more straightforward plot where Simon quickly accepts Maddie's ghost and embarks on a mission to uncover the school's dark past. The Author Written Story uses a more subtle and gradual revelation of the truth, with a focus on Simon's internal struggle and the mystery surrounding Maddie's disappearance.\n\n2. **Creativity**: The Author Written Story creatively integrates elements of mystery and suspense, with Simon's initial dismissal of Maddie's ghost and the gradual uncovering of the truth. The story uses the concept of a ghost haunting to explore themes of grief, denial, and acceptance. The narrative is enriched with specific details, such as the video of Maddie and the historical reference to the 1958 fire, which add depth and intrigue. The Base Story, while also incorporating supernatural elements, follows a more conventional approach to the ghost story genre, with a clear focus on the resolution of the haunting.\n\n3. **Development (Character and Setting)**: In the Author Written Story, Simon is portrayed as a complex character dealing with grief and denial. His interactions with other characters, such as Nicole and Claire, and his internal monologue provide insight into his emotional state. The setting of the school is intricately tied to the plot, with specific locations like the classroom and football field playing a role in Simon's encounters with Maddie. The Base Story provides a more general depiction of Simon and the school setting, focusing on the broader narrative of uncovering the school's past.\n\n4. **Language Use**: The Author Written Story employs a conversational and introspective tone, with Simon's internal thoughts and dialogue driving the narrative. The use of direct speech and internal monologue creates an intimate connection with the reader, allowing them to experience Simon's journey firsthand. The story uses specific and vivid language to describe Simon's encounters with Maddie and the unfolding mystery. The Base Story uses a more descriptive and expository style, with a focus on the external events and actions of the characters.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist, Simon, dismissing the ghost of his friend Maddie as a figment of his imagination. Use specific incidents, such as a video or a conversation, to reinforce his disbelief.\n  - Gradually reveal the truth about Maddie's ghost through a series of clues and events that challenge Simon's skepticism. Include a pivotal moment where Simon encounters Maddie in a familiar setting, prompting him to question his assumptions.\n  - Structure the narrative around Simon's internal conflict and journey from disbelief to acceptance. Use specific plot points, such as the mention of a historical event or character, to deepen the mystery and drive the story forward.\n  - Conclude with Simon's decision to help Maddie, setting the stage for a resolution that involves uncovering a decades-old tragedy.\n\n- **Creativity**:\n  - Integrate elements of mystery and suspense by weaving in historical references and unexplained phenomena that Simon must investigate. Use these elements to create a sense of intrigue and tension throughout the story.\n  - Explore themes of grief, denial, and acceptance through Simon's interactions with Maddie's ghost. Use the supernatural elements to delve into Simon's emotional journey and the impact of Maddie's disappearance on his life.\n  - Incorporate specific and imaginative details, such as a ghostly message or a significant location, to enrich the narrative and provide depth to the story's supernatural aspects.\n\n- **Development (Character and Setting)**:\n  - Develop Simon as a multidimensional character grappling with grief and skepticism. Use his internal monologue and interactions with other characters to reveal his emotional state and motivations.\n  - Establish the school setting as a central element of the story, with specific locations playing a role in Simon's encounters with Maddie. Use the setting to enhance the atmosphere and tie it to the narrative's themes.\n  - Create supporting characters, such as friends or teachers, who contribute to Simon's journey and the unfolding mystery. Use their interactions with Simon to provide additional perspectives and insights into the story's events.\n\n- **Language Use**:\n  - Employ a conversational and introspective tone, using Simon's internal thoughts and dialogue to drive the narrative. Create an intimate connection with the reader by allowing them to experience Simon's journey firsthand.\n  - Use direct speech and internal monologue to convey Simon's emotions and reactions to the unfolding mystery. Include specific and vivid language to describe his encounters with Maddie and the supernatural elements of the story.\n  - Incorporate rhetorical devices and figures of speech to enhance the narrative's emotional impact and create a sense of immediacy. Use pacing to build tension and suspense, particularly during key moments of revelation or conflict.\n</story_rules>",
    "<thinking>\n1. **Plot**: The Author Written Story presents a more complex and layered plot compared to the Base Story. It begins with Everett's backstory, detailing the circumstances of his death and his initial interactions with other ghosts. The narrative unfolds with a focus on Everett's internal conflict and his fear of being left behind, which drives his deceit. The story builds tension as the ghosts begin to uncover the truth, leading to a climax where Everett is confronted with the consequences of his actions. The resolution is more tragic, with Everett facing eternal isolation, unlike the Base Story, which ends on a hopeful note with Olivia finding peace.\n\n2. **Creativity**: The Author Written Story creatively integrates the prompt by focusing on the psychological aspects of being a ghost, particularly Everett's guilt and fear. It uses the setting of a high school to explore themes of regret and denial, adding depth to the ghostly existence. The story also introduces a unique twist by having Everett's lies unravel through the actions of other ghosts, rather than a direct confrontation, which adds an element of suspense and inevitability.\n\n3. **Development (Character and Setting)**: Characters in the Author Written Story are more developed, with distinct personalities and backstories. Everett is portrayed as a flawed, complex character whose actions are driven by fear and guilt. The setting of Split River High is vividly described, with its history and the events leading to the characters' deaths intricately woven into the narrative. This creates a rich, immersive environment that enhances the story's emotional impact.\n\n4. **Language Use**: The Author Written Story employs a more sophisticated and nuanced use of language. It uses introspective and reflective tones to convey Everett's internal struggle. The narrative includes detailed descriptions and a careful choice of words to evoke the atmosphere of the high school and the ghosts' experiences. Dialogue is used effectively to reveal character motivations and advance the plot, with subtle hints and foreshadowing that build tension and anticipation.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a backstory that explains the protagonist's death and initial interactions with other ghosts. Use this to establish the protagonist's motivations and fears.\n  - Develop the plot around the protagonist's internal conflict and fear of being left behind, which drives their deceitful actions. Gradually build tension as other characters begin to uncover the truth.\n  - Create a climax where the protagonist is confronted with the consequences of their actions, leading to a resolution that reflects the themes of regret and isolation.\n  - Example: Introduce Everett's fear of being left alone in Split River High and his decision to lie to other ghosts about crossing over.\n\n- **Creativity**:\n  - Integrate psychological elements into the narrative, focusing on the protagonist's guilt and fear. Use these elements to explore deeper themes of regret and denial.\n  - Introduce a unique twist by having the protagonist's lies unravel through the actions of other characters, rather than a direct confrontation.\n  - Example: Show how Everett's lies begin to unravel as other ghosts, like Dawn and Maddie, start to find ways to move on without his guidance.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters with distinct personalities and backstories. Use these to create emotional arcs that resonate with the story's themes.\n  - Establish an immersive setting that is intricately tied to the characters' histories and the events leading to their deaths. Use detailed descriptions to enhance the atmosphere.\n  - Example: Describe Split River High as a place with a rich history, where Everett and Janet's deaths are central to the narrative.\n\n- **Language Use**:\n  - Employ introspective and reflective tones to convey the protagonist's internal struggle. Use detailed descriptions and a careful choice of words to evoke the story's atmosphere.\n  - Use dialogue effectively to reveal character motivations and advance the plot. Include subtle hints and foreshadowing to build tension and anticipation.\n  - Example: Use phrases like \"Everett continued to fear a day when they would all cross over\" to highlight his internal conflict and fear of isolation.\n</story_rules>",
    "<thinking>\n1. **Plot**: The Author Written Story presents a more complex and layered plot compared to the Base Story. It begins with Ethan's realization that Christmas is approaching, despite the town's perpetual winter. The narrative explores the interpersonal dynamics and conflicts within the town, particularly focusing on Ethan's family and the broader community's struggles. The story builds tension through Ethan's interactions with other townsfolk, who are initially dismissive or preoccupied with their own issues. The climax occurs when Ethan's persistence leads to a communal decision to celebrate Christmas, culminating in a heartfelt gathering. The resolution is bittersweet, acknowledging ongoing challenges but highlighting the importance of community and hope. In contrast, the Base Story follows a more straightforward plot where Jonah, the protagonist, easily rallies the children and eventually the adults to bring back Christmas, leading to a magical transformation of the town.\n\n2. **Creativity**: The Author Written Story creatively integrates elements of realism and fantasy, drawing parallels to \"Narnia\" and using the perpetual winter as a metaphor for emotional and communal stagnation. The story's creativity lies in its focus on character-driven conflict and resolution, rather than relying on a magical or supernatural transformation. The narrative is grounded in the characters' personal struggles and relationships, making the eventual celebration of Christmas a hard-won victory. The Base Story, on the other hand, leans more heavily into the magical realism genre, with the return of Christmas breaking a literal curse over the town.\n\n3. **Development (Character and Setting)**: The Author Written Story excels in character development, particularly through dialogue and interactions. Ethan is portrayed as a determined and empathetic character, whose actions catalyze change in the town. The setting is vividly described through the characters' experiences and emotions, emphasizing the oppressive nature of the endless winter and the isolation it causes. The story delves into the personal histories and motivations of secondary characters, such as Boyd and Bakta, adding depth to the narrative. The Base Story provides a more surface-level exploration of characters, focusing primarily on Jonah's leadership and the town's transformation.\n\n4. **Language Use**: The Author Written Story employs a conversational and realistic tone, with dialogue that reveals character and advances the plot. The language is rich with emotional nuance, capturing the tension and eventual warmth of the community's interactions. The narrative uses rhetorical questions and direct speech to engage the reader and convey the characters' internal conflicts. The Base Story uses a more traditional narrative style, with descriptive language that paints a vivid picture of the setting but lacks the same level of emotional depth and complexity in dialogue.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's realization of the approaching holiday, setting the stage for the central conflict. Use Ethan's internal monologue to express his concerns and observations about the town's neglect of Christmas.\n  - Introduce interpersonal conflicts early on, particularly within the protagonist's family and the broader community. Use dialogue to highlight these tensions, such as Ethan's conversation with Julie about their parents' arguments.\n  - Build tension through the protagonist's interactions with other townsfolk, who are initially dismissive or preoccupied. Use scenes like Ethan's inquiry at the diner to show the community's varied responses to the idea of celebrating Christmas.\n  - Resolve the narrative with a communal decision to celebrate Christmas, emphasizing the importance of community and hope. Use a gathering scene to depict the town's transformation, focusing on the emotional impact rather than a magical change.\n\n- **Creativity**:\n  - Integrate elements of realism and fantasy, using the perpetual winter as a metaphor for emotional and communal stagnation. Reference familiar fantasy elements, such as the comparison to \"Narnia,\" to enrich the narrative.\n  - Focus on character-driven conflict and resolution, rather than relying on a magical or supernatural transformation. Highlight the characters' personal struggles and relationships as the driving force behind the story's resolution.\n  - Use creative dialogue and interactions to reveal character motivations and advance the plot. For example, Ethan's persistence in asking about Christmas despite initial dismissals from the townsfolk.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters through dialogue and interactions. Portray Ethan as a determined and empathetic character whose actions catalyze change in the town.\n  - Use the setting to reflect the characters' experiences and emotions, emphasizing the oppressive nature of the endless winter and the isolation it causes. Describe the town through the characters' perspectives, such as Ethan's observations of the diner and Colony House.\n  - Delve into the personal histories and motivations of secondary characters, adding depth to the narrative. Use scenes like Boyd's apology to Ethan to reveal character growth and change.\n\n- **Language Use**:\n  - Employ a conversational and realistic tone, with dialogue that reveals character and advances the plot. Use direct speech and rhetorical questions to engage the reader and convey the characters' internal conflicts.\n  - Capture emotional nuance through language, highlighting the tension and eventual warmth of the community's interactions. Use phrases like \"Christmas is important\" to underscore the story's themes.\n  - Use descriptive language to paint a vivid picture of the setting, but focus on the emotional depth and complexity in dialogue. For example, describe the diner as a place of gathering and transformation, reflecting the characters' emotional journeys.\n</story_rules>"
]