[
    "<thinking>\n1. **Plot**: The Author Written Story focuses on the intimate, everyday moments between Will and Nico, emphasizing their established relationship and routine. The narrative is structured around a typical morning, filled with affection and humor, without introducing a significant change or conflict as the prompt suggests. The Base Story, however, introduces a pivotal moment where Nico suggests a life-changing adventure, aligning more closely with the prompt's requirement for a change in routine.\n\n2. **Creativity**: The Author Written Story creatively explores the depth of Will and Nico's relationship through small, tender moments and playful interactions. It uses the setting of a morning routine to delve into their dynamic, highlighting the comfort and love they share. The Base Story takes a more adventurous approach, suggesting a travel narrative that shifts the focus from routine to exploration and change.\n\n3. **Development (Character and Setting)**: The Author Written Story develops its characters through detailed descriptions and interactions, painting a vivid picture of their morning routine and the warmth of their relationship. The setting is intimate and personal, centered around their bedroom. The Base Story, while also focusing on character interaction, uses the setting as a springboard for a broader narrative about travel and adventure.\n\n4. **Language Use**: The Author Written Story employs rich, descriptive language to create an immersive and intimate atmosphere. It uses detailed imagery and affectionate dialogue to convey the depth of Will and Nico's relationship. The Base Story uses a more straightforward narrative style, with dialogue that drives the plot forward and introduces the idea of change and adventure.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a detailed and affectionate depiction of the morning routine between Will and Nico, emphasizing the comfort and love in their relationship. Use phrases like \"The best feeling in the world was waking up next to Nico Di Angelo\" to set the tone.\n  - Focus on the interactions and playful banter between the characters, such as tickling and teasing, to highlight their closeness and familiarity.\n  - Do not introduce a significant change or conflict within the narrative. Instead, maintain the focus on the established routine and the joy it brings to the characters.\n\n- **Creativity**:\n  - Use the setting of a morning routine to explore the depth of the characters' relationship, incorporating imaginative and tender moments that reveal their personalities and bond.\n  - Integrate small, unique details that add depth to the narrative, such as the description of Nico's appearance and the playful naming of their cat, Connie, as \"Constable.\"\n\n- **Development (Character and Setting)**:\n  - Develop the characters through detailed descriptions and interactions, focusing on their emotional connection and the warmth of their relationship. Use descriptions like \"His dark lashes cast shadows over his angled face\" to create vivid imagery.\n  - Establish an intimate and personal setting, centered around their bedroom, to enhance the sense of closeness and familiarity between the characters.\n\n- **Language Use**:\n  - Employ rich, descriptive language to create an immersive and intimate atmosphere. Use detailed imagery and affectionate dialogue to convey the depth of Will and Nico's relationship.\n  - Use playful and affectionate dialogue to highlight the characters' dynamic, such as \"Wake up, my love,\" and \"I love you even more for the breakfast in bed.\"\n  - Maintain a warm and tender tone throughout the narrative, using language that reflects the comfort and joy of the characters' routine.\n</story_rules>",
    "<thinking>\n1. **Plot**: The Author Written Story introduces the plot through a casual conversation between Will and Nico, which naturally leads to the topic of phone privacy. The conflict is subtly introduced through a discussion about a friend's breakup over phone privacy issues, which sets the stage for the main narrative. The resolution is gentle and focuses on emotional connection rather than dramatic revelation. In contrast, the Base Story uses a more direct approach, with Percy immediately accessing Nico's phone and discovering the photos, leading to an emotional climax and resolution.\n\n2. **Creativity**: The Author Written Story creatively integrates the prompt by using a conversation about a friend's relationship to segue into the main plot. It blends everyday life with deeper emotional themes, using the phone as a symbol of trust and intimacy. The Base Story, while imaginative, follows a more straightforward path, focusing on the discovery and emotional impact of the photos without the same level of narrative layering.\n\n3. **Development (Character and Setting)**: The Author Written Story develops characters through dialogue and small actions, creating a sense of intimacy and realism. Will and Nico's relationship is depicted through their interactions and shared moments, emphasizing trust and affection. The setting is their home, which adds to the cozy, intimate atmosphere. The Base Story also focuses on character development, but it relies more on internal monologue and direct emotional expression, with less emphasis on setting.\n\n4. **Language Use**: The Author Written Story uses casual, realistic dialogue to convey character dynamics and emotions. The language is simple yet effective, with a focus on showing rather than telling. The narrative perspective is third-person, providing an external view of the characters' interactions. The Base Story uses more descriptive language and internal monologue, with a first-person perspective that offers direct insight into Percy's thoughts and feelings.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a casual, everyday interaction that naturally leads to the main plot. Use a conversation about a friend's relationship to introduce the theme of phone privacy and trust.\n  - Resolve the narrative with a focus on emotional connection and understanding, rather than dramatic confrontation. Allow the characters to express their feelings through actions and subtle dialogue.\n\n- **Creativity**:\n  - Integrate the writing prompt by using a secondary story (e.g., a friend's breakup) to introduce the main theme. Use this as a springboard to explore deeper emotional and relational themes.\n  - Use the phone as a symbol of trust and intimacy, capturing the essence of the relationship through candid photos that reveal unnoticed special moments.\n\n- **Development (Character and Setting)**:\n  - Develop characters through realistic dialogue and small, meaningful actions. Show their relationship dynamics through everyday interactions and shared moments.\n  - Set the story in a familiar, intimate environment, such as the characters' home, to enhance the sense of closeness and comfort.\n\n- **Language Use**:\n  - Employ casual, realistic dialogue to convey character emotions and dynamics. Use simple yet effective language to show rather than tell.\n  - Maintain a third-person narrative perspective to provide an external view of the characters' interactions, allowing the reader to observe their relationship from a slight distance.\n  - Include specific phrases that reflect the characters' personalities and relationship, such as \"You can check my phone\" and \"I wanted to remember all the moments that made me fall in love with you.\"\n</story_rules>",
    "<thinking>\n1. **Plot**: The Author Written Story begins with a direct address to the audience, setting a playful and engaging tone. The plot revolves around a makeup challenge where Nico, the mischievous makeup artist, transforms his partner, Will, into a carebear. The story is structured around a series of humorous interactions and questions that Nico asks Will, which adds depth to their relationship and builds anticipation for the final reveal. The conflict is light-hearted, focusing on Will's reluctance and Nico's playful insistence. The resolution is comedic, with Will's transformation into a carebear serving as the unexpected twist. In contrast, the Base Story follows a more traditional narrative arc with a focus on Percy's apprehension and eventual acceptance of the transformation, which is more aesthetically pleasing and thematically tied to his identity as the son of Poseidon.\n\n2. **Creativity**: The Author Written Story creatively uses the makeup challenge as a vehicle for humor and relationship exploration. The transformation into a carebear is an unexpected and whimsical twist that aligns with the prompt's call for a hilariously unexpected transformation. The story incorporates a playful banter and a series of personal questions that reveal character dynamics and deepen the comedic effect. The Base Story, while imaginative, leans towards a more fantastical and visually stunning transformation, focusing on the beauty and thematic relevance of the sea nymph look.\n\n3. **Development (Character and Setting)**: The Author Written Story develops its characters through dialogue and interaction. Nico's mischievous nature and Will's affectionate reluctance are conveyed through their banter and physical interactions, such as nose rubbing and kisses. The setting is minimal, focusing on the intimate space of the makeup session, which enhances the personal and humorous tone. The Base Story provides more descriptive detail about the setting and uses the transformation to explore Percy's connection to his heritage, adding a layer of depth to his character.\n\n4. **Language Use**: The Author Written Story employs a conversational and humorous tone, using direct address, playful banter, and colloquial language to engage the reader. The dialogue is snappy and filled with affectionate teasing, which enhances the comedic and light-hearted atmosphere. The use of phrases like \"my little hell spawns\" and \"tesoro\" adds personality and warmth to the narrative. The Base Story uses more descriptive and poetic language, focusing on the visual and emotional aspects of the transformation, with a softer and more romantic tone.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a direct address to the audience to establish an engaging and playful tone. For example, start with a line like, \"Hello, my little hell spawns! Today is a very special day because I finally persuaded my boyfriend to be in a video with me!\"\n  - Structure the narrative around a series of humorous interactions and questions that reveal character dynamics and build anticipation for the transformation. Use a light-hearted conflict, such as a partner's reluctance, and resolve it with a comedic twist, like transforming the partner into a carebear.\n\n- **Creativity**:\n  - Use the makeup challenge as a vehicle for humor and relationship exploration. Incorporate unexpected and whimsical elements, such as turning the partner into a carebear, to align with the prompt's call for a hilariously unexpected transformation.\n  - Integrate playful banter and personal questions that reveal character dynamics and enhance the comedic effect. For example, include questions like, \"Do you love me?\" and \"Do you trust me?\" to add depth to the interactions.\n\n- **Development (Character and Setting)**:\n  - Develop characters through dialogue and interaction, focusing on their personalities and relationship dynamics. Convey the mischievous nature of the makeup artist and the affectionate reluctance of the partner through their banter and physical interactions, such as nose rubbing and kisses.\n  - Keep the setting minimal and intimate, focusing on the personal space of the makeup session to enhance the humorous and personal tone of the story.\n\n- **Language Use**:\n  - Employ a conversational and humorous tone, using direct address, playful banter, and colloquial language to engage the reader. Use snappy dialogue filled with affectionate teasing to enhance the comedic and light-hearted atmosphere.\n  - Incorporate phrases that add personality and warmth to the narrative, such as \"my little hell spawns\" and \"tesoro,\" to create a sense of intimacy and charm.\n</story_rules>",
    "<thinking>\n1. **Plot**: The Author Written Story begins with an immediate sense of action and mystery, as Nico is startled awake by a noise and encounters a strange boy claiming to be from the future. The plot is driven by dialogue and the interaction between Nico and Will, focusing on the confusion and humor of the situation rather than a traditional action sequence. The story resolves with a sense of ambiguity and open-endedness, as Will disappears and Nico is left to continue his journey, hinting at future possibilities without a definitive conclusion.\n\n2. **Creativity**: The Author Written Story creatively blends humor with the fantastical elements of the prompt. The future boyfriend concept is explored through witty dialogue and the awkwardness of time travel, rather than focusing on a dramatic or action-packed narrative. The story uses the Labyrinth setting to enhance the sense of confusion and unpredictability, while the character of Will adds a modern, relatable twist to the mythological context.\n\n3. **Development (Character and Setting)**: Characters are developed through their interactions and dialogue. Nico is portrayed as cautious and skeptical, while Will is depicted as humorous and slightly awkward, creating a dynamic contrast. The setting of the Labyrinth is used to create a sense of mystery and danger, but the focus remains on the characters' relationship and dialogue rather than detailed descriptions of the environment.\n\n4. **Language Use**: The language is informal and conversational, with a focus on dialogue that captures the characters' personalities and the humor of the situation. The narrative uses short, punchy sentences and rhetorical questions to convey Nico's skepticism and Will's nervousness. The tone is light-hearted and playful, with a focus on the characters' banter and the absurdity of the situation. The use of modern references, such as \"pizza and Shrek,\" adds a humorous and relatable element to the story.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with an immediate sense of action or mystery, such as a sudden noise or unexpected event that jolts the protagonist into action. For example, \"A loud thud made Nico jolt awake.\"\n  - Focus the plot on character interaction and dialogue, using the encounter between Nico and the strange boy to drive the narrative forward. Ensure the story revolves around the confusion and humor of the situation rather than traditional action sequences.\n  - Conclude the story with an open-ended resolution that hints at future possibilities without providing a definitive conclusion. Allow the protagonist to continue their journey with a sense of ambiguity, as seen when Will disappears and Nico is left to ponder the encounter.\n\n- **Creativity**:\n  - Incorporate humor and wit into the narrative, especially through the dialogue between characters. Use the concept of a future boyfriend to explore the awkwardness and absurdity of time travel, as demonstrated by Will's rambling explanations.\n  - Use the setting of the Labyrinth to enhance the sense of confusion and unpredictability, but focus on the characters' relationship and interactions rather than detailed descriptions of the environment.\n  - Introduce modern, relatable elements into the mythological context to create a humorous twist, such as references to \"pizza and Shrek.\"\n\n- **Development (Character and Setting)**:\n  - Develop characters through their interactions and dialogue, highlighting their contrasting personalities. Portray Nico as cautious and skeptical, while Will should be humorous and slightly awkward.\n  - Use dialogue to reveal character traits and dynamics, such as Nico's skepticism and Will's nervousness, without relying heavily on internal monologue or exposition.\n  - Establish the setting of the Labyrinth as a backdrop for the characters' interactions, using it to create a sense of mystery and danger without overshadowing the character-driven narrative.\n\n- **Language Use**:\n  - Employ informal and conversational language, focusing on dialogue that captures the characters' personalities and the humor of the situation. Use short, punchy sentences and rhetorical questions to convey the characters' emotions and reactions.\n  - Maintain a light-hearted and playful tone throughout the narrative, emphasizing the characters' banter and the absurdity of the situation.\n  - Integrate modern references and colloquial expressions to add a humorous and relatable element to the story, such as Will's mention of \"pizza and Shrek.\"\n</story_rules>",
    "<thinking>\n1. **Plot**: The Author Written Story begins with Will waking up to find Nico missing from their bed, immediately setting a tone of concern and intimacy. The narrative unfolds in a quiet, introspective manner, focusing on the small, personal rituals the characters have developed to cope with their trauma. The plot is driven by the characters' emotional states and their interactions, rather than external events. The story resolves with a tender moment of dancing in the kitchen, symbolizing healing and connection. In contrast, the Base Story follows a more straightforward narrative arc, with a clear beginning, middle, and end, focusing on the act of dancing as a ritual for overcoming nightmares.\n\n2. **Creativity**: The Author Written Story creatively uses the setting and objects (like the red night light and cocoa puffs) to evoke a sense of safety and routine amidst the characters' lingering fears. The story blends elements of romance and healing, using the prompt as a springboard for exploring deeper emotional themes. The Base Story, while also touching on these themes, does so in a more conventional manner, focusing on the act of dancing as a direct response to nightmares.\n\n3. **Development (Character and Setting)**: The Author Written Story delves deeply into the characters' emotional states, using their interactions to reveal their vulnerabilities and strengths. The setting is intimate and personal, with details like the red night light and the scattered cocoa puffs adding depth to the characters' shared space. The Base Story provides a more general depiction of the characters and setting, focusing on the kitchen as a place of solace without the same level of intimate detail.\n\n4. **Language Use**: The Author Written Story employs a rich, descriptive language that captures the characters' emotions and the atmosphere of their environment. The use of dialogue is intimate and personal, reflecting the characters' deep connection. The narrative perspective is close and introspective, allowing readers to feel the characters' emotions. The Base Story uses a more straightforward language style, with dialogue serving to advance the plot rather than delve deeply into the characters' inner worlds.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a moment of absence or concern that immediately draws the reader into the characters' emotional world. For example, have a character wake up to find their partner missing from bed, prompting a search that leads to a moment of reconnection.\n  - Focus on the internal emotional journey of the characters rather than external events. Use small, intimate rituals as a means of exploring themes of healing and connection, such as dancing in the kitchen to soothe fears.\n  - Resolve the narrative with a tender, symbolic act that encapsulates the characters' growth and healing, like holding each other close as the weight of their shared past fades.\n\n- **Creativity**:\n  - Use everyday objects and settings to evoke a sense of safety and routine amidst lingering fears. For instance, describe a red night light as a comforting presence in the room.\n  - Blend elements of romance and healing, using the prompt as a springboard to explore deeper emotional themes. Allow the characters' interactions to reveal their vulnerabilities and strengths.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their emotional states and interactions. Use dialogue and physical gestures to reveal their vulnerabilities and strengths, such as a character wrapping themselves tightly around their partner after a nightmare.\n  - Create an intimate and personal setting that reflects the characters' shared space and history. Include specific details, like scattered cocoa puffs or a red night light, to add depth and authenticity to the environment.\n\n- **Language Use**:\n  - Employ rich, descriptive language to capture the characters' emotions and the atmosphere of their environment. Use sensory details to immerse the reader in the scene, such as describing the warmth of a partner's body or the texture of a tank top.\n  - Use intimate and personal dialogue to reflect the characters' deep connection. Allow the narrative perspective to be close and introspective, enabling readers to feel the characters' emotions and thoughts.\n  - Incorporate specific phrases and diction that reflect the characters' relationship, such as \"Pretty baby\" or \"fearsome warrior,\" to add authenticity and depth to their interactions.\n</story_rules>"
]