[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed and structured rules under the categories of **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contained specific, actionable instructions tailored to the unique elements of the writing prompt. The rules emphasized comprehensive detailing, character dynamics, and immersive settings, while maintaining a consistent tone and narrative style.\n\nFor the new writing prompt, the **Story Rules** will need to address the covert nature of the mission, the experimental technology, the political implications, and the interpersonal dynamics of the untested crew. The rules should guide the narrative to create tension, suspense, and a sense of high stakes, while also developing the characters and setting in a detailed and immersive manner.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin with a detailed introduction of the Helo-Class Cruiser *Hope*, its experimental nature, and the covert mission assigned to the crew.\n  - Provide background on the political context, including the Galactic Council's stance on Geth AI technology and the implications of the mission being unofficial.\n  - Describe the crew's preparation for the mission, highlighting their diverse backgrounds and the secrecy surrounding their assignment.\n  - Develop the plot through key mission stages: entering Batarian space, locating the colony, and investigating the rumored experiments.\n  - Incorporate escalating tension and danger as the crew uncovers more about the forbidden technology and faces external threats from the Batarians.\n  - Conclude with a high-stakes climax where the crew must make critical decisions that could impact the broader political landscape.\n\n- **Creativity**:\n  - Blend elements of science fiction, political intrigue, and covert operations to create a rich and engaging narrative.\n  - Use imaginative descriptions of the Helo-Class Cruiser, the Batarian space, and the colony to create a vivid and immersive setting.\n  - Integrate unique technological elements, such as the forbidden Geth AI, and explore their potential implications and dangers.\n  - Incorporate unexpected twists and turns to maintain suspense and keep the reader engaged.\n\n- **Development (Character and Setting)**:\n  - Develop the characters through their roles, backgrounds, and interactions, emphasizing their diverse skills and the tensions within the team.\n  - Provide detailed descriptions of the Helo-Class Cruiser, its experimental features, and the living conditions aboard the ship.\n  - Describe the Batarian space and the colony in detail, highlighting the contrast between the advanced technology and the secrecy of the experiments.\n  - Create multidimensional characters with clear motivations, personal conflicts, and growth arcs throughout the mission.\n\n- **Language Use**:\n  - Use formal and descriptive language to convey the seriousness and high stakes of the mission.\n  - Employ technical jargon and detailed descriptions to enhance the realism and immersion of the narrative.\n  - Use dialogue to reveal character dynamics, build tension, and advance the plot, ensuring it is consistent with the formal tone of the narrative.\n  - Maintain a tone that reflects the covert and dangerous nature of the mission, with moments of tension, suspense, and urgency.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot rules in the examples emphasize detailed backgrounds, comprehensive descriptions of the setting, and the buildup of tension.\n   - They focus on the procedural aspects of the mission or journey, the roles of different characters, and the threats or conflicts that arise.\n\n2. **Creativity**:\n   - The creativity rules encourage blending elements of intrigue, detailed world-building, and imaginative descriptions.\n   - They suggest using a mix of descriptive language and technical jargon to create a vivid and immersive setting.\n\n3. **Development (Character and Setting)**:\n   - The development rules emphasize detailed descriptions of the setting and multidimensional character development.\n   - They focus on the characters' motivations, backgrounds, and interactions within the larger context of the story.\n\n4. **Language Use**:\n   - The language use rules suggest using formal and descriptive language, with a focus on creating a vivid and immersive narrative.\n   - They recommend employing a mix of narrative styles, including detailed descriptions, technical explanations, and character interactions.\n\nUsing these patterns, craft the **Story Rules** for the new writing prompt, ensuring they are detailed, actionable, and tailored to the themes and tone of the prompt.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a detailed description of the airship *Vent lger*, its history, and its current state of disrepair.\n  - Introduce the mix of hopeful colonists and ex-convicts, providing background on why they are on this journey and their hopes or fears.\n  - Describe the journey in detail, including the daily routines, interactions among passengers, and the growing tensions.\n  - Incorporate elements of mystery and suspense, such as whispers of sabotage and hidden motives among the passengers.\n  - Build up to a climax where the true nature of the threats and secrets is revealed, and the passengers must confront these challenges as they near their destination.\n\n- **Creativity**:\n  - Blend elements of historical fiction, adventure, and mystery to create a rich and engaging narrative.\n  - Use detailed and imaginative descriptions of the airship, the uncharted island, and the passengers' backgrounds to create a vivid and immersive setting.\n  - Incorporate unique and imaginative elements, such as the design of the airship and the cultural aspects of the secret French colony.\n\n- **Development (Character and Setting)**:\n  - Provide rich and multidimensional character development, particularly for key figures among the colonists and ex-convicts.\n  - Explore the personalities, motivations, and conflicts of the characters in depth, highlighting their backgrounds and reasons for joining the journey.\n  - Describe the setting in great detail, emphasizing the aging airship's atmosphere, the uncharted island's allure, and the cultural aspects of the secret French colony.\n  - Create an immersive environment that reflects the story's tone and themes, with a focus on the tension and mystery of the journey.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to create a vivid picture of the setting and characters.\n  - Use dialogue to reveal character dynamics, build tension, and advance the plot.\n  - Maintain a deliberate pacing that allows for a gradual buildup of suspense and intrigue.\n  - Ensure the language style is rich and immersive, drawing the reader into the story's world.\n</story_rules>"
]