[
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used in crafting the rules. The few-shot demonstrations emphasize a blend of humor, creativity, and character-driven narratives, often incorporating elements of mystery or fantasy. The rules are organized into categories: Plot, Creativity, Development (Character and Setting), and Language Use, each with specific, actionable instructions and examples.\n\nFor the new prompt, \"At the Library at the End of the Universe,\" the rules must reflect the fantastical and meta-narrative elements inherent in the setting. The plot should focus on the Librarians' adventures in Bookworlds and the meta-conflict of their own story being rewritten. Creativity should explore the unique concept of Bookworlds and the Library's cosmic setting. Character and setting development should emphasize the Librarians' roles and the surreal environment. Language use should capture the whimsical and philosophical tone of the narrative.\n\nI will ensure each rule is accompanied by a detailed example, inspired by the few-shot demonstrations, to illustrate its application in the context of the new writing prompt.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Structure the narrative around the Librarians' mission to enter Bookworlds and correct stories that have deviated from their intended paths. Begin with a specific story that has gone astray, such as a fairy tale where the villain has become the hero. Use this mission as a catalyst for the plot.\n  - Introduce the meta-conflict of the Chronicle rewriting the Librarians' own story. Create tension by having the Librarians discover changes in their reality, such as a Librarian suddenly speaking in rhymes or the Library's architecture shifting unpredictably.\n  - Develop a resolution where the Librarians confront the Chronicle, using their knowledge of stories to negotiate or outwit the narrative changes. For example, they might use a forgotten plot device from a classic novel to restore balance.\n\n- **Creativity**:\n  - Explore the concept of Bookworlds as diverse and imaginative realms, each with its own rules and logic. For instance, depict a world where characters are aware of their fictional nature and interact with the Librarians as fellow storytellers.\n  - Incorporate elements of cosmic wonder and philosophical musings, reflecting the Library's position at the end of the universe. Use these elements to add depth and intrigue, such as a Librarian pondering the nature of stories and reality while gazing at the eternal dawn.\n\n- **Development (Character and Setting)**:\n  - Develop the Librarians as knowledgeable and resourceful characters, each with a unique specialty or quirk. For example, one Librarian might be an expert in historical epics, while another excels in deciphering ancient languages.\n  - Create a vivid and surreal setting for the Library, emphasizing its timeless nature and vast collection of stories. Use descriptions of endless shelves, floating books, and the perpetual twilight to immerse the reader in the environment.\n\n- **Language Use**:\n  - Employ a whimsical and philosophical tone, using lyrical language and thoughtful reflections to convey the story's themes. For example, describe the dawn as \"a gentle whisper of light that dances across the pages of eternity.\"\n  - Use dialogue to reveal character dynamics and the Librarians' expertise, incorporating literary references and wordplay. Allow characters to engage in discussions about the nature of stories and their roles as custodians of narrative order.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as humor, character dynamics, and plot structure. The new prompt involves a pirate crew in an urban setting, blending elements of adventure, humor, and misfortune. The rules will need to guide the narrative through a series of comedic and adventurous events, focusing on the crew's interactions and their attempts to reclaim their ship. The examples will illustrate how to incorporate the unique setting and character dynamics into the story, ensuring alignment with the prompt's themes and tone.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with the pirate crew's realization of their predicament at the bus stop, using humor to highlight their disbelief and frustration. For example, describe Captain Redbeard's incredulous reaction as he checks the Nokia phone for any sign of their ship.\n  - Develop the narrative around the crew's attempts to devise a plan to reclaim their ship from the Hermit Crabs. Use a series of comedic mishaps and misunderstandings to drive the plot forward. For instance, depict the crew's failed attempts to communicate with the Hermit Crabs using the outdated Nokia phone.\n  - Conclude with a climactic confrontation or clever resolution that showcases the crew's resourcefulness and teamwork. Ensure the ending leaves room for future adventures, such as the crew finally locating their ship but realizing they must now navigate through a city canal.\n\n- **Creativity**:\n  - Blend elements of pirate lore with modern urban settings to create a unique and engaging narrative. Use the juxtaposition of the pirate crew in a city environment to enhance the story's humor and originality. For example, describe the crew's confusion as they navigate the graffiti-covered bus stop, mistaking it for a treasure map.\n  - Incorporate imaginative plot devices, such as the Nokia phone serving as a mysterious artifact or tool, to add depth and intrigue to the story. Use this device to create unexpected twists, like the phone accidentally dialing a local radio station that broadcasts the crew's plight.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their interactions and distinct personalities, focusing on their roles within the crew. Use dialogue and actions to reveal their quirks and motivations. For instance, portray First Mate Sally as the pragmatic voice of reason, constantly clashing with Captain Redbeard's impulsive decisions.\n  - Create a vivid and immersive setting by emphasizing the contrast between the pirate crew and the urban environment. Use detailed descriptions to convey the atmosphere of the bus stop and the acid rainstorm, such as the sound of rain sizzling on the pavement and the vibrant graffiti.\n\n- **Language Use**:\n  - Employ a humorous and adventurous tone, using witty dialogue and playful banter to engage the reader. Focus on character-driven dialogue to reveal dynamics and drive the narrative. For example, include exchanges where the crew debates the best way to use the Nokia phone, with each member offering increasingly absurd suggestions.\n  - Use vivid and descriptive language to enhance key moments and create a sense of immersion. Focus on sensory details that bring the setting and characters to life, such as the acrid smell of the rain and the crew's colorful attire.\n  - Maintain a fast-paced narrative with quick dialogue and sharp observations, ensuring the story remains engaging and dynamic. Use humor and satire to create an entertaining and immersive narrative experience.\n</story_rules>"
]