[
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a complex narrative set in a richly detailed universe, requiring rules that emphasize character convergence, intricate world-building, and a balance of action and intrigue. I will ensure the rules are specific, actionable, and include examples that align with the themes and tone of the new prompt, reflecting the style and depth demonstrated in the few-shot examples.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the narrative by introducing each character in their own environment, highlighting their personal struggles and motivations. For example, depict the thief executing a high-stakes heist in the bustling markets of Nar Shadaa, narrowly escaping capture.\n  - Develop a central plot that revolves around a shared objective or threat, such as a powerful artifact or a common enemy, that gradually draws the characters together. Use a series of escalating events, like a sudden Imperial crackdown or a Hutt betrayal, to force their paths to intersect.\n  - Conclude with a climactic confrontation that resolves the immediate conflict but leaves room for future adventures, emphasizing the ongoing nature of their alliance and the mysteries of the Outer Rim.\n\n- **Creativity**:\n  - Incorporate elements of the Star Wars universe, such as iconic locations, species, and technology, to create an authentic and immersive setting. For instance, describe a tense negotiation in a dimly lit cantina filled with diverse alien patrons.\n  - Use imaginative plot devices, like a hidden Force relic or a secretive Hutt council, to add depth and intrigue to the narrative. Ensure these elements are integral to the plot and character development.\n\n- **Development (Character and Setting)**:\n  - Develop characters with distinct voices and backgrounds, focusing on their personal histories and motivations. Use internal monologues and dialogues to reveal their thoughts and emotions, such as the bounty hunter's internal conflict over a past betrayal.\n  - Create a dynamic setting by detailing the chaotic and vibrant environment of Nar Shadaa, highlighting its role as a hub of criminal activity and intrigue. Use sensory descriptions to convey the atmosphere, such as the neon-lit streets and the constant hum of starships overhead.\n\n- **Language Use**:\n  - Employ a descriptive and action-oriented language style, using vivid imagery and dynamic verbs to convey the fast-paced and dangerous world of Nar Shadaa. For example, describe a high-speed chase through the crowded streets with sensory-rich details.\n  - Use dialogue to reveal character traits and advance the plot, ensuring it reflects the diverse backgrounds and personalities of the characters. Incorporate slang and jargon specific to the Star Wars universe to enhance authenticity.\n  - Maintain a tone that balances tension and intrigue, using language that evokes the complexity and danger of the characters' world and their intertwined fates.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize detailed character introductions, immersive settings, and a blend of personal and larger narrative conflicts. They also highlight the importance of vivid language and introspective character development. I will apply these insights to create comprehensive and actionable rules tailored to the new prompt, ensuring each rule is accompanied by a concrete example that aligns with the themes and tone of the Hogwarts setting.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the narrative with individual scenes that introduce each child receiving their Hogwarts letter under unique and mysterious circumstances. For example, describe a child finding their letter hidden in a family heirloom or delivered by an unusual magical creature.\n  - Develop a plot that gradually reveals the secrets of each child's past and abilities, using their journey to Hogwarts as a catalyst for self-discovery. For instance, show a child discovering a latent magical ability during a moment of crisis on their way to the train station.\n  - Converge the children's paths at the start of term, using their initial interactions to hint at their intertwined destinies. Create a scene where they all meet on the Hogwarts Express, each bringing a piece of a larger mystery that connects them.\n\n- **Creativity**:\n  - Incorporate imaginative elements that expand on the magical world of Hogwarts, such as unique magical artifacts or creatures that play a role in the children's discoveries. For example, introduce a magical map that reveals hidden passages and secrets about the school.\n  - Use creative plot devices to explore the children's backgrounds and abilities, such as a magical diary that records their dreams or a family portrait that comes to life to offer guidance.\n\n- **Development (Character and Setting)**:\n  - Develop each child as a distinct character with a rich backstory and personal motivations. Use detailed descriptions and internal monologues to explore their emotions and reactions to the magical world. For example, depict a child from a non-magical family grappling with the sudden revelation of their magical heritage.\n  - Create an immersive setting by vividly describing the magical and mundane aspects of the children's lives, both before and after arriving at Hogwarts. Highlight the contrast between their diverse backgrounds and the shared experience of entering the wizarding world.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to capture the wonder and mystery of the magical world. Use metaphors and similes to enhance the imagery, such as describing the Hogwarts Express as \"a gleaming serpent of steel and steam.\"\n  - Use a mix of dialogue and narrative exposition to convey character emotions and plot developments. Ensure that dialogue reflects the characters' backgrounds and personalities, using distinct voices and speech patterns.\n  - Maintain a tone that balances wonder and intrigue, using language that evokes the excitement and challenges of discovering one's magical identity and destiny.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used in crafting the rules. The demonstrations emphasize a structured approach to plot development, creativity, character and setting development, and language use, with each rule accompanied by concrete examples. The rules are tailored to the specific themes and narrative potential of the writing prompt, ensuring comprehensive and actionable guidance.\n\nFor the new writing prompt, the rules will focus on the assembly of a diverse team of heroes, the exploration of their unique abilities and secrets, and the unfolding of a grand narrative involving an ancient threat. The examples will illustrate how to integrate these elements into the story, ensuring alignment with the prompt's themes and objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the narrative with the shattering of the ancient vault, using this event as the inciting incident that sets the story in motion. Describe the immediate consequences and the awakening of the ancient force, creating a sense of urgency and danger.\n  - Structure the story around the guardian's quest to assemble the team, dedicating sections to the introduction and recruitment of each hero. For example, depict the guardian seeking out a reclusive sorcerer in a hidden forest, revealing their reluctance and eventual agreement to join the cause.\n  - Develop a central conflict that revolves around the heroes' struggle to understand and combat the ancient threat. Use a series of escalating challenges and revelations to build tension and drive the narrative forward.\n\n- **Creativity**:\n  - Incorporate imaginative elements that highlight the unique powers and backgrounds of each hero. For instance, describe a hero who can manipulate time, using their abilities to glimpse into the past and uncover secrets about the ancient force.\n  - Use creative plot devices, such as ancient prophecies or mystical artifacts, to add depth and intrigue to the story. Introduce a legendary weapon that can only be wielded by one of the heroes, creating a subplot around its discovery and use.\n\n- **Development (Character and Setting)**:\n  - Develop each hero with a focus on their personal history, powers, and secrets. Provide detailed backstories that explain their motivations and connections to the ancient threat. For example, reveal that one hero is the last descendant of a long-lost civilization tied to the vault's origins.\n  - Create immersive settings that reflect the diverse backgrounds of the heroes and the scale of the threat. Use vivid descriptions to bring to life locations such as a crumbling temple where the vault was housed or a bustling city on the brink of chaos.\n\n- **Language Use**:\n  - Employ a dynamic and evocative language style, using vivid imagery and detailed descriptions to convey the grandeur and danger of the narrative. Use metaphors and similes to enhance the atmosphere, such as describing the ancient force as \"a storm older than the stars.\"\n  - Use dialogue to reveal character traits and advance the plot, ensuring that each hero's voice is distinct and reflective of their background. For example, use formal and archaic language for the sorcerer, contrasting with the modern slang of a tech-savvy hero.\n</story_rules>"
]