[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed and structured rules under the categories of Plot, Creativity, Development (Character and Setting), and Language Use. Each category contained specific, actionable instructions that were tailored to the unique elements of the writing prompt. The rules were comprehensive, covering various narrative aspects such as pacing, character dynamics, and thematic elements.\n\nFor the new writing prompt, the rules should focus on the themes of revenge, mystery, and the supernatural. The narrative should explore the protagonist's motivations, the risks involved, and the enigmatic nature of \"Candent.\" The setting should be immersive and reflect the dark, mysterious tone of the story. Language use should be evocative and maintain a sense of tension and intrigue.\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a vivid description of the protagonist's initial encounter with the wish gone wrong, setting the stage for their desire for revenge.\n  - Introduce the mysterious blog and the invitation from \"Candent\" early in the narrative, creating a sense of intrigue and urgency.\n  - Develop a series of events that lead the protagonist deeper into the mystery, including encounters with other victims and clues about the beings who twist desires.\n  - Build tension by highlighting the risks and moral dilemmas the protagonist faces as they pursue revenge.\n  - Conclude with a climactic confrontation with \"Candent\" and a resolution that addresses the protagonist's internal conflict and the consequences of their actions.\n\n- **Creativity**:\n  - Incorporate elements of the supernatural and the unknown, such as cryptic messages, eerie settings, and mysterious characters.\n  - Use imaginative descriptions to create a sense of wonder and fear, particularly when describing the blog, the invitation, and the encounters with other victims.\n  - Explore the theme of twisted desires by showing the varied and unexpected ways wishes have gone wrong for different characters.\n  - Introduce unique and memorable elements, such as a hidden network of victims or a secret society dedicated to combating the beings who twist desires.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist's backstory and motivations, emphasizing their emotional journey and the impact of the wish gone wrong.\n  - Create a detailed and immersive setting that reflects the dark and mysterious tone of the story, such as shadowy urban landscapes, abandoned buildings, and hidden meeting places.\n  - Introduce secondary characters who add depth to the narrative, such as other victims, allies, and enigmatic figures connected to \"Candent.\"\n  - Use dialogue and interactions to reveal character traits, relationships, and the stakes involved in the protagonist's quest for revenge.\n\n- **Language Use**:\n  - Employ evocative and descriptive language to create a sense of tension and mystery, particularly when describing the blog, the invitation, and the encounters with other victims.\n  - Use varied sentence structures and vocabulary to maintain reader engagement and enhance the storytelling.\n  - Incorporate dialogue that reflects the characters' personalities and backgrounds, adding depth and authenticity to their interactions.\n  - Maintain a tone of suspense and intrigue throughout the narrative, reflecting the protagonist's internal conflict and the risks they face.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should be intricate, with multiple layers and subplots.\n   - It should include a mix of personal stakes and broader implications.\n   - Twists and turns should be incorporated to maintain suspense and engagement.\n\n2. **Creativity**:\n   - Blend genres and incorporate unique elements to create a rich narrative.\n   - Use imaginative and unexpected plot devices.\n   - Ensure the narrative remains grounded in the context of the setting and characters.\n\n3. **Development (Character and Setting)**:\n   - Characters should be multidimensional with detailed backstories and motivations.\n   - The setting should be immersive, with detailed descriptions that convey atmosphere and socio-economic aspects.\n   - Emotional arcs and growth should be evident in the characters.\n\n4. **Language Use**:\n   - Employ rich, descriptive language to create vivid imagery.\n   - Use varied pacing and sentence structure to maintain engagement.\n   - Dialogue should reflect characters' personalities and backgrounds.\n\nUsing these inferred patterns, craft the **Story Rules** for the new writing prompt about Basilisk University.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Introduce the setting of Basilisk University with a focus on its unique aspects, such as the training in magic and the tradition of graduating with a dragon.\n  - Develop a central mystery involving the secrets or dangers in the nearby town, gradually revealing information through the narrative.\n  - Incorporate subplots that explore the personal stakes of the students, their relationships, and their individual quests for mastery.\n  - Include twists and turns that challenge the characters and reveal deeper layers of the mystery and the setting.\n\n- **Creativity**:\n  - Blend elements of fantasy, mystery, and adventure to create a rich and engaging narrative.\n  - Introduce unique magical elements and creatures, such as different types of dragons and spells, to add depth and intrigue.\n  - Use imaginative plot devices, such as ancient prophecies or hidden magical artifacts, to drive the story forward.\n  - Ensure the narrative remains grounded in the context of the university and the surrounding valley, maintaining a consistent tone and atmosphere.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters with detailed backstories, motivations, and emotional arcs that tie into the broader narrative.\n  - Provide vivid descriptions of Basilisk University, its architecture, and the magical environment to create an immersive setting.\n  - Highlight the contrasts between the university and the nearby town, emphasizing the socio-economic and cultural differences.\n  - Use the setting to reflect themes of knowledge, power, and the consequences of ambition.\n\n- **Language Use**:\n  - Employ rich, descriptive language to create vivid imagery and convey the magical atmosphere of the setting.\n  - Use varied pacing, with slower, reflective moments interspersed with fast-paced action scenes to maintain reader engagement.\n  - Include natural, character-driven dialogue that reveals personality and advances the plot.\n  - Maintain a consistent tone, balancing seriousness with moments of wonder and discovery.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed and structured rules under the categories of Plot, Creativity, Development (Character and Setting), and Language Use. Each category contained specific, actionable instructions that were tailored to the themes and tone of the writing prompt. The rules were comprehensive, covering various narrative aspects such as pacing, humor, character dynamics, and setting descriptions.\n\nFor the new writing prompt, the rules should focus on the urgency and danger of the mission to find Luke Skywalker, the harsh environment of Hoth, and the presence of Imperial threats. The tone should be tense and suspenseful, reflecting the high stakes and perilous conditions.\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the immediate aftermath of Luke Skywalker's disappearance, highlighting the chaos and urgency at the Rebel base.\n  - Introduce the main characters who will embark on the rescue mission, detailing their roles and motivations.\n  - Develop the narrative through a series of escalating challenges, including navigating the icy terrain, facing Imperial patrols, and dealing with the unpredictable wildlife of Hoth.\n  - Conclude with a climactic rescue attempt, ensuring that the resolution is both satisfying and reflective of the characters' growth and determination.\n\n- **Creativity**:\n  - Incorporate imaginative elements such as unique survival strategies, innovative uses of technology, and unexpected allies or threats.\n  - Use the harsh environment of Hoth to create tension and suspense, emphasizing the characters' resourcefulness and resilience.\n  - Blend action and introspection, allowing characters to reflect on their mission and their personal stakes while navigating the dangers of Hoth.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their actions and interactions, revealing their strengths, weaknesses, and motivations.\n  - Provide detailed descriptions of the setting, emphasizing the extreme cold, treacherous terrain, and constant threat of Imperial forces.\n  - Highlight the emotional and physical toll of the mission on the characters, showing their determination and camaraderie in the face of adversity.\n  - Use dialogue to reveal character dynamics and advance the plot, ensuring that interactions are tense, meaningful, and reflective of the high stakes.\n\n- **Language Use**:\n  - Use vivid and evocative language to describe the harsh environment of Hoth, creating a sense of immersion and urgency.\n  - Employ a mix of descriptive passages and dialogue to maintain a dynamic and engaging narrative.\n  - Maintain a tense and suspenseful tone throughout the story, reflecting the high stakes and perilous conditions.\n  - Use concise and impactful language to convey the urgency and danger of the mission, avoiding overly elaborate or flowery descriptions.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed and structured rules under the categories of **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contained specific, actionable instructions tailored to the unique elements of the writing prompt. The rules emphasized the importance of character motivations, setting descriptions, narrative structure, and the use of language to enhance the storytelling.\n\nFor the new writing prompt about Neo Elysia, the rules should focus on the divided nature of the city, the protagonist's motivations for crossing boundaries, and the potential for both survival and systemic change. The narrative should explore the socio-political dynamics of the city, the dangers of each zone, and the protagonist's journey.\n\n<story_rules>\n- **Plot**:\n  - Structure the story around the protagonist's journey through the different zones of Neo Elysia, highlighting the unique challenges and dangers of each area.\n  - Introduce the protagonist's motivations early in the narrative, providing a clear reason for defying the city's hierarchy.\n  - Develop a series of escalating conflicts as the protagonist crosses boundaries, encountering both allies and adversaries.\n  - Conclude the narrative with a resolution that addresses the protagonist's goals, whether it be survival, systemic change, or a combination of both.\n\n- **Creativity**:\n  - Create a vivid and imaginative depiction of Neo Elysia, emphasizing the distinct characteristics and rules of each zone.\n  - Incorporate elements of dystopian and cyberpunk genres, using advanced technology and societal divisions to enhance the narrative.\n  - Use unexpected plot twists and revelations to keep the reader engaged and to add depth to the story.\n  - Explore themes of rebellion, survival, and social justice, reflecting the protagonist's struggle against the city's rigid hierarchy.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a complex and relatable character, providing a detailed backstory and clear motivations for their actions.\n  - Introduce a diverse cast of supporting characters, each with their own unique perspectives and roles within the divided city.\n  - Create an immersive setting by describing the physical, social, and technological aspects of Neo Elysia in detail.\n  - Highlight the contrasts between different zones, emphasizing the socio-economic disparities and the unique dangers of each area.\n\n- **Language Use**:\n  - Use descriptive and evocative language to create a vivid and immersive depiction of Neo Elysia and its various zones.\n  - Employ a mix of narrative and dialogue to advance the plot and develop characters, ensuring that the language reflects the tone and themes of the story.\n  - Incorporate elements of cyberpunk and dystopian language, using technical jargon and futuristic terminology to enhance the setting.\n  - Maintain a balance between action-driven scenes and introspective moments, ensuring that the language captures both the external conflicts and the protagonist's internal struggles.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should be multi-layered, with interconnected subplots that reveal the town's mysterious return and the secrets it harbors.\n   - Include a mix of personal stakes and broader implications, reflecting the impact on both the town's inhabitants and the outside world.\n   - Develop a storyline where the protagonists' actions uncover deeper mysteries and lead to significant revelations about Frostvale's past and present.\n   - Incorporate unexpected twists and turns that challenge the protagonists and reveal hidden truths.\n\n2. **Creativity**:\n   - Blend elements of fantasy, mystery, and supernatural to create a rich and multifaceted narrative.\n   - Introduce unique and imaginative characters, such as beings from another dimension or individuals with mysterious powers.\n   - Explore the socio-political landscape of Frostvale, highlighting the interplay between different factions and their interests.\n   - Use unconventional plot devices, such as dimensional rifts and ancient curses, to add depth and intrigue to the story.\n\n3. **Development (Character and Setting)**:\n   - Provide detailed backstories and motivations for each character, making them multidimensional and relatable.\n   - Develop emotional arcs for the protagonists, showing their growth and evolution throughout the story.\n   - Create an immersive setting by describing the architectural, cultural, and socio-economic aspects of Frostvale in detail.\n   - Highlight the contrasts between different areas of the town, such as the bustling market streets and the eerie, abandoned sections, to emphasize the town's mysterious nature.\n\n4. **Language Use**:\n   - Employ formal and descriptive language to create a sense of grandeur and complexity in the narrative.\n   - Use detailed and vivid descriptions to build the world and convey the intricacies of the plot.\n   - Vary the vocabulary and sentence structure to maintain reader engagement and enhance the storytelling.\n   - Incorporate dialogue that reflects the characters' personalities and backgrounds, adding depth and authenticity to their interactions.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Structure the story with multiple interconnected subplots that reveal the mystery behind Frostvale's return and the secrets it harbors.\n  - Include a mix of personal stakes and broader implications, showing the impact on both the town's inhabitants and the outside world.\n  - Develop a storyline where the protagonists' actions uncover deeper mysteries and lead to significant revelations about Frostvale's past and present.\n  - Incorporate unexpected twists and turns that challenge the protagonists and reveal hidden truths about the town and its return.\n\n- **Creativity**:\n  - Blend elements of fantasy, mystery, and supernatural to create a rich and multifaceted narrative.\n  - Introduce unique and imaginative characters, such as beings from another dimension or individuals with mysterious powers.\n  - Explore the socio-political landscape of Frostvale, highlighting the interplay between different factions and their interests.\n  - Use unconventional plot devices, such as dimensional rifts and ancient curses, to add depth and intrigue to the story.\n\n- **Development (Character and Setting)**:\n  - Provide detailed backstories and motivations for each character, making them multidimensional and relatable.\n  - Develop emotional arcs for the protagonists, showing their growth and evolution throughout the story.\n  - Create an immersive setting by describing the architectural, cultural, and socio-economic aspects of Frostvale in detail.\n  - Highlight the contrasts between different areas of the town, such as the bustling market streets and the eerie, abandoned sections, to emphasize the town's mysterious nature.\n\n- **Language Use**:\n  - Employ formal and descriptive language to create a sense of grandeur and complexity in the narrative.\n  - Use detailed and vivid descriptions to build the world and convey the intricacies of the plot.\n  - Vary the vocabulary and sentence structure to maintain reader engagement and enhance the storytelling.\n  - Incorporate dialogue that reflects the characters' personalities and backgrounds, adding depth and authenticity to their interactions.\n</story_rules>"
]