[
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a mysterious labyrinth that draws strangers from different worlds, suggesting themes of exploration, mystery, and interconnectedness. The rules will need to guide the narrative to explore these themes while maintaining suspense and intrigue. I will ensure the rules are actionable, specific, and include examples that align with the prompt's unique setting and narrative potential.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with each character's sudden and disorienting arrival in the labyrinth, using their initial reactions to establish their backgrounds and personalities. For example, describe a character from a futuristic world marveling at the ancient tomes in a library.\n  - Structure the narrative around the exploration of the labyrinth, with each section revealing new clues about the force that brought them there. Use shifting environments to create tension and suspense, such as a gallery that transforms into a forested corridor.\n  - Conclude with a revelation or confrontation at the heart of the maze, where the characters must work together to understand the labyrinth's purpose and their role within it.\n\n- **Creativity**:\n  - Use imaginative and surreal elements to enhance the labyrinth's mystery, such as paintings that come to life or books that whisper secrets. For example, introduce a gallery where the art changes based on the viewer's emotions.\n  - Incorporate diverse cultural and fantastical influences to reflect the characters' varied backgrounds, creating a rich tapestry of settings and experiences within the maze.\n  - Develop unique challenges and puzzles that the characters must solve to progress, each reflecting their personal strengths and weaknesses.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their interactions with the labyrinth and each other, highlighting their differences and commonalities. For instance, show a medieval knight and a space explorer finding common ground in their quest for answers.\n  - Create an immersive setting by vividly describing the labyrinth's ever-changing environments, using sensory details to enhance the atmosphere. For example, describe the scent of old parchment in the library or the echoing footsteps in a marble corridor.\n  - Use the labyrinth as a metaphor for the characters' internal journeys, with each section reflecting their fears, desires, and unresolved conflicts.\n\n- **Language Use**:\n  - Employ a descriptive and evocative language style, using rich imagery and metaphors to convey the labyrinth's otherworldly nature. For example, describe the corridors as \"a tapestry of time and space, woven with threads of the unknown.\"\n  - Use varied sentence structures to control pacing and build tension, alternating between long, flowing descriptions and short, impactful sentences.\n  - Incorporate dialogue that reveals character motivations and builds relationships, using the characters' diverse backgrounds to create distinct voices and perspectives.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves themes of resistance, survival, and the cost of freedom under alien rule. The rules must guide the narrative to explore these themes deeply, using examples that reflect the tension and emotional depth inherent in such a scenario. The rules will be structured to ensure a comprehensive approach to storytelling, focusing on the unique aspects of the prompt, such as the moral dilemmas faced by the survivors and the oppressive atmosphere of the alien-controlled world. I will ensure the rules are actionable, specific, and enriched with examples that align with the prompt's objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a pivotal moment that highlights the tension between survival and resistance, such as a secret meeting of survivors planning a sabotage mission. For example, start with a scene where a character receives a coded message about a resistance gathering.\n  - Develop the narrative around the internal and external conflicts faced by the survivors, emphasizing the moral dilemmas of choosing between safety and freedom. Illustrate this with a subplot where a character must decide whether to betray a fellow survivor to protect their family.\n  - Conclude with a significant event that challenges the characters' beliefs and forces them to redefine their understanding of freedom and resistance. For instance, end with a successful but costly attack on an alien facility that sparks hope among the survivors.\n\n- **Creativity**:\n  - Integrate elements of science fiction and dystopian themes, using the alien coalition's technology and societal control as a backdrop for the story. Describe unique alien devices that monitor human activity, creating an atmosphere of constant surveillance.\n  - Use imaginative scenarios to explore the psychological impact of living under alien rule, such as a character experiencing vivid dreams of Earth's past freedom that inspire their actions.\n  - Incorporate symbolic elements that represent the struggle for freedom, like a hidden garden where survivors secretly cultivate Earth-native plants as a symbol of resistance.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their relationships and interactions with the alien-controlled world, highlighting their resilience and adaptability. Portray a character who was once a leader in the old world, now struggling to find their place in the resistance.\n  - Create an immersive setting by vividly describing the alien-controlled environment, focusing on the contrast between the oppressive urban areas and the hidden enclaves of resistance. Use descriptions of alien architecture that dominates the skyline, casting long shadows over the city.\n  - Emphasize the emotional and psychological dimensions of the characters, particularly their internal conflicts and motivations. For example, explore a character's guilt over past actions that inadvertently aided the alien coalition.\n\n- **Language Use**:\n  - Employ a tense and evocative narrative style, using language that reflects the oppressive atmosphere and the characters' emotional states. Use phrases like \"the air was thick with unspoken defiance\" to convey the mood.\n  - Use a mix of dialogue and internal monologue to reveal character motivations and advance the plot. For instance, include a scene where characters debate the risks of a planned resistance action, revealing their fears and hopes.\n  - Incorporate vivid imagery and sensory details to enhance the setting and mood, such as describing the \"cold, metallic scent of alien machinery\" that permeates the air.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a city under alien rule, themes of control, secrets, and resistance, and a diverse group of characters. The rules will need to reflect these elements, providing detailed guidance on how to develop the plot, infuse creativity, build characters and settings, and use language effectively. Each rule will include examples inspired by the few-shot demonstrations to ensure clarity and applicability.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with a scene that highlights the city's alien-controlled peace, setting the stage for the underlying tension. For example, describe a public announcement by alien overseers that emphasizes harmony while subtly hinting at underlying control.\n  - Structure the narrative around the gradual discovery of secrets and the formation of a resistance. Use multiple character perspectives to reveal different facets of the city's reality and the characters' personal stakes.\n  - Introduce a pivotal event that forces the group to confront the hidden truths of their world, such as a malfunction in the alien technology that exposes vulnerabilities. This event should serve as a catalyst for the characters' actions and decisions.\n\n- **Creativity**:\n  - Blend elements of science fiction and dystopian themes, using the alien rule as a backdrop for exploring control and resistance. Incorporate unique alien technologies and societal structures that reflect the city's new order.\n  - Use imaginative metaphors and symbols to represent the characters' internal struggles and the city's dual nature. For example, describe the city as a \"glittering cage\" to convey the illusion of peace and freedom.\n  - Develop creative plot twists that challenge the characters' perceptions and alliances, such as revealing that a trusted ally is an alien collaborator.\n\n- **Development (Character and Setting)**:\n  - Develop a diverse cast of characters, each with a unique background and perspective on the alien rule. Highlight their personal motivations and how they intersect with the broader resistance movement.\n  - Create an immersive setting by detailing the city's architecture, technology, and societal norms under alien rule. Use sensory descriptions to convey the atmosphere of control and surveillance.\n  - Emphasize character growth through their interactions and evolving relationships, particularly as they uncover secrets and form alliances. For example, show a scientist's transformation from compliance to rebellion as they learn more about the alien agenda.\n\n- **Language Use**:\n  - Employ a tone that balances tension and intrigue, using descriptive language to create a vivid picture of the city and its inhabitants. For example, describe the alien technology as \"elegant yet oppressive, a constant reminder of their dominance.\"\n  - Use dialogue to reveal character motivations and advance the plot, ensuring each character's voice reflects their background and role in the story. For instance, a rebel might speak in terse, defiant sentences, while a scientist uses more analytical language.\n  - Incorporate a mix of short, impactful sentences and longer, descriptive passages to control pacing and build suspense. Use internal monologue to explore characters' thoughts and conflicts, particularly as they grapple with the city's secrets.\n</story_rules>"
]