[
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with a strong setting or context, using imaginative elements to enhance the narrative, developing characters through their interactions and motivations, and employing a specific tone or style that aligns with the narrative's themes. \n\nFor the new prompt, the rules will need to focus on the themes of revenge, mystery, and the supernatural. The plot should revolve around the protagonist's journey from being wronged to seeking justice, with a focus on the moral and ethical dilemmas involved. Creativity will be key in depicting the mysterious blog and the character of \"Candent,\" as well as the supernatural elements of the story. Character development should explore the protagonist's internal conflict and motivations, while the setting should reflect the eerie and enigmatic nature of the narrative. Language use should convey a sense of suspense and intrigue, with vivid descriptions and a reflective tone.\n\nI will ensure that each rule is actionable, specific, and includes examples inspired by the few-shot demonstrations to guide the storytelling process effectively.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a vivid depiction of the protagonist's initial wish and its disastrous outcome, setting the stage for their desire for revenge. For example, describe the moment the wish backfires, leaving the protagonist with a tangible reminder of their mistake, such as a scar or a lost opportunity.\n  - Structure the narrative around the protagonist's discovery of the mysterious blog and the subsequent invitation from \"Candent.\" Use this as a turning point that propels the protagonist into a world of intrigue and potential danger.\n  - Conclude with an open-ended decision point, where the protagonist must weigh the risks of seeking revenge against the potential for justice. Highlight the moral and ethical dilemmas involved, leaving the outcome uncertain.\n\n- **Creativity**:\n  - Use imaginative elements to bring the mysterious blog and the character of \"Candent\" to life. Describe the blog as having an otherworldly design, with cryptic messages and hidden links that suggest a deeper, supernatural connection.\n  - Incorporate supernatural elements that enhance the narrative's mystery and suspense. For example, describe \"Candent\" as a shadowy figure with an aura of power and mystery, capable of manipulating reality in subtle ways.\n  - Explore the theme of twisted desires by depicting the beings responsible for the protagonist's plight as enigmatic and morally ambiguous, adding depth to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through their internal conflict and motivations, focusing on their journey from victim to seeker of justice. Use internal monologue and reflective narration to explore their thoughts and emotions.\n  - Create a setting that reflects the eerie and enigmatic nature of the narrative. Describe the protagonist's environment as being subtly altered by the supernatural elements, with shadows that seem to move and whispers that linger in the air.\n  - Use character interactions to reveal the complexities of the protagonist's relationships and the impact of their quest for revenge. For example, depict a conversation with a skeptical friend who warns of the dangers of pursuing \"Candent.\"\n\n- **Language Use**:\n  - Employ a suspenseful and reflective tone, using vivid descriptions and sensory details to create an immersive atmosphere. For example, describe the blog's interface as \"a labyrinth of digital whispers and flickering shadows.\"\n  - Use introspective language to convey the protagonist's internal struggle and the weight of their decision. Incorporate rhetorical questions and metaphor to enhance the narrative's depth and complexity.\n  - Craft dialogue that reflects the tension and intrigue of the story, ensuring it contributes to character development and plot progression. Use language that highlights the supernatural and mysterious elements of the narrative.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a magical academic setting with an element of mystery and potential danger, which suggests a need for rules that emphasize world-building, character dynamics, and a balance between the magical and the mysterious. The examples should reflect the unique aspects of the university and the surrounding valley, incorporating the themes of magic, secrecy, and potential danger. The rules will be structured to guide the narrative in exploring these elements while maintaining a cohesive and engaging story.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with an introduction to Basilisk University, focusing on its reputation and the significance of graduating with a dragon. Use a scene where Mallaidh Macbridei addresses the newcomers, setting the tone for the challenges and mysteries they will face. For example, describe Mallaidh standing before a grand hall, her voice echoing as she warns of the valley's secrets.\n  - Develop the narrative by intertwining the students' academic journey with the unfolding mystery of the valley. Introduce a series of events or clues that hint at the dangers lurking below, such as strange occurrences or whispered rumors among the students.\n  - Conclude with a pivotal moment where the protagonist must choose between pursuing the truth about the valley or focusing on their magical studies, leaving the resolution open-ended to maintain suspense.\n\n- **Creativity**:\n  - Integrate imaginative elements of magic and academia, using the setting of Basilisk University to explore unique magical disciplines and traditions. Describe classes where students learn to communicate with dragons or harness elemental forces.\n  - Use the valley as a source of mystery and intrigue, incorporating fantastical creatures or hidden magical artifacts that challenge the students' skills and courage. For example, mention a hidden grove where ancient spells are rumored to be inscribed on the trees.\n  - Blend elements of mystery and adventure, using the students' curiosity and ambition to drive the narrative forward. Highlight the contrast between the structured environment of the university and the untamed, enigmatic nature of the valley.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their interactions with the magical environment and their responses to the challenges they face. Use Mallaidh Macbridei as a mentor figure, providing guidance and warnings that shape the students' experiences.\n  - Create a vivid and immersive setting by describing the architecture and atmosphere of Basilisk University, emphasizing its grandeur and magical aura. Use sensory details to evoke the sights, sounds, and smells of the campus and the surrounding valley.\n  - Explore the dynamics between students, highlighting their diverse backgrounds and motivations. Use dialogue and internal monologue to reveal their aspirations and fears, particularly in relation to the mysteries of the valley.\n\n- **Language Use**:\n  - Employ a descriptive and evocative language style, using rich imagery and metaphor to convey the magical and mysterious aspects of the setting. For example, describe the university's towers as \"spiraling into the sky like the horns of a great dragon.\"\n  - Use a formal and slightly archaic tone to reflect the academic and magical context of the story. Incorporate specific magical terminology and references to enhance the authenticity of the narrative.\n  - Craft dialogue that reflects the characters' personalities and the story's themes, using it to reveal information and advance the plot. Ensure that the language captures the sense of wonder and danger inherent in the setting.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The rules must be tailored to the specific themes and narrative potential of the prompt, which involves a high-stakes rescue mission in a hostile environment. The examples will be inspired by the detailed and imaginative elements seen in the few-shot demonstrations, ensuring they align with the Star Wars universe and the urgency of the situation. The rules will be structured to provide comprehensive guidance on how to develop the plot, infuse creativity, build characters and settings, and use language effectively to capture the tension and adventure of the narrative.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a scene that captures the immediate chaos and urgency at the Rebel base, using sensory details to convey the cold and tension. For example, describe the frantic movements of personnel as alarms blare and the icy wind howls through the corridors.\n  - Structure the narrative around a series of escalating challenges, including environmental hazards, potential Imperial encounters, and the ticking clock of nightfall. Use these elements to build suspense and drive the plot forward.\n  - Conclude with a resolution that addresses the immediate crisis of finding Luke, while leaving room for future developments. For instance, depict the moment of rescue as a temporary reprieve, with hints of ongoing threats.\n\n- **Creativity**:\n  - Integrate elements of the Star Wars universe, such as familiar technology and creatures, to enrich the narrative. Describe the use of Tauntauns for transportation across the icy terrain or the strategic deployment of droids for reconnaissance.\n  - Use the harsh environment of Hoth as a character in itself, presenting unique challenges and opportunities for innovation. For example, depict a scene where the protagonist must improvise a shelter using the natural landscape to survive a sudden blizzard.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their responses to the crisis, highlighting their resourcefulness, bravery, and camaraderie. Use dialogue and internal monologue to reveal their motivations and fears.\n  - Create a vivid setting by describing the stark beauty and deadly conditions of Hoth. Use sensory details to convey the biting cold, the blinding snow, and the eerie silence of the wasteland, enhancing the story's atmosphere.\n\n- **Language Use**:\n  - Employ a tense and urgent tone, using short, punchy sentences to convey the immediacy of the situation. For example, \"The wind howled, and the temperature dropped. Time was running out.\"\n  - Use descriptive language to paint a vivid picture of the environment and the characters' experiences. Incorporate Star Wars-specific terminology to maintain authenticity and immerse the reader in the universe.\n  - Balance action with introspection, allowing moments of reflection to deepen character development and provide insight into the stakes of the mission. Use these moments to explore themes of hope, resilience, and the fight against overwhelming odds.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with a strong setting or context, using imaginative elements to enhance the narrative, developing characters through their interactions and motivations, and employing a language style that reflects the tone and themes of the story. For the new prompt, I will focus on the themes of division, hierarchy, and rebellion within the city of Neo Elysia, ensuring the rules guide the narrative to explore these aspects deeply and creatively. I will include examples that illustrate how to apply these rules effectively, drawing inspiration from the detailed and immersive style of the few-shot demonstrations.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a vivid description of the divided city of Neo Elysia, highlighting the stark contrasts between its zones. Use sensory details to convey the atmosphere and tension, such as the oppressive silence in the wealthier zones compared to the chaotic noise of the poorer areas.\n  - Establish the protagonist's motivation for crossing boundaries early in the narrative. Use a personal or emotional catalyst, such as a loved one in danger or a deep-seated desire for justice, to drive the plot forward.\n  - Incorporate escalating challenges as the protagonist navigates different zones, each with its own rules and dangers. For example, describe a tense encounter with a zone enforcer or a narrow escape from a surveillance drone.\n\n- **Creativity**:\n  - Use the setting of Neo Elysia to explore themes of division and hierarchy creatively. Introduce unique elements, such as a black market for zone passes or a secret network of rebels, to add depth and intrigue to the narrative.\n  - Incorporate imaginative technology and societal structures that reflect the city's rigid hierarchy. For instance, describe a biometric system that tracks citizens' movements and enforces zone boundaries.\n  - Explore the protagonist's internal conflict and growth as they challenge the system. Use symbolic elements, such as a forbidden map or a hidden message, to represent their journey and transformation.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through their interactions with the diverse inhabitants of Neo Elysia. Use dialogue and actions to reveal their personality, values, and motivations.\n  - Create a rich and immersive setting by detailing the unique characteristics of each zone. For example, describe the neon-lit streets of the entertainment district or the crumbling infrastructure of the industrial zone.\n  - Highlight the social and political dynamics of Neo Elysia, emphasizing the tensions and alliances between different zones. Use these dynamics to add complexity and realism to the narrative.\n\n- **Language Use**:\n  - Employ a dynamic and engaging narrative style, using varied sentence structures and vivid imagery to capture the tension and urgency of the protagonist's journey.\n  - Use dialogue to reveal character dynamics and advance the plot, ensuring it reflects the diverse backgrounds and perspectives of Neo Elysia's inhabitants.\n  - Incorporate rhetorical devices, such as foreshadowing and irony, to enhance the narrative and emphasize the themes of division and rebellion. For example, use foreshadowing to hint at the protagonist's eventual impact on the city's hierarchy.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt about Frostvale, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with a strong sense of setting and context, using imaginative elements to enhance the narrative, developing characters through their interactions with the environment, and employing a descriptive and engaging language style. I will ensure the rules for Frostvale incorporate these elements, focusing on the mysterious return of the town, the secrets it harbors, and the atmosphere of intrigue and suspense. Each rule will include concrete examples to illustrate how to apply these elements effectively in the narrative.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a vivid description of Frostvale's reappearance, focusing on the initial reactions of the townspeople and visitors. Use sensory details to convey the town's mysterious aura, such as the chilling air and the eerie silence that follows its return. For example, describe how the townspeople gather at the gates, whispering about the black fire that once consumed the town.\n  - Introduce the central mystery of the strange cracks and dark marks appearing throughout Frostvale. Use these elements to drive the plot, creating a sense of urgency and suspense as characters seek to uncover the town's secrets. For instance, depict a scene where a shopkeeper discovers a crack in their wall that seems to pulse with an unnatural energy.\n  - Conclude each narrative arc with a revelation or twist that deepens the mystery, leaving room for further exploration. Ensure that each plot development ties back to the overarching theme of Frostvale's enigmatic return.\n\n- **Creativity**:\n  - Incorporate elements of fantasy and mystery, using the town's return from another dimension as a backdrop for exploring themes of time, space, and reality. Describe the town's architecture as a blend of familiar and otherworldly, with buildings that defy conventional design.\n  - Use imaginative descriptions to enhance the narrative, such as the black fire that once consumed Frostvale and the strange symbols that appear on its walls. For example, describe the fire as \"a darkness that devoured light, leaving only shadows in its wake.\"\n  - Explore the concept of parallel dimensions and the impact of Frostvale's return on the surrounding world. Use these elements to add depth and intrigue to the story, encouraging readers to question the nature of reality.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their interactions with Frostvale and its mysteries. Use their backgrounds and motivations to reveal their connections to the town and its secrets. For example, introduce a historian who has dedicated their life to studying Frostvale's disappearance and is now determined to uncover the truth behind its return.\n  - Create a rich and immersive setting by describing Frostvale's unique features and atmosphere. Use sensory details to evoke the town's mysterious and otherworldly nature, such as the cold, misty air and the faint hum that seems to emanate from its walls.\n  - Use the setting to reflect the characters' emotions and the story's themes, such as the tension between the familiar and the unknown. For instance, describe how the townspeople feel both drawn to and wary of the strange symbols that appear on their homes.\n\n- **Language Use**:\n  - Employ a descriptive and atmospheric language style, using vivid imagery and sensory details to create a sense of mystery and intrigue. Use phrases like \"the air was thick with whispers of the past\" to convey the town's enigmatic nature.\n  - Use dialogue and internal monologue to reveal character motivations and advance the plot. Ensure that the language reflects the characters' emotions and the story's themes, such as curiosity, fear, and wonder.\n  - Incorporate rhetorical devices, such as foreshadowing and symbolism, to enhance the narrative and engage the reader. Use these techniques to hint at the deeper mysteries of Frostvale and its return from another dimension.\n</story_rules>"
]