[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used in the previous examples. The demonstrations emphasize a blend of mystery, character development, and atmospheric setting, with a focus on creating suspense and intrigue. Each category—Plot, Creativity, Development (Character and Setting), and Language Use—provides specific, actionable guidance with examples that align with the narrative's themes and tone.\n\nFor the new prompt, I will ensure the rules reflect the chaotic and opportunistic environment of Hephaestus Station, focusing on the interplay of diverse characters and the unfolding of secrets and schemes. The examples will illustrate how to weave these elements into the narrative, maintaining the suspenseful and dynamic atmosphere suggested by the prompt.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Start with a dramatic event that sets the stage for the arrival of the supertanker, such as a power outage or a sudden influx of communication signals. Use this event to introduce the station's atmosphere and hint at the impending chaos. For example, describe the station's lights flickering ominously as the supertanker docks, casting long shadows over the bustling docks.\n  - Develop a multi-threaded narrative that follows different characters as they navigate the station's complex social and economic landscape. Ensure each thread reveals a piece of the larger puzzle, such as a smuggler's risky deal or a dockworker's unexpected discovery. For instance, show a dockworker stumbling upon a hidden compartment in the supertanker, filled with contraband.\n\n- **Creativity**:\n  - Incorporate elements of science fiction and noir, using the decaying station as a backdrop for intrigue and deception. Create unique technological and cultural details that enrich the setting, such as a black market for rare minerals or a secretive guild of information brokers. For example, describe a clandestine meeting in a dimly lit bar, where holographic displays flicker with encrypted messages.\n  - Use unexpected twists and reveals to maintain suspense and engage the reader. Introduce surprising alliances or betrayals that challenge characters' loyalties and ambitions. For instance, reveal that a seemingly loyal dockworker is actually an undercover agent for a rival faction.\n\n- **Development (Character and Setting)**:\n  - Develop characters by exploring their motivations and backgrounds, highlighting their roles within the station's ecosystem. Use dialogue and internal monologues to reveal their ambitions and fears. For example, depict a smuggler reflecting on their past failures and the high stakes of their current operation.\n  - Establish the setting of Hephaestus Station with vivid descriptions that convey its decaying grandeur and bustling activity. Focus on sensory details, such as the metallic tang of recycled air and the constant hum of machinery. For instance, describe the station's corridors as labyrinthine and dimly lit, with graffiti marking the territories of different factions.\n\n- **Language Use**:\n  - Employ a gritty, atmospheric tone that reflects the station's harsh environment and the characters' struggles. Use a mix of terse, impactful sentences and detailed descriptions to create a dynamic narrative pace. For example, use short, punchy sentences to convey the urgency of a smuggler's escape, followed by a detailed description of the station's chaotic docks.\n  - Use dialogue to convey character dynamics and advance the plot, incorporating slang and jargon specific to the station's culture. For instance, include exchanges like: \"You got the creds, or are we just wasting air here?\" to highlight the transactional nature of interactions on the station.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used in crafting the rules. The demonstrations emphasize a balance between plot development, creativity, character and setting development, and language use, with each rule accompanied by concrete examples. The new prompt involves a high-stakes scenario with a looming threat, requiring a focus on urgency, decision-making, and emotional depth. The rules will need to guide the narrative towards capturing the tension and desperation of the situation while exploring the characters' motivations and the setting's atmosphere. I will ensure the rules are actionable, specific, and enriched with examples that align with the prompt's themes and tone.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Start with an immediate sense of urgency as the creeping grey fog, known as the Loss, approaches Belfathan. Describe the initial chaos and the survivors' frantic attempts to gather their thoughts and belongings. For example, depict a scene where a character frantically searches through their home, deciding between sentimental items and practical necessities.\n  - Introduce a countdown mechanism to heighten tension, such as a clock ticking down the hour until the Loss arrives. Use this to structure the narrative, with each segment of time bringing new challenges and decisions. For instance, show how the dwindling time forces characters to make increasingly difficult choices about what to salvage.\n\n- **Creativity**:\n  - Incorporate elements of speculative fiction and horror to create a unique atmosphere. Describe the Loss with vivid, unsettling imagery, such as \"tendrils of fog curling like fingers around the edges of the town.\" Use these elements to evoke a sense of dread and inevitability.\n  - Explore the psychological impact of the impending disaster on the survivors. Use internal monologues to reveal their fears, regrets, and hopes. For example, illustrate a character's internal struggle as they weigh the value of a family heirloom against the need for survival gear.\n\n- **Development (Character and Setting)**:\n  - Develop characters by focusing on their backgrounds and relationships, highlighting how these influence their decisions in the face of the Loss. Use flashbacks to provide context for their choices, such as a memory of a loved one that compels a character to save a seemingly trivial item.\n  - Establish the setting of Belfathan with rich, atmospheric details that contrast its former vibrancy with the encroaching desolation. Describe the town's landmarks and how they are slowly being consumed by the fog, such as \"the once-bustling market square now eerily silent, shrouded in grey.\"\n\n- **Language Use**:\n  - Use evocative and descriptive language to convey the story's tension and emotional depth. Employ a mix of short, punchy sentences to convey urgency and longer, flowing descriptions to build atmosphere. For example, \"The fog crept closer, a silent predator, as hearts raced and breaths quickened.\"\n  - Craft dialogue that reflects the characters' desperation and resolve. Use terse exchanges to highlight the urgency of the situation, such as, \"We have to go now!\" \"But what about—\" \"No time, just move!\" This will help to maintain the story's pace and intensity.\n</story_rules>"
]