[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed and structured rules under the categories of **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contained specific, actionable instructions that were tailored to the themes and tones of the respective writing prompts. The rules emphasized the importance of setting the scene, developing characters, and maintaining a consistent tone throughout the narrative.\n\nFor the new writing prompt, the rules should focus on the mysterious and suspenseful elements, the connection between the two seemingly separate scenarios, and the hidden truths that are gradually revealed. The narrative should build tension and intrigue, with a focus on character interactions and the atmosphere of the settings.\n\n<story_rules>\n- **Plot**:\n  - Begin the story by establishing the two separate scenarios: the man waiting for the phone call in a room filled with a mysterious green light, and the strangers gathering in the cramped apartment.\n  - Alternate between the two settings, gradually revealing connections and building suspense.\n  - Introduce subtle hints and clues that suggest a deeper connection between the man and the strangers.\n  - Develop the narrative through interactions and dialogue, revealing hidden truths and secrets.\n  - Conclude the story with a revelation that ties the two scenarios together, leaving some elements open to interpretation to maintain intrigue.\n\n- **Creativity**:\n  - Use a blend of suspense and mystery to create an engaging and atmospheric narrative.\n  - Incorporate elements of the supernatural or unexplained, particularly in the descriptions of the green light and the woman's secrets.\n  - Ensure the narrative is immersive, with detailed descriptions and a focus on the characters' emotions and thoughts.\n  - Avoid straightforward explanations; instead, use subtle hints and ambiguous details to maintain a sense of mystery.\n\n- **Development (Character and Setting)**:\n  - Develop the man as a complex character, focusing on his anticipation and the significance of the awaited phone call.\n  - Create a vivid and immersive setting for both the room with the green light and the cramped apartment, using sensory details to enhance the atmosphere.\n  - Depict the strangers in the apartment with distinct personalities and backstories, hinting at their reasons for being there and their connections to the woman.\n  - Show the kindly woman as a mysterious and enigmatic figure, with hints of her secrets gradually revealed through interactions and dialogue.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to create a vivid and immersive atmosphere, focusing on the mysterious and suspenseful elements.\n  - Use varied pacing to build tension, with slower, reflective moments interspersed with moments of heightened suspense.\n  - Ensure dialogue is natural and reflective of the characters' emotions and relationships, contributing to the overall atmosphere.\n  - Maintain a tone of intrigue and mystery throughout the narrative, using language that enhances the sense of hidden truths and connections.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should start with the teens arriving at the wilderness retreat, setting the stage for the challenges ahead.\n   - Introduce the initial survival challenges and group dynamics early on, establishing the tension and stakes.\n   - Gradually reveal the secrets lurking in the forest through subtle hints and eerie occurrences.\n   - Build up to the storm's arrival, using it as a catalyst for the climax where the secrets are uncovered.\n   - Conclude with the teens' reactions and the resolution of both the survival and mystery elements.\n\n2. **Creativity**:\n   - Use a blend of suspense and mystery to create an engaging and tense atmosphere.\n   - Incorporate elements of the supernatural or unexplained phenomena to heighten the sense of mystery.\n   - Ensure the narrative is immersive, with detailed descriptions of the wilderness and the storm.\n   - Avoid straightforward horror tropes; instead, focus on psychological tension and the unknown.\n\n3. **Development (Character and Setting)**:\n   - Develop each teen as a distinct character with their own backstory, motivations, and personal struggles.\n   - Use the wilderness setting to reflect the characters' internal conflicts and growth.\n   - Create a dynamic group dynamic, showing how the teens' relationships evolve under pressure.\n   - Provide detailed and immersive descriptions of the forest and the storm, using sensory details to enhance the atmosphere.\n\n4. **Language Use**:\n   - Employ descriptive and evocative language to create a vivid and immersive setting.\n   - Use dialogue to reveal character traits and advance the plot, ensuring it feels natural and contributes to the overall atmosphere.\n   - Maintain a tense and suspenseful tone throughout the narrative, with moments of introspection and reflection.\n   - Use varied pacing to build tension, with slower, more reflective moments interspersed with moments of high tension and action.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the teens arriving at the wilderness retreat, setting the stage for the challenges ahead.\n  - Introduce the initial survival challenges and group dynamics early on, establishing the tension and stakes.\n  - Gradually reveal the secrets lurking in the forest through subtle hints and eerie occurrences.\n  - Build up to the storm's arrival, using it as a catalyst for the climax where the secrets are uncovered.\n  - Conclude with the teens' reactions and the resolution of both the survival and mystery elements.\n\n- **Creativity**:\n  - Use a blend of suspense and mystery to create an engaging and tense atmosphere.\n  - Incorporate elements of the supernatural or unexplained phenomena to heighten the sense of mystery.\n  - Ensure the narrative is immersive, with detailed descriptions of the wilderness and the storm.\n  - Avoid straightforward horror tropes; instead, focus on psychological tension and the unknown.\n\n- **Development (Character and Setting)**:\n  - Develop each teen as a distinct character with their own backstory, motivations, and personal struggles.\n  - Use the wilderness setting to reflect the characters' internal conflicts and growth.\n  - Create a dynamic group dynamic, showing how the teens' relationships evolve under pressure.\n  - Provide detailed and immersive descriptions of the forest and the storm, using sensory details to enhance the atmosphere.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to create a vivid and immersive setting.\n  - Use dialogue to reveal character traits and advance the plot, ensuring it feels natural and contributes to the overall atmosphere.\n  - Maintain a tense and suspenseful tone throughout the narrative, with moments of introspection and reflection.\n  - Use varied pacing to build tension, with slower, more reflective moments interspersed with moments of high tension and action.\n</story_rules>"
]