[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should be introduced clearly and early, establishing the main conflict and stakes.\n   - The narrative should include specific events or tasks that the characters must undertake to resolve the conflict.\n   - The plot should progress logically, with each event building on the previous one to create a cohesive narrative.\n   - The story should have a clear resolution or a shift in focus that hints at a larger, ongoing struggle.\n\n2. **Creativity**:\n   - The setting and plot should incorporate unique and imaginative elements that enhance the narrative.\n   - Unconventional or surprising details should be used to add depth and interest to the story.\n   - The narrative should blend genres and tones to create a rich and multifaceted story.\n\n3. **Development (Character and Setting)**:\n   - Characters should be multidimensional with distinct personalities, backgrounds, and motivations.\n   - The setting should be immersive and intricately tied to the story's themes and tone.\n   - Emotional arcs for the characters should be established, showing their growth and struggles throughout the story.\n\n4. **Language Use**:\n   - Descriptive language should be used to create vivid and immersive scenes.\n   - Dialogue should convey characters' emotions, motivations, and the stakes of the plot.\n   - The pacing should be controlled to keep the reader engaged, balancing detailed descriptions with action and dialogue.\n\nUsing these inferred patterns, craft the **Story Rules** for the new writing prompt about the White Collar Gang and the heroes of Emerald City.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a detailed description of the White Collar Gang's storming of the second National Bank of Emerald City, establishing the main conflict and stakes.\n  - Introduce the few heroes left in town, highlighting their initial reactions and the dilemma they face regarding whether to confront the gang or deal with the paperwork.\n  - Include specific events or tasks that the heroes must undertake to resolve the conflict, such as gathering intelligence, planning their approach, and confronting the gang.\n  - Ensure the plot progresses logically, with each event building on the previous one to create a cohesive narrative, leading to a climactic confrontation or resolution.\n\n- **Creativity**:\n  - Incorporate unique and imaginative elements that enhance the setting and plot, such as the extreme accountants' specialized tools and methods, and the heroes' unconventional abilities or weaknesses.\n  - Use unconventional or surprising details to add depth and interest to the story, such as humorous or ironic twists related to the heroes' aversion to paperwork.\n  - Blend genres and tones to create a rich and multifaceted narrative, balancing elements of action, comedy, and satire.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters with distinct personalities, backgrounds, and motivations. Show their interactions with each other and the environment, emphasizing their unique traits and abilities.\n  - Create an immersive setting that is intricately tied to the story's themes and tone. Describe the bank, the city, and the atmosphere in detail, highlighting the contrast between the mundane and the extraordinary.\n  - Establish emotional arcs for the characters, showing their growth and struggles throughout the story. Highlight their internal conflicts and relationships with other characters, particularly their feelings about the White Collar Gang and the paperwork dilemma.\n\n- **Language Use**:\n  - Use descriptive language to create vivid and immersive scenes. Focus on practical details that enhance the reader's understanding of the setting and characters' experiences.\n  - Maintain a straightforward and informative tone, avoiding overly poetic or abstract language. Use humor and irony to reflect the story's satirical elements.\n  - Employ dialogue to convey characters' emotions, motivations, and the stakes of the plot. Ensure the dialogue feels natural and contributes to the narrative, using wit and banter to add levity.\n  - Control the pacing to keep the reader engaged, balancing detailed descriptions with action and dialogue to maintain a steady flow. Use shorter, punchier sentences during action scenes to create a sense of urgency.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should be centered around a specific event or series of events that drive the narrative forward.\n   - Introduce the central conflict early on and build tension through the characters' actions and decisions.\n   - Ensure the plot includes a clear beginning, middle, and end, with a focus on resolving the central conflict.\n\n2. **Creativity**:\n   - Incorporate unique and imaginative elements that enhance the narrative and engage the reader.\n   - Use vivid descriptions and sensory details to create an immersive experience.\n   - Highlight the personal stakes and internal conflicts of the characters to add depth to the story.\n\n3. **Development (Character and Setting)**:\n   - Develop characters through their roles and interactions within the story, providing insights into their personalities and motivations.\n   - Create a detailed and immersive setting that enhances the narrative and provides context for the characters' actions.\n   - Use the setting to create a sense of atmosphere and tension, emphasizing the challenges and dangers faced by the characters.\n\n4. **Language Use**:\n   - Employ descriptive language to paint a vivid picture of the setting and characters.\n   - Use a mix of narrative and dialogue to convey the story, ensuring that character interactions reveal their personalities and relationships.\n   - Maintain a tone that reflects the themes and atmosphere of the story, while also capturing the tension and urgency of the central conflict.\n   - Use sensory details and vivid imagery to create an immersive experience for the reader.\n\nBased on these patterns, the **Story Rules** for the new writing prompt will be crafted to provide detailed, actionable guidance for plot development, creativity, character and setting development, and language use.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with the dramatic arrival of the sinking galleon, emphasizing the urgency and chaos of the situation.\n  - Introduce the central conflict of balancing the rescue of the crew, salvaging valuable cargo, and preventing further disaster.\n  - Develop the narrative through the actions and decisions of the townsfolk, highlighting their struggles and priorities.\n  - Conclude with a resolution that addresses the immediate crisis, while leaving room for future consequences and developments.\n\n- **Creativity**:\n  - Incorporate unique and imaginative elements, such as the appearance of the galleon, the behavior of the sharks, and the nature of the scattered cargo.\n  - Use vivid descriptions and sensory details to create an immersive and tense atmosphere.\n  - Highlight the personal stakes and internal conflicts of the townsfolk, adding depth to their motivations and actions.\n  - Introduce unexpected twists or challenges that complicate the rescue and salvage efforts, keeping the reader engaged.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their roles in the rescue and salvage efforts, providing insights into their personalities, skills, and motivations.\n  - Create a detailed and immersive setting, emphasizing the port town's layout, the condition of the galleon, and the surrounding environment.\n  - Use the setting to create a sense of atmosphere and tension, emphasizing the dangers and challenges faced by the characters.\n  - Show the interactions and dynamics among the townsfolk, highlighting their cooperation, conflicts, and individual contributions to the efforts.\n\n- **Language Use**:\n  - Employ descriptive language to paint a vivid picture of the setting, characters, and events, using sensory details to enhance the narrative.\n  - Use a mix of narrative and dialogue to convey the story, ensuring that character interactions reveal their personalities and relationships.\n  - Maintain a tone that reflects the urgency and tension of the central conflict, while also capturing the resilience and determination of the townsfolk.\n  - Use vivid imagery and sensory details to create an immersive experience, such as the sounds of the crashing waves, the smell of the sea, and the sight of the sinking galleon and circling sharks.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed and structured rules under the categories of **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contained specific, actionable instructions that were tailored to the unique elements of the writing prompt. The rules were comprehensive, covering various narrative aspects such as pacing, character dynamics, and setting descriptions.\n\nFor the new writing prompt, the rules should focus on the themes of naval warfare, diverse fantasy elements, and the quest for glory and reclaiming a lost homeland. The rules should guide the narrative to create a vivid and immersive story that captures the tension and excitement of the fleet's mission.\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the fleet's departure, emphasizing the anticipation and tension among the crew as they sail into enemy waters.\n  - Introduce the hawk captain's rallying speech, highlighting the promises of glory, trade routes, and reclaiming a lost homeland.\n  - Develop the central conflict with the threat of the Kichledai navy, incorporating strategic maneuvers, battles, and the crew's efforts to survive.\n  - Include key events that showcase the diverse skills and abilities of the mages, wyvern riders, and Pegasus-mounted cavaliers.\n  - Conclude the story with a decisive battle or turning point that determines the fleet's fate, leaving room for future exploration of their journey.\n\n- **Creativity**:\n  - Blend elements of naval warfare with fantasy, using imaginative details to describe the ships, magical abilities, and mythical creatures.\n  - Incorporate unique and surprising elements, such as enchanted weapons, magical storms, and mythical sea creatures that challenge the fleet.\n  - Use the diverse backgrounds and abilities of the crew to create dynamic and unexpected interactions and strategies.\n  - Highlight the cultural and historical significance of the lost homeland, adding depth to the crew's motivations and the stakes of their mission.\n\n- **Development (Character and Setting)**:\n  - Develop the hawk captain as a charismatic and determined leader, providing insights into their background and motivations.\n  - Create multidimensional characters among the crew, showcasing their unique skills, personalities, and relationships.\n  - Establish a vivid setting by describing the fleet's ships, the enemy waters, and the various magical and mythical elements they encounter.\n  - Show the crew's growth and camaraderie as they face challenges together, emphasizing their diverse abilities and teamwork.\n\n- **Language Use**:\n  - Use descriptive language to create vivid and immersive scenes, focusing on the sensory details of naval battles, magical abilities, and the environment.\n  - Maintain a tone that reflects the tension and excitement of the fleet's mission, balancing action with moments of introspection and camaraderie.\n  - Employ dialogue to convey the characters' emotions, motivations, and the stakes of their mission, ensuring it feels natural and contributes to the narrative.\n  - Control the pacing to keep the reader engaged, balancing detailed descriptions with action and dialogue to maintain a steady flow.\n</story_rules>"
]