[
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a mysterious green light, a man waiting for a phone call, and strangers gathering in a cramped apartment, suggesting themes of mystery, suspense, and interconnectedness. The rules will need to guide the narrative to explore these themes, using detailed examples to illustrate how to build tension and reveal hidden truths. The rules will be structured to ensure they are actionable, specific, and aligned with the prompt's objectives, incorporating the style and level of detail from the few-shot demonstrations.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with the man in a dimly lit room, emphasizing the eerie atmosphere created by the mysterious green light. Use his anticipation of the phone call to build suspense and introduce the central mystery.\n    - Example: Describe the man's restless pacing and the way the green light casts strange shadows on the walls, creating an unsettling ambiance.\n  - Introduce the secondary plotline with the strangers gathering in the cramped apartment, focusing on their interactions and the kindly woman's enigmatic behavior.\n    - Example: Detail the cramped space filled with mismatched furniture and the woman's warm yet secretive demeanor as she welcomes her guests.\n  - Develop the plot by gradually revealing connections between the man and the strangers, using subtle clues and interactions to hint at a shared history or purpose.\n    - Example: Use a seemingly innocuous object, like a photograph or a letter, to link the two settings and suggest a deeper connection.\n  - Conclude with an open-ended resolution that leaves some mysteries unsolved, maintaining a sense of intrigue and inviting the reader to ponder the hidden truths.\n    - Example: End with the phone ringing just as the strangers uncover a significant clue, leaving the outcome uncertain.\n\n- **Creativity**:\n  - Use the green light as a symbolic element throughout the story, representing mystery, hope, or danger, and influencing the characters' emotions and actions.\n    - Example: Describe how the green light seems to pulse in time with the man's heartbeat, heightening his anxiety and anticipation.\n  - Incorporate unique character dynamics and interactions to explore themes of trust, secrecy, and revelation, using the setting to enhance these themes.\n    - Example: Highlight the tension between the strangers as they share their stories, each revealing a piece of the puzzle while guarding their own secrets.\n\n- **Development (Character and Setting)**:\n  - Develop the man as a complex character, using his internal monologue and actions to reveal his motivations and fears as he waits for the call.\n    - Example: Show his internal struggle as he debates whether to leave the room or continue waiting, reflecting his desperation and hope.\n  - Create a vivid setting for the cramped apartment, using sensory details to convey the atmosphere and the characters' emotional states.\n    - Example: Describe the musty smell of old books and the flickering candlelight that casts long shadows, adding to the sense of mystery and intimacy.\n\n- **Language Use**:\n  - Employ a suspenseful and atmospheric tone, using descriptive language to create a sense of unease and anticipation.\n    - Example: Use phrases like \"the air hummed with tension\" or \"the shadows danced with secrets\" to evoke the story's mood.\n  - Use dialogue to reveal character traits and advance the plot, ensuring each line contributes to the unfolding mystery and character development.\n    - Example: Craft dialogue that hints at the characters' pasts and their reasons for being in the apartment, using subtext to suggest deeper connections.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves themes of survival, mystery, and personal growth, set against the backdrop of a wilderness retreat. The rules will need to guide the narrative through the challenges faced by the teens, the secrets of the forest, and the impending storm. I will ensure the rules are actionable, specific, and include examples that align with the prompt's themes and tone.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the teens arriving at the wilderness retreat, setting the stage for their initial interactions and establishing the tension between them. Use this moment to introduce the looming storm as a metaphor for the challenges ahead.\n    - Example: Describe the teens' arrival at the campsite, noting the darkening clouds on the horizon and the uneasy glances exchanged among the group.\n  - Develop the plot by intertwining survival challenges with the mystery of the forest. Use the storm as a catalyst for revealing secrets and testing the teens' resilience.\n    - Example: As the storm approaches, have the group discover strange symbols carved into the trees, sparking curiosity and fear.\n  - Conclude the story with a revelation or discovery that ties together the themes of survival and mystery, leaving room for personal growth and reflection.\n    - Example: After the storm passes, the teens find an old journal hidden in a hollow tree, containing stories of past retreats and the secrets of the forest.\n\n- **Creativity**:\n  - Use the wilderness setting to create a sense of mystery and adventure, incorporating elements of folklore or local legends to deepen the narrative.\n    - Example: Introduce a legend about a hidden cave that only appears during storms, enticing the teens to explore despite the risks.\n  - Blend the natural challenges of the wilderness with the psychological and emotional struggles of the teens, using the environment as a mirror for their internal conflicts.\n    - Example: As the rain begins to fall, one teen's fear of water surfaces, forcing them to confront past traumas while seeking shelter.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their interactions and responses to the wilderness challenges. Highlight their individual backgrounds and secrets, using dialogue and actions to reveal their personalities.\n    - Example: Show a teen who is initially withdrawn stepping up to lead the group when they get lost, revealing hidden strengths.\n  - Create an immersive setting by focusing on the sensory details of the forest and the storm. Use vivid descriptions to convey the beauty and danger of the wilderness.\n    - Example: Describe the sound of rain pounding on the leaves, the smell of wet earth, and the flash of lightning illuminating the forest.\n\n- **Language Use**:\n  - Employ a descriptive and atmospheric narrative style, using language that evokes the tension and mystery of the setting. Use metaphors and similes to enhance the mood.\n    - Example: \"The forest was a living entity, its whispers carried on the wind, secrets hidden beneath the canopy like shadows in the night.\"\n  - Use dialogue to reveal character dynamics and build tension, ensuring each character's voice is distinct and reflective of their background and personality.\n    - Example: Capture the group's anxiety and excitement through quick, overlapping exchanges as they debate whether to explore the mysterious cave.\n</story_rules>"
]