[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed and structured rules under the categories of Plot, Creativity, Development (Character and Setting), and Language Use. Each category contained specific, actionable instructions that were tailored to the unique elements of the writing prompt. The rules emphasized the importance of setting, character development, and the use of descriptive language to create an immersive narrative.\n\nFor the new writing prompt, the rules will need to focus on creating a sense of dread and urgency, developing the protagonist's character and their journey, and using vivid, atmospheric language to convey the dark and dangerous setting. The rules should guide the narrative to maintain a consistent tone of suspense and horror, while also providing clear instructions for plot progression and character interactions.\n\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with a vivid description of the perpetual darkness, emphasizing the absence of the sun and stars to set a foreboding tone.\n  - Introduce the protagonist's immediate situation and their awareness of the unspeakable threat stalking them.\n  - Establish the protagonist's goal of reaching the northern tip of the island, highlighting the urgency and desperation of their journey.\n  - Use the blood-soaked sands and shadowed waters as significant obstacles, creating moments of intense suspense and danger.\n  - Gradually reveal the nature of the unspeakable threat through the protagonist's encounters and observations, maintaining an air of mystery and horror.\n\n- **Creativity**:\n  - Employ rich, atmospheric descriptions to create a sense of dread and unease, using the darkness and the island's features to enhance the horror elements.\n  - Incorporate unique and unsettling details about the environment and the threat, avoiding clichés and predictable horror tropes.\n  - Use the protagonist's internal monologue to explore their fears, doubts, and determination, adding depth to their character.\n  - Develop a sense of isolation and hopelessness, contrasting it with moments of fleeting hope and resilience.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a resourceful and determined individual, driven by a strong desire to survive and reach safety.\n  - Provide detailed descriptions of the island's landscape, emphasizing its eerie and hostile nature.\n  - Use the setting to reflect the protagonist's emotional state, creating a strong connection between the environment and the character's journey.\n  - Introduce secondary characters or creatures sparingly, focusing on their impact on the protagonist and the story's tension.\n\n- **Language Use**:\n  - Use descriptive and evocative language to create a vivid and immersive narrative, focusing on sensory details to convey the darkness and danger.\n  - Maintain a consistent tone of suspense and horror, using pacing and sentence structure to build tension and anticipation.\n  - Employ introspective and reflective language to convey the protagonist's internal struggles and emotions.\n  - Use dialogue sparingly, focusing on the protagonist's thoughts and observations to drive the narrative forward.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed and structured rules under the categories of Plot, Creativity, Development (Character and Setting), and Language Use. Each category contained specific, actionable instructions tailored to the writing prompt, ensuring comprehensive guidance for narrative generation.\n\nFor the new writing prompt, the rules should focus on the mysterious and eerie atmosphere of the ghost town, the protagonist's fragmented memory, and the secrets of the forsaken town. The rules should guide the narrative to explore the protagonist's past, the town's history, and the supernatural or mysterious elements that may be present.\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist awakening in an unfamiliar place, emphasizing their disorientation and fragmented memory.\n  - Introduce the setting of Sentinel gradually, using the protagonist's exploration to reveal key locations and details.\n  - Incorporate the sound of the church bells as a recurring motif, using it to build suspense and guide the protagonist's actions.\n  - Develop a central mystery around the protagonist's past and the town's secrets, gradually revealing clues through exploration and interactions.\n  - Ensure the narrative includes a clear beginning, middle, and end, with a resolution that ties together the protagonist's memories and the town's history.\n\n- **Creativity**:\n  - Use rich, descriptive language to create a vivid and immersive setting, blending elements of mystery and suspense.\n  - Incorporate sensory details to enhance the atmosphere, focusing on sounds, sights, and textures of the ghost town.\n  - Develop unique and imaginative elements, such as supernatural occurrences, hidden messages, or enigmatic characters, to deepen the mystery.\n  - Allow for creative interpretations of the protagonist's fragmented memories, using flashbacks or dream sequences to reveal their past.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a complex character with a mysterious past, using their fragmented memories to create depth and intrigue.\n  - Provide detailed descriptions of the ghost town, emphasizing its abandoned and eerie nature.\n  - Introduce secondary characters or entities gradually, focusing on their connection to the town and the protagonist.\n  - Use the setting to reflect and enhance the story's tone and themes, creating a strong sense of place and mood.\n\n- **Language Use**:\n  - Employ descriptive and atmospheric language to create an engaging and immersive narrative.\n  - Focus on internal monologue and detailed observations to reveal the protagonist's emotions and thoughts.\n  - Use sparse but impactful dialogue to convey character relationships and advance the plot.\n  - Maintain a consistent tone that reflects the mysterious and eerie nature of the story, using sensory details to immerse the reader in the setting.\n</story_rules>"
]