[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a space setting with themes of anticipation, celebration, and an underlying threat. The rules will need to guide the narrative to balance the excitement of departure with the tension of an unnoticed anomaly. I will ensure the rules are actionable, specific, and include examples that align with the prompt's themes and tone.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with a detailed depiction of the UEC Ever Onward's bustling atmosphere, capturing the excitement and anticipation of its historic departure. Use descriptions like \"The ship's corridors hummed with the chatter of eager passengers and crew, each step echoing with the promise of new beginnings.\"\n  - Introduce the anomaly subtly, weaving it into the background of the celebration. Use small, seemingly insignificant details that hint at the impending threat, such as \"a flicker in the control panel lights that went unnoticed amidst the laughter and farewells.\"\n  - Build tension gradually, allowing the anomaly to become more apparent as the story progresses. Ensure the narrative maintains a balance between the celebratory mood and the underlying sense of unease.\n\n- **Creativity**:\n  - Incorporate elements of futuristic technology and space exploration, using imaginative details to enhance the setting. Describe the ship's advanced features, like \"holographic displays projecting the ship's trajectory across the stars.\"\n  - Use the theme of departure to explore personal stories and relationships, highlighting the emotional weight of goodbyes and new beginnings. For example, depict a passenger's internal conflict as they leave behind a loved one, adding depth to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their interactions and farewells, revealing their motivations and emotional states. Use dialogue and body language to convey their excitement and apprehension, such as \"a mother clinging to her child's hand, her smile wavering as she whispered promises of a swift return.\"\n  - Create an immersive setting by detailing the ship's interior and the bustling activity of the departure. Use sensory details to evoke the atmosphere, like \"the scent of polished metal and the distant hum of engines readying for launch.\"\n\n- **Language Use**:\n  - Employ a descriptive and immersive style, using vivid imagery and sensory details to convey the setting and mood. Use phrases like \"the ship's hull gleamed under the artificial lights, a beacon of hope against the vastness of space.\"\n  - Maintain a narrative voice that captures both the excitement of the departure and the subtle tension of the anomaly. Use pacing to reflect the dual nature of the story, allowing moments of calm to be interspersed with hints of the underlying threat.\n  - Use dialogue to reveal character relationships and emotions, ensuring it serves to advance the plot and deepen the narrative. For example, capture a farewell exchange with lines like, \"Promise me you'll look at the stars every night, and know I'm doing the same.\"\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a high-stakes scenario with a time constraint, requiring a focus on tension, urgency, and strategic planning. The setting in a desert town under surveillance adds layers of intrigue and danger, which should be reflected in the rules. I will ensure the rules are actionable, specific, and include examples that align with the prompt's themes and objectives.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with an immediate sense of urgency, using the five-minute time constraint to drive the narrative. Describe the countdown with phrases like \"The clock ticked down from five minutes, each second echoing louder than the last.\"\n  - Structure the narrative around the team's strategic movements through the town, highlighting obstacles such as guards and oppressive surveillance. Use examples like \"The team split into pairs, each taking a different alley to avoid detection.\"\n  - Conclude with a climactic moment as the team reaches the pink house, ensuring the tension peaks just as they make contact. Avoid resolving the chaos too early, maintaining suspense until the final moment.\n\n- **Creativity**:\n  - Incorporate elements of espionage and stealth, using the setting to enhance the narrative's tension. Describe creative tactics the team uses to avoid detection, such as \"ducking behind market stalls and blending with the crowd.\"\n  - Use the oppressive atmosphere to explore themes of resistance and cunning, emphasizing the team's resourcefulness in navigating the town's dangers.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their roles and interactions within the team, highlighting their skills and contributions to the mission. For example, describe a character's expertise in navigation as they lead the team through the maze-like streets.\n  - Create an immersive setting by detailing the desert town's oppressive atmosphere, using sensory details like \"the relentless sun casting long shadows under the watchful eyes of the guards\" to enhance the mood.\n\n- **Language Use**:\n  - Employ a tense and fast-paced narrative style, using short, punchy sentences to convey urgency and action. For example, \"They moved quickly, hearts pounding, eyes scanning for any sign of the pink house.\"\n  - Use dialogue sparingly to maintain the story's pace, ensuring it serves to advance the plot and reveal character dynamics. For instance, \"Keep moving,\" one whispered, \"we're almost there.\"\n  - Maintain a third-person limited perspective to focus on the team's experiences and heighten the sense of immediacy and tension.\n</story_rules>"
]