[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should start with a vivid description of the setting, emphasizing its chaotic and dangerous nature.\n   - Introduce each character through their immediate actions and circumstances, highlighting their desperation and unique skills.\n   - Ensure that the characters' paths cross due to a central event or common goal, such as a heist, a bounty, or a shared enemy.\n   - Develop the narrative by balancing individual character arcs with the overarching plot, leading to a climax where their fates are intertwined.\n\n2. **Creativity**:\n   - Incorporate a mix of science fiction and adventure elements to create a sense of excitement and danger.\n   - Blend genres, such as action, mystery, and drama, to enhance the story's complexity and intrigue.\n   - Use imaginative and unconventional elements, such as unique alien species, advanced technology, and the mystical aspects of the Force, to add depth to the characters and plot.\n\n3. **Development (Character and Setting)**:\n   - Develop characters through their actions, internal thoughts, and interactions with the environment, rather than extensive backstory exposition.\n   - Create multidimensional characters with distinct personalities, motivations, and abilities that are revealed through their interactions with each other and the setting.\n   - Establish an immersive setting that reflects the characters' perceptions and emotions, using detailed and evocative descriptions to bring Nar Shadaa to life.\n\n4. **Language Use**:\n   - Employ vivid, sometimes gritty language to create a strong sense of atmosphere and tension throughout the narrative.\n   - Vary the pacing to include moments of intense action, suspense, and introspection, keeping the reader engaged and invested in the story.\n   - Use dialogue to reveal character traits, advance the plot, and create a natural flow between different perspectives.\n   - Maintain a consistent tone that aligns with the themes of danger, intrigue, and interconnectedness, ensuring that the narrative remains cohesive and compelling.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with a vivid description of Nar Shadaa, emphasizing its chaotic and dangerous nature.\n  - Introduce each character through their immediate actions and circumstances, highlighting their desperation and unique skills.\n  - Ensure that the characters' paths cross due to a central event or common goal, such as a heist, a bounty, or a shared enemy.\n  - Develop the narrative by balancing individual character arcs with the overarching plot, leading to a climax where their fates are intertwined.\n\n- **Creativity**:\n  - Incorporate a mix of science fiction and adventure elements to create a sense of excitement and danger.\n  - Blend genres, such as action, mystery, and drama, to enhance the story's complexity and intrigue.\n  - Use imaginative and unconventional elements, such as unique alien species, advanced technology, and the mystical aspects of the Force, to add depth to the characters and plot.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their actions, internal thoughts, and interactions with the environment, rather than extensive backstory exposition.\n  - Create multidimensional characters with distinct personalities, motivations, and abilities that are revealed through their interactions with each other and the setting.\n  - Establish an immersive setting that reflects the characters' perceptions and emotions, using detailed and evocative descriptions to bring Nar Shadaa to life.\n\n- **Language Use**:\n  - Employ vivid, sometimes gritty language to create a strong sense of atmosphere and tension throughout the narrative.\n  - Vary the pacing to include moments of intense action, suspense, and introspection, keeping the reader engaged and invested in the story.\n  - Use dialogue to reveal character traits, advance the plot, and create a natural flow between different perspectives.\n  - Maintain a consistent tone that aligns with the themes of danger, intrigue, and interconnectedness, ensuring that the narrative remains cohesive and compelling.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed and structured rules under categories such as Plot, Creativity, Development (Character and Setting), and Language Use. Each category contained specific, actionable instructions that were tailored to the unique elements of the writing prompt. The rules emphasized vivid descriptions, character development through actions and interactions, and maintaining a consistent tone that aligns with the themes of the prompt.\n\nFor the new writing prompt about five children receiving their Hogwarts letters under unusual circumstances, the rules should focus on:\n- Introducing each child and their unique background.\n- Creating a sense of mystery and discovery as they uncover secrets about their pasts and abilities.\n- Developing their interactions and relationships as they converge at Hogwarts.\n- Maintaining a magical and adventurous tone throughout the narrative.\n\n<story_rules>\n- **Plot**:\n  - Begin the story by introducing each child in their unique environment, highlighting the unusual circumstances under which they receive their Hogwarts letters.\n  - Develop a sense of mystery and anticipation as each child uncovers secrets about their pasts and abilities, leading up to their arrival at Hogwarts.\n  - Ensure that the convergence of their paths at the start of term is marked by significant events or revelations that hint at their intertwined destinies.\n  - Balance the narrative between individual character arcs and the overarching plot, allowing the story to flow naturally between different perspectives.\n  - Resolve the narrative by revealing how their destinies are interconnected and setting the stage for future adventures and challenges.\n\n- **Creativity**:\n  - Incorporate imaginative and magical elements that are unique to the Harry Potter universe, such as enchanted objects, magical creatures, and spellcasting.\n  - Blend genres, such as fantasy, mystery, and adventure, to enhance the story's complexity and intrigue.\n  - Use creative and unconventional elements, such as hidden magical talents or ancient prophecies, to add layers to the characters and plot.\n  - Integrate moments of wonder and discovery, capturing the magical atmosphere of Hogwarts and the wizarding world.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their immediate actions, internal thoughts, and responses to their environment, rather than extensive backstory exposition.\n  - Create multidimensional characters with distinct personalities, backgrounds, and abilities that are revealed through their interactions with each other and the magical world.\n  - Establish an immersive setting that reflects the characters' perceptions and emotions, using detailed and evocative descriptions to bring Hogwarts and the wizarding world to life.\n  - Show the growth of the characters' relationships and their development as they navigate the challenges and mysteries of their new environment.\n\n- **Language Use**:\n  - Employ vivid, sometimes poetic language to create a strong sense of atmosphere and emotion throughout the narrative.\n  - Vary the pacing to include moments of introspection, sudden action, and tension, keeping the reader engaged and invested in the story.\n  - Use dialogue to reveal character traits, advance the plot, and create a natural flow between different perspectives.\n  - Maintain a consistent tone that aligns with the themes of magic, mystery, and adventure, ensuring that the narrative remains cohesive and compelling.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot rules should outline the sequence of events, starting with the shattering of the ancient vault and the assembly of the team.\n   - Emphasize the discovery of each hero's past, powers, and secrets.\n   - Detail the progression of the team's journey and the challenges they face.\n   - Conclude with a climactic confrontation with the ancient threat.\n\n2. **Creativity**:\n   - Encourage imaginative and unique powers and backgrounds for each hero.\n   - Incorporate elements of ancient mythology and modern fantasy.\n   - Use the ancient threat to explore themes of time, legacy, and destiny.\n   - Blend action, suspense, and moments of introspection.\n\n3. **Development (Character and Setting)**:\n   - Develop each hero with a distinct personality, backstory, and emotional arc.\n   - Create a diverse and dynamic team dynamic, highlighting conflicts and alliances.\n   - Describe settings vividly, from the ancient vault to various mystical and real-world locations.\n   - Use the settings to reflect the themes and enhance the narrative.\n\n4. **Language Use**:\n   - Use descriptive and evocative language to create a sense of wonder and danger.\n   - Employ dialogue to reveal character traits and advance the plot.\n   - Maintain a tone that balances epic grandeur with personal stakes.\n   - Utilize vivid imagery and sensory details to immerse the reader in the story.\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the shattering of the ancient vault, setting off a chain of events that introduces the ancient force and its immediate impact on the world.\n  - Introduce the world's guardian and their realization of the need to assemble a team of heroes, each with unique pasts, powers, and secrets.\n  - Detail the process of finding and recruiting each hero, highlighting their initial reluctance or challenges.\n  - Develop the team's journey as they face various trials and adversaries, uncovering more about the ancient threat and their own abilities.\n  - Build towards a climactic confrontation with the ancient force, where the heroes must unite their strengths and overcome their differences.\n  - Conclude with a resolution that hints at the lasting impact of their victory and the potential for future challenges.\n\n- **Creativity**:\n  - Create imaginative and diverse powers for each hero, ensuring they are unique and complement each other.\n  - Incorporate elements of ancient mythology, blending them with modern fantasy to create a rich and immersive world.\n  - Use the ancient threat to explore themes of time, legacy, and destiny, adding depth to the narrative.\n  - Balance action-packed sequences with moments of introspection and character development, creating a dynamic and engaging story.\n\n- **Development (Character and Setting)**:\n  - Develop each hero with a distinct personality, backstory, and emotional arc, ensuring they are well-rounded and relatable.\n  - Highlight the team dynamic, focusing on conflicts, alliances, and the growth of their relationships.\n  - Describe settings vividly, from the ancient vault to various mystical and real-world locations, creating a sense of wonder and danger.\n  - Use the settings to reflect the themes of the story and enhance the narrative, making the world feel alive and integral to the plot.\n\n- **Language Use**:\n  - Use descriptive and evocative language to create a sense of wonder and danger, immersing the reader in the story.\n  - Employ dialogue effectively to reveal character traits, advance the plot, and develop relationships.\n  - Maintain a tone that balances epic grandeur with personal stakes, ensuring the story feels both grand and intimate.\n  - Utilize vivid imagery and sensory details to bring the settings and characters to life, making the narrative engaging and immersive.\n</story_rules>"
]