[
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a humorous and unconventional scenario with a team of extreme accountants, which suggests a blend of action, comedy, and satire. The rules will need to reflect this tone while providing clear guidance on how to develop the narrative, characters, and setting. I will ensure that each rule is accompanied by a concrete example to illustrate its application, drawing inspiration from the detailed examples in the few-shot demonstrations. The rules will be structured under the specified categories and tailored to the unique aspects of the new prompt, such as the comedic potential of accountants as antagonists and the satirical take on superhero tropes.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Start the story with a dramatic and humorous introduction of the White Collar Gang's heist at the National Bank, emphasizing their unusual demands for tax returns and ledgers. For example, describe how the gang, clad in tailored suits and wielding calculators, storms the bank with a battle cry of \"Audit or Annihilation!\"\n  - Develop the plot by focusing on the heroes' internal debate about whether to confront the gang, highlighting the absurdity of their dilemma. Illustrate this with a scene where the heroes, gathered in their secret lair, argue over the merits of fighting accountants versus tackling paperwork.\n  - Conclude with a comedic resolution that subverts typical superhero narratives, such as the heroes realizing that their true power lies in their ability to outsmart the accountants with creative accounting tricks.\n\n- **Creativity**:\n  - Infuse the narrative with humor and satire, using the concept of extreme accountants as a playful critique of bureaucracy and financial systems. For instance, depict the gang's leader as a charismatic figure who delivers motivational speeches about the power of spreadsheets.\n  - Incorporate unexpected twists that play on superhero tropes, such as the heroes discovering that their superpowers are ineffective against the gang's financial acumen, forcing them to rely on wit and strategy instead.\n\n- **Development (Character and Setting)**:\n  - Develop characters with exaggerated traits that reflect their roles in the story, such as a hero who is a former tax attorney with a penchant for justice and a fear of paperwork. Use these traits to create humorous and relatable character dynamics.\n  - Create a vivid setting by describing the bank as a fortress of bureaucracy, complete with endless rows of filing cabinets and a vault filled with tax documents. Use the setting to enhance the comedic tone and highlight the absurdity of the situation.\n\n- **Language Use**:\n  - Employ a playful and witty narrative style, using puns and wordplay related to finance and accounting to enhance the humor. For example, describe the gang's weapons as \"ledger blasters\" and their getaway vehicle as a \"taxicab.\"\n  - Use dialogue to convey the characters' personalities and the comedic tone of the story. Ensure that conversations are snappy and filled with banter, reflecting the lighthearted and satirical nature of the narrative.\n  - Maintain a fast-paced and engaging narrative flow, using concise and vivid descriptions to keep the reader entertained and immersed in the story's whimsical world.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The rules must be specific to the prompt about the sinking galleon, focusing on the themes of survival, community response, and the tension between saving lives and salvaging goods. I will ensure the rules are actionable, detailed, and include examples that align with the narrative style and objectives of the prompt. The rules will be organized into the specified categories, providing comprehensive guidance for storytelling.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a vivid description of the galleon as it approaches the docks, emphasizing the urgency and chaos of the situation. For example, describe the ship's creaking timbers and the frantic shouts of the crew as they struggle to keep the vessel afloat.\n  - Develop the plot by focusing on the townsfolk's immediate reactions and decisions, highlighting the tension between saving the crew and salvaging valuable cargo. Illustrate this with scenes of townspeople debating priorities and forming rescue teams.\n  - Introduce escalating challenges, such as worsening weather or increased shark activity, to heighten the stakes and drive the narrative forward. Use these elements to create a sense of urgency and suspense.\n\n- **Creativity**:\n  - Incorporate unique and imaginative solutions that the townsfolk devise to address the crisis, such as using makeshift rafts or employing trained animals to assist in the rescue. For instance, describe a character who uses a trained falcon to scout the waters for approaching sharks.\n  - Blend elements of maritime lore and local legends into the narrative, adding depth and intrigue to the story. Mention tales of ghost ships or sea monsters that the townsfolk recall as they face the unfolding disaster.\n\n- **Development (Character and Setting)**:\n  - Develop characters by exploring their roles within the community and their personal motivations during the crisis. Highlight diverse perspectives, such as a seasoned sailor advocating for the crew's safety and a merchant focused on salvaging goods.\n  - Create a rich and immersive setting by detailing the town's relationship with the sea, including its history, economy, and cultural traditions. Use descriptions of the bustling docks and the surrounding landscape to enhance the atmosphere.\n\n- **Language Use**:\n  - Employ vivid and dynamic language to convey the intensity and urgency of the situation. Use sensory details to immerse the reader in the scene, such as the salty air, the sound of crashing waves, and the sight of circling sharks.\n  - Use dialogue to reveal character dynamics and convey the tension between different priorities. Ensure conversations reflect the gravity of the situation and the characters' emotional states.\n  - Maintain a tone that balances suspense and hope, capturing the community's resilience and determination in the face of disaster. Use language that evokes both the peril and the potential for heroism.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used in crafting the rules. The demonstrations emphasize a clear introduction of the setting and characters, a blend of thematic elements with the narrative, and the use of vivid, descriptive language to create an immersive experience. Each rule is accompanied by concrete examples that illustrate the application of the rule in the context of the writing prompt.\n\nFor the new prompt, the rules will need to focus on the dynamics of a diverse crew, the strategic and emotional aspects of naval warfare, and the overarching theme of reclaiming a lost homeland. The examples will illustrate how to convey the tension and camaraderie among the crew, the challenges posed by the Kichledai navy, and the captain's leadership.\n\nThe rules will be organized into the specified categories: **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category will provide comprehensive and granular guidance, ensuring the rules are actionable and tailored to the new writing prompt.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the fleet's departure, highlighting the anticipation and tension among the crew. Describe the captain's speech, focusing on themes of glory, trade, and reclaiming a homeland. For example, illustrate the captain standing on the deck, rallying the crew with promises of new trade routes and the honor of reclaiming their ancestral lands.\n  - Develop the plot through a series of encounters with the Kichledai navy, using these battles to test the crew's resolve and unity. Include a pivotal battle where the crew must use their diverse skills to outmaneuver the enemy, such as coordinating a surprise attack using wyvern riders and mages.\n  - Conclude with a reflection on the journey's impact on the crew, emphasizing the personal growth and strengthened bonds among them. Highlight the bittersweet nature of their achievements, balancing the glory of victory with the sacrifices made.\n\n- **Creativity**:\n  - Integrate fantastical elements, such as magic and mythical creatures, into the naval setting. Use these elements to enhance the narrative, such as describing a mage casting a protective barrier around the ship during a storm or a Pegasus-mounted cavalier scouting ahead for enemy ships.\n  - Explore the theme of reclaiming a lost homeland by weaving in cultural and historical references that enrich the backstory. For instance, include legends or songs that the crew shares about their homeland, creating a sense of shared heritage and purpose.\n\n- **Development (Character and Setting)**:\n  - Develop characters by focusing on their roles within the crew and their personal motivations. For example, portray a wyvern rider who seeks redemption for past failures or a mage who longs to prove their worth to the captain.\n  - Create a vivid setting by describing the fleet's journey through enemy waters, using sensory details to convey the atmosphere. Illustrate the contrast between the open sea and the looming threat of the Kichledai navy, such as the sight of enemy ships on the horizon or the sound of waves crashing against the hull.\n\n- **Language Use**:\n  - Employ vivid and descriptive language to create an immersive experience. Use detailed imagery to convey the majesty of the fleet and the tension of naval battles, such as the gleam of sunlight on the sails or the roar of cannon fire.\n  - Use dialogue to reveal character dynamics and build tension. Ensure the captain's speeches are inspiring and authoritative, while the crew's interactions reflect their diverse backgrounds and shared goals.\n  - Maintain a tone that balances the epic nature of the journey with the personal stakes for the characters. Use language that reflects the high stakes and emotional depth of the narrative, ensuring the reader is engaged with both the action and the characters' inner journeys.\n</story_rules>"
]