[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed, actionable rules under the categories of **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contained specific instructions that guided the narrative, character development, and language style. The rules were tailored to the unique elements of each writing prompt, ensuring that the narrative aligned with the themes and tone of the prompt.\n\nFor the new writing prompt, the rules will need to address the mysterious and fantastical nature of the labyrinth, the diverse backgrounds of the characters, and the overarching mystery of the force that brought them together. The rules should guide the creation of a rich, immersive setting and complex character interactions, while maintaining a consistent tone of suspense and wonder.\n\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with each character's initial experience of being pulled into the labyrinth, highlighting their confusion and disorientation.\n  - Gradually reveal the labyrinth's structure and the interconnected nature of its libraries, galleries, and corridors through the characters' explorations.\n  - Introduce the central mystery of the force that brought the characters together, using clues and encounters to build suspense and intrigue.\n  - Develop a series of challenges or puzzles that the characters must solve to progress through the labyrinth, emphasizing their cooperation and individual skills.\n  - Conclude the story with a revelation or confrontation at the heart of the labyrinth, providing answers to some questions while leaving others open to maintain a sense of mystery.\n\n- **Creativity**:\n  - Use vivid and imaginative descriptions to bring the labyrinth to life, emphasizing its ever-shifting nature and the surreal quality of its environments.\n  - Incorporate elements from each character's world into the labyrinth, creating a sense of interconnectedness and blending different genres and styles.\n  - Employ a mix of fantastical and eerie elements to create a unique atmosphere that keeps the reader engaged and curious.\n  - Explore themes of identity, memory, and destiny through the characters' interactions and experiences within the labyrinth.\n\n- **Development (Character and Setting)**:\n  - Develop each character's backstory and personality, ensuring they are distinct and their motivations for navigating the labyrinth are clear.\n  - Use the labyrinth as a dynamic setting that reflects the characters' inner struggles and growth, with each new area presenting opportunities for development.\n  - Create complex relationships between the characters, highlighting their differences and commonalities as they work together to uncover the labyrinth's secrets.\n  - Provide detailed descriptions of the labyrinth's various sections, using sensory language to immerse the reader in the setting and convey its otherworldly nature.\n\n- **Language Use**:\n  - Employ a descriptive and evocative language style, using rich imagery and sensory details to enhance the reader's immersion in the story.\n  - Use varied sentence structures and pacing to reflect the characters' experiences and the shifting nature of the labyrinth.\n  - Craft dialogue that reveals character and advances the plot, while maintaining a natural and authentic voice for each character.\n  - Maintain a consistent tone of suspense and wonder, reflecting the mysterious and fantastical elements of the labyrinth and the characters' journey.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed and structured rules under the categories of **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contained specific, actionable instructions tailored to the writing prompt, ensuring comprehensive guidance for narrative generation.\n\nFor the new writing prompt, the rules should focus on the themes of resistance, survival, and the cost of freedom. The tone should be serious and urgent, reflecting the high stakes and the struggle against the alien coalition. The narrative should explore the characters' motivations, the setting of a fallen world, and the tension between survival and resistance.\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a vivid description of the world under alien control, highlighting the contrast between the promised peace and the reality of oppression.\n  - Introduce the protagonist and their immediate circumstances, focusing on their internal conflict between mere survival and the desire to resist.\n  - Develop the plot through a series of encounters and events that force the protagonist to make difficult choices, revealing their character and the stakes involved.\n  - Conclude the story with a pivotal moment that encapsulates the protagonist's decision to resist, leaving the reader with a sense of hope and determination despite the overwhelming odds.\n\n- **Creativity**:\n  - Blend elements of dystopian fiction and sci-fi to create a unique and immersive world.\n  - Use symbolism and metaphors to convey the themes of freedom, resistance, and the cost of peace.\n  - Incorporate unexpected twists and turns to keep the reader engaged and to highlight the unpredictability of the resistance movement.\n  - Emphasize the moral and ethical dilemmas faced by the characters, adding depth and complexity to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist with a detailed backstory that explains their motivations and the personal cost of their decisions.\n  - Create a diverse cast of secondary characters, each with their own perspectives on the alien occupation and the resistance.\n  - Describe the setting in a way that emphasizes the stark contrast between the alien-controlled areas and the hidden enclaves of the resistance.\n  - Use the setting to reflect the themes of the story, such as the loss of freedom and the struggle for survival.\n\n- **Language Use**:\n  - Employ a serious and urgent tone, reflecting the high stakes and the tension of the situation.\n  - Use vivid and descriptive language to paint a clear picture of the world and the characters.\n  - Craft dialogue that reveals character and advances the plot, while maintaining a natural and authentic voice.\n  - Maintain a consistent narrative voice that reflects the protagonist's perspective, using language that conveys their emotions and state of mind.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided show a clear structure with categories: **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contains detailed, actionable rules that guide the narrative process. The rules are specific, avoiding comparative terms, and are tailored to the themes and tone of the writing prompt.\n\nFor the new writing prompt, the rules should focus on the themes of control, secrets, resistance, and the personal lives of the characters. The setting of a city rebuilt under alien rule should be vividly described, and the characters' roles as scientists, rebels, and dreamers should be well-developed. The narrative should balance the tension between the oppressive peace and the emerging resistance, using rich, evocative language to enhance the atmosphere.\n\n<story_rules>\n- **Plot**:\n  - Start the story with a scene that highlights the city's alien-controlled environment, establishing the oppressive peace and the underlying tension.\n  - Introduce the main characters—scientists, rebels, and dreamers—early on, showing their daily lives and the subtle ways they begin to notice the cracks in their society.\n  - Develop a central mystery or conflict that ties the characters together, such as a hidden truth about the alien rulers or a secret resistance movement.\n  - Build suspense through a series of discoveries and confrontations, gradually revealing the extent of the control and the potential for rebellion.\n  - Conclude with a climactic event that forces the characters to confront their own beliefs and decide whether to join the resistance or maintain the status quo.\n\n- **Creativity**:\n  - Blend elements of science fiction and dystopian genres to create a unique and compelling narrative.\n  - Use imaginative descriptions of alien technology and societal structures to enhance the world-building.\n  - Incorporate symbolic elements and motifs that reflect the themes of control, resistance, and hidden truths.\n  - Explore the characters' dreams and aspirations, using them as a contrast to the controlled reality they live in.\n\n- **Development (Character and Setting)**:\n  - Provide detailed backstories for each character, explaining their motivations and how they came to be in their current roles.\n  - Develop the city as a character in itself, with vivid descriptions of its architecture, atmosphere, and the ways in which alien control is manifested.\n  - Show the characters' relationships and interactions, highlighting the tensions and alliances that form as they uncover the truth.\n  - Use the setting to reflect the story's themes, such as the contrast between the city's outward peace and the underlying unrest.\n\n- **Language Use**:\n  - Employ rich, descriptive language to create a vivid and immersive setting.\n  - Use a formal yet engaging tone that reflects the gravity of the situation and the characters' struggles.\n  - Craft dialogue that reveals character and advances the plot, while maintaining authenticity and depth.\n  - Maintain a consistent narrative voice that aligns with the story's themes and enhances the overall atmosphere of tension and intrigue.\n</story_rules>"
]