[
    "<thinking>  \nTo generate the Story Rules, I will analyze the Author Writing Sheet for each category—Plot, Creativity, Development (Character and Setting), and Language Use. I will identify the unique storytelling elements and techniques used by the author and tailor them to the Writing Prompt: \"No, mom. I'm not a grave robber, I'm a dungeon crawler. And no, it's not the same thing, dad!\" This prompt suggests a humorous and adventurous tone, focusing on the protagonist's defense of their unconventional hobby to their parents. I will ensure the Story Rules reflect the author's style while aligning with the prompt's themes and tone.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the narrative around a humorous and adventurous confrontation between the protagonist and their parents, exploring themes of misunderstanding and acceptance. For example, the protagonist might recount their latest dungeon crawl, emphasizing the differences between dungeon crawling and grave robbing through a series of humorous anecdotes and misunderstandings.\n  - Develop the plot around a confident protagonist who actively engages in dungeon crawling, leading to unexpected and humorous outcomes. For instance, the protagonist could describe a mishap where they accidentally triggered a trap that released a swarm of enchanted brooms, causing chaos in the dungeon.\n  - Integrate a series of historical anecdotes related to famous dungeon crawlers or legendary treasures to engage the parents and challenge their perception of the protagonist's hobby. The protagonist might recount tales of legendary adventurers who found fame and fortune through dungeon crawling.\n  - Use multiple interconnected storylines to explore different aspects of dungeon crawling. For example, the narrative could shift between the protagonist's current dungeon adventure, their parents' reactions, and flashbacks to previous dungeon crawls that highlight the protagonist's growth and experiences.\n  - Focus on personal relationships and character interactions rather than external conflict. The plot should center on the protagonist's interactions with their parents, friends, and fellow dungeon crawlers, highlighting the humorous and heartfelt moments that arise from their unconventional hobby.\n\n- **Creativity**:  \n  - Creatively reinterpret the prompt by blending traditional dungeon crawling elements with modern-day settings and humor. For example, the protagonist might describe using a smartphone app to locate hidden dungeons or employing everyday items like a vacuum cleaner to clear out cobwebs.\n  - Integrate culinary themes with magical elements to add a whimsical touch to the narrative. The protagonist could describe finding a magical cookbook in a dungeon that contains recipes for enchanted dishes, leading to humorous and unexpected culinary experiments.\n  - Blend historical and mythological elements to highlight the unique impact of dungeon crawling. The protagonist might compare their adventures to legendary quests, drawing parallels between their experiences and those of famous heroes from history and mythology.\n  - Use a blend of fantasy and science fiction elements to create a unique and imaginative world. The protagonist could encounter futuristic technology within ancient dungeons, such as robotic guardians or holographic maps, adding a sci-fi twist to their adventures.\n  - Subvert traditional dungeon crawling tropes by portraying the protagonist as a community caretaker. For example, the protagonist might reveal that they use the treasures they find to support local charities or help rebuild their community, challenging the stereotype of dungeon crawlers as selfish treasure hunters.\n\n- **Development (Character and Setting)**:  \n  - Develop characters through dialogue that reveals their biases and potential for growth. The parents' initial skepticism and eventual understanding of the protagonist's hobby should be illustrated through their conversations and changing perceptions.\n  - Use interactions and reactions to the protagonist's dungeon crawling adventures to add depth and humor. The protagonist's friends and fellow dungeon crawlers could react with excitement or disbelief to their latest finds, while the parents might express concern or amusement.\n  - Develop characters through their interactions with historical and mythological narratives. The protagonist could share stories of legendary dungeon crawlers with their parents, sparking curiosity and interest in their hobby.\n  - Highlight the protagonist's internal motivations and strategic thinking. The protagonist's internal dialogue should reveal their passion for dungeon crawling and their calculated approach to navigating dungeons and avoiding traps.\n  - Use interactions that reveal backstories and motivations. The protagonist's parents might share their own adventurous pasts or reveal their concerns for the protagonist's safety, adding depth to their characters and their relationship with the protagonist.\n\n- **Language Use**:  \n  - Employ dialogue to convey tension and character dynamics, using it as a primary tool for storytelling. The protagonist's conversations with their parents should highlight the cultural clash and their plea for understanding, with lines like, \"What I do is not grave robbing, it's preserving history!\"\n  - Use a humorous and light-hearted tone, employing dialogue and descriptions to enhance the whimsical nature of the story. The protagonist's dialogue should be filled with witty remarks and humorous observations, such as, \"You wouldn't believe the number of skeletons who just want to chat about their past lives.\"\n  - Use detailed descriptions and historical references to create an engaging narrative. The protagonist should vividly describe the dungeons they explore, using imagery to emphasize the excitement and danger of their adventures.\n  - Employ formal and elevated language to enhance the mythological tone when recounting legendary dungeon crawlers and their quests. Phrases like, \"In the annals of history, the greatest adventurers were not mere grave robbers, but seekers of lost knowledge and hidden treasures,\" can add a grandiose atmosphere.\n  - Use vivid and imaginative language to create an otherworldly atmosphere. Descriptions of the dungeons and their inhabitants should evoke a fantastical and surreal tone, with phrases like, \"The walls of the dungeon glowed with an eerie, phosphorescent light, casting long shadows that danced like specters.\"\n\n</story_rules>",
    "<thinking>  \nAnalyze the Author Writing Sheet for all four categories in depth to infer patterns, unique traits, and key elements of the author’s storytelling style. Reflect on how these elements can be adapted to suit the Writing Prompt. Use this analysis to craft **Story Rules** enriched with tailored examples inspired by the Evidence, ensuring alignment with both the Writing Prompt and the Author Writing Sheet.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative around a judicial confrontation to explore themes of justice and cultural misunderstanding. For example, include a scene where the protagonist must defend their accidental victory in front of a council of mages, highlighting the tension and eventual understanding through a formal judicial process.\n  - Develop the plot around a confident protagonist who humorously engages with their new role, leading to unexpected outcomes. For instance, the protagonist might declare, \"I plan on mastering every spell in this tome,\" only to accidentally summon a harmless but chaotic creature, causing uproar among the mages.\n  - Integrate multiple interconnected storylines to enrich the narrative. Shift between the protagonist's personal struggles, the political machinations of the mage council, and the reactions of the magical community to the protagonist's new position.\n  - Focus on personal relationships and character interactions rather than external conflict. Highlight the protagonist's interactions with other mages, such as forming an unlikely friendship with a skeptical but kind-hearted mage who helps them navigate their new responsibilities.\n\n- **Creativity**:\n  - Use a courtroom-like setting to reinterpret the prompt, focusing on legal and ethical dilemmas. For example, create a scene where the protagonist must explain their accidental victory to a panel of judges, emphasizing the absurdity and ethical implications of the situation.\n  - Blend culinary themes with magical elements for a whimsical touch. Include a humorous scene where the protagonist attempts to brew a potion but ends up creating a delicious but magical soup that causes unexpected effects, like making everyone who eats it float.\n  - Integrate mythological elements and epic quests to add depth to the narrative. For instance, the protagonist might be tasked with retrieving a legendary artifact to prove their worth, encountering various mythical creatures and challenges along the way.\n  - Subvert traditional mage tropes by portraying the protagonist as a community caretaker. Show how the protagonist, despite their lack of magical skill, uses their position to help others in practical ways, such as organizing community events or mediating disputes.\n\n- **Development (Character and Setting)**:\n  - Develop characters through dialogue that reveals their biases and potential for growth. For example, include a scene where a senior mage initially dismisses the protagonist but gradually comes to respect their unique approach to problem-solving.\n  - Use interactions and reactions to the protagonist's magical mishaps to add depth and humor. Show how different characters react to the protagonist's accidental spells, such as a stern mage's exasperation turning into reluctant amusement.\n  - Develop characters through their divine challenges and interactions with the protagonist. Introduce characters with distinct personalities and roles, such as a wise mentor who provides guidance and a rival who constantly challenges the protagonist's legitimacy.\n  - Focus on internal motivations and strategic thinking. Highlight the protagonist's internal dialogue as they navigate their new role, revealing their insecurities and their determination to prove themselves despite their lack of traditional magical talent.\n\n- **Language Use**:\n  - Employ dialogue to convey tension and character dynamics, using it as a primary tool for storytelling. For example, use lines like, \"What I did to win was pure luck, not skill,\" to highlight the protagonist's honesty and the council's skepticism.\n  - Use a humorous and light-hearted tone, with dialogue and descriptions enhancing the whimsical nature of the story. Include playful banter and humorous descriptions, such as, \"The spellbook's instructions were as clear as mud, but I gave it a shot anyway.\"\n  - Use detailed descriptions and historical references to create an engaging narrative. Describe the ancient traditions and the grandeur of the mage council's chambers to emphasize the protagonist's out-of-place feeling.\n  - Employ a conversational and humorous tone to convey the protagonist's perspective. Use casual and reflective dialogue, such as, \"Am I really supposed to be here?\" to highlight the protagonist's internal conflict and add levity to the narrative.\n</story_rules>",
    "<thinking>  \nAnalyze the Author Writing Sheet for all four categories in depth to infer patterns, unique traits, and key elements of the author’s storytelling style. Reflect on how these elements can be adapted to suit the Writing Prompt. Use this analysis to craft **Story Rules** enriched with tailored examples inspired by the Evidence, ensuring alignment with both the Writing Prompt and the Author Writing Sheet.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative around a judicial confrontation to explore themes of justice and cultural misunderstanding. For example, include a scene where different species argue their case before a cosmic judge about why they deserve to survive in the new dimension.\n  - Develop the plot around a confident protagonist who actively engages with the survival challenge, leading to humorous and unexpected outcomes. For instance, the protagonist might declare, \"I plan on winning this survival game with style,\" and humorously recount their mishaps, such as accidentally taming a ferocious beast with a snack.\n  - Integrate historical anecdotes to engage the characters and provide context for their survival strategies. For example, characters might recall ancient battles or survival tactics from their home planets to inspire their current actions.\n  - Use multiple interconnected storylines to show the diverse experiences of different species in the new dimension. Shift between various characters and settings, such as a warrior from a desert planet, a scientist from an oceanic world, and a mystic from a forest realm, each facing unique survival challenges.\n  - Focus on personal relationships and character interactions rather than external conflict. Highlight moments where characters form alliances, share their backstories, and develop mutual respect despite their differences.\n\n- **Creativity**:\n  - Use a courtroom-like setting to reinterpret the prompt, focusing on legal and ethical dilemmas. For example, characters might have to present their case to a cosmic tribunal to justify their survival strategies and actions.\n  - Blend culinary themes with magical elements to add whimsy to the survival narrative. For instance, a character might use enchanted food to gain temporary powers or create humorous situations, like accidentally summoning a food-based creature.\n  - Integrate mythological elements and epic quests to reinterpret the survival challenge. Characters might be tasked with completing legendary trials, such as retrieving a sacred artifact or defeating a mythical beast, to prove their worthiness.\n  - Employ a blend of fantasy and science fiction elements to create a unique survival world. Introduce characters with non-human traits and advanced technology, such as a cyborg with a plasma sword or an alien with telepathic abilities, to enhance the narrative's diversity.\n  - Subvert traditional survival tropes by portraying characters in unexpected roles. For example, a typically villainous species might be shown as compassionate caretakers, or a seemingly weak character might reveal hidden strengths and strategic brilliance.\n\n- **Development (Character and Setting)**:\n  - Develop characters through dialogue that reveals their biases and potential for growth. For instance, a character might initially distrust another species but gradually learn to appreciate their unique skills and perspectives.\n  - Use interactions and reactions to the survival challenges to add depth and humor. Characters might react to unexpected situations with surprise, frustration, or amusement, revealing their personalities and building camaraderie.\n  - Highlight characters' internal motivations and strategic thinking. Show their thought processes as they plan their survival strategies, form alliances, and navigate the new dimension's dangers.\n  - Develop characters through their divine challenges and interactions with the protagonist. Each character might face unique trials that reflect their strengths and weaknesses, leading to personal growth and deeper relationships.\n  - Use non-human traits and motivations to create distinct and memorable characters. For example, an alien with wings might have a different perspective on survival, focusing on aerial tactics and high vantage points.\n\n- **Language Use**:\n  - Employ dialogue to convey tension and character dynamics, using it as a primary tool for storytelling. For example, characters might argue about the best survival strategies or share their fears and hopes through intense conversations.\n  - Use a humorous and light-hearted tone to balance the survival narrative's tension. Include witty dialogue and amusing descriptions, such as a character joking about their unlikely survival skills or making light of a dangerous situation.\n  - Use detailed descriptions and historical references to create an engaging narrative. Describe the new dimension's environment vividly, comparing it to familiar historical or mythological settings to enhance immersion.\n  - Employ formal and elevated language to enhance the mythological tone. Use grandiose phrases and epic descriptions to convey the gravity of the survival challenge and the characters' heroic efforts.\n  - Use vivid and imaginative language to create an otherworldly atmosphere. Describe the new dimension's unique flora, fauna, and landscapes with rich, evocative imagery to transport readers into the story's fantastical world.\n</story_rules>",
    "<thinking>  \nTo generate the Story Rules, I will analyze the Author Writing Sheet for each category—Plot, Creativity, Development (Character and Setting), and Language Use. I will identify the unique storytelling elements and techniques used by the author and tailor them to the Writing Prompt about reincarnation as the god of a newly formed universe. I will ensure the rules are actionable, detailed, and aligned with both the author's style and the Writing Prompt.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the narrative around a judicial confrontation to explore themes of justice and cultural misunderstanding. For example, as the newly reincarnated god, create a scenario where you must mediate a dispute between two newly formed species, each with its own cultural practices and sense of justice. Use dialogue to highlight the tension and eventual understanding, such as, \"What you call a crime is a sacred ritual to us,\" one species might argue.\n  - Develop the plot around a confident protagonist who actively engages with their divine powers, leading to humorous and unexpected outcomes. For instance, the god might confidently declare, \"I will create the perfect world,\" only to humorously recount, \"The only black mark on my history was accidentally creating a planet of sentient cheese.\"\n  - Use a series of historical anecdotes to engage the newly formed beings. The god could recount events from their past life to teach lessons, such as, \"In my previous life, we had a war called the Trojan War, which taught us the value of cunning over brute force.\"\n  - Structure the plot around a series of divine quests that culminate in a significant event, such as the creation of a new pantheon. The god might be tasked with creating a rare celestial object, taming a cosmic beast, and establishing a divine council, leading to a grand celestial celebration.\n  - Introduce multiple interconnected storylines. For example, shift between different realms and characters, such as a celestial being in the heavens, a mortal hero on a quest, and a wise sage in a mystical forest, each dealing with the theme of creation and divine influence.\n  - Focus on personal relationships and character interactions rather than external conflict. Develop the god's relationships with their creations, such as a close bond with a mortal who seeks their guidance, emphasizing dialogue and shared experiences.\n  - Use strategic manipulation of roles and expectations. The god might consider befriending rebellious mortals and guiding them subtly, thinking, \"What if I choose a few mortals to mentor and shape their destinies? I'm divine enough to not look manipulative.\"\n  - Introduce external conflict through outsider perspectives to explore the theme of acceptance. For instance, introduce a group of celestial beings who are skeptical of the god's methods, creating tension that is resolved as they learn about the god's true intentions and benevolent nature.\n  - Use a reflective interview format to reveal the god's journey. The narrative could unfold through an interview with a celestial historian, where the god recounts their rise from a mortal to a divine being, sharing insights and lessons learned.\n\n- **Creativity**:  \n  - Use a courtroom-like setting to reinterpret the prompt, focusing on legal and ethical dilemmas. For example, the god might preside over a celestial court where newly formed beings must justify their actions and cultural practices.\n  - Blend culinary themes with divine elements, resulting in a whimsical reinterpretation of the prompt. The god could create divine feasts with magical properties, such as, \"This ambrosia will grant you the wisdom of the ages,\" leading to humorous and unexpected consequences.\n  - Integrate human history with cosmic events to highlight humanity's unique impact. The god might draw parallels between historical events from their past life and significant cosmic milestones, such as, \"Just as the first FTL flight changed the galaxy, my creation of this star system will change the universe.\"\n  - Integrate mythological elements and epic quests to reinterpret the prompt. The god could undertake mythic tasks, such as forging a celestial weapon or taming a primordial beast, reminiscent of classic hero myths.\n  - Employ a blend of fantasy and science fiction elements. Create a unique universe with fantastical creatures and advanced technology, such as, \"The golden carapace of the celestial guardian shimmered as it activated its plasma shield.\"\n  - Integrate elements of nostalgia and legacy into the narrative. The god might create elements in the new universe that reflect their past life, such as, \"This constellation is a tribute to my homeland, a reminder of where I came from.\"\n  - Blend traditional fantasy elements with a subversive twist on the protagonist's role. The god might choose an unconventional form, such as a playful trickster deity, contrasting with typical divine forms, and use this to their advantage.\n  - Subvert traditional god tropes by portraying the god as a caretaker of the universe. The god might be depicted as nurturing and protective, ensuring the well-being of their creations, such as, \"I am not just a creator, but a guardian of all life.\"\n  - Use the concept of a divine network to explore unintended consequences. The god's interactions with other deities and celestial beings could lead to unexpected outcomes, such as, \"By collaborating with the goddess of fate, I inadvertently altered the course of destiny.\"\n\n- **Development (Character and Setting)**:  \n  - Develop characters through dialogue that reveals their biases and potential for growth. For example, the god's interactions with a skeptical celestial being could reveal their initial mistrust and eventual acceptance, such as, \"You may be a god, but I need to see your actions before I trust you.\"\n  - Develop characters through their interactions and reactions to the god's divine experiments, adding depth and humor. The reactions of celestial beings to the god's creations, such as, \"The celestial council's eyes widened in awe as the new star system came to life,\" can add humor and depth.\n  - Develop characters through their interactions and reactions to historical narratives. The god's recounting of past life events could elicit various reactions from celestial beings, such as, \"The young celestial's eyes sparkled with curiosity as the god spoke of ancient wars and lost civilizations.\"\n  - Develop characters through their divine challenges and interactions with the god. Each celestial being could present unique challenges to the god, reflecting their distinct personalities and roles, such as, \"The goddess of wisdom challenged the god to solve an ancient riddle, while the god of war demanded a test of strength.\"\n  - Develop characters with distinct non-human traits and motivations. Create celestial beings with unique characteristics and motivations, such as, \"The celestial guardian, with its golden wings and unyielding sense of duty, stood watch over the new universe.\"\n  - Develop characters through their relationships and shared history. The god's interactions with celestial beings who share a past connection, such as, \"The god and the celestial sage reminisced about their past lives, forging a deeper bond.\"\n  - Develop characters with a focus on their internal motivations and strategic thinking. The god's internal dialogue could reveal their calculated approach to creation and power, such as, \"I must balance creation and destruction to maintain harmony in the universe.\"\n  - Develop characters through interactions that reveal their backstories and motivations. The god's interactions with celestial beings could hint at their past lives and motivations, such as, \"The celestial warrior's scars told a story of countless battles fought in the name of justice.\"\n  - Develop characters through dialogue that reveals their motivations and unintended outcomes. The god's conversations with celestial beings could reveal their intentions and the surprising consequences of their actions, such as, \"I intended to create a peaceful world, but my actions have led to unforeseen chaos.\"\n\n- **Language Use**:  \n  - Employ dialogue to convey tension and character dynamics, using it as a primary tool for storytelling. For example, use dialogue between the god and celestial beings to highlight cultural clashes and resolutions, such as, \"Your ways are strange to us, but we see the wisdom in your actions.\"\n  - Use a humorous and light-hearted tone, using dialogue and descriptions to enhance the whimsical nature of the story. The god's playful interactions with celestial beings, such as, \"Watch as I create a planet of dancing stars,\" can add a whimsical touch.\n  - Use detailed descriptions and historical references to create an engaging narrative. Describe the new universe with vivid imagery, such as, \"The newly formed galaxies shimmered like jewels in the cosmic sea, each one a testament to the god's creative power.\"\n  - Employ formal and elevated language to enhance the mythological tone. Use grandiose language to describe the god's actions and the celestial events, such as, \"With a wave of their hand, the god summoned a celestial storm, its thunderous roar echoing through the heavens.\"\n  - Use vivid and imaginative language to create an otherworldly atmosphere. Describe the celestial beings and their realms with imaginative language, such as, \"The celestial guardian's golden carapace glowed with an ethereal light, casting a radiant aura across the heavens.\"\n  - Use dialogue to reveal character traits and build relationships. The god's conversations with celestial beings can reveal their personalities and relationships, such as, \"The god's gentle words soothed the anxious celestial, forging a bond of trust.\"\n  - Employ a conversational and humorous tone to convey the protagonist's perspective. The god's casual and humorous language, such as, \"Creating a universe is harder than it looks,\" can add levity to the narrative.\n  - Use dialogue to convey character dynamics and advance the plot. The god's interactions with celestial beings can drive the narrative forward, such as, \"The celestial council debated the god's latest creation, each member voicing their concerns and hopes.\"\n  - Employ conversational language to create an engaging and introspective tone. The god's reflective dialogue, such as, \"Am I truly worthy of this divine power?\" can add depth to the narrative and highlight the god's internal conflict.\n\n</story_rules>",
    "<thinking>  \nTo generate the Story Rules, I will analyze the Author Writing Sheet for each category—Plot, Creativity, Development (Character and Setting), and Language Use. I will identify the unique storytelling elements and techniques used by the author and tailor them to the Writing Prompt, which involves a confrontation with Death and themes of defiance and authority. I will ensure the rules are actionable, detailed, and aligned with the prompt, incorporating specific examples inspired by the Author Writing Sheet.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative around a judicial confrontation to explore themes of justice and defiance. Begin with the protagonist being summoned before Death, who questions their right to remain standing when all others bow. Use this confrontation to delve into the protagonist's past actions and moral justifications.\n    - Example: \"Death's eyes narrowed as the protagonist stood tall. 'And who are you to remain standing?' Death's voice echoed. The protagonist replied, 'I am the one who defied the gods to save my people.'\"\n  - Incorporate a series of historical anecdotes to engage the reader and provide context for the protagonist's defiance. Use these anecdotes to highlight the protagonist's significant actions and their impact on the world.\n    - Example: \"The protagonist recounted the Battle of the Crimson Fields, where they single-handedly turned the tide against the invading hordes, earning the title 'Savior of the Realm.'\"\n  - Develop multiple interconnected storylines that converge at the confrontation with Death. Each storyline should reveal different aspects of the protagonist's character and their journey.\n    - Example: \"As Death questioned the protagonist, scenes from their past flashed before their eyes: the betrayal by a trusted ally, the rescue of a village from a dragon, and the forging of an alliance with the elves.\"\n\n- **Creativity**:\n  - Use a courtroom-like setting to reinterpret the prompt, focusing on the legal and ethical dilemmas faced by the protagonist. Create a scenario where the protagonist must defend their actions before Death, who acts as both judge and executioner.\n    - Example: \"The protagonist stood in a grand hall, with Death seated on a throne of bones. 'State your case,' Death commanded, and the protagonist began to recount their deeds.\"\n  - Blend mythological elements with epic quests to reinterpret the prompt. Include tasks that the protagonist undertook to earn their right to defy Death, such as slaying mythical beasts or retrieving sacred artifacts.\n    - Example: \"The protagonist spoke of the time they ventured into the Underworld to retrieve the Heart of the Phoenix, a task deemed impossible by many.\"\n  - Integrate elements of nostalgia and legacy into the narrative. Highlight the protagonist's connection to past heroes and their continuation of a noble lineage.\n    - Example: \"The protagonist's armor bore the crest of their ancestors, a symbol of a legacy that spanned generations of warriors who stood against tyranny.\"\n\n- **Development (Character and Setting)**:\n  - Develop characters through dialogue that reveals their biases and potential for growth. Use the confrontation with Death to showcase the protagonist's inner strength and moral convictions.\n    - Example: \"Death sneered, 'You think yourself above the natural order?' The protagonist's voice was steady, 'I believe in a higher justice, one that transcends even you.'\"\n  - Develop characters through their interactions and reactions to the protagonist's defiance. Show how other characters, such as allies or adversaries, respond to the protagonist's unwavering stance.\n    - Example: \"The protagonist's loyal companion, a mage, stepped forward, 'I stand with them, for they have shown me the true meaning of courage.'\"\n  - Create a vivid and imaginative setting that enhances the otherworldly atmosphere of the confrontation. Describe the realm of Death with rich, evocative language.\n    - Example: \"The hall was shrouded in shadows, with flickering torches casting eerie light on the skeletal figures that lined the walls.\"\n\n- **Language Use**:\n  - Employ dialogue to convey tension and character dynamics. Use it as a primary tool for storytelling, especially during the confrontation with Death.\n    - Example: \"Death's voice was a cold whisper, 'You defy me, yet you know the cost.' The protagonist's reply was firm, 'I accept the cost, for my cause is just.'\"\n  - Use a formal and elevated language to enhance the mythological tone of the narrative. This will add gravitas to the protagonist's defiance and the confrontation with Death.\n    - Example: \"The protagonist's words rang out, 'I am the last of the line of heroes, and I shall not bow to you, O Death.'\"\n  - Employ vivid and imaginative language to create an otherworldly atmosphere. Use descriptive phrases to evoke the surreal and ethereal nature of Death's realm.\n    - Example: \"The air was thick with the scent of decay, and the walls seemed to pulse with a life of their own, as if the very essence of death permeated the space.\"\n\n</story_rules>"
]