[
    "<thinking>  \nAnalyze the Author Writing Sheet for all four categories in depth to infer patterns, unique traits, and key elements of the author’s storytelling style. Reflect on how these elements can be adapted to suit the Writing Prompt. Use this analysis to craft **Story Rules** enriched with tailored examples inspired by the Evidence, ensuring alignment with both the Writing Prompt and the Author Writing Sheet.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative with disjointed and surreal events to convey the protagonist's mental struggle. For example, have the protagonist experience abrupt transitions between different cosmic settings, such as floating in a void, standing on a planet's surface, and being engulfed by a supernova, each leading to new and unexpected scenarios.\n  - Center the story around the protagonist's internal conflict and self-realization, using confrontations with the council to highlight their struggles. For instance, depict a scene where the protagonist argues with a council member, dodging a cosmic energy blast and retaliating with their own powers, illustrating their frustration and determination to prove their worth.\n  - Emphasize the psychological effects of isolation by showing the protagonist's prolonged solitude in the void between universes. Include reflections like, \"It's been eons since I last saw another being. The stars have become my only companions.\"\n  - Use a guided tour of the council's domain as a framework to introduce various elements of the narrative. For example, have the protagonist be led through different chambers, each representing a different aspect of the council's power and history.\n  - Highlight the protagonist's internal preparation and anxiety about proving their immortality and experience. Show them meticulously practicing their cosmic abilities and rehearsing their arguments, aware that \"any sign of weakness could lead to rejection.\"\n\n- **Creativity**:\n  - Employ humor and irony to reinterpret the prompt, creating a unique tone. For example, have the protagonist humorously comment on the absurdity of the council's requirements, such as, \"So, ending a universe isn't enough? Next, they'll ask me to juggle black holes.\"\n  - Integrate elements of a cosmic school setting and martial arts to reinterpret the theme of immortality. For instance, depict the protagonist training in a celestial dojo, using their powers in unconventional ways, like healing a star after a supernova.\n  - Use a storytelling format that blends personal anecdotes with communal interaction. For example, have the protagonist recount their experiences to the council, interspersed with reactions and questions from the members, creating a dynamic and engaging narrative.\n  - Focus on the psychological impact of long-term isolation rather than immediate survival. Include musings like, \"What's killing me the most is the endless silence... Even the stars' whispers have faded.\"\n  - Use repetitive motifs to emphasize the protagonist's mental entrapment. For example, repeat the phrase \"Another universe, another chance\" to symbolize the monotonous cycle the protagonist is trapped in while trying to prove their worth.\n  - Integrate a unique blend of magical realism and introspection to reinterpret the prompt. For instance, use magical elements like cosmic energy and celestial spells to explore the protagonist's internal struggle, symbolizing their attempt to rise above their emotional turmoil.\n  - Explore the theme of sentience through the protagonist's strategic behavior and internal monologue. For example, have the protagonist reflect on the implications of their actions on their immortality status, considering paradoxes and philosophical dilemmas.\n  - Reimagine the prompt by exploring the concept of time and aging in a cosmic context. For instance, depict the protagonist experiencing time differently, with centuries passing in moments, highlighting a unique twist on the passage of time and its impact on their life.\n  - Employ surreal elements to explore the theme of self-discovery. For example, have the protagonist encounter their future self in a surreal cosmic setting, using vivid imagery to delve into the theme of self-discovery.\n\n- **Development (Character and Setting)**:\n  - Develop characters through dialogue and interactions that reveal their personalities and relationships. For example, show the protagonist's interactions with the council members, such as a stern member questioning their motives and a sympathetic member offering support, revealing the dynamics of the council.\n  - Develop a multidimensional character through introspection and past experiences, highlighting a deep sense of loneliness. Include reflections like, \"I... didn't really have anywhere to go. Family, friends, romance... it all just sorta faded away through the eons.\"\n  - Establish an immersive setting by using sensory details and character interactions to create a vivid atmosphere. For example, describe the council's domain with details like \"The chamber was filled with the hum of cosmic energy, the walls adorned with shifting constellations,\" enhancing the story's tone.\n  - Establish an immersive setting by detailing the harsh and unchanging cosmic environment, reinforcing the theme of isolation. For instance, describe the void between universes as, \"A vast expanse of nothingness, where time and space seemed to stand still.\"\n  - Develop characters through dynamic interactions and dialogue, revealing their personalities and relationships. For example, show the protagonist's banter with a fellow immortal, showcasing their personality and establishing a rapport with the characters.\n  - Develop characters through intense emotional exchanges and moral dilemmas. For instance, depict a heated argument between the protagonist and a council member, revealing deep-seated resentment and differing values.\n  - Establish a setting that reflects the protagonist's inner devastation and conflict. For example, describe a desolate cosmic landscape with \"barren planets and dying stars,\" symbolizing the aftermath of the protagonist's choices.\n  - Develop the protagonist as a multidimensional character through their internal conflict and societal challenges. For instance, show the protagonist concealing their true nature from the council, noting that \"revealing my origins could jeopardize my acceptance.\"\n  - Develop the protagonist's character through introspection and gradual transformation over eons. For example, depict the protagonist evolving from a hopeful youth to a powerful, aged figure who ultimately breaks free from their cosmic confinement, reflecting a deep internal journey.\n  - Develop the protagonist through their adaptability and nonchalant attitude towards bizarre situations. For instance, show the protagonist's adaptability when they nonchalantly navigate through different cosmic settings, indicating a level of comfort and acceptance of their unusual circumstances.\n\n- **Language Use**:\n  - Employ informal and colloquial language to create a relatable and youthful tone. For example, use lines like \"Wonder if I'll ever get out of this mess,\" and \"I'm not dealing with this cosmic nonsense,\" to contribute to the story's humorous and laid-back tone.\n  - Use colloquial and conversational language to create an authentic and relatable narrative voice. For instance, have the protagonist's speech filled with informal expressions and humor, such as \"YEAH, LAUGH, ya cosmic beings,\" adding to the story's realism and character depth.\n  - Use humor and informal dialogue to lighten the tone and engage the audience. For example, have the protagonist humorously recount their mishaps during their cosmic journey, eliciting laughter and camaraderie among the council members.\n  - Employ a conversational and introspective tone, using first-person narration to create an intimate connection with the reader. For instance, have the protagonist narrate, \"The first sounds I try to make are... almost inhuman. It's been eons since I last spoke to anyone.\"\n  - Use vivid imagery and sensory details to convey the protagonist's experience and the setting's desolation. For example, describe the cosmic void as, \"The silence was deafening, the stars' whispers barely audible.\"\n  - Use dialogue to reveal character traits and build a connection between the protagonist and the council members. For instance, have a council member warn, \"If you can't prove your immortality, you won't be able to join us.\"\n  - Use vivid sensory details to create an immersive and chaotic atmosphere. For example, describe the protagonist's mental landscape with details like \"the warm watered down grime of bliss\" and \"sharp drooling teeth and a featureless black void,\" evoking a visceral response.\n  - Use conversational and informal language to create an engaging and accessible narrative. For instance, have the protagonist's speech be casual and direct, as seen in lines like, \"If you can't handle my story, you may leave the chamber.\"\n  - Employ vivid and sensory language to convey the protagonist's emotional and physical state. For example, use phrases like \"Pain searing from the tip of my forehead down towards my spine\" to vividly depict the protagonist's physical and emotional pain.\n  - Use dialogue to reveal character motivations and conflicts. For instance, have a council member accuse, \"You were gambling with the fate of the universe! All because you wanted the glory, the prestige,\" highlighting the underlying motivations and tensions between the characters.\n</story_rules>",
    "<thinking>  \nTo generate the Story Rules, I will analyze the Author Writing Sheet for each category—Plot, Creativity, Development (Character and Setting), and Language Use. I will identify the unique storytelling elements and techniques used by the author and tailor them to the given Writing Prompt. The Writing Prompt involves a protagonist who opposes a man falsely chosen by the stars to lead, focusing on themes of leadership, ambition, and resistance. I will ensure the Story Rules reflect the author's style while aligning with these themes.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the narrative with disjointed and surreal events to convey the protagonist's mental struggle. For example, have the protagonist experience abrupt transitions between different settings, such as a grand hall filled with star charts, a desolate battlefield, and a serene garden, each representing different aspects of their internal conflict about the false leader.\n  - Center the story around the protagonist's internal conflict and self-realization. Use confrontations to highlight their struggles, such as a heated argument where the protagonist dodges a thrown object and retaliates, symbolizing their fight against the false leader's ambition.\n  - Emphasize the psychological effects of solitude by incorporating a prolonged period of isolation for the protagonist. For instance, describe how the protagonist spends months in a secluded observatory, reflecting on the misalignment of the stars and their own role in preventing the false leader's rise.\n  - Use a guided tour as a framework to introduce various elements of the narrative. Have the protagonist lead a group of allies through a hidden archive, explaining the history and significance of the stars' omens and the dangers of the false leader's ambition.\n  - Focus on the protagonist's internal preparation and anxiety about confronting the false leader. Detail their meticulous planning and practice, such as rehearsing speeches and strategies, aware that any misstep could lead to disaster.\n  - Highlight the long-term consequences of the false leader's rise. Show the protagonist reflecting on potential future scenarios, from societal collapse to personal loss, illustrating the stakes of their resistance.\n  - Incorporate a surreal and introspective encounter. Have the protagonist enter a mysterious chamber through a hidden door, where they confront a vision of the false leader in a setting with \"a black tiled floor and pure red velvet curtains,\" creating an atmosphere of introspection and surrealism.\n\n- **Creativity**:  \n  - Employ humor and irony to reinterpret the prompt, creating a unique tone. For example, have the protagonist sarcastically comment on the absurdity of the false leader's claims, such as joking about the stars' \"sense of humor\" in choosing him.\n  - Integrate elements of a school setting and martial arts to reinterpret the theme of leadership. Describe a scene where the protagonist participates in a training session, using their skills to outmaneuver the false leader's supporters in a sparring match.\n  - Use a storytelling format that blends personal anecdotes with communal interaction. Have the protagonist recount their experiences and doubts about the false leader to a group of trusted allies, interspersed with their reactions and questions.\n  - Focus on the psychological impact of the false leader's rise rather than immediate political consequences. Describe the protagonist's internal musings, such as, \"What's killing me the most is the thought of him leading... But you can't even trust the stars anymore.\"\n  - Use repetitive motifs to emphasize the protagonist's mental entrapment. Repeat phrases like \"Another sleepless night\" to symbolize the protagonist's ongoing struggle and anxiety about the false leader's ambition.\n  - Integrate a unique blend of magical realism and introspection. Describe how the protagonist uses a magical artifact, like a star map, to explore their internal struggle and find clarity in their mission to oppose the false leader.\n  - Explore the theme of sentience through the protagonist's strategic behavior and internal monologue. Have the protagonist reflect on the implications of the false leader's rise, considering how \"misaligned stars are a standard reason for leadership denial.\"\n  - Reimagine the prompt by exploring the concept of time and aging in a magical context. Describe how the protagonist experiences time differently, perhaps aging slower due to their connection with the stars, highlighting the long-term impact of their resistance.\n  - Employ surreal elements to explore the theme of self-discovery. Describe the protagonist's encounter with a vision of their future self, involving surreal imagery like \"a cool gel\" mirror and a room with \"a blaze of color and darkness,\" delving into their fears and hopes.\n\n- **Development (Character and Setting)**:  \n  - Develop characters through dialogue and interactions that reveal their personalities and relationships. For example, show the protagonist's interactions with allies, such as a loyal friend offering support and a mentor providing guidance, revealing the dynamics of their resistance group.\n  - Create a multidimensional protagonist through introspection and past experiences, highlighting a deep sense of responsibility. Describe the protagonist reflecting on their past failures and the weight of their current mission, such as, \"I... didn't really have anywhere to go. Family, friends, purpose... it all just sorta faded away through the years.\"\n  - Establish an immersive setting by using sensory details and character interactions to create a vivid atmosphere. Describe the hidden archive with details like the musty smell of old books, the flickering candlelight, and the hushed whispers of the protagonist's allies, enhancing the story's tone.\n  - Detail the harsh and unchanging environment to reinforce the theme of isolation. Describe the secluded observatory as, \"The mountain pass here collects the snow during Winter. We essentially get cut off from the world for 6 months out of the year,\" symbolizing the protagonist's isolation and focus.\n  - Develop characters through dynamic interactions and dialogue, revealing their personalities and relationships. Show the protagonist's interactions with the false leader, such as a tense exchange where the false leader's arrogance and the protagonist's determination are highlighted.\n  - Use intense emotional exchanges and moral dilemmas to develop characters. Describe a confrontation where the protagonist's ally accuses them of risking everything for their mission, revealing deep-seated tensions and differing values.\n  - Establish a setting that reflects the protagonist's inner devastation and conflict. Describe the observatory's surroundings as barren and desolate, with \"Ash fluttering and dancing in the air,\" symbolizing the aftermath of the false leader's rise and the protagonist's internal struggle.\n  - Develop the protagonist as a multidimensional character through their internal conflict and societal challenges. Describe how the protagonist conceals their true intentions from the false leader's supporters, noting that \"revealing my plans too soon could lead to disaster.\"\n  - Show the protagonist's gradual transformation over time. Describe their evolution from a hopeful idealist to a determined and strategic leader, reflecting a deep internal journey and the impact of their resistance.\n  - Highlight the protagonist's adaptability and nonchalant attitude towards bizarre situations. Show how they calmly navigate unexpected challenges, such as a sudden attack by the false leader's supporters, indicating their resilience and acceptance of their unusual circumstances.\n\n- **Language Use**:  \n  - Employ informal and colloquial language to create a relatable and youthful tone. For example, use phrases like \"Wonder if I'll survive this\" and \"I'm not dealing with his nonsense,\" contributing to the story's humorous and laid-back tone.\n  - Use colloquial and conversational language to create an authentic and relatable narrative voice. Describe the protagonist's speech with informal expressions and humor, such as \"YEAH, RIGHT, like the stars really chose him,\" adding to the story's realism and character depth.\n  - Use humor and informal dialogue to lighten the tone and engage the audience. Describe the protagonist's humorous recounting of their encounters with the false leader, eliciting laughter and camaraderie among their allies.\n  - Employ a conversational and introspective tone, using first-person narration to create an intimate connection with the reader. Describe the protagonist's thoughts and feelings with lines like, \"The first sounds I try to make are... almost inhuman. I'm not one to talk to myself, so it'd been a while since I'd said a word.\"\n  - Use vivid imagery and sensory details to convey the protagonist's experience and the setting's desolation. Describe the observatory as, \"The machine crackles, like it's judging my lack of words,\" evoking a sense of isolation and introspection.\n  - Use dialogue to reveal character traits and build a connection between the protagonist and their allies. Describe conversations where the protagonist's determination and their allies' support are highlighted, such as, \"If I'm right about your location, a big storm's coming. You won't be able to get through on your own.\"\n  - Employ vivid sensory details to create an immersive and chaotic atmosphere. Describe the protagonist's mental landscape with phrases like \"the warm watered down grime of bliss\" and \"sharp drooling teeth and a featureless black void,\" evoking a visceral response.\n  - Use conversational and informal language to create an engaging and accessible narrative. Describe the protagonist's speech as casual and direct, with lines like, \"If you can't stomach working with me, you may follow your peers out the front door.\"\n  - Use vivid and sensory language to convey the protagonist's emotional and physical state. Describe their pain and determination with phrases like \"Pain searing from the tip of my forehead down towards my spine,\" vividly depicting their struggle.\n  - Use dialogue to reveal character motivations and conflicts. Describe conversations where the protagonist's motivations and the false leader's ambition are highlighted, such as, \"Because I am a leader. It was never about YOU,\" emphasizing their differing perspectives and priorities.\n</story_rules>",
    "<thinking>  \nAnalyze the Author Writing Sheet for all four categories in depth to infer patterns, unique traits, and key elements of the author’s storytelling style. Reflect on how these elements can be adapted to suit the Writing Prompt. Use this analysis to craft **Story Rules** enriched with tailored examples inspired by the Evidence, ensuring alignment with both the Writing Prompt and the Author Writing Sheet.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative with disjointed and surreal events to convey the protagonist's mental struggle. For example, after pressing the button, the protagonist might find themselves abruptly transitioning between bizarre locations, such as a floating island, a room filled with clocks, and a desert with a single tree.\n  - Center the story around the protagonist's internal conflict and self-realization, using confrontations to highlight their struggles. For instance, the protagonist might argue with a mysterious figure who appears after each button press, representing their inner doubts and fears.\n  - Emphasize the psychological effects of isolation by having the protagonist experience moments of solitude in each surreal location, reflecting on their actions and the consequences of pressing the button.\n  - Use a guided tour framework to introduce various elements of the narrative. The protagonist could be led by a cryptic guide who explains the significance of each location and the buttons they encounter.\n  - Highlight the protagonist's internal preparation and anxiety about the consequences of pressing the button. Show them meticulously considering each button press, aware of the potential for drastic changes.\n\n- **Creativity**:\n  - Employ humor and irony to reinterpret the prompt, creating a unique tone. For example, the protagonist might sarcastically comment on the absurdity of their situation, such as saying, \"Great, now I'm in a room full of rubber ducks. Just what I needed.\"\n  - Integrate elements of a school setting and martial arts to reinterpret the theme. The protagonist could find themselves in a dojo where each button press initiates a new, unexpected challenge.\n  - Use a storytelling format that blends personal anecdotes with communal interaction. The protagonist might recount their button-pressing adventures to a group of curious listeners, interspersed with their reactions and questions.\n  - Focus on the psychological impact of the button presses rather than immediate survival. The protagonist could reflect on how each press affects their mental state, such as feeling increasingly detached from reality.\n  - Use repetitive motifs to emphasize the protagonist's mental entrapment. For instance, the phrase \"Another button, another world\" could be repeated to highlight the cyclical nature of their journey.\n  - Integrate a unique blend of magical realism and introspection. The protagonist might encounter magical elements, like talking animals or floating objects, that symbolize their internal struggles.\n  - Explore the theme of sentience through the protagonist's strategic behavior and internal monologue. They might ponder the implications of their actions, questioning whether they are truly in control or merely following a predetermined path.\n  - Reimagine the prompt by exploring the concept of time and aging in a magical context. The protagonist could experience time differently in each location, aging rapidly in one and remaining unchanged in another.\n  - Employ surreal elements to explore the theme of self-discovery. The protagonist's encounters with their future or past selves in each location could provide insights into their character and motivations.\n\n- **Development (Character and Setting)**:\n  - Develop characters through dialogue and interactions that reveal their personalities and relationships. The protagonist's conversations with the cryptic guide or other characters they meet in each location should reveal their traits and dynamics.\n  - Create a multidimensional protagonist through introspection and past experiences, highlighting a deep sense of loneliness. The protagonist might reflect on their life before the button presses, revealing their motivations and fears.\n  - Establish immersive settings by using sensory details and character interactions to create a vivid atmosphere. Each location should be described with rich sensory details, such as the smell of the ocean in a seaside setting or the sound of ticking clocks in a time-themed room.\n  - Detail the harsh and unchanging environment of certain locations to reinforce the theme of isolation. For example, a barren wasteland with no signs of life could symbolize the protagonist's internal desolation.\n  - Develop characters through dynamic interactions and dialogue, revealing their personalities and relationships. The protagonist's interactions with other characters in each location should showcase their adaptability and resilience.\n  - Use intense emotional exchanges and moral dilemmas to develop the protagonist. They might face difficult choices, such as whether to press a button that could potentially harm others.\n  - Establish settings that reflect the protagonist's inner devastation and conflict. Descriptions of desolate or chaotic environments should mirror their emotional state.\n  - Develop the protagonist as a multidimensional character through their internal conflict and societal challenges. Their reflections on the consequences of their actions should reveal their complexity.\n  - Show the protagonist's adaptability and nonchalant attitude towards bizarre situations. Their casual reactions to each new location should highlight their resilience and acceptance of the absurd.\n\n- **Language Use**:\n  - Employ informal and colloquial language to create a relatable and youthful tone. The protagonist's voice should be conversational and humorous, using phrases like \"Well, this is just great\" or \"Here we go again.\"\n  - Use colloquial and conversational language to create an authentic and relatable narrative voice. The protagonist's internal monologue and dialogue should be filled with informal expressions and humor.\n  - Use humor and informal dialogue to lighten the tone and engage the audience. The protagonist's humorous recounting of their experiences should elicit laughter and camaraderie.\n  - Employ a conversational and introspective tone, using first-person narration to create an intimate connection with the reader. The protagonist's reflections on their journey should be personal and engaging.\n  - Use vivid imagery and sensory details to convey the protagonist's experience and the setting's desolation. Descriptions of each location should evoke a strong sense of place and atmosphere.\n  - Use dialogue to reveal character traits and build a connection between the protagonist and other characters. Conversations should highlight their personalities and relationships.\n  - Employ vivid and sensory language to create an immersive and chaotic atmosphere. Descriptions of surreal elements should evoke a visceral response and highlight the protagonist's turbulent mental landscape.\n  - Use conversational and informal language to create an engaging and accessible narrative. The protagonist's speech should be casual and direct, making the story easy to follow.\n  - Use dialogue to reveal character motivations and conflicts. Conversations should highlight the underlying motivations and tensions between the characters, emphasizing their differing perspectives and priorities.\n</story_rules>",
    "<thinking>  \nAnalyze the Author Writing Sheet for all four categories in depth to infer patterns, unique traits, and key elements of the author’s storytelling style. Reflect on how these elements can be adapted to suit the Writing Prompt. Use this analysis to craft **Story Rules** enriched with tailored examples inspired by the Evidence, ensuring alignment with both the Writing Prompt and the Author Writing Sheet.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative with disjointed and surreal events to convey the protagonist's mental struggle with the curse. For example, have the protagonist experience abrupt transitions between different interrogation rooms, each with bizarre and unexpected elements, such as one room filled with floating clocks and another with walls made of mirrors reflecting their every move.\n  - Center the story around the protagonist's internal conflict and self-realization, using confrontations to highlight their struggles with the curse. For instance, include a scene where the protagonist is forced to confront a friend they lied to, leading to a physical altercation that reveals deeper frustrations and truths.\n  - Emphasize the psychological effects of the curse by structuring the narrative around a prolonged period of isolation. The protagonist could be isolated in a cell where they reflect on their past lies and the impact of the curse, such as, \"It's been three days since I last saw anyone. The silence is deafening, and my thoughts are my only company.\"\n  - Use a guided tour framework to introduce various elements of the narrative. For example, the protagonist could be led through different stages of the interrogation process, each revealing new aspects of the curse and its implications.\n  - Highlight the protagonist's internal preparation and anxiety about maintaining their composure under the curse. Show them practicing ways to avoid oversharing, aware that \"one slip could reveal too much.\"\n\n- **Creativity**:\n  - Employ humor and irony to reinterpret the prompt, creating a unique tone. For instance, the protagonist could humorously comment on the absurdity of the curse, such as, \"Great, now I can't even compliment someone without it turning into a roast.\"\n  - Integrate elements of a school setting and martial arts to reinterpret the interrogation theme. The protagonist could be a student who uses their martial arts skills to navigate the challenges of the curse, adding a unique twist to the narrative.\n  - Use a storytelling format that blends personal anecdotes with communal interaction. The protagonist could recount their experiences with the curse to a group of fellow cursed individuals, creating a dynamic and engaging narrative.\n  - Focus on the psychological impact of the curse rather than immediate survival. The protagonist could muse, \"What's killing me the most is the constant need to filter my thoughts... But you can't even trust your own mind anymore.\"\n  - Use repetitive motifs to emphasize the protagonist's mental entrapment. For example, the phrase \"Another truth revealed\" could be repeated multiple times, symbolizing the monotonous cycle of forced honesty.\n  - Integrate a unique blend of magical realism and introspection to reinterpret the prompt. The protagonist could use magical elements to explore their internal struggle, such as casting spells to temporarily mute their voice, symbolizing their attempt to control the curse.\n  - Explore the theme of sentience through the protagonist's strategic behavior and internal monologue. The protagonist could reflect on the implications of the curse on their identity, considering how \"constant truth-telling is a standard reason for losing one's sense of self.\"\n  - Reimagine the prompt by exploring the concept of time and aging in a magical context. The protagonist could experience the curse's effects differently at various ages, highlighting a unique twist on the passage of time and its impact on their life.\n  - Employ surreal elements to explore the theme of self-discovery. The protagonist's encounter with their future self could involve surreal imagery, such as a room with \"a blaze of color and darkness,\" using surreal elements to delve into the theme of self-discovery.\n\n- **Development (Character and Setting)**:\n  - Develop characters through dialogue and interactions that reveal their personalities and relationships. For example, the protagonist's interactions with their interrogator and fellow cursed individuals could reveal the dynamics of their relationships and the social environment.\n  - Develop a multidimensional character through introspection and past experiences, highlighting a deep sense of loneliness. The protagonist could reflect, \"I... didn't really have anyone to confide in. Family, friends, trust... it all just sorta faded away through the years.\"\n  - Establish an immersive setting by using sensory details and character interactions to create a vivid atmosphere. The interrogation room could be described with details like \"the cold metal chair, the flickering fluorescent light, and the distant hum of machinery,\" enhancing the story's tone.\n  - Establish an immersive setting by detailing the harsh and unchanging environment of the interrogation facility, reinforcing the theme of isolation. The setting could be described as, \"The walls here are thick and soundproof. We essentially get cut off from the world for hours on end.\"\n  - Develop characters through dynamic interactions and dialogue, revealing their personalities and relationships. The protagonist's interactions with the interrogator, such as their banter and confrontations, could showcase their personality and establish a rapport with the characters.\n  - Develop characters through intense emotional exchanges and moral dilemmas. The protagonist's interaction with a loved one could reveal deep-seated resentment and differing values, as the loved one accuses, \"You were always hiding the truth! All because you wanted to protect yourself!\"\n  - Establish a setting that reflects the protagonist's inner devastation and conflict. The interrogation room could mirror the protagonist's emotional state, with descriptions like \"The walls were bare and cold. Silence echoed and lingered in the air,\" symbolizing the aftermath of their choices.\n  - Develop the protagonist as a multidimensional character through their internal conflict and societal challenges. The protagonist could work in a profession where honesty is crucial, noting that \"being truthful is statistically easier should they not be made aware of the curse.\"\n  - Develop the protagonist's character through introspection and gradual transformation over time. The protagonist could evolve from a habitual liar to someone who values honesty, reflecting a deep internal journey.\n  - Develop the protagonist through their adaptability and nonchalant attitude towards bizarre situations. The protagonist's adaptability could be shown when they nonchalantly navigate the challenges of the curse, indicating a level of comfort and acceptance of their unusual circumstances.\n\n- **Language Use**:\n  - Employ informal and colloquial language to create a relatable and youthful tone. The protagonist's voice could be informal and conversational, as seen in lines like \"Wonder if I'll ever get used to this,\" and \"I'm not dealing with this right now,\" contributing to the story's humorous and laid-back tone.\n  - Use colloquial and conversational language to create an authentic and relatable narrative voice. The protagonist's speech could be filled with informal expressions and humor, such as \"YEAH, RIGHT, like I can keep my mouth shut,\" adding to the story's realism and character depth.\n  - Use humor and informal dialogue to lighten the tone and engage the audience. The protagonist's humorous recounting of their mishaps with the curse, like accidentally revealing embarrassing secrets, could elicit laughter and camaraderie among the characters.\n  - Employ a conversational and introspective tone, using first-person narration to create an intimate connection with the reader. The protagonist could narrate, \"The first words I try to say are... almost inhuman. I'm not one to talk to myself, so it'd been a while since I'd said a word.\"\n  - Use vivid imagery and sensory details to convey the protagonist's experience and the setting's desolation. The protagonist could describe, \"The room crackles with tension, like it's judging my every word.\"\n  - Use dialogue to reveal character traits and build a connection between the protagonist and the interrogator. The dialogue could reveal, \"If I'm right about your intentions, this curse won't break you. You'll have to face it head-on.\"\n  - Use vivid sensory details to create an immersive and chaotic atmosphere. Sensory details such as \"the warm, oppressive air\" and \"the sharp, sterile smell of the room\" could be used to evoke a visceral response and highlight the protagonist's turbulent mental landscape.\n  - Use conversational and informal language to create an engaging and accessible narrative. The protagonist's speech could be casual and direct, as seen in lines like, \"If you can't handle the truth, you might as well leave now.\"\n  - Employ vivid and sensory language to convey the protagonist's emotional and physical state. The author could use phrases like \"Pain searing from the tip of my tongue down towards my heart\" to vividly depict the protagonist's physical and emotional pain.\n  - Use dialogue to reveal character motivations and conflicts. Dialogue such as \"Because I am a truth-teller. It was never about YOU\" could highlight the underlying motivations and tensions between the characters, emphasizing their differing perspectives and priorities.\n</story_rules>",
    "<thinking>  \nTo generate the Story Rules, I will analyze the Author Writing Sheet for each category—Plot, Creativity, Development (Character and Setting), and Language Use. I will identify the unique storytelling elements and techniques used by the author and tailor them to the Writing Prompt about a vampire dealing with zombies and the challenge of finding an edible meal. I will ensure the rules are actionable, detailed, and aligned with both the author's style and the Writing Prompt.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative with disjointed and surreal events to convey the vampire's mental struggle. For example, the vampire might experience abrupt transitions between different environments, such as a decrepit mansion, a bustling city street overrun by zombies, and a serene forest, each time leading to a new and unexpected scenario.\n  - Center the story around the vampire's internal conflict and self-realization, using confrontations with zombies and other characters to highlight their struggles. For instance, the vampire might have a physical altercation with a zombie horde, illustrating their frustration and desperation to find a suitable meal.\n  - Emphasize the psychological effects of the vampire's prolonged isolation. The vampire could reflect on their loneliness and the monotony of their existence, such as reminiscing about past centuries and the changes in society.\n  - Use a guided tour as a framework to introduce various elements of the narrative. The vampire could lead a newly turned vampire through the city, explaining the challenges of finding an edible meal amidst the zombie apocalypse.\n  - Focus on the vampire's internal preparation and anxiety about maintaining their humanity. The vampire might meticulously practice blending in with humans, aware that any slip-up could reveal their true nature and make finding a meal even harder.\n  - Highlight the long-term consequences of a significant event, such as the vampire's transformation or a past encounter with a powerful enemy. The narrative could reflect on how this event has shaped the vampire's current predicament and their approach to finding food.\n  - Incorporate a surreal and introspective encounter. The vampire might enter a mysterious, dream-like realm where they confront their fears and desires, symbolized by a room with eerie, shifting shadows and a mirror that shows their true form.\n\n- **Creativity**:\n  - Employ humor and irony to reinterpret the prompt, creating a unique tone. For example, the vampire might humorously comment on the absurdity of zombies being inedible, such as joking, \"Zombies are like stale bread—no flavor and hard to chew.\"\n  - Integrate elements of a school setting and martial arts to reinterpret the vampire's struggle. The vampire could encounter a group of survivors practicing self-defense, using their skills in unconventional ways to fend off zombies and protect their food supply.\n  - Use a storytelling format that blends personal anecdotes with communal interaction. The vampire could recount their experiences to a group of fellow vampires, interspersed with reactions and questions from the group, creating a dynamic and engaging narrative.\n  - Focus on the psychological impact of the vampire's long-term isolation rather than immediate survival. The vampire might muse about the boredom and loneliness of their existence, such as, \"What's killing me the most is the monotony... Even the zombies have become predictable.\"\n  - Use repetitive motifs to emphasize the vampire's mental entrapment. The phrase \"Another night, another hunt\" could be repeated multiple times, symbolizing the monotonous cycle the vampire is trapped in while searching for an edible meal.\n  - Integrate a unique blend of magical realism and introspection. The vampire might use their supernatural abilities to explore their internal struggle, such as using their heightened senses to detect the faint heartbeat of a potential meal, symbolizing their hope and desperation.\n  - Explore the theme of sentience through the vampire's strategic behavior and internal monologue. The vampire could reflect on the ethical implications of feeding on humans, considering the balance between survival and maintaining their humanity.\n  - Reimagine the prompt by exploring the concept of time and aging in a magical context. The vampire might experience time differently, with centuries feeling like mere days, highlighting the unique challenges of their existence.\n  - Employ surreal elements to explore the theme of self-discovery. The vampire's encounter with their past self could involve a mirror that feels like \"a cool gel\" and a room with \"a blaze of color and darkness,\" using surreal imagery to delve into the theme of self-discovery.\n\n- **Development (Character and Setting)**:\n  - Develop characters through dialogue and interactions that reveal their personalities and relationships. The vampire's interactions with humans and other vampires, such as a tense conversation with a rival vampire or a compassionate exchange with a human ally, should reveal their motivations and struggles.\n  - Create a multidimensional character through introspection and past experiences, highlighting a deep sense of loneliness. The vampire might reflect on their long life, the loss of loved ones, and the isolation that comes with immortality.\n  - Establish an immersive setting by using sensory details and character interactions to create a vivid atmosphere. Describe the decaying city overrun by zombies, the eerie silence of abandoned buildings, and the occasional sounds of distant screams, enhancing the story's tone.\n  - Detail the harsh and unchanging environment, reinforcing the theme of isolation. The setting could be a desolate urban landscape, with descriptions like, \"The streets were littered with debris and the stench of decay hung in the air,\" symbolizing the vampire's desolation.\n  - Develop characters through dynamic interactions and dialogue, revealing their personalities and relationships. The vampire's banter with a human ally or a rival vampire should showcase their personality and establish a rapport with the characters.\n  - Use intense emotional exchanges and moral dilemmas to develop characters. The vampire's interaction with a potential meal could reveal deep-seated guilt and conflicting values, as they struggle with the morality of feeding on humans.\n  - Establish a setting that reflects the vampire's inner devastation and conflict. The setting could mirror the vampire's emotional state, with descriptions like, \"The once vibrant city was now a wasteland, a reflection of my own hollow existence,\" symbolizing the aftermath of their choices.\n  - Develop the protagonist as a multidimensional character through their internal conflict and societal challenges. The vampire might work in a human-dominated society, concealing their true nature while grappling with the ethical implications of their actions.\n  - Show the protagonist's adaptability and nonchalant attitude towards bizarre situations. The vampire's adaptability could be shown when they nonchalantly navigate through a zombie-infested area, indicating a level of comfort and acceptance of their unusual circumstances.\n\n- **Language Use**:\n  - Employ informal and colloquial language to create a relatable and youthful tone. The vampire's voice should be informal and conversational, with lines like, \"Great, another zombie. Just what I needed,\" contributing to the story's humorous and laid-back tone.\n  - Use colloquial and conversational language to create an authentic and relatable narrative voice. The vampire's speech should be filled with informal expressions and humor, such as, \"Zombies are the worst dinner guests—no manners and they stink,\" adding to the story's realism and character depth.\n  - Use humor and informal dialogue to lighten the tone and engage the audience. The vampire's humorous recounting of their mishaps while hunting for an edible meal, like accidentally biting into a zombie, should elicit laughter and camaraderie among the characters.\n  - Employ a conversational and introspective tone, using first-person narration to create an intimate connection with the reader. The vampire might narrate, \"I've been around for centuries, but nothing prepared me for the zombie apocalypse. It's like a bad joke that never ends.\"\n  - Use vivid imagery and sensory details to convey the protagonist's experience and the setting's desolation. Describe the vampire's heightened senses, such as, \"The scent of decay was overwhelming, mingling with the faint, tantalizing aroma of fresh blood,\" to evoke a visceral response.\n  - Use dialogue to reveal character traits and build a connection between the protagonist and other characters. The vampire's dialogue with a human ally or a rival vampire should reveal their motivations and conflicts, such as, \"I don't want to hurt anyone, but I need to feed.\"\n  - Use vivid sensory details to create an immersive and chaotic atmosphere. Describe the chaotic scenes of zombie attacks, with sensory details like, \"The sound of shuffling feet and guttural moans filled the air, creating a symphony of dread,\" to enhance the story's tension.\n  - Use conversational and informal language to create an engaging and accessible narrative. The vampire's speech should be casual and direct, with lines like, \"If you can't handle the heat, stay out of the apocalypse,\" adding to the story's engaging tone.\n  - Employ vivid and sensory language to convey the protagonist's emotional and physical state. Use phrases like, \"Hunger gnawed at me, a relentless beast that refused to be tamed,\" to vividly depict the vampire's struggle.\n  - Use dialogue to reveal character motivations and conflicts. The vampire's dialogue with a potential meal or a rival vampire should highlight the underlying motivations and tensions, emphasizing their differing perspectives and priorities.\n</story_rules>"
]