[
    "<thinking>  \nAnalyze the Author Writing Sheet for all four categories in depth to infer patterns, unique traits, and key elements of the author’s storytelling style. Reflect on how these elements can be adapted to suit the Writing Prompt. Use this analysis to craft **Story Rules** enriched with tailored examples inspired by the Evidence, ensuring alignment with both the Writing Prompt and the Author Writing Sheet.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Begin the story with a seemingly peaceful and humorous scene of the retired super villain enjoying their retirement. For example, describe the protagonist gardening or playing chess with a neighbor, setting a light-hearted tone.\n  - Introduce an unexpected twist that disrupts the protagonist's peace, such as a sudden attack on their family. Ensure this twist subverts initial expectations, much like the dramatic cartel escape in the \"Jesus taking the wheel\" story.\n  - Use a framing device to provide context and structure, such as the protagonist recounting their past exploits through a series of journal entries or news clippings. This will give the narrative a structured and immersive feel, similar to the classified log entries in the \"child soldiers baiting summoners\" story.\n  - Resolve conflicts with clever, non-violent solutions where possible. For instance, the protagonist could use their wits and old connections to outmaneuver their enemies, avoiding direct confrontation.\n  - Include a final twist or revelation that recontextualizes the entire story. For example, reveal that the attack on the family was orchestrated by an old ally seeking to bring the protagonist out of retirement for a greater cause, adding a layer of irony.\n  - Use humor to diffuse tension and provide unique resolutions. For instance, the protagonist's old costume could be comically outdated, leading to humorous situations as they try to adapt to modern technology.\n\n- **Creativity**:\n  - Blend genres to create unique and imaginative scenarios. Combine elements of superhero fiction with a slice-of-life retirement story, creating a humorous and thought-provoking narrative.\n  - Reinterpret familiar tropes in unconventional ways. For example, instead of a typical revenge plot, focus on the protagonist's struggle to balance their peaceful retirement with their old villainous instincts.\n  - Integrate elements of satire and parody to critique societal norms. Use the protagonist's perspective to comment on the absurdity of modern heroism and villainy, much like the aliens misunderstanding The Onion.\n  - Incorporate fantastical elements into everyday settings. Transform mundane retirement activities into epic adventures, such as a simple trip to the grocery store turning into a covert operation.\n  - Use imaginative world-building to enhance the narrative. Create a richly detailed world where retired super villains have their own community, complete with unique customs and societal structures.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters with clear motivations and emotional arcs. Portray the protagonist as a complex individual with a rich backstory, showing their internal conflict between their peaceful retirement and their old villainous ways.\n  - Create immersive settings that enhance the story's tone and themes. Describe the protagonist's idyllic retirement home in detail, contrasting it with the chaotic world of their past.\n  - Use character interactions to reveal deeper themes and conflicts. Show the protagonist's relationships with their family and old allies, highlighting the tensions and loyalties that drive the narrative.\n  - Include diverse and inclusive character representations. Introduce characters with various backgrounds and experiences, promoting themes of acceptance and self-discovery.\n  - Use detailed descriptions to bring settings and characters to life. Paint vivid pictures of the protagonist's retirement activities and their old villainous lair, making the reader feel immersed in both worlds.\n\n- **Language Use**:\n  - Employ witty and humorous dialogue to enhance character interactions. Fill the protagonist's conversations with clever wordplay and humorous exchanges, adding charm to the story.\n  - Use descriptive language to create vivid imagery and atmosphere. Describe the protagonist's peaceful retirement in rich detail, making the reader feel the tranquility before it is disrupted.\n  - Use irony and sarcasm to convey themes and critique societal norms. Highlight the absurdity of the protagonist's situation with ironic and sarcastic commentary.\n  - Employ varied sentence structures to maintain a dynamic and engaging narrative. Use a mix of short, punchy sentences and longer, descriptive passages to keep the reader engaged.\n  - Use rhetorical devices and figures of speech to enhance the narrative. Incorporate metaphors and analogies to explain the protagonist's complex emotions and experiences in an accessible and entertaining way.\n  - Maintain a consistent and distinctive narrative voice. Blend humor, wit, and insightful commentary to create a cohesive and recognizable style throughout the story.\n</story_rules>",
    "<thinking>  \nTo generate the Story Rules, I will analyze the Author Writing Sheet for each category—Plot, Creativity, Development (Character and Setting), and Language Use. I will identify the unique traits and techniques the author uses and then tailor these to the Writing Prompt about an engineer isekai'd to a fantasy world. The rules will be actionable, detailed, and include examples inspired by the Evidence provided.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Incorporate unexpected twists that subvert initial expectations. For example, the engineer's first invention might seem like a simple gadget but later reveals itself to be a crucial tool in outsmarting the Dark Lord's minions.\n  - Use a framing device to provide context and structure. Present the narrative through the engineer's journal entries or video logs, documenting their experiments and discoveries in the new world.\n  - Resolve conflicts with clever, non-violent solutions. Instead of direct combat, have the engineer use their inventions to create traps or distractions that neutralize threats without bloodshed.\n  - Include a final twist or revelation that recontextualizes the entire story. For instance, the engineer's ultimate invention could inadvertently lead to a peaceful resolution with the Dark Lord, who turns out to be a misunderstood figure.\n  - Use humor to diffuse tension and provide unique resolutions. The engineer's quirky inventions and their unexpected effects can add a layer of comedy, such as a device meant to create a shield that instead produces a harmless but hilarious light show.\n\n- **Creativity**:\n  - Blend genres to create unique and imaginative scenarios. Combine elements of fantasy and science fiction, such as using advanced engineering principles to create magical artifacts.\n  - Reinterpret familiar tropes in unconventional ways. Instead of traditional fantasy weapons, have the engineer create bizarre and innovative tools, like a mechanical dragonfly for reconnaissance or a portable black hole generator.\n  - Integrate elements of satire and parody to critique societal norms. Use the engineer's perspective to comment on the absurdity of certain fantasy world customs, such as the inefficiency of medieval siege tactics compared to modern engineering solutions.\n  - Incorporate fantastical elements into everyday settings. Transform mundane tasks, like building a bridge, into epic engineering challenges with magical materials and creatures.\n  - Use imaginative world-building to enhance the narrative. Create detailed descriptions of the engineer's workshop, filled with both Earthly tools and fantastical components, and explore the societal impact of their inventions on the fantasy world.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters with clear motivations and emotional arcs. The engineer should have a backstory that explains their passion for invention and their initial struggle to adapt to the new world.\n  - Create immersive settings that enhance the story's tone and themes. Describe the engineer's workshop in detail, highlighting the blend of Earthly and magical elements, and the contrast between the engineer's logical mindset and the fantastical world.\n  - Use character interactions to reveal deeper themes and conflicts. Show the engineer's interactions with local inhabitants, who may be skeptical or fascinated by their inventions, revealing cultural differences and potential conflicts.\n  - Include diverse and inclusive character representations. Introduce characters from various backgrounds and species, each with unique perspectives on the engineer's work and the changes it brings to their world.\n  - Use detailed descriptions to bring settings and characters to life. Vividly describe the engineer's inventions, the fantastical landscapes, and the diverse inhabitants of the world, making the reader feel immersed in the story.\n\n- **Language Use**:\n  - Employ witty and humorous dialogue to enhance character interactions. The engineer's conversations with locals should be filled with clever banter and humorous misunderstandings about technology and magic.\n  - Use descriptive language to create vivid imagery and atmosphere. Paint a detailed picture of the engineer's inventions and their effects, making the reader visualize the fantastical and often comical results.\n  - Use irony and sarcasm to convey themes and critique societal norms. The engineer's internal monologue and dialogue can highlight the absurdity of certain fantasy world practices compared to modern engineering logic.\n  - Employ varied sentence structures to maintain a dynamic and engaging narrative. Alternate between detailed technical descriptions of the engineer's work and fast-paced action scenes when their inventions are put to the test.\n  - Use rhetorical devices and figures of speech to enhance the narrative. Incorporate metaphors and analogies to explain complex engineering concepts in an accessible and entertaining way.\n  - Maintain a consistent and distinctive narrative voice. Ensure the narrative voice blends humor, wit, and insightful commentary, reflecting the engineer's unique perspective and the author's recognizable style.\n</story_rules>",
    "<thinking>  \nAnalyze the Author Writing Sheet for all four categories in depth to infer patterns, unique traits, and key elements of the author’s storytelling style. Reflect on how these elements can be adapted to suit the Writing Prompt. Use this analysis to craft **Story Rules** enriched with tailored examples inspired by the Evidence, ensuring alignment with both the Writing Prompt and the Author Writing Sheet.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Begin the story with a seemingly mundane and humorous premise, such as the protagonist's frustration over the stolen garden robot. Gradually reveal deeper layers of the protagonist's past as a super weapon designer and the true stakes involved in retrieving the robot.\n    - Example: \"You were just about to enjoy a cup of tea when you noticed your garden robot was missing. Again. Those space pirates had struck once more, and this time, they took your favorite gardening companion. Little did they know, you weren't just any retiree.\"\n  - Use a framing device to provide context and structure to the story. Consider using the protagonist's personal logs or a series of video messages to document the journey and provide insights into their thoughts and plans.\n    - Example: \"Log Entry 47: The pirates have taken my garden robot. It's time to dust off some old skills and show them why you don't mess with a retired super weapon designer.\"\n  - Resolve conflicts with clever, non-violent solutions that showcase the protagonist's ingenuity and resourcefulness.\n    - Example: \"Instead of confronting the pirates head-on, you devise a plan to hack into their ship's systems using an old, forgotten backdoor you designed years ago. With a few keystrokes, you disable their weapons and lock them in their own brig.\"\n  - Include a final twist or revelation that recontextualizes the entire story, adding a layer of irony or deeper meaning.\n    - Example: \"As you retrieve your garden robot, you discover it had been secretly recording the pirates' activities all along. The data it collected could bring down the entire pirate network, turning your small act of retrieval into a major victory.\"\n  - Use humor to diffuse tension and provide a unique resolution, ensuring the story remains light-hearted and engaging.\n    - Example: \"As you leave the pirate ship, you can't help but chuckle at the sight of the pirates arguing over who gets the last piece of space rations, completely unaware of their impending capture by the authorities.\"\n\n- **Creativity**:\n  - Blend genres to create a unique and imaginative scenario, combining elements of science fiction with a touch of humor and adventure.\n    - Example: \"Your peaceful colony planet, with its lush gardens and serene landscapes, contrasts sharply with the high-tech gadgets and deadly super weapons you once designed.\"\n  - Reinterpret familiar tropes in unconventional ways, such as the retired hero coming out of retirement for a seemingly trivial reason.\n    - Example: \"Instead of a grand mission to save the world, your return to action is motivated by the theft of your beloved garden robot, adding a whimsical twist to the classic hero's journey.\"\n  - Integrate elements of satire and parody to critique societal norms, such as the absurdity of space pirates targeting a peaceful colony.\n    - Example: \"The space pirates, with their over-the-top bravado and comically outdated technology, serve as a satirical commentary on the futility of their actions against a retired super weapon designer.\"\n  - Incorporate fantastical elements into everyday settings, transforming the protagonist's quest into an epic adventure.\n    - Example: \"What starts as a simple retrieval mission quickly escalates into a journey through asteroid fields, encounters with alien creatures, and the discovery of hidden pirate bases.\"\n  - Use imaginative world-building to enhance the narrative, creating a richly detailed colony planet and pirate network.\n    - Example: \"The colony planet, with its advanced agricultural technology and peaceful community, contrasts with the chaotic and lawless world of the space pirates, adding depth to the story.\"\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters with clear motivations and emotional arcs, particularly focusing on the protagonist's transition from a retired designer to an active problem-solver.\n    - Example: \"Your protagonist, once a renowned super weapon designer, now finds joy in the simple pleasures of gardening. However, the theft of the garden robot reignites their passion for problem-solving and justice.\"\n  - Create immersive settings that enhance the story's tone and themes, such as the serene colony planet and the gritty pirate hideouts.\n    - Example: \"The colony's lush gardens and tranquil environment provide a stark contrast to the dark, cluttered interiors of the pirate ships, highlighting the protagonist's journey from peace to conflict.\"\n  - Use character interactions to reveal deeper themes and conflicts, such as the protagonist's past and their relationship with the colony's inhabitants.\n    - Example: \"Conversations with fellow colonists reveal the protagonist's hidden talents and the respect they command, despite their humble new life.\"\n  - Include diverse and inclusive character representations, showcasing a variety of backgrounds and experiences within the colony and pirate crew.\n    - Example: \"The colony is home to a diverse group of settlers, each with their own unique skills and stories, while the pirate crew includes members from different planets and cultures, adding richness to the narrative.\"\n  - Use detailed descriptions to bring settings and characters to life, making the reader feel immersed in the protagonist's journey.\n    - Example: \"The vibrant colors of the colony's gardens, the intricate designs of the protagonist's old workshop, and the chaotic mess of the pirate ship's interior are vividly described, creating a fully realized world.\"\n\n- **Language Use**:\n  - Employ witty and humorous dialogue to enhance character interactions, particularly between the protagonist and the space pirates.\n    - Example: \"As you confront the pirate captain, you can't help but quip, 'You know, stealing a garden robot is a new low, even for you lot.'\"\n  - Use descriptive language to create vivid imagery and atmosphere, making the settings and action sequences come alive.\n    - Example: \"The colony's gardens are a riot of color and life, with flowers blooming in every shade imaginable, while the pirate ship is a dark, claustrophobic maze of metal and grime.\"\n  - Use irony and sarcasm to convey themes and critique societal norms, particularly in the protagonist's reflections on their past and present.\n    - Example: \"You muse to yourself, 'I designed weapons that could destroy planets, and now I'm chasing after a garden robot. Life sure has a sense of humor.'\"\n  - Employ varied sentence structures to maintain a dynamic and engaging narrative, reflecting the protagonist's shifting emotions and the story's pacing.\n    - Example: \"One moment, you're calmly tending to your garden; the next, you're in a high-speed chase through an asteroid field, adrenaline pumping through your veins.\"\n  - Use rhetorical devices and figures of speech to enhance the narrative, making complex concepts accessible and entertaining.\n    - Example: \"Describing the pirate ship, you think, 'It's like a junkyard in space, held together by duct tape and sheer stubbornness.'\"\n  - Maintain a consistent and distinctive narrative voice, blending humor, wit, and insightful commentary to create a cohesive and recognizable style.\n    - Example: \"Throughout the story, your narrative voice remains light-hearted and engaging, with a touch of sarcasm and a keen eye for the absurdities of life in space.\"\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the given Writing Prompt and the author's unique storytelling style, I will analyze the Author Writing Sheet in depth. I will identify key elements from each category—Plot, Creativity, Development (Character and Setting), and Language Use—and tailor them to the narrative potential of the Writing Prompt. The rules will be actionable, detailed, and enriched with examples inspired by the Evidence provided, ensuring they reflect the author's style while being specific to the prompt about a hero dealing with their dying son due to unexpected super gene outcomes.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Incorporate unexpected twists that subvert initial expectations. For example, start with the hero's grief and desperation, but introduce a twist where the hero discovers a hidden aspect of their son's condition that leads to a dramatic and unexpected journey to find a cure.\n  - Use a framing device to provide context and structure. Present the narrative through a series of journal entries or video logs made by the hero, documenting their quest to save their son and the emotional toll it takes.\n  - Resolve conflicts with clever, non-violent solutions. Instead of a final battle, have the hero use their intellect and resources to find a scientific or magical solution to their son's condition, emphasizing collaboration and ingenuity.\n  - Include a final twist or revelation that recontextualizes the entire story. Reveal that the son's condition was a result of a deliberate act by a former ally or a hidden enemy, adding a layer of irony and depth to the narrative.\n  - Use humor to diffuse tension and provide a unique resolution. Despite the heavy theme, incorporate moments of levity, such as the hero's interactions with quirky scientists or magical beings, to balance the tone and keep the narrative engaging.\n\n- **Creativity**:\n  - Blend genres to create unique and imaginative scenarios. Combine elements of superhero fiction with medical drama and fantasy, creating a rich and multifaceted narrative.\n  - Reinterpret familiar tropes in unconventional ways. Instead of a typical superhero rescue, focus on the hero's vulnerability and the emotional journey of dealing with their child's illness, exploring themes of parenthood and sacrifice.\n  - Integrate elements of satire and parody to critique societal norms. Use the hero's public persona and the media's reaction to their personal crisis to comment on the pressures and expectations placed on public figures.\n  - Incorporate fantastical elements into everyday settings. Transform mundane hospital visits and medical procedures into epic quests involving magical artifacts or advanced alien technology.\n  - Use imaginative world-building to enhance the narrative. Create a detailed and immersive world where super genes and their consequences are a known but mysterious phenomenon, adding depth and intrigue to the story.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters with clear motivations and emotional arcs. Portray the hero as a dedicated parent struggling with guilt and helplessness, and the son as a brave and resilient child facing their fate with courage.\n  - Create immersive settings that enhance the story's tone and themes. Use detailed descriptions of the hero's home, the hospital, and any fantastical locations they visit, creating a vivid and emotionally resonant backdrop for the narrative.\n  - Use character interactions to reveal deeper themes and conflicts. Highlight the hero's relationships with their family, friends, and allies, using these interactions to explore themes of love, loss, and resilience.\n  - Include diverse and inclusive character representations. Introduce characters from various backgrounds and with different abilities, promoting themes of acceptance and unity.\n  - Use detailed descriptions to bring settings and characters to life. Describe the hero's physical and emotional state in vivid detail, as well as the unique characteristics of the settings they visit, making the narrative immersive and engaging.\n\n- **Language Use**:\n  - Employ witty and humorous dialogue to enhance character interactions. Use clever banter and humorous exchanges between the hero and their allies to lighten the mood and add charm to the story.\n  - Use descriptive language to create vivid imagery and atmosphere. Describe the hero's emotional turmoil and the settings they visit in rich detail, making the reader feel immersed in the narrative.\n  - Use irony and sarcasm to convey themes and critique societal norms. Highlight the absurdity of the hero's public image versus their private struggles, using irony to critique the nature of fame and heroism.\n  - Employ varied sentence structures to maintain a dynamic and engaging narrative. Use a mix of short, punchy sentences and longer, descriptive passages to keep the narrative pace lively and engaging.\n  - Use rhetorical devices and figures of speech to enhance the narrative. Incorporate metaphors and analogies to explain complex emotions and situations, making the narrative more accessible and entertaining.\n  - Maintain a consistent and distinctive narrative voice. Ensure the narrative voice blends humor, wit, and insightful commentary, creating a cohesive and recognizable style that aligns with the author's unique storytelling approach.\n</story_rules>",
    "<thinking>  \nAnalyze the Author Writing Sheet for all four categories in depth to infer patterns, unique traits, and key elements of the author’s storytelling style. Reflect on how these elements can be adapted to suit the Writing Prompt. Use this analysis to craft **Story Rules** enriched with tailored examples inspired by the Evidence, ensuring alignment with both the Writing Prompt and the Author Writing Sheet.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Begin the story with a humorous misunderstanding about the protagonist's business, setting the stage for unexpected twists. For example, start with a customer entering the shop and asking, \"I run a soap kitchen.\" \"You mean soup?\" \"SOAP!\"\n  - Use a framing device to provide context and structure. For instance, the story could be presented through a series of diary entries or social media posts by the protagonist, detailing the daily challenges and humorous encounters in the soap kitchen.\n  - Incorporate unexpected twists that subvert initial expectations. For example, reveal that the soap kitchen is actually a front for a secret operation, such as a group of vigilantes using soap-making as a cover for their activities.\n  - Resolve conflicts with clever, non-violent solutions. For instance, when a rival business tries to sabotage the soap kitchen, the protagonist could outsmart them by creating a viral marketing campaign that turns the sabotage attempt into a publicity stunt.\n  - Include a final twist or revelation that recontextualizes the entire story. For example, reveal that the protagonist's soap has magical properties, and the soap kitchen is part of a larger plan to distribute these magical soaps to those in need.\n  - Use humor to diffuse tension and provide unique resolutions. For example, when a health inspector visits the soap kitchen, the protagonist's quick wit and humorous explanations turn a potentially disastrous inspection into a comedic highlight.\n\n- **Creativity**:\n  - Blend genres to create unique and imaginative scenarios. For example, combine elements of comedy, mystery, and fantasy by introducing a subplot where the soap kitchen's products start exhibiting magical effects.\n  - Reinterpret familiar tropes in unconventional ways. For instance, take the trope of a small business struggling to survive and add a twist where the soap kitchen becomes a hub for a secret society of soap enthusiasts with quirky rituals.\n  - Integrate elements of satire and parody to critique societal norms. For example, use the soap kitchen to comment on the absurdity of modern consumer culture, with exaggerated characters and situations that highlight the ridiculousness of certain trends.\n  - Incorporate fantastical elements into everyday settings. For instance, describe how the soap kitchen's mundane activities, like mixing ingredients, are transformed into epic, almost alchemical processes with unexpected outcomes.\n  - Use imaginative world-building to enhance the narrative. For example, create a detailed backstory for the soap kitchen, including its origins, unique recipes, and the eccentric characters who frequent it.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters with clear motivations and emotional arcs. For example, the protagonist could be a passionate soap maker with a personal mission to create the perfect soap, driven by a backstory involving a family tradition or a personal quest for redemption.\n  - Create immersive settings that enhance the story's tone and themes. For instance, describe the soap kitchen in vivid detail, from the bubbling cauldrons of soap to the shelves lined with colorful, aromatic bars, creating a sensory-rich environment.\n  - Use character interactions to reveal deeper themes and conflicts. For example, through conversations with customers and employees, explore themes of community, identity, and the struggle to maintain authenticity in a commercial world.\n  - Include diverse and inclusive character representations. For instance, portray characters from various backgrounds and with different experiences, such as a retired chemist who helps with soap formulations or a young artist who designs the soap packaging.\n  - Use detailed descriptions to bring settings and characters to life. For example, describe the protagonist's meticulous process of soap-making, the vibrant colors and scents of the soaps, and the eclectic decor of the soap kitchen, making the setting feel tangible and alive.\n\n- **Language Use**:\n  - Employ witty and humorous dialogue to enhance character interactions. For example, include exchanges like, \"I run a soap kitchen.\" \"You mean soup?\" \"SOAP!\" to set a playful tone and establish character dynamics.\n  - Use descriptive language to create vivid imagery and atmosphere. For instance, describe the soap kitchen's interior with phrases like, \"The air was thick with the scent of lavender and eucalyptus, and the shelves gleamed with rows of jewel-toned soaps.\"\n  - Use irony and sarcasm to convey themes and critique societal norms. For example, the protagonist could sarcastically comment on the latest soap trends, highlighting the absurdity of certain consumer behaviors.\n  - Employ varied sentence structures to maintain a dynamic and engaging narrative. For instance, mix short, punchy sentences with longer, descriptive passages to keep the reader's interest and reflect the protagonist's lively personality.\n  - Use rhetorical devices and figures of speech to enhance the narrative. For example, use metaphors like, \"The soap kitchen was a bubbling cauldron of creativity,\" to convey the protagonist's passion and the vibrant atmosphere of the setting.\n  - Maintain a consistent and distinctive narrative voice characterized by humor, wit, and insightful commentary. For example, ensure the protagonist's voice is engaging and relatable, with a blend of humor and sincerity that draws the reader into their world.\n</story_rules>"
]