[
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The goal is to create rules that reflect the author's unique style while aligning with the narrative potential of the Writing Prompt.\n\n### Plot\n1. **Non-linear Narrative**: The author uses non-linear storytelling, often through flashbacks or time shifts. For the zombie apocalypse prompt, this could involve the protagonist reflecting on past experiences with medieval history or reenactments that prepared them for this moment.\n2. **Internal Conflict**: The author emphasizes internal struggles. The protagonist might grapple with the moral implications of using medieval weapons against zombified former neighbors.\n3. **Twist Resolutions**: The author often includes a twist. Perhaps the protagonist discovers that the medieval armory holds a secret that could change the course of the apocalypse.\n4. **Open Endings**: The author leaves endings open to interpretation. The story could end with the protagonist standing at the threshold of their home, uncertain of what they will find inside.\n5. **Dialogue-Driven Plot**: The author uses dialogue to reveal key plot points. Conversations with other survivors or even imagined dialogues with historical figures could drive the narrative.\n\n### Creativity\n1. **Genre Blending**: The author blends genres. The story should mix elements of horror (zombies) with historical fantasy (medieval armory).\n2. **Trope Reinterpretation**: The author reinterprets tropes. The protagonist's choice of medieval weapons over guns subverts typical zombie apocalypse narratives.\n3. **Imaginative Elements**: The author introduces unconventional elements. The protagonist might discover that the armor has magical properties.\n4. **Humor and Satire**: The author uses humor to critique norms. The protagonist's anachronistic approach could humorously highlight the absurdity of modern reliance on technology.\n5. **Speculative Scenarios**: The author explores philosophical questions. The story could question the nature of heroism and survival in a world turned upside down.\n\n### Development (Character and Setting)\n1. **Complex Characters**: The protagonist should have a rich emotional arc, perhaps dealing with themes of identity as a modern-day knight.\n2. **Detailed Settings**: The setting should reflect the protagonist's internal state, with the medieval armory serving as a sanctuary and symbol of hope.\n3. **Secondary Characters**: Use secondary characters to contrast the protagonist's choices, such as a friend who chose guns and faces different challenges.\n4. **Immersive Worlds**: Create a believable world where medieval tactics are surprisingly effective against zombies.\n5. **Societal Impact**: Explore how societal collapse affects individual choices, critiquing the reliance on modern technology.\n\n### Language Use\n1. **Vivid Imagery**: Use sensory details to describe the protagonist's armor and the eerie silence of a zombie-infested world.\n2. **Witty Dialogue**: Incorporate humor in the protagonist's interactions, perhaps with a fellow survivor who questions their choice of weaponry.\n3. **Varied Sentence Structures**: Use short sentences to build tension during zombie encounters and longer, reflective passages for introspection.\n4. **Rhetorical Devices**: Employ metaphors and similes to enhance the narrative, such as comparing the protagonist's armor to a knight's resolve.\n5. **Conversational Tone**: Maintain an informal tone to create immediacy, drawing readers into the protagonist's unique perspective.\n\nThese insights will guide the creation of detailed Story Rules that align with the Writing Prompt and the author's style.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Use a non-linear narrative structure by incorporating flashbacks to the protagonist's past experiences with medieval history or reenactments. For example, reveal how a childhood fascination with knights prepared them for the apocalypse.\n  - Focus on internal conflict by exploring the protagonist's moral dilemmas about using medieval weapons against zombified neighbors. Illustrate their struggle with vivid internal monologues.\n  - Introduce a twist resolution by having the protagonist discover a hidden secret within the medieval armory, such as a map to a safe haven or a legendary artifact.\n  - Craft an open ending by leaving the protagonist at the doorstep of their home, contemplating the unknown challenges inside, allowing readers to imagine the outcome.\n  - Drive the plot through dialogue, using conversations with other survivors or imagined dialogues with historical figures to reveal key plot points and character motivations.\n\n- **Creativity**:\n  - Blend genres by integrating horror elements of the zombie apocalypse with the historical fantasy of medieval weaponry, creating a unique narrative world.\n  - Reinterpret traditional zombie apocalypse tropes by having the protagonist choose medieval weapons over guns, highlighting their unique approach to survival.\n  - Introduce imaginative elements, such as the protagonist discovering that their armor has magical properties, adding a fantastical twist to the story.\n  - Incorporate humor and satire by using the protagonist's anachronistic approach to critique modern reliance on technology, perhaps through humorous interactions with other survivors.\n  - Explore speculative scenarios by questioning the nature of heroism and survival, using the protagonist's journey to reflect on what it means to be a hero in a world turned upside down.\n\n- **Development (Character and Setting)**:\n  - Develop a complex protagonist with a rich emotional arc, focusing on their identity as a modern-day knight and their journey of self-discovery.\n  - Create a detailed setting that reflects the protagonist's internal state, using the medieval armory as a symbol of hope and sanctuary amidst chaos.\n  - Use secondary characters to highlight or contrast the protagonist's choices, such as a friend who chose guns and faces different challenges, providing depth to the narrative.\n  - Build an immersive world with distinct rules where medieval tactics are surprisingly effective against zombies, enhancing the story's believability.\n  - Explore the impact of societal collapse on individual choices, critiquing the reliance on modern technology and highlighting the protagonist's unique perspective.\n\n- **Language Use**:\n  - Employ vivid, sensory imagery to describe the protagonist's armor and the eerie silence of a zombie-infested world, creating an immersive atmosphere.\n  - Use witty dialogue to reveal character traits and advance the plot, incorporating humor in the protagonist's interactions with fellow survivors.\n  - Vary sentence structures to control pacing, using short sentences to build tension during zombie encounters and longer passages for introspection.\n  - Utilize rhetorical devices, such as metaphors and similes, to enhance the narrative's tone and meaning, comparing the protagonist's armor to a knight's resolve.\n  - Maintain a conversational tone to create intimacy and immediacy, drawing readers into the protagonist's unique perspective and experiences.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, \"You never knew you were a god until you got your very first follower,\" I will analyze the Author Writing Sheet to extract key storytelling elements. The author’s style includes non-linear narratives, internal conflicts, unexpected resolutions, and open-ended conclusions. Creativity is marked by genre blending, trope reinterpretation, and humor. Characters are multidimensional, with settings reflecting internal states. Language use is vivid, with varied sentence structures and a conversational tone. I will tailor these elements to the Writing Prompt, ensuring the story reflects the author's style while exploring the theme of unexpected divinity and the dynamics of belief and identity.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Use a non-linear narrative to explore the protagonist's past and present. Begin with the moment they realize their divinity upon gaining a follower, then shift to flashbacks of their life before this revelation. For example, depict a scene where the protagonist unknowingly performs a miracle in their childhood, hinting at their divine nature.\n  - Focus on internal conflict as the protagonist grapples with the moral implications of their newfound status. Illustrate their struggle with questions of responsibility and identity, such as whether to use their powers for personal gain or the greater good.\n  - Introduce a twist that recontextualizes the protagonist's understanding of their divinity. Perhaps the follower is not what they seem, or the protagonist's powers have unintended consequences.\n  - Conclude with an open-ended resolution, leaving the protagonist's future and the nature of their divinity ambiguous. For instance, end with the protagonist contemplating their next steps, leaving the reader to ponder the implications of their choices.\n  - Use dialogue to reveal key plot points and the protagonist's internal state. For example, a conversation with the follower could reveal the follower's motivations and the protagonist's doubts.\n\n- **Creativity**:  \n  - Blend elements of fantasy and existential exploration to create a unique narrative world. Introduce fantastical elements, such as divine powers manifesting in unexpected ways, while exploring philosophical questions about belief and identity.\n  - Reinterpret traditional godhood tropes by presenting the protagonist as an ordinary person thrust into an extraordinary role. Challenge reader expectations by depicting a god who is unsure and flawed.\n  - Incorporate imaginative elements that challenge expectations, such as a world where gods are common but unaware of their status until they gain followers.\n  - Use humor and satire to critique societal norms about power and divinity. For example, depict the protagonist's awkward attempts to fulfill their follower's expectations, highlighting the absurdity of divine responsibilities.\n  - Explore speculative scenarios to delve into philosophical questions about faith and self-discovery. For instance, consider how the protagonist's perception of themselves changes with the knowledge of their divinity.\n\n- **Development (Character and Setting)**:  \n  - Develop the protagonist as a multidimensional character with a complex emotional arc. Focus on their journey of self-discovery as they navigate their new identity as a god.\n  - Create settings that reflect the protagonist's internal state. For example, a chaotic cityscape could mirror their confusion and uncertainty, while a serene natural setting might represent moments of clarity and acceptance.\n  - Use secondary characters, such as the follower, to highlight the protagonist's traits and decisions. The follower's unwavering belief could contrast with the protagonist's self-doubt, driving character development.\n  - Build an immersive world with distinct rules about divinity and followers, enhancing the narrative's believability. Define how followers influence a god's power and the societal implications of being a god.\n  - Explore the impact of societal structures on the protagonist, critiquing the expectations placed on divine figures. For instance, depict how society reacts to the emergence of a new god and the pressures it places on the protagonist.\n\n- **Language Use**:  \n  - Employ vivid, sensory imagery to create an immersive atmosphere. Describe the protagonist's experiences with divine powers in detail, evoking awe and wonder.\n  - Use dialogue to reveal character traits and advance the plot, incorporating wit and humor. For example, the protagonist's banter with their follower can highlight their personality and the absurdity of their situation.\n  - Vary sentence structures to control pacing and build tension. Use short, fragmented sentences to convey the protagonist's shock upon discovering their divinity, and longer, flowing sentences to depict moments of introspection.\n  - Employ rhetorical devices and figures of speech to enhance the narrative's tone. Use metaphors and similes to convey the protagonist's internal conflict and the surreal nature of their experiences.\n  - Write in a conversational tone to create intimacy with the reader. Use informal language to draw the reader into the protagonist's journey, making their divine discovery relatable and engaging.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a wizard explaining their lack of faith in magic, akin to software designers' skepticism about software. This scenario offers opportunities for humor, satire, and philosophical exploration, which are consistent with the author's style. I will incorporate non-linear narrative elements, internal conflicts, and unexpected resolutions in the plot. Creativity will involve blending fantasy with modern skepticism, reinterpreting traditional wizard tropes, and using humor to critique societal norms. Character development will focus on multidimensional characters and settings that reflect internal states. Language use will include vivid imagery, witty dialogue, varied sentence structures, and a conversational tone.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Begin with a non-linear narrative structure. Introduce the wizard's skepticism through a flashback to a failed spell that had unintended consequences, revealing their internal conflict with magic.  \n  - Develop the plot through internal struggles and moral dilemmas. The wizard should grapple with the ethical implications of using magic, paralleling a software designer's concerns about technology's impact.  \n  - Introduce a twist or unexpected revelation. Perhaps the wizard discovers that their skepticism is itself a form of magic, recontextualizing their understanding of their abilities.  \n  - Leave the ending open to interpretation. Allow the reader to ponder whether the wizard's skepticism is justified or if it is a self-imposed limitation.  \n  - Use dialogue to drive the plot. Have the wizard explain their reasoning to the party through witty and insightful conversations, revealing key plot points and character motivations.  \n\n- **Creativity**:  \n  - Blend fantasy with modern skepticism. Create a world where magic is as unreliable as software, incorporating elements of both genres to explore the theme of faith in one's tools.  \n  - Reinterpret traditional wizard tropes. Present the wizard as a reluctant user of magic, akin to a tech-savvy individual wary of over-reliance on technology.  \n  - Introduce imaginative elements that challenge expectations. Perhaps the wizard uses mundane objects, like a smartphone, to perform spells, highlighting the absurdity of their situation.  \n  - Incorporate humor and satire. Use the wizard's explanations to humorously critique both the fantasy world's reliance on magic and modern society's dependence on technology.  \n  - Explore philosophical questions. Use the narrative to delve into themes of trust, reliability, and the nature of belief in one's abilities and tools.  \n\n- **Development (Character and Setting)**:  \n  - Develop the wizard as a multidimensional character with a complex emotional arc. Explore their journey of self-discovery as they reconcile their skepticism with their identity as a wizard.  \n  - Create a setting that reflects the wizard's internal state. Perhaps the environment is a chaotic blend of magical and technological elements, symbolizing the wizard's internal conflict.  \n  - Use secondary characters to highlight the wizard's traits. The party members can serve as foils, each representing different attitudes towards magic and technology.  \n  - Build an immersive world with distinct rules. Establish a setting where magic and technology coexist, each with its own limitations and quirks, enhancing the narrative's believability.  \n  - Critique societal structures through the wizard's experiences. Explore how societal expectations of magic use impact the wizard's decisions and self-perception.  \n\n- **Language Use**:  \n  - Employ vivid, sensory imagery to create an immersive atmosphere. Describe the wizard's spells and the chaotic environment in detail to evoke emotional responses.  \n  - Use dialogue effectively to reveal character traits and advance the plot. Incorporate wit and humor in the wizard's conversations with the party, showcasing their personality and skepticism.  \n  - Vary sentence structures to control pacing and build tension. Use short, fragmented sentences during moments of doubt or revelation to convey the wizard's internal turmoil.  \n  - Employ rhetorical devices and figures of speech. Use wordplay and puns in the wizard's explanations to enhance the narrative's tone and meaning.  \n  - Write in a conversational tone. Create a sense of intimacy and immediacy with the reader, drawing them into the wizard's humorous and philosophical predicament.  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet to identify key storytelling elements that define the author's style. The prompt involves a witch who is surprised by an unknown teenager in her woods, suggesting themes of mystery, magic, and potential conflict. The author's style includes non-linear narratives, internal conflicts, genre blending, and vivid language, which can be effectively applied to this prompt. I will create Story Rules that incorporate these elements, ensuring they are actionable and tailored to the narrative of the witch and the mysterious teenager.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Use a non-linear narrative structure by incorporating flashbacks that reveal the witch's past interactions with the woods and its inhabitants. For example, include a scene where the witch recalls a past encounter with a mysterious figure who warned her of future disruptions.\n  - Introduce conflict through the witch's internal struggle with her own powers and the uncertainty of the teenager's intentions. For instance, depict her questioning her abilities and the reliability of her magical senses.\n  - Conclude the story with a twist that recontextualizes the teenager's presence, such as revealing they are a manifestation of the woods' magic seeking the witch's help.\n  - Leave the ending open to interpretation, allowing readers to ponder the future relationship between the witch and the teenager. For example, suggest that the teenager might be a future ally or a hidden threat.\n  - Use dialogue between the witch and the teenager to drive the plot, revealing key information about the teenager's background and purpose through their conversation.\n\n- **Creativity**:\n  - Blend elements of fantasy and mystery to create a unique story world. For example, describe the woods as a living entity with its own consciousness that occasionally communicates with the witch.\n  - Reinterpret traditional witch tropes by presenting the witch as a guardian of the woods rather than a solitary figure, offering a fresh perspective on her role.\n  - Introduce imaginative elements that challenge expectations, such as the teenager possessing an unusual artifact that disrupts the witch's magic.\n  - Incorporate humor and satire by having the witch humorously critique modern technology or societal norms when interacting with the teenager, who might be more familiar with the outside world.\n  - Use speculative scenarios to explore philosophical questions, such as the nature of knowledge and the limits of foresight, through the witch's reflections on her powers.\n\n- **Development (Character and Setting)**:\n  - Develop the witch as a multidimensional character with a complex emotional arc, exploring themes of identity and self-discovery as she interacts with the teenager.\n  - Create a richly detailed setting where the woods reflect the witch's internal state, perhaps becoming more chaotic or serene based on her emotions.\n  - Use the teenager as a secondary character to highlight the witch's traits and decisions, contrasting their youthful curiosity with her seasoned wisdom.\n  - Establish an immersive world with distinct magical rules, such as specific rituals the witch performs to maintain harmony in the woods.\n  - Explore the impact of societal structures on the witch, such as her role as an outcast or protector, and how these expectations influence her actions.\n\n- **Language Use**:\n  - Employ vivid, sensory imagery to create an immersive atmosphere, describing the woods with rich details that evoke a sense of mystery and magic.\n  - Use dialogue to reveal character traits and advance the plot, incorporating wit and humor in the witch's exchanges with the teenager.\n  - Vary sentence structures to control pacing and build tension, using short, fragmented sentences during moments of surprise or discovery.\n  - Employ rhetorical devices and figures of speech to enhance the narrative's tone, such as metaphors comparing the woods to a living tapestry.\n  - Write in a conversational tone to create intimacy and immediacy, drawing the reader into the witch's perspective and her interactions with the teenager.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet to identify key storytelling elements and techniques. The prompt involves an immortal character born in 1986, which suggests a blend of modern and timeless themes. The author’s style includes non-linear narratives, internal conflicts, genre blending, and humor, which can be effectively applied to this prompt. I will create rules that incorporate these elements, ensuring they align with the prompt's themes of immortality and modernity. The rules will be structured under the categories of Plot, Creativity, Development (Character and Setting), and Language Use, providing detailed guidance for each aspect.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Use a non-linear narrative to explore the protagonist's life, shifting between key moments from 1986 to the present. For example, reveal a flashback to the protagonist's first realization of their immortality during a mundane event in the 1990s, contrasting it with a present-day scenario where they struggle with the monotony of eternal life.\n  - Introduce conflict through the protagonist's internal struggle with their immortality, such as feelings of isolation or the burden of outliving loved ones. Avoid external threats; instead, focus on their existential dilemmas.\n  - Incorporate a twist that recontextualizes the protagonist's understanding of immortality, such as discovering a hidden purpose or a new perspective on their eternal life.\n  - Leave the ending open to interpretation, perhaps by hinting at a new beginning or an unresolved question about the nature of immortality, encouraging reader engagement.\n  - Use dialogue to reveal key plot points, such as a conversation with a friend or a fellow immortal that uncovers new insights about their condition.\n\n- **Creativity**:  \n  - Blend genres by incorporating elements of fantasy and modern life, such as the protagonist using contemporary technology to explore ancient myths or legends about immortality.\n  - Reinterpret traditional immortality tropes by focusing on the protagonist's modern experiences, like dealing with the digital age or pop culture references that highlight their unique perspective.\n  - Introduce imaginative elements that challenge expectations, such as the protagonist's ability to influence time in subtle ways, affecting minor events without altering history.\n  - Use humor and satire to critique societal norms, such as the protagonist's humorous take on modern trends or their interactions with people who romanticize immortality without understanding its downsides.\n  - Explore philosophical questions about the meaning of life and the value of time through speculative scenarios, like the protagonist contemplating the impact of their eternal existence on their identity.\n\n- **Development (Character and Setting)**:  \n  - Develop the protagonist as a multidimensional character with a complex emotional arc, exploring themes of identity and self-discovery as they navigate their eternal life.\n  - Create settings that reflect the protagonist's internal state, such as a bustling city that mirrors their chaotic thoughts or a serene landscape that offers moments of clarity.\n  - Use secondary characters to highlight the protagonist's traits, such as a mortal friend who provides a contrasting perspective on life and time.\n  - Build an immersive world with distinct rules about immortality, such as specific conditions or limitations that the protagonist must navigate, enhancing the narrative's believability.\n  - Critique societal structures through the protagonist's interactions with modern institutions, exploring how their immortality challenges conventional norms and expectations.\n\n- **Language Use**:  \n  - Employ vivid, sensory imagery to create an immersive atmosphere, such as detailed descriptions of the protagonist's surroundings that evoke the passage of time and the weight of eternity.\n  - Use dialogue to reveal character traits and advance the plot, incorporating wit and humor to reflect the protagonist's unique perspective on life.\n  - Vary sentence structures to control pacing and build tension, using short, fragmented sentences to convey moments of realization or longer, flowing sentences to reflect the protagonist's introspection.\n  - Employ rhetorical devices and figures of speech to enhance the narrative's tone, such as metaphors that compare immortality to a never-ending journey or similes that highlight the protagonist's detachment from time.\n  - Write in a conversational tone to create intimacy with the reader, drawing them into the protagonist's world and making their experiences relatable despite the fantastical premise.  \n</story_rules>"
]