[
    "<thinking>  \nAnalyze the Author Writing Sheet for all four categories in depth to infer patterns, unique traits, and key elements of the author’s storytelling style. Reflect on how these elements can be adapted to suit the Writing Prompt. Use this analysis to craft **Story Rules** enriched with tailored examples inspired by the Evidence, ensuring alignment with both the Writing Prompt and the Author Writing Sheet.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the story around a central conflict that challenges societal norms or legal boundaries. For example, the protagonist must navigate the legal and ethical implications of dungeon crawling, which is often mistaken for grave robbing.\n  - Incorporate a twist or unexpected revelation to drive the plot forward. For instance, reveal that the protagonist's dungeon crawling is actually part of a larger quest to protect the town from an ancient curse.\n  - Use a setting that allows for exploration of complex moral and ethical issues, such as a courtroom or a town council meeting where the protagonist must defend their actions.\n  - Resolve the narrative with a sense of justice or moral resolution. Ensure that the protagonist's true intentions are recognized, and they are vindicated in the eyes of their parents and the community.\n  - Juxtapose mundane activities with extraordinary circumstances to create humor or irony. For example, the protagonist could be seen using dungeon-crawling tools for everyday tasks, like using a grappling hook to retrieve a lost item from a tree.\n\n- **Creativity**:\n  - Blend genres by mixing elements of fantasy, adventure, and realism. For example, combine the fantastical elements of dungeon crawling with the realistic challenges of explaining this to skeptical parents.\n  - Subvert conventional tropes in unique ways. For instance, instead of the protagonist being a typical treasure hunter, they could be a historian seeking to preserve ancient artifacts.\n  - Integrate imaginative and unique elements to enhance the narrative's depth. Introduce magical creatures or enchanted items that the protagonist encounters during their dungeon crawls.\n  - Use humor and irony to add a creative twist to the narrative. For example, the protagonist could humorously compare their dungeon-crawling adventures to mundane family activities, like grocery shopping.\n  - Explore themes of identity and transformation through fantastical elements. Show how the protagonist's experiences in the dungeons shape their identity and how they are perceived by others.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters who face moral or ethical dilemmas. The protagonist should grapple with the ethical implications of their dungeon crawling and how it affects their relationship with their parents.\n  - Create immersive settings that reflect the story's tone and themes. Describe the dungeons in vivid detail, highlighting their eerie and mysterious atmosphere.\n  - Use detailed descriptions to bring characters and settings to life. For example, describe the protagonist's gear and the intricate designs of the dungeon traps.\n  - Portray characters with strong emotional arcs, highlighting their growth and development. Show the protagonist's journey from being misunderstood to gaining acceptance and respect.\n  - Include interactions that reveal character relationships and dynamics. For instance, depict the protagonist's conversations with their parents, showcasing the tension and eventual understanding.\n\n- **Language Use**:\n  - Employ vivid, sensory imagery to create an immersive atmosphere. Describe the sights, sounds, and smells of the dungeons to draw readers into the setting.\n  - Use dialogue effectively to reveal character traits and advance the plot. The protagonist's conversations with their parents should reveal their motivations and the challenges they face.\n  - Maintain a formal and articulate tone, especially in dialogue and narration. For example, the protagonist could use formal language when explaining the historical significance of their finds.\n  - Incorporate rhetorical devices and figures of speech to enhance the narrative. Use metaphors and similes to describe the dungeons and the protagonist's experiences.\n  - Vary sentence structure to maintain a dynamic and engaging narrative pace. Alternate between short, punchy sentences during action scenes and longer, descriptive sentences during exploration.\n  - Use first-person and third-person perspectives to provide different narrative angles. Consider using first-person for the protagonist's internal monologues and third-person for broader narrative descriptions.\n  - Include internal monologues to provide deeper insight into characters' thoughts and motivations. Show the protagonist's internal struggle with their identity as a dungeon crawler and their desire for parental approval.\n</story_rules>",
    "<thinking>  \nTo generate the Story Rules, I will analyze the Author Writing Sheet for each category—Plot, Creativity, Development (Character and Setting), and Language Use. I will identify key elements and patterns in the author's storytelling style and adapt them to the Writing Prompt about a terrible mage who, through luck, defeats an archmage and must now contend with the responsibilities and protests that follow. I will ensure the rules are actionable, detailed, and aligned with both the author's style and the Writing Prompt.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Incorporate a twist or unexpected revelation to drive the plot forward. For example, reveal that the archmage's defeat was part of a larger, hidden plan to test the mage's true potential or to uncover a conspiracy within the mage council.\n  - Structure the story around the central conflict of the mage's unqualified status challenging societal norms and the ancient tradition. Highlight the protests and debates among the mages regarding the legitimacy of the mage's new position.\n  - Use a courtroom or debate setting to explore the complex moral and ethical issues surrounding the mage's unexpected rise to power. For instance, include scenes where the mage must defend their position in front of a council of elder mages.\n  - Resolve the narrative with a sense of justice or moral resolution. Ensure that by the end, the mage either proves their worth through an unexpected act of bravery or wisdom or steps down in favor of a more qualified candidate, thus restoring balance.\n  - Juxtapose mundane activities with extraordinary circumstances to create humor or irony. For example, show the mage struggling with simple spells while being expected to perform grand magical feats, leading to humorous situations.\n\n- **Creativity**:\n  - Blend genres by mixing elements of fantasy, comedy, and realism. For instance, combine the magical setting with the realistic struggles of an unqualified individual trying to fit into a prestigious role.\n  - Subvert conventional tropes by having the mage's incompetence turn out to be an advantage in unexpected ways. For example, their lack of traditional training allows them to think outside the box and solve problems in unconventional ways.\n  - Integrate imaginative and unique elements to enhance the narrative's depth. Introduce magical artifacts or creatures that the mage interacts with, each adding a layer of complexity to their journey.\n  - Use humor and irony to add a creative twist to the narrative. Highlight the mage's clumsy attempts at magic and the ironic situations that arise from their unexpected success.\n  - Explore themes of identity and transformation through the mage's journey. Show how the mage's perception of themselves and their abilities evolves as they navigate their new role and the challenges it brings.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters who face moral or ethical dilemmas. For example, the mage grapples with the ethical implications of holding a position they feel unqualified for and the responsibility it entails.\n  - Create immersive settings that reflect the story's tone and themes. Describe the grandiose and intimidating environment of the archmage's tower, contrasting it with the mage's humble origins.\n  - Use detailed descriptions to bring characters and settings to life. Provide vivid imagery of the mage's appearance, the magical council chambers, and the various magical artifacts they encounter.\n  - Portray characters with strong emotional arcs, highlighting their growth and development. Show the mage's journey from self-doubt to a more confident and capable individual, or their decision to step down for the greater good.\n  - Include interactions that reveal character relationships and dynamics. Depict the mage's interactions with other mages, both supportive and antagonistic, to highlight the complex relationships and power dynamics at play.\n\n- **Language Use**:\n  - Employ vivid, sensory imagery to create an immersive atmosphere. Describe the sights, sounds, and smells of the magical world, such as the crackling energy of spells or the musty scent of ancient tomes.\n  - Use dialogue effectively to reveal character traits and advance the plot. Craft conversations that showcase the mage's insecurities, the skepticism of other mages, and the debates over the mage's qualifications.\n  - Maintain a formal and articulate tone, especially in dialogue and narration. Reflect the prestigious and traditional nature of the mage society through the characters' speech and the narrative style.\n  - Incorporate rhetorical devices and figures of speech to enhance the narrative. Use metaphors, similes, and rhetorical questions to add depth and engage the reader.\n  - Vary sentence structure to maintain a dynamic and engaging narrative pace. Mix longer, descriptive sentences with shorter, impactful ones to keep the reader's interest.\n  - Use first-person and third-person perspectives to provide different narrative angles. Consider using first-person for the mage's internal monologues and third-person for broader narrative descriptions.\n  - Include internal monologues to provide deeper insight into the mage's thoughts and motivations. Show the mage's internal struggle with their new role and their reflections on the events unfolding around them.\n</story_rules>",
    "<thinking>  \nTo generate the Story Rules, I will analyze the Author Writing Sheet for each category—Plot, Creativity, Development (Character and Setting), and Language Use. I will identify key elements and patterns in the author's style and adapt them to the Writing Prompt, ensuring the rules are actionable, detailed, and aligned with the prompt's themes of survival, competition, and existential stakes. I will incorporate specific examples inspired by the Evidence to illustrate the rules effectively.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Introduce a central conflict that challenges societal norms or ethical boundaries. For example, explore the moral implications of forced survival and the ethical dilemmas faced by characters who must choose between fighting and preserving their humanity.\n  - Incorporate a twist or unexpected revelation to drive the plot forward. For instance, reveal that one of the characters has a hidden ability or knowledge about the new dimension that changes the stakes of the survival game.\n  - Use a structured setting, such as a debate or council meeting among the survivors, to explore complex moral and ethical issues. This setting can serve as a platform for characters to discuss strategies, form alliances, and confront the ethical implications of their situation.\n  - Resolve the narrative with a sense of justice or moral resolution. Ensure that the conclusion reflects the protagonist's journey and the ethical choices made throughout the story. For example, the last survivor might find a way to end the cycle of forced survival, bringing a sense of justice to the narrative.\n  - Juxtapose mundane activities with extraordinary circumstances to create humor or irony. For example, depict characters engaging in everyday tasks like cooking or repairing equipment while discussing their survival strategies, highlighting the contrast between normalcy and the dire situation.\n\n- **Creativity**:\n  - Blend genres by incorporating elements of science fiction, fantasy, and realism. For example, mix the high-stakes survival scenario with fantastical creatures and advanced technology in the new dimension.\n  - Subvert conventional tropes by reinterpreting them in unique ways. For instance, instead of a typical battle royale, introduce a twist where cooperation and empathy become key survival strategies, challenging the expectation of ruthless competition.\n  - Integrate imaginative and unique elements to enhance the narrative's depth. For example, create a diverse array of environments within the new dimension, each with its own challenges and resources, adding complexity to the survival game.\n  - Use humor and irony to add a creative twist to the narrative. For example, include a character who uses humor to cope with the stress of the situation, providing a light-hearted counterpoint to the tension.\n  - Explore themes of identity and transformation through fantastical elements. For instance, characters might undergo physical or psychological changes as they adapt to the new dimension, reflecting their inner struggles and growth.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters who face moral or ethical dilemmas. For example, create characters with diverse backgrounds and motivations, each grappling with the ethical implications of their actions in the survival game.\n  - Create immersive settings that reflect the story's tone and themes. For example, describe the new dimension with vivid detail, highlighting its alien landscapes, dangerous creatures, and mysterious structures to create a sense of wonder and peril.\n  - Use detailed descriptions to bring characters and settings to life. For instance, describe a character's appearance, mannerisms, and emotional state in detail, as well as the environment they navigate, to create a vivid and immersive experience.\n  - Portray characters with strong emotional arcs, highlighting their growth and development. For example, show a character's journey from fear and reluctance to courage and determination as they adapt to the survival game.\n  - Include interactions that reveal character relationships and dynamics. For example, depict alliances, rivalries, and betrayals among the characters, using dialogue and actions to reveal their personalities and motivations.\n\n- **Language Use**:\n  - Employ vivid, sensory imagery to create an immersive atmosphere. For example, describe the sights, sounds, and smells of the new dimension in detail, making the reader feel as if they are experiencing it alongside the characters.\n  - Use dialogue effectively to reveal character traits and advance the plot. For instance, use conversations between characters to reveal their motivations, fears, and strategies, driving the narrative forward.\n  - Maintain a formal and articulate tone, especially in dialogue and narration. For example, use precise and sophisticated language to convey the gravity of the situation and the characters' determination.\n  - Incorporate rhetorical devices and figures of speech to enhance the narrative. For example, use metaphors and similes to describe the new dimension and the characters' experiences, adding depth and richness to the prose.\n  - Vary sentence structure to maintain a dynamic and engaging narrative pace. For instance, use short, punchy sentences during action scenes to create tension and longer, descriptive sentences during moments of reflection.\n  - Use first-person and third-person perspectives to provide different narrative angles. For example, switch between a first-person perspective to provide an intimate view of a character's thoughts and a third-person perspective to describe the broader events and setting.\n  - Include internal monologues to provide deeper insight into characters' thoughts and motivations. For instance, use internal monologues to reveal a character's inner conflict and decision-making process as they navigate the survival game.\n</story_rules>",
    "<thinking>  \nAnalyze the Author Writing Sheet to identify key storytelling elements and stylistic traits. Adapt these elements to the Writing Prompt, ensuring the Story Rules reflect the author's unique style while aligning with the narrative potential of being reincarnated as the god of a newly formed universe.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Introduce a central conflict that challenges the protagonist's understanding of divinity and creation. For example, the protagonist discovers that their newly formed universe is unstable, and they must navigate the moral and ethical implications of their godly powers to stabilize it.\n  - Incorporate a twist or unexpected revelation to drive the plot forward. For instance, reveal that the protagonist's previous life memories influence their decisions as a god, leading to unforeseen consequences in the universe.\n  - Use a setting that allows for complex moral and ethical debates, such as a celestial council where gods discuss the fate of the universe. This setting can explore themes of power, responsibility, and justice.\n  - Resolve the narrative with a sense of justice or moral resolution. Ensure the protagonist's actions lead to a balanced and harmonious universe, reflecting their growth and understanding of their divine role.\n  - Juxtapose mundane activities with extraordinary circumstances to create humor or irony. For example, the protagonist might struggle with simple tasks like creating a planet's ecosystem, leading to humorous mishaps.\n\n- **Creativity**:\n  - Blend genres by incorporating elements of fantasy, science fiction, and realism. For example, the protagonist's divine powers could include both magical abilities and advanced technological control over the universe.\n  - Subvert conventional tropes by reinterpreting the role of a god. Instead of being omnipotent and infallible, the protagonist could be learning and making mistakes, adding depth to their character.\n  - Integrate imaginative and unique elements to enhance the narrative's depth. For instance, the protagonist could create sentient beings with unique cultures and societies, each presenting different challenges and perspectives.\n  - Use humor and irony to add a creative twist to the narrative. For example, the protagonist might accidentally create a species that worships them in a comically exaggerated manner.\n  - Explore themes of identity and transformation through the protagonist's journey as a god. Their past life experiences could shape their divine persona, leading to a deeper exploration of self-discovery and purpose.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a multidimensional character facing moral and ethical dilemmas. For example, they might struggle with decisions that affect the lives of their creations, questioning their right to intervene.\n  - Create immersive settings that reflect the story's tone and themes. Describe the newly formed universe in vivid detail, from celestial landscapes to the intricate societies of its inhabitants.\n  - Use detailed descriptions to bring characters and settings to life. For instance, describe the protagonist's divine form and the awe-inspiring beauty of the universe they create.\n  - Portray the protagonist's strong emotional arc, highlighting their growth and development. Show their journey from confusion and doubt to confidence and wisdom as they embrace their role as a god.\n  - Include interactions that reveal character relationships and dynamics. For example, the protagonist could interact with other gods or their creations, revealing different aspects of their personality and beliefs.\n\n- **Language Use**:\n  - Employ vivid, sensory imagery to create an immersive atmosphere. Describe the universe's creation with rich, evocative language that captures its wonder and majesty.\n  - Use dialogue effectively to reveal character traits and advance the plot. For instance, the protagonist's conversations with other gods or their creations can reveal their motivations and inner conflicts.\n  - Maintain a formal and articulate tone, especially in dialogue and narration. This tone can reflect the grandeur and seriousness of the protagonist's divine role.\n  - Incorporate rhetorical devices and figures of speech to enhance the narrative. Use metaphors and similes to describe the universe's creation and the protagonist's divine experiences.\n  - Vary sentence structure to maintain a dynamic and engaging narrative pace. Use shorter sentences for moments of tension and longer, descriptive sentences for world-building.\n  - Use first-person and third-person perspectives to provide different narrative angles. The first-person perspective can offer an intimate view of the protagonist's thoughts, while the third-person perspective can provide a broader view of the universe.\n  - Include internal monologues to provide deeper insight into the protagonist's thoughts and motivations. These monologues can reveal their struggles, doubts, and growth as they navigate their divine responsibilities.\n</story_rules>",
    "<thinking>  \nAnalyze the Author Writing Sheet for all four categories in depth to infer patterns, unique traits, and key elements of the author’s storytelling style. Reflect on how these elements can be adapted to suit the Writing Prompt. Use this analysis to craft **Story Rules** enriched with tailored examples inspired by the Evidence, ensuring alignment with both the Writing Prompt and the Author Writing Sheet.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Introduce a central conflict that challenges societal norms or legal boundaries. For example, the protagonist could be a figure who defies Death's authority, questioning the natural order and the concept of mortality.\n  - Incorporate a twist or unexpected revelation to drive the plot forward. For instance, reveal that the protagonist has a unique power or secret that allows them to stand against Death, such as being a reincarnated deity or possessing an ancient artifact.\n  - Use a setting that allows for complex moral and ethical debates, such as a grand hall where souls are judged, to explore the implications of defying Death.\n  - Resolve the narrative with a sense of justice or moral resolution. Ensure that the protagonist's defiance leads to a broader understanding or change in the rules governing life and death.\n  - Juxtapose mundane activities with extraordinary circumstances to create humor or irony. For example, the protagonist could be casually sipping tea or reading a book while having a profound conversation with Death.\n\n- **Creativity**:\n  - Blend genres by mixing elements of fantasy, mythology, and realism. For example, incorporate mythological references to gods and the afterlife alongside a realistic portrayal of the protagonist's emotions and struggles.\n  - Subvert conventional tropes by reinterpreting the role of Death. Instead of a grim reaper, Death could be portrayed as a bureaucratic figure frustrated by the protagonist's noncompliance.\n  - Integrate imaginative and unique elements to enhance the narrative's depth. For instance, the protagonist could have a backstory involving a quest for immortality or a pact with ancient spirits.\n  - Use humor and irony to add a creative twist to the narrative. For example, Death could be exasperated by the protagonist's nonchalant attitude, leading to humorous exchanges.\n  - Explore themes of identity and transformation through fantastical elements. The protagonist's journey could involve discovering their true nature or purpose, which empowers them to stand against Death.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters who face moral or ethical dilemmas. The protagonist should grapple with the implications of defying Death and the potential consequences for themselves and others.\n  - Create immersive settings that reflect the story's tone and themes. For example, describe a majestic, otherworldly court where souls are judged, with intricate details that evoke a sense of awe and mystery.\n  - Use detailed descriptions to bring characters and settings to life. Describe Death's appearance and demeanor vividly, as well as the protagonist's unique traits and surroundings.\n  - Portray characters with strong emotional arcs, highlighting their growth and development. The protagonist should evolve from uncertainty to confidence in their defiance of Death.\n  - Include interactions that reveal character relationships and dynamics. Show the protagonist's interactions with other souls or beings in the afterlife, revealing their motivations and alliances.\n\n- **Language Use**:\n  - Employ vivid, sensory imagery to create an immersive atmosphere. Describe the ethereal glow of the afterlife, the chilling presence of Death, and the protagonist's defiant stance in rich detail.\n  - Use dialogue effectively to reveal character traits and advance the plot. Craft exchanges between Death and the protagonist that reveal their personalities and the stakes of their confrontation.\n  - Maintain a formal and articulate tone, especially in dialogue and narration. Use elevated language to reflect the gravity of the encounter with Death.\n  - Incorporate rhetorical devices and figures of speech to enhance the narrative. Use metaphors and similes to describe the protagonist's defiance and the surreal nature of the afterlife.\n  - Vary sentence structure to maintain a dynamic and engaging narrative pace. Alternate between long, descriptive sentences and short, impactful statements to keep the reader engaged.\n  - Use first-person and third-person perspectives to provide different narrative angles. Consider using third-person to describe the setting and first-person for the protagonist's internal thoughts.\n  - Include internal monologues to provide deeper insight into characters' thoughts and motivations. Show the protagonist's internal struggle and reasoning behind their defiance of Death.\n\n</story_rules>"
]