[
    "<thinking>\nThe writing prompt presents a scenario involving a council that sets strict criteria for immortality and rebirth of a universe. The protagonist is accused of cheating by ending their universe without allowing it to be reborn. This prompt suggests themes of immortality, cosmic rebirth, and judgment, with potential for dramatic conflict and introspection.\n\nThe user profile indicates a preference for vivid descriptions, immediate conflict, and tension in the story beginning. The endings are typically dramatic and open-ended, leaving readers curious. The narrative structure can be either chronological or non-linear but always maintains clear progression. The user introduces unique elements, subverts common tropes, and employs engaging themes and imagery. Characters are developed through actions, dialogue, and internal struggles, with immersive settings that reflect the protagonist's state of mind. The first-person narrative perspective is used to provide depth, with varied sentence structures, descriptive language, and occasional humor and irony. The tone and mood are consistently aligned with the prompt.\n\nCombining these insights, the Story Rules will guide the creation of a story that begins with immediate conflict, develops through vivid descriptions and unique elements, and concludes with a dramatic, open-ended resolution. The narrative will be immersive, with well-developed characters and settings, and will use a first-person perspective to convey the protagonist's internal experiences.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Start with a vivid description of the council chamber, immediately introducing the conflict as the protagonist stands accused. Use sensory details to create a tense atmosphere, such as the echoing voices of the council members and the protagonist's racing thoughts.\n\n#### Story Ending\n- Conclude with a dramatic and open-ended scene where the protagonist reflects on the council's judgment and their own actions. Leave the reader curious about the protagonist's future and the potential for redemption or further conflict.\n\n#### Narrative Structure\n- Use a non-linear structure to reflect the protagonist's disorientation and the cosmic nature of the story. Include flashbacks to the protagonist's actions that led to the council's judgment, interspersed with the present confrontation.\n\n---\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements such as the concept of cosmic rebirth and the mechanics of how universes are reborn. Add depth by exploring the protagonist's unique experiences and the consequences of their actions.\n\n#### Engaging Themes and Imagery\n- Use themes of immortality, judgment, and cosmic rebirth to create a rich narrative. Employ vivid imagery to describe the council chamber, the protagonist's memories of their universe, and the cosmic events they witnessed.\n\n#### Use of Tropes or Clichés\n- Subvert common tropes related to immortality and cosmic judgment by presenting the protagonist's actions and motivations in a unique light. Highlight their internal struggles and the moral ambiguity of their choices.\n\n---\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist through their actions, dialogue, and internal monologue. Reveal their complex personality, motivations, and the internal conflict they face regarding their actions and the council's judgment.\n\n#### Setting Establishment\n- Create an immersive setting for the council chamber with detailed descriptions that reflect the protagonist's state of mind. Use sensory details to enhance the atmosphere and make the environment feel vivid and relevant.\n\n#### Supporting Characters and Interactions\n- Introduce council members as supporting characters who play significant roles in advancing the plot. Use their interactions with the protagonist to add depth to the narrative and provide additional context about the protagonist's situation.\n\n---\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a first-person narrative perspective to provide an intimate view of the protagonist's thoughts and feelings. This perspective will enhance the storytelling by conveying the protagonist's internal experiences and reflections.\n\n#### Stylistic Elements\n- Employ varied sentence structures, a mix of straightforward and descriptive language, and occasional humor and irony to enhance the narrative. Use descriptive and evocative language to reinforce the tone and mood.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the prompt's themes of immortality, judgment, and cosmic rebirth. Use specific word choices and recurring themes to reinforce the narrative's atmosphere and enhance the reader's experience and immersion.\n</story_rules>",
    "<thinking>\nThe writing prompt presents a scenario where the protagonist is determined to prevent an unworthy man, supposedly chosen by the stars, from taking over something they have built. The key thematic elements include leadership, destiny, ambition, and resistance. The tone is serious and determined, with a sense of urgency and conflict.\n\nThe user profile indicates a preference for vivid descriptions, immediate conflict, and dynamic openings. The user often concludes stories with dramatic, open-ended endings, leaving readers curious. Their narrative structure can be both chronological and non-linear, maintaining clear progression. The user introduces unique elements, subverts common tropes, and employs engaging themes and imagery. Characters are developed through actions, dialogue, and internal struggles, with immersive settings that reflect the protagonist's state of mind. The first-person narrative perspective is commonly used, with varied sentence structures, descriptive language, and occasional humor and irony.\n\nCombining these insights, the Story Rules will guide the creation of a story that begins with immediate conflict, develops a complex protagonist and immersive setting, and concludes with a dramatic, open-ended resolution. The narrative will include unique elements and subverted tropes, maintaining a serious and determined tone throughout.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Start with a vivid description of the protagonist witnessing the man being chosen by the stars, immediately establishing the conflict and tension. Use sensory details to draw the reader in and set a dynamic tone.\n\n#### Story Ending\n- Conclude with a dramatic and open-ended scene where the protagonist's actions have significant consequences, leaving the reader curious about future developments. Use reflective thoughts and vivid imagery to enhance the final impact.\n\n#### Narrative Structure\n- Use a chronological structure with clear progression, but incorporate flashbacks or reflections to provide context and depth to the protagonist's motivations and past experiences. Ensure a cohesive connection between events.\n\n---\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements such as a mystical artifact or a hidden prophecy that the protagonist discovers, adding depth and originality to the narrative. Ensure these elements are integral to the plot and enhance the story's themes.\n\n#### Engaging Themes and Imagery\n- Explore themes of destiny versus free will, ambition, and resistance. Use vivid imagery to depict the protagonist's internal and external struggles, such as the oppressive atmosphere of the setting and the protagonist's determined expressions.\n\n#### Use of Tropes or Clichés\n- Subvert common tropes related to chosen ones and leadership by revealing the chosen man’s flaws and the protagonist’s unique perspective on destiny. Add originality by incorporating unexpected twists and the protagonist's personal insights.\n\n---\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist through their actions, dialogue, and internal monologue, revealing their complex personality and strong motivations. Show their determination and resilience in the face of the chosen man's ambition.\n\n#### Setting Establishment\n- Create an immersive setting with detailed descriptions that reflect the protagonist's state of mind and the story's themes. Use sensory details to depict the environment, such as the celestial phenomena and the protagonist's surroundings.\n\n#### Supporting Characters and Interactions\n- Introduce supporting characters that play significant roles in advancing the plot and adding depth to the narrative. Use their interactions with the protagonist to highlight the protagonist's struggles and motivations, and to provide additional context about the chosen man and the prophecy.\n\n---\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a first-person narrative perspective to provide an intimate view of the protagonist's thoughts and feelings. This perspective will enhance the storytelling by conveying the protagonist's emotions and reflections effectively.\n\n#### Stylistic Elements\n- Employ varied sentence structures, a mix of straightforward and descriptive language, and occasional humor and irony to enhance the storytelling. Use descriptive and evocative language, along with rhetorical questions and exclamations, to reinforce the tone and mood.\n\n#### Tone and Mood Alignment\n- Maintain a serious and determined tone throughout the story, using specific word choices and recurring themes to reinforce the narrative's atmosphere. Ensure the mood is consistent, enhancing the reader's experience and immersion.\n\n</story_rules>",
    "<thinking>\nThe writing prompt, \"Don't press the button.\" \"This button?\" \"No, this one-oh,\" suggests a scenario filled with tension, curiosity, and potential humor. The dialogue implies a situation where pressing a button could lead to unexpected or dramatic consequences. This sets the stage for a story that could explore themes of curiosity, unintended consequences, and perhaps a touch of chaos or humor.\n\nThe user profile indicates a storytelling style that begins with vivid descriptions and immediate conflict, often concluding with dramatic and open-ended endings. The user employs a mix of chronological and non-linear narrative structures, introduces unique elements, and subverts common tropes with originality. Characters are developed through actions, dialogue, and internal struggles, with immersive settings that reflect the protagonist's state of mind. The first-person narrative perspective is used to add depth, with varied sentence structures and a mix of straightforward and descriptive language, often incorporating humor and irony.\n\nCombining these insights, the story rules will need to ensure a dynamic and engaging opening, a clear progression of events, and a dramatic, open-ended conclusion. The narrative should include unique and imaginative elements, subvert common tropes, and develop characters and settings in a detailed and immersive manner. The language should be varied, descriptive, and align with the tone and mood suggested by the prompt.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Start with a vivid description of the setting where the button is located, immediately introducing the conflict or tension surrounding the button. Use sensory details to draw the reader in and set a dynamic tone.\n\n#### Story Ending\n- Conclude with a dramatic and open-ended scene that leaves the reader curious about the consequences of pressing the button. Use vivid imagery and reflective thoughts to enhance the final impact and provide a sense of continuation.\n\n#### Narrative Structure\n- Use a clear progression of events, whether chronological or non-linear, to maintain engagement. Ensure that each event logically follows from the previous one, with purposeful disruptions to reflect the unfolding chaos or humor.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique and imaginative elements related to the button and its consequences. Consider incorporating unexpected twists that add depth and originality to the narrative.\n\n#### Engaging Themes and Imagery\n- Explore themes of curiosity, unintended consequences, and chaos. Use vivid imagery to enhance the engagement, such as detailed descriptions of the button's appearance and the environment around it.\n\n#### Use of Tropes or Clichés\n- Subvert common tropes related to buttons and their consequences. For example, instead of a typical catastrophic result, consider a humorous or ironic twist that adds originality to the story.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist through their actions, dialogue, and internal struggles related to the button. Ensure their motivations and personality are well-established, making them relatable and engaging.\n\n#### Setting Establishment\n- Create an immersive setting with detailed descriptions that reflect the protagonist's state of mind or the story's themes. Make the environment around the button vivid and relevant to the narrative.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters that complement the protagonist and contribute meaningfully to the plot. Use their interactions to add emotional depth or advance the story, particularly in relation to the button and its consequences.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a first-person narrative perspective to provide depth to the protagonist's internal experiences. This perspective should offer an intimate view of their thoughts and feelings, enhancing the storytelling.\n\n#### Stylistic Elements\n- Employ varied sentence structures and a mix of straightforward and descriptive language. Incorporate humor and irony to enhance the narrative, using descriptive and evocative language to reinforce the tone and mood.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the tension, curiosity, and potential humor of the prompt. Use specific word choices and recurring themes to reinforce the narrative's atmosphere, ensuring consistency throughout the story.\n</story_rules>",
    "<thinking>\nThe writing prompt presents a scenario involving a curse that forces a character to tell the truth, leading to humorous and potentially awkward revelations. The tone is light-hearted with a touch of irony, focusing on the interplay between characters and the consequences of the curse. The prompt suggests a narrative that explores themes of honesty, social interactions, and the unintended consequences of magical interventions.\n\nThe user profile indicates a preference for vivid descriptions, immediate conflict, and engaging openings. The user often concludes stories with dramatic, open-ended endings, leaving readers curious about future developments. Their narrative structure can be both chronological and non-linear, maintaining a clear progression and connection between events. The user introduces unique elements and subverts common tropes, adding depth and originality to their stories. Characters are developed through actions, dialogue, and internal struggles, with immersive settings that reflect the protagonist's state of mind. The user employs a first-person narrative perspective, using varied sentence structures, descriptive language, and occasional humor and irony to enhance storytelling. The tone and mood are consistently aligned with the prompt, reinforcing the narrative's atmosphere.\n\nCombining these insights, the Story Rules will guide the creation of a story that begins with immediate conflict, uses vivid descriptions, and explores the humorous and awkward consequences of the curse. The narrative will be structured to maintain engagement, with unique elements and subverted tropes. Characters will be developed through their interactions and internal struggles, with immersive settings that enhance the narrative. The first-person perspective will provide depth, using varied sentence structures and descriptive language to maintain a light-hearted and ironic tone.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a vivid description of the moment the curse is cast, immediately introducing the conflict and tension. Use sensory details to draw the reader in and set the scene.\n\n#### Story Ending\n- Conclude with a dramatic and open-ended scene that leaves the reader curious about the future consequences of the curse. Use vivid imagery and reflective thoughts to enhance the final impact.\n\n#### Narrative Structure\n- Use a chronological structure with clear progression and connection between events. Ensure transitions between scenes are smooth and maintain the reader's engagement.\n\n---\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements related to the curse and its effects on the characters' interactions. Consider adding unexpected twists that subvert common tropes about truth-telling and curses.\n\n#### Engaging Themes and Imagery\n- Explore themes of honesty, social interactions, and unintended consequences. Use vivid imagery to enhance the humor and awkwardness of the characters' revelations.\n\n#### Use of Tropes or Clichés\n- Subvert common tropes about truth-telling and curses by adding unique twists and humorous elements. Ensure the narrative remains original and engaging.\n\n---\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist through their actions, dialogue, and internal struggles with the curse. Ensure their motivations and personality are well-established and relatable.\n\n#### Setting Establishment\n- Create immersive settings that reflect the protagonist's state of mind and the story's themes. Use detailed descriptions to bring the scenes to life and enhance the narrative's impact.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters that contribute meaningfully to the plot and highlight the protagonist's struggles. Use interactions to add depth and advance the story.\n\n---\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a first-person narrative perspective to provide an intimate view of the protagonist's thoughts and feelings. Ensure the tone aligns with the light-hearted and ironic nature of the prompt.\n\n#### Stylistic Elements\n- Employ varied sentence structures and descriptive language to enhance the storytelling. Include humor and irony to create impact and maintain the reader's engagement.\n\n#### Tone and Mood Alignment\n- Maintain a light-hearted and ironic tone throughout the story, using specific word choices and recurring themes to reinforce the narrative's atmosphere. Ensure the mood is consistent and enhances the reader's experience.\n\n</story_rules>",
    "<thinking>\nThe writing prompt presents a unique scenario where a vampire finds zombies to be a mere annoyance, with the real challenge being the search for an edible meal. This sets up a darkly humorous and potentially tense narrative. The user profile indicates a preference for vivid descriptions, immediate conflict, and a mix of chronological and non-linear narrative structures. The user also enjoys subverting common tropes with unique twists and developing complex main characters through their actions and internal struggles. The language use is characterized by a first-person perspective, varied sentence structures, and a mix of straightforward and descriptive language with occasional humor and irony.\n\nTo align with the user's style, the story should begin with a vivid and immediate conflict involving the vampire and zombies. The narrative should explore the vampire's internal struggles and motivations, using detailed descriptions to create an immersive setting. The story should subvert common vampire and zombie tropes with unique twists, maintaining a darkly humorous tone. The ending should be dramatic and open-ended, leaving the reader curious about future developments.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Start with a vivid and immediate conflict, such as the vampire encountering a horde of zombies. Use detailed descriptions to set the scene and establish the tension right away.\n\n#### Story Ending\n- Conclude with a dramatic and open-ended scene, such as the vampire discovering a potential meal but facing a new dilemma. Use vivid imagery and reflective thoughts to enhance the final impact and provide a sense of continuation.\n\n#### Narrative Structure\n- Use a mix of chronological and non-linear narrative structures to reflect the vampire's disorientation and internal struggles. Ensure a clear progression and connection between events to keep the reader engaged.\n\n---\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements that add depth and originality, such as the vampire's unique dietary restrictions or a humorous twist on the typical vampire-zombie dynamic.\n\n#### Engaging Themes and Imagery\n- Use themes of survival, identity, and disillusionment, with vivid imagery to enhance engagement. Describe the setting and situations in detail, such as the decaying cityscape and the vampire's internal reflections.\n\n#### Use of Tropes or Clichés\n- Subvert common vampire and zombie tropes with unique twists, such as the vampire finding zombies to be a mere annoyance rather than a threat. Incorporate humor and irony to add originality to the narrative.\n\n---\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the vampire protagonist through their actions, dialogue, and internal struggles. Reveal their complex personality and motivations, making them relatable and engaging.\n\n#### Setting Establishment\n- Create an immersive setting with detailed descriptions that reflect the vampire's state of mind and the story's themes. Describe the decaying cityscape and the eerie atmosphere in vivid detail.\n\n#### Supporting Characters and Interactions\n- Introduce supporting characters, such as other vampires or humans, that play significant roles in advancing the plot and adding depth to the narrative. Use their interactions with the protagonist to highlight the vampire's struggles and motivations.\n\n---\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a first-person narrative perspective to provide an intimate view of the vampire's thoughts and feelings. Employ dialogue and internal monologue effectively to convey the protagonist's emotions and reflections.\n\n#### Stylistic Elements\n- Employ varied sentence structures and a mix of straightforward and descriptive language. Use occasional humor and irony to enhance the storytelling. Include rhetorical questions and exclamations to reinforce the tone and mood.\n\n#### Tone and Mood Alignment\n- Maintain a darkly humorous tone and a tense, eerie mood throughout the story. Use specific word choices and recurring themes to reinforce the narrative's atmosphere, enhancing the reader's experience and immersion.\n\n</story_rules>"
]