[
    "<thinking>  \nAnalyze the Author Writing Sheet for all four categories in depth to infer patterns, unique traits, and key elements of the author’s storytelling style. Reflect on how these elements can be adapted to suit the Writing Prompt. Use this analysis to craft **Story Rules** enriched with tailored examples inspired by the Evidence, ensuring alignment with both the Writing Prompt and the Author Writing Sheet.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Use a non-linear timeline to enhance the narrative. For example, have the protagonist recall different moments from their past lives and the end of their universe, jumping between these memories to create a fragmented and non-linear narrative.\n  - Incorporate a sense of mystery and gradual revelation of the plot. Slowly reveal the protagonist's backstory and the true nature of their actions that led to the end of their universe through interactions with the council and flashbacks.\n  - Focus on internal conflicts and psychological struggles. Highlight the protagonist's internal monologue and their struggle with the guilt and consequences of their actions, as well as their desire to be accepted by the council.\n  - Employ a first-person perspective to create an intimate connection with the reader. Have the protagonist narrate their experiences and thoughts directly, providing a personal and immersive account of their journey and interactions with the council.\n  - Leave the resolution open-ended or ambiguous. Conclude the story with the protagonist's fate and the council's decision remaining uncertain, leaving the reader to ponder the outcome.\n\n- **Creativity**:\n  - Blend elements of science fiction and fantasy to create a unique story world. Combine futuristic technology with mystical elements, such as the concept of universe rebirth and immortality.\n  - Reinterpret common tropes in unconventional ways. Twist the familiar trope of immortality by exploring the moral and ethical implications of ending a universe prematurely.\n  - Integrate imaginative and vivid descriptions to enhance the story's atmosphere. Describe the council's chamber, the protagonist's memories of their universe, and the rebirth process with rich sensory details to create a surreal and immersive experience.\n  - Explore themes of identity and self-discovery. Have the protagonist grapple with their sense of self and the consequences of their actions, questioning their place in the universe and their worthiness to join the council.\n  - Use humor and irony to add depth to the narrative. Include the protagonist's sarcastic remarks and humorous interactions with the council members to provide a lighthearted contrast to the serious nature of their situation.\n\n- **Development (Character and Setting)**:\n  - Create multidimensional characters with complex motivations. Develop the protagonist as a character with a deep sense of guilt and a desire for redemption, as well as the council members with their own unique perspectives and motivations.\n  - Establish immersive settings that reflect the story's tone and themes. Describe the council's chamber as a grand and otherworldly place, reflecting the gravity of the protagonist's situation and the mystical nature of the council.\n  - Use dialogue to reveal character traits and relationships. Craft conversations between the protagonist and the council members that highlight the tension, skepticism, and underlying motivations of each character.\n  - Include detailed backstories to enrich character development. Provide insights into the protagonist's past lives, their actions that led to the end of their universe, and their journey to the council.\n  - Employ symbolism to add layers of meaning to the narrative. Use symbols such as the council's chamber, the protagonist's memories, and the concept of universe rebirth to represent themes of guilt, redemption, and the cyclical nature of existence.\n\n- **Language Use**:\n  - Use vivid and sensory imagery to create an immersive reading experience. Describe the protagonist's memories, the council's chamber, and the rebirth process with rich sensory details to engage the reader.\n  - Employ varied sentence structures to maintain a dynamic narrative pace. Alternate between short and long sentences to reflect the protagonist's fluctuating emotions and the chaotic nature of their experiences.\n  - Use rhetorical devices to emphasize key points and themes. Incorporate repetition, metaphors, and other rhetorical devices to underscore the protagonist's anxiety, guilt, and desire for acceptance.\n  - Incorporate internal monologue to provide insight into the protagonist's thoughts and feelings. Use the protagonist's internal reflections to reveal their inner turmoil, guilt, and determination to be accepted by the council.\n  - Use dialogue to convey character voice and personality. Craft the protagonist's dialogue with a casual and sarcastic tone to highlight their reluctance and frustration, while giving the council members distinct voices that reflect their authority and skepticism.\n</story_rules>",
    "<thinking>  \nAnalyze the Author Writing Sheet for all four categories in depth to infer patterns, unique traits, and key elements of the author’s storytelling style. Reflect on how these elements can be adapted to suit the Writing Prompt. Use this analysis to craft **Story Rules** enriched with tailored examples inspired by the Evidence, ensuring alignment with both the Writing Prompt and the Author Writing Sheet.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Use a non-linear timeline to reveal the protagonist's past interactions with the man chosen by the stars. For example, jump between memories of past confrontations and the present struggle to prevent him from taking over.\n  - Gradually reveal the true nature of the man's ambition and the protagonist's reasons for opposing him. Start with subtle hints and build up to a full revelation through key interactions and discoveries.\n  - Focus on the protagonist's internal conflict and psychological struggle with the decision to oppose the man chosen by the stars. Highlight their doubts, fears, and determination.\n  - Employ a first-person perspective to create an intimate connection with the reader. Let the protagonist narrate their thoughts and experiences directly, providing a personal and immersive account of their struggle.\n  - Leave the resolution open-ended or ambiguous. For instance, end the story with the protagonist making a crucial decision, but leave the ultimate outcome uncertain, allowing the reader to ponder the consequences.\n\n- **Creativity**:\n  - Blend elements of science fiction and fantasy to create a unique story world. For example, incorporate advanced technology that allows communication with the stars and mystical elements that influence fate and destiny.\n  - Reinterpret common tropes in unconventional ways. For instance, twist the trope of a destined leader by revealing that the stars' choice is flawed or manipulated.\n  - Integrate imaginative and vivid descriptions to enhance the story's atmosphere. Describe the celestial omens, the protagonist's visions, and the settings with rich sensory details to create a surreal and immersive experience.\n  - Explore themes of identity and self-discovery. Show the protagonist grappling with their sense of self and their role in opposing the chosen leader, questioning their own motivations and beliefs.\n  - Use humor and irony to add depth to the narrative. Include the protagonist's sarcastic remarks and ironic observations about the chosen leader's supposed destiny and their own predicament.\n\n- **Development (Character and Setting)**:\n  - Create multidimensional characters with complex motivations. Develop the protagonist as a determined and resourceful individual with a deep-seated reason for opposing the chosen leader. Similarly, give the chosen leader layers, showing both their ambition and the flaws that make them unfit to lead.\n  - Establish immersive settings that reflect the story's tone and themes. For example, describe a futuristic city where the stars' influence is a tangible force, or a mystical realm where celestial omens dictate societal roles.\n  - Use dialogue to reveal character traits and relationships. Craft conversations that highlight the tension between the protagonist and the chosen leader, as well as the protagonist's interactions with allies and skeptics.\n  - Include detailed backstories to enrich character development. Provide glimpses into the protagonist's past, such as their achievements and the sacrifices they made to build what they have, and the chosen leader's rise to prominence.\n  - Employ symbolism to add layers of meaning to the narrative. Use celestial imagery to symbolize fate and destiny, and contrast it with the protagonist's determination to forge their own path.\n\n- **Language Use**:\n  - Use vivid and sensory imagery to create an immersive reading experience. Describe the celestial omens, the protagonist's visions, and the settings with rich sensory details, such as the shimmering stars, the cold steel of the city, and the protagonist's visceral reactions.\n  - Employ varied sentence structures to maintain a dynamic narrative pace. Alternate between short, punchy sentences to convey urgency and longer, descriptive passages to build atmosphere and tension.\n  - Use rhetorical devices to emphasize key points and themes. For example, repeat phrases like \"the stars have chosen\" to underscore the protagonist's skepticism and the societal pressure to accept the chosen leader.\n  - Incorporate internal monologue to provide insight into the protagonist's thoughts and feelings. Let the protagonist's internal reflections reveal their doubts, fears, and determination, adding depth to their character.\n  - Use dialogue to convey character voice and personality. Craft the protagonist's speech with a tone of determination and sarcasm, while giving the chosen leader a more grandiose and ambitious voice to highlight their contrasting personalities.\n</story_rules>",
    "<thinking>  \nAnalyze the Author Writing Sheet for all four categories in depth to infer patterns, unique traits, and key elements of the author’s storytelling style. Reflect on how these elements can be adapted to suit the Writing Prompt. Use this analysis to craft **Story Rules** enriched with tailored examples inspired by the Evidence, ensuring alignment with both the Writing Prompt and the Author Writing Sheet.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Use a non-linear timeline to enhance the narrative. For example, start the story with the moment the button is pressed, then jump back to earlier events that led to this moment, and intersperse scenes from different points in time to create a fragmented and engaging narrative.\n  - Incorporate a sense of mystery and gradual revelation. Slowly unveil the significance of the button and the consequences of pressing it through the protagonist's interactions and discoveries. For instance, reveal bits of information about the button's origin and purpose through cryptic messages or encounters with enigmatic characters.\n  - Focus on internal conflicts and psychological struggles. Highlight the protagonist's internal debate about whether to press the button, exploring their fears, doubts, and motivations. Use internal monologue to delve into their psyche, showing their struggle with the potential consequences.\n  - Employ a first-person perspective to create an intimate connection with the reader. Have the protagonist narrate their thoughts and experiences directly, providing a personal and immersive account of the events surrounding the button.\n  - Leave the resolution open-ended or ambiguous. Conclude the story with the protagonist facing the aftermath of pressing the button, but leave the ultimate consequences uncertain, allowing the reader to ponder the outcome.\n\n- **Creativity**:\n  - Blend elements of science fiction and fantasy to create a unique story world. For example, the button could be a piece of advanced technology with magical properties, capable of altering reality or summoning otherworldly beings.\n  - Reinterpret common tropes in unconventional ways. Instead of a typical \"doomsday button,\" make the button's function unexpected, such as triggering a series of bizarre and surreal events that challenge the protagonist's perception of reality.\n  - Integrate imaginative and vivid descriptions to enhance the story's atmosphere. Describe the button and its surroundings with rich sensory details, such as the texture of the button, the eerie glow it emits, and the strange sounds that accompany its activation.\n  - Explore themes of identity and self-discovery. Use the button as a catalyst for the protagonist to confront their true self, uncover hidden aspects of their personality, or face their deepest fears and desires.\n  - Use humor and irony to add depth to the narrative. Include witty and ironic dialogue between the protagonist and other characters, especially in moments of tension or uncertainty about the button's purpose.\n\n- **Development (Character and Setting)**:\n  - Create multidimensional characters with complex motivations. Develop the protagonist as a well-rounded character with a clear backstory and personal stakes related to the button. For example, they might be a scientist, a curious child, or someone with a hidden agenda.\n  - Establish immersive settings that reflect the story's tone and themes. Describe the environment where the button is located in detail, whether it's a high-tech laboratory, a mystical cave, or a dystopian cityscape. Use the setting to mirror the protagonist's emotional state and the story's atmosphere.\n  - Use dialogue to reveal character traits and relationships. Craft conversations that highlight the dynamics between the protagonist and other characters, such as a mentor warning them about the button or a rival trying to manipulate them into pressing it.\n  - Include detailed backstories to enrich character development. Provide glimpses into the protagonist's past that explain their connection to the button and their reasons for being involved in the situation.\n  - Employ symbolism to add layers of meaning to the narrative. Use the button as a symbol for the protagonist's choices, control, and the unknown. For example, pressing the button could represent a leap of faith or a surrender to curiosity.\n\n- **Language Use**:\n  - Use vivid and sensory imagery to create an immersive reading experience. Describe the protagonist's sensations and surroundings in detail, such as the cold metal of the button, the flickering lights, and the tension in the air.\n  - Employ varied sentence structures to maintain a dynamic narrative pace. Alternate between short, punchy sentences during moments of high tension and longer, descriptive sentences during reflective or exploratory scenes.\n  - Use rhetorical devices to emphasize key points and themes. Incorporate repetition, metaphors, and similes to highlight the protagonist's internal conflict and the significance of the button.\n  - Incorporate internal monologue to provide insight into the protagonist's thoughts and feelings. Use the protagonist's inner voice to reveal their fears, doubts, and rationalizations about pressing the button.\n  - Use dialogue to convey character voice and personality. Craft distinct and memorable voices for each character, using their speech patterns, vocabulary, and tone to reflect their personalities and relationships with the protagonist.\n</story_rules>",
    "<thinking>  \nAnalyze the Author Writing Sheet for all four categories in depth to infer patterns, unique traits, and key elements of the author’s storytelling style. Reflect on how these elements can be adapted to suit the Writing Prompt. Use this analysis to craft **Story Rules** enriched with tailored examples inspired by the Evidence, ensuring alignment with both the Writing Prompt and the Author Writing Sheet.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Use a non-linear timeline to enhance the narrative. For example, have the protagonist recall past instances where lying was crucial to their survival or relationships, interspersed with the present interrogation scene.\n  - Incorporate a sense of mystery and gradual revelation. Slowly unveil the backstory of why the protagonist lies so often and the consequences of their lies through their interactions during the interrogation.\n  - Focus on internal conflicts and psychological struggles. Highlight the protagonist's internal turmoil as they grapple with the inability to lie and the potential fallout from their forced honesty.\n  - Employ a first-person perspective to create an intimate connection with the reader. Have the protagonist narrate their thoughts and feelings directly, providing a personal and immersive account of the interrogation and their past.\n  - Leave the resolution open-ended or ambiguous. End the story with the protagonist facing an uncertain future due to the curse, leaving the reader to ponder the long-term effects of their newfound honesty.\n\n- **Creativity**:\n  - Blend elements of science fiction and fantasy. Introduce a magical or technological explanation for the curse, such as a spell cast by a powerful sorcerer or a futuristic device used by the interrogators.\n  - Reinterpret common tropes in unconventional ways. Twist the familiar trope of a truth-telling curse by adding unexpected complications, such as the protagonist revealing deeply buried secrets that even they had forgotten.\n  - Integrate imaginative and vivid descriptions to enhance the story's atmosphere. Describe the interrogation room with rich sensory details, such as the cold metal of the chair, the harsh glare of the lights, and the oppressive silence.\n  - Explore themes of identity and self-discovery. Use the curse as a catalyst for the protagonist to confront their true self and the reasons behind their habitual lying.\n  - Use humor and irony to add depth to the narrative. Include the protagonist's sarcastic remarks and humorous observations about the absurdity of their situation, contrasting with the serious nature of the interrogation.\n\n- **Development (Character and Setting)**:\n  - Create multidimensional characters with complex motivations. Develop the protagonist as someone who lies not out of malice but as a coping mechanism or survival strategy, revealing their vulnerabilities and fears.\n  - Establish immersive settings that reflect the story's tone and themes. Set the interrogation in a stark, sterile room that mirrors the protagonist's sense of exposure and vulnerability.\n  - Use dialogue to reveal character traits and relationships. Through the interrogation, let the protagonist's interactions with the interrogator reveal their personality, past relationships, and the dynamics of power and control.\n  - Include detailed backstories to enrich character development. Provide glimpses into the protagonist's past through their truthful confessions, explaining how they became a habitual liar and the impact it had on their life.\n  - Employ symbolism to add layers of meaning to the narrative. Use the curse as a symbol of the protagonist's struggle with honesty and self-acceptance, and the interrogation room as a metaphor for their internal prison.\n\n- **Language Use**:\n  - Use vivid and sensory imagery to create an immersive reading experience. Describe the physical sensations and emotional responses of the protagonist as they are forced to tell the truth, enhancing the reader's engagement.\n  - Employ varied sentence structures to maintain a dynamic narrative pace. Alternate between short, abrupt sentences to convey the tension of the interrogation and longer, reflective sentences for the protagonist's internal monologue.\n  - Use rhetorical devices to emphasize key points and themes. Employ repetition, such as the protagonist repeatedly stating \"I can't lie,\" to underscore their frustration and the gravity of the curse.\n  - Incorporate internal monologue to provide insight into the protagonist's thoughts and feelings. Use the protagonist's internal reflections to reveal their fear, regret, and the mental gymnastics they perform to navigate the truth.\n  - Use dialogue to convey character voice and personality. Capture the protagonist's casual and sarcastic tone in their interactions with the interrogator, highlighting their reluctance and discomfort with the curse.\n\n</story_rules>",
    "<thinking>  \nTo generate the Story Rules, I will analyze the Author Writing Sheet for each category—Plot, Creativity, Development (Character and Setting), and Language Use. I will extract the unique storytelling elements and adapt them to the Writing Prompt about a vampire dealing with zombies and the challenge of finding an edible meal. The rules will be actionable, detailed, and include examples inspired by the Evidence provided.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  1. Use a non-linear timeline to enhance the narrative. For example, have the vampire protagonist recall past encounters with zombies and previous struggles to find a suitable meal, interspersed with the present-day challenges.\n     - Example: \"As I dodged another mindless zombie, I couldn't help but remember the time in 1847 when I faced a similar horde in Paris. Back then, the blood was richer, more satisfying...\"\n  \n  2. Incorporate a sense of mystery and gradual revelation of the plot. Slowly unveil the vampire's backstory and the reasons behind the scarcity of edible meals.\n     - Example: \"It wasn't just the zombies that were a problem. Something had changed in the blood of humans, something I needed to understand. Each clue I found only deepened the mystery.\"\n\n  3. Focus on internal conflicts and psychological struggles. Highlight the vampire's frustration and desperation in finding a suitable meal amidst the zombie apocalypse.\n     - Example: \"The hunger gnawed at me, a constant reminder of my cursed existence. Each failed hunt brought me closer to the edge of madness.\"\n\n  4. Employ a first-person perspective to create an intimate connection with the reader. Let the vampire narrate their experiences and thoughts directly.\n     - Example: \"I watched the city from the shadows, my senses heightened by the scent of decay and the distant heartbeat of a potential meal.\"\n\n  5. Leave the resolution open-ended or ambiguous. Allow the story to conclude with uncertainty about the vampire's future and the ongoing struggle for survival.\n     - Example: \"As the sun began to rise, I found myself no closer to a solution. The hunger remained, and the future was as uncertain as ever.\"\n\n- **Creativity**:\n  1. Blend elements of science fiction and fantasy to create a unique story world. Introduce futuristic or magical elements that affect the vampire's quest for food.\n     - Example: \"The serum that once promised to cure vampirism had backfired, turning humans into zombies and leaving us with nothing but tainted blood.\"\n\n  2. Reinterpret common tropes in unconventional ways. Twist the typical vampire and zombie tropes to add depth and originality to the story.\n     - Example: \"Unlike the mindless zombies, I retained my intellect and cunning. But that only made the hunt more excruciating, as I outwitted my prey only to find their blood undrinkable.\"\n\n  3. Integrate imaginative and vivid descriptions to enhance the story's atmosphere. Use rich sensory details to describe the vampire's experiences and the post-apocalyptic setting.\n     - Example: \"The air was thick with the stench of decay, and the streets echoed with the shuffling of the undead. My senses were overwhelmed, yet I pressed on, driven by an insatiable thirst.\"\n\n  4. Explore themes of identity and self-discovery. Delve into the vampire's struggle with their nature and the quest for a meaningful existence.\n     - Example: \"In the quiet moments between hunts, I pondered my existence. Was I merely a predator, or was there something more to my eternal life?\"\n\n  5. Use humor and irony to add depth to the narrative. Incorporate the vampire's sarcastic remarks and ironic observations about the absurdity of their situation.\n     - Example: \"Great, another zombie. Just what I needed. As if finding a decent meal wasn't hard enough, now I had to deal with these brainless nuisances.\"\n\n- **Development (Character and Setting)**:\n  1. Create multidimensional characters with complex motivations. Develop the vampire protagonist with a rich backstory and conflicting desires.\n     - Example: \"I wasn't always a monster. Once, I was a scholar, a lover of art and music. Now, I was reduced to this—a hunter in a world gone mad.\"\n\n  2. Establish immersive settings that reflect the story's tone and themes. Describe the post-apocalyptic world in detail, emphasizing the desolation and danger.\n     - Example: \"The city was a wasteland, buildings crumbling and streets deserted. Only the zombies roamed freely, a constant reminder of the world's downfall.\"\n\n  3. Use dialogue to reveal character traits and relationships. Show the vampire's interactions with other survivors or fellow vampires, highlighting their personality and struggles.\n     - Example: \"I met another vampire last night. He was desperate, like me. 'Have you found any clean blood?' he asked, his eyes hollow with hunger.\"\n\n  4. Include detailed backstories to enrich character development. Provide glimpses into the vampire's past and how they came to be in their current predicament.\n     - Example: \"I remembered the night I was turned, the pain and the ecstasy. It was a different world then, one where blood was plentiful and pure.\"\n\n  5. Employ symbolism to add layers of meaning to the narrative. Use symbolic elements to reflect the vampire's internal and external struggles.\n     - Example: \"The broken mirror in my lair symbolized my fractured existence. I was a reflection of what I once was, shattered and incomplete.\"\n\n- **Language Use**:\n  1. Use vivid and sensory imagery to create an immersive reading experience. Describe the vampire's sensations and the environment in rich detail.\n     - Example: \"The taste of blood lingered on my tongue, metallic and bitter. The night air was cool against my skin, a stark contrast to the heat of my hunger.\"\n\n  2. Employ varied sentence structures to maintain a dynamic narrative pace. Alternate between short, punchy sentences and longer, descriptive passages.\n     - Example: \"I ran. The zombies were close. Too close. My heart pounded, not from fear, but from the thrill of the hunt.\"\n\n  3. Use rhetorical devices to emphasize key points and themes. Incorporate repetition, metaphors, and other devices to highlight the vampire's struggles and insights.\n     - Example: \"Hunger. It was all-consuming, relentless. No matter how much I fed, it was never enough. Hunger defined me.\"\n\n  4. Incorporate internal monologue to provide insight into the protagonist's thoughts and feelings. Let the vampire's inner voice reveal their fears, desires, and reflections.\n     - Example: \"Why do I continue this endless hunt? Is there any hope left for me, or am I doomed to this eternal cycle of hunger and despair?\"\n\n  5. Use dialogue to convey character voice and personality. Capture the vampire's unique voice through their interactions and internal musings.\n     - Example: \"I smirked at the zombie. 'You think you can catch me? Think again.' My voice was a low growl, filled with both confidence and desperation.\"\n</story_rules>"
]