[
    "<thinking>  \nTo generate Story Rules that align with the given Writing Prompt and the Author Writing Sheet, I will analyze each category to extract the author's unique storytelling style and apply it to the prompt. The prompt involves a tense situation with mimics, suggesting themes of survival, trust, and potential betrayal or revelation. The author's style includes central twists, internal conflicts, and open-ended resolutions, which can be effectively applied to this scenario. The creativity section highlights genre blending and reinterpretation of tropes, which can be used to add depth to the mimic encounter. Character and setting development focus on interactions, emotional arcs, and immersive settings, which are crucial for building tension and atmosphere in the story. Language use emphasizes vivid imagery, varied sentence structures, and humor, which can enhance the narrative's engagement and tone. I will create detailed, actionable Story Rules for each category, incorporating examples inspired by the Author Writing Sheet and tailored to the Writing Prompt.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the story around a central twist or revelation. For example, reveal that the mimics are not just mindless creatures but are sentient beings seeking something specific from the protagonist, recontextualizing the narrative.\n  - Use the protagonist's internal conflict to drive the plot. Illustrate their hesitation to follow the group due to a lingering doubt or a secret connection with the mimics, which propels the narrative forward.\n  - Resolve the narrative with ambiguity. End the story with the protagonist making a choice that leaves their future and the group's safety open to interpretation, such as deciding whether to communicate with the mimics or rejoin the group.\n  - Incorporate irony or unexpected outcomes. For instance, the \"safe\" area might turn out to be a trap set by the mimics, challenging the group's expectations.\n  - Employ a cyclical structure. Begin and end the story with a similar scene, such as the protagonist standing at a threshold, contemplating their next move, to create narrative symmetry.\n\n- **Creativity**:  \n  - Blend genres by incorporating elements of fantasy and horror. Describe the mimics with fantastical abilities and a horror-like presence, enhancing the narrative's distinctiveness.\n  - Reinterpret traditional tropes. Portray the mimics not as mere monsters but as misunderstood entities with their own culture or purpose, subverting typical creature archetypes.\n  - Integrate unique elements. Introduce a mimic that communicates through mimicry of human speech, adding a surreal and imaginative twist to the encounter.\n  - Use a surreal setting. Describe the environment beyond the threshold as a distorted reflection of the real world, adding a fantastical dimension to the narrative.\n  - Employ humor and irony. Use dialogue to highlight the group's obliviousness to the true nature of the mimics, adding depth and complexity to the narrative.\n\n- **Development (Character and Setting)**:  \n  - Develop characters through interactions and dialogues. Use the group's conversations to reveal their personalities and motivations, such as a character's bravado masking their fear.\n  - Create an immersive setting. Describe the threshold and the area beyond with vivid detail, using sensory imagery to enhance the atmosphere and tone.\n  - Explore characters' emotional arcs. Focus on the protagonist's internal struggle with trust and fear, showing their growth or change by the story's end.\n  - Create multidimensional characters. Give the mimics complex motivations, such as a desire for freedom or understanding, adding depth to their portrayal.\n  - Use the setting as a reflection of themes. The threshold can symbolize the boundary between safety and danger, reflecting the protagonist's internal conflict.\n\n- **Language Use**:  \n  - Employ vivid and sensory imagery. Describe the mimics and the environment with detailed sensory language to create an immersive atmosphere.\n  - Use varied sentence structures. Alternate between short, tense sentences during action scenes and longer, reflective sentences during moments of introspection to enhance pacing and tone.\n  - Use dialogue to reveal character traits. Through conversations, reveal the protagonist's doubts and the group's dynamics, advancing the plot.\n  - Employ rhetorical devices. Use metaphors and rhetorical questions to add depth to the protagonist's internal monologue or dialogue with the mimics.\n  - Use humor and irony in dialogue. Highlight the group's misconceptions about the mimics through witty exchanges, adding complexity to the narrative.\n  - Maintain a consistent and distinctive tone. Use a tone of suspense and irony to enhance the narrative's themes and atmosphere.\n  - Use concise and impactful language. Convey the protagonist's complex emotions and decisions with succinct and powerful language.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The goal is to create rules that reflect the author's unique style while aligning with the narrative potential of the Writing Prompt. The prompt involves a character dealing with repeated resurrections due to a necromancer service, which suggests themes of life, death, and perhaps humor or irony. The author's style includes twists, internal conflicts, genre blending, and vivid language, all of which can be effectively applied to this prompt.  \n\nFor **Plot**, I will focus on creating a central twist or revelation, using internal conflict to drive the narrative, and incorporating irony or unexpected outcomes. For **Creativity**, I will blend genres and reinterpret traditional tropes, using humor and irony to add depth. In **Development (Character and Setting)**, I will focus on character interactions and emotional arcs, using settings that reflect internal states. For **Language Use**, I will employ vivid imagery, varied sentence structures, and humor to create an engaging narrative.  \n\nEach rule will be tailored to the Writing Prompt, ensuring that the examples and stylistic elements are relevant and enhance the story's themes.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the story around a central twist or revelation. For example, reveal that the necromancer service, expected to be a simple subscription, is actually a complex contract with unforeseen consequences, such as the protagonist's soul being bound to a mischievous spirit.  \n  - Use the protagonist's internal conflict to drive the plot. Illustrate their struggle with the decision to cancel the service, weighing the benefits of immortality against the chaos of repeated deaths.  \n  - Resolve the narrative with ambiguity, leaving room for interpretation. End with the protagonist contemplating their next move, perhaps receiving a mysterious message from the necromancer service hinting at further complications.  \n  - Incorporate irony or unexpected outcomes. For instance, the protagonist might discover that the necromancer service is run by a former rival who now holds power over their life and death.  \n  - Employ a cyclical structure, where the ending mirrors the beginning. Start and end with the protagonist's interaction with the necromancer service, creating a sense of narrative symmetry.  \n\n- **Creativity**:  \n  - Blend genres by incorporating elements of fantasy, horror, and dark comedy. Use the necromancer service as a fantastical element that introduces horror through the protagonist's repeated deaths, while adding humor through their increasingly absurd attempts to cancel the service.  \n  - Reinterpret traditional tropes, such as the necromancer, by portraying them as a bureaucratic entity with mundane customer service issues.  \n  - Integrate imaginative elements, like a surreal customer service experience where the protagonist must navigate a labyrinthine arcane web interface to cancel their subscription.  \n  - Use humor and irony to add depth. For example, depict the protagonist's frustration with the necromancer's hold music, which ironically sings about eternal life.  \n\n- **Development (Character and Setting)**:  \n  - Develop characters through interactions and dialogues. Show the protagonist's personality and motivations through their conversations with the necromancer's customer service representatives.  \n  - Use detailed and immersive settings to enhance the atmosphere. Describe the protagonist's home, filled with reminders of their past deaths, creating a vivid and immersive setting.  \n  - Explore the protagonist's emotional arc, focusing on their internal struggle with the concept of mortality and the desire for a normal life.  \n  - Create multidimensional characters with complex motivations. For instance, the necromancer could have a backstory that explains their interest in the protagonist's repeated resurrections.  \n  - Use the setting as a reflection of the protagonist's internal state. The chaotic and cluttered environment of their home could mirror their mental turmoil.  \n\n- **Language Use**:  \n  - Employ vivid and sensory imagery to create an immersive atmosphere. Describe the sensations of each resurrection, from the cold touch of death to the warmth of life returning.  \n  - Use varied sentence structures to enhance pacing and tone. Alternate between short, punchy sentences during moments of tension and longer, flowing sentences during introspective moments.  \n  - Use dialogue to reveal character traits and advance the plot. The protagonist's witty exchanges with the necromancer's representatives can reveal their frustration and determination.  \n  - Employ rhetorical devices and figures of speech to add depth. Use metaphors and similes to describe the protagonist's experiences with death and resurrection.  \n  - Use humor and irony in dialogue and narration. The protagonist's sarcastic remarks about their situation can add depth and complexity to the narrative.  \n  - Maintain a consistent and distinctive tone that enhances the narrative's themes and atmosphere. Use a tone that balances humor with the darker themes of life and death.  \n  - Use concise and impactful language to convey complex ideas and emotions. Capture the protagonist's existential crisis in a few powerful sentences.  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a character who has experienced multiple deaths and is considering canceling a necromancer service subscription. This scenario offers opportunities for humor, irony, and exploration of internal conflict, which are prevalent in the author's style. I will incorporate elements such as a central twist, internal conflict, and open-ended resolution in the plot. Creativity will involve blending fantasy and humor, reinterpreting necromancer tropes, and using surreal settings. Character development will focus on internal struggles and multidimensional personalities, while language use will emphasize vivid imagery, varied sentence structures, and humor.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the story around a central twist or revelation. For example, reveal that the necromancer service, expected to be a sinister force, is actually a bureaucratic nightmare with comical inefficiencies.\n  - Use the protagonist's internal conflict about canceling the service to drive the plot. Illustrate their struggle with the convenience of resurrection versus the absurdity of repeated deaths.\n  - Resolve the narrative with ambiguity, leaving the protagonist's decision about the service open to interpretation. Perhaps they draft a cancellation letter but hesitate to send it, pondering the implications.\n  - Incorporate irony by having the protagonist's deaths be caused by mundane accidents, highlighting the absurdity of their situation.\n  - Employ a cyclical structure by starting and ending the story with the protagonist's interaction with the necromancer service, creating a sense of narrative symmetry.\n\n- **Creativity**:\n  - Blend genres by mixing fantasy elements with humor. For instance, depict the necromancer service as a whimsical, yet eerie, online platform with quirky customer service representatives.\n  - Reinterpret traditional necromancer tropes by portraying them as overworked office workers rather than dark sorcerers.\n  - Integrate unique elements, such as a surreal waiting room in the afterlife where the protagonist repeatedly finds themselves after each death.\n  - Use a fantastical setting, like an arcane web interface that visually represents the protagonist's subscription status with magical symbols and animations.\n  - Employ humor and irony to add depth, such as the protagonist's exasperated conversations with the necromancer service's chatbot.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through their interactions with the necromancer service, revealing their frustration and underlying motivations for wanting to cancel.\n  - Create an immersive setting by vividly describing the arcane web and the protagonist's surreal experiences in the afterlife, enhancing the story's atmosphere.\n  - Explore the protagonist's emotional arc, focusing on their internal struggle with the repeated deaths and the decision to cancel the service.\n  - Develop multidimensional characters, such as a necromancer customer service representative with a complex backstory and unexpected empathy for the protagonist.\n  - Use the setting as a reflection of the protagonist's internal state, such as a chaotic afterlife waiting room mirroring their confusion and frustration.\n\n- **Language Use**:\n  - Employ vivid and sensory imagery to create an immersive atmosphere, such as describing the eerie glow of the arcane web interface and the chilling sensation of resurrection.\n  - Use varied sentence structures to enhance pacing and tone, alternating between the protagonist's frantic thoughts and the calm, automated responses of the necromancer service.\n  - Use dialogue to reveal character traits and advance the plot, such as the protagonist's sarcastic exchanges with the necromancer service's chatbot.\n  - Employ rhetorical devices and figures of speech to add depth, like metaphors comparing the necromancer service to a relentless subscription box.\n  - Use humor and irony in dialogue and narration to add complexity, such as the protagonist's dry humor about their repeated deaths.\n  - Maintain a consistent and distinctive tone that enhances the narrative's themes, using a blend of sarcasm and existential reflection.\n  - Use concise and impactful language to convey complex ideas, such as the protagonist's realization of the absurdity of their situation.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet to identify key storytelling elements that define the author's style. These elements will be adapted to fit the narrative of a workplace where a demon-possessed manager is more tolerable than the original manager. The rules will be organized into categories: Plot, Creativity, Development (Character and Setting), and Language Use, ensuring they are actionable and tailored to the prompt. Each rule will include examples inspired by the Author Writing Sheet, ensuring alignment with both the author's style and the Writing Prompt.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the story around a central twist or revelation. For example, reveal that the demon, expected to be malevolent, is actually improving the workplace environment by implementing fair policies and boosting morale.\n  - Use the protagonist's internal conflict to drive the plot. Illustrate their struggle with the ethical dilemma of working under a demon versus the benefits of a better work environment.\n  - Resolve the narrative with ambiguity. End with the protagonist contemplating whether to reveal the demon's presence to higher authorities, leaving the decision and its consequences open to interpretation.\n  - Incorporate irony by showing how the demon's management style is ironically more humane and effective than the previous manager's.\n  - Employ a cyclical structure by starting and ending the story with a staff meeting, highlighting the changes in atmosphere and dynamics under the demon's leadership.\n\n- **Creativity**:\n  - Blend genres by incorporating elements of office comedy, supernatural fantasy, and light horror. For instance, depict humorous scenarios where the demon uses its powers to solve mundane office problems.\n  - Reinterpret traditional demon tropes by portraying the demon as a misunderstood entity who genuinely wants to improve the workplace.\n  - Integrate unique elements, such as the demon organizing a team-building event in a surreal, otherworldly setting, enhancing the narrative's distinctiveness.\n  - Use a surreal office setting where the demon's presence subtly alters reality, like plants growing faster or coffee machines never breaking down, to enhance creativity.\n  - Employ humor and irony in the narrative, such as the demon's surprise at being more appreciated than the human manager, adding depth and complexity.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their interactions and dialogues. Show how employees bond over the bizarre yet improved work conditions, revealing their personalities and motivations.\n  - Use detailed and immersive settings to enhance the narrative's atmosphere. Describe the office's transformation under the demon's influence, with vivid details of its eerie yet efficient ambiance.\n  - Explore characters' emotional arcs, focusing on their internal struggles with the moral implications of working under a demon.\n  - Create multidimensional characters, such as a skeptical coworker who gradually warms up to the demon's leadership, adding depth to their motivations and backgrounds.\n  - Use the office setting as a reflection of the characters' internal states, such as the protagonist's growing acceptance mirrored by the office's increasingly harmonious environment.\n\n- **Language Use**:\n  - Employ vivid and sensory imagery to create an immersive atmosphere. Describe the demon's presence with sensory details, like the subtle scent of brimstone mixed with fresh coffee.\n  - Use varied sentence structures to enhance the narrative's pacing and tone, creating a dynamic flow that mirrors the chaotic yet improved office environment.\n  - Use dialogue to reveal character traits and advance the plot. For example, have the demon engage in witty banter with employees, revealing its surprisingly charismatic personality.\n  - Employ rhetorical devices and figures of speech to add depth, such as metaphors comparing the demon's management style to a breath of fresh air.\n  - Use a consistent and distinctive tone that enhances the narrative's themes, maintaining a balance of humor and supernatural intrigue.\n  - Use concise and impactful language to convey complex ideas and emotions, such as the protagonist's conflicted feelings about the demon's presence.\n  - Incorporate humor and irony in dialogue and narration, such as employees joking about the demon's unexpected efficiency, adding depth to the narrative.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet to identify key storytelling elements that define the author's style. These elements will be adapted to fit the narrative of arriving in hell as a millionaire due to an unexpected accumulation of souls. The rules will be structured under the categories of Plot, Creativity, Development (Character and Setting), and Language Use, ensuring they are actionable and tailored to the prompt. Each rule will incorporate examples inspired by the Evidence provided, ensuring alignment with both the author's style and the Writing Prompt.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the story around a central twist or revelation. Begin with the protagonist's arrival in hell, expecting a mundane afterlife due to their law-abiding life. Reveal that their wealth in souls is due to an unforeseen consequence of their actions, such as inadvertently causing harm through seemingly innocuous decisions (e.g., a butterfly effect scenario).  \n  - Use the protagonist's internal conflict to drive the plot. Focus on their struggle to reconcile their self-image as a good person with the reality of their wealth in souls. This internal battle should propel the narrative, leading to moments of self-reflection and moral questioning.  \n  - Resolve the narrative with ambiguity. End with the protagonist contemplating their newfound status and the moral implications, leaving their future actions open to interpretation. For example, they might be offered a choice to use their wealth for power or redemption, but the decision remains unresolved.  \n  - Incorporate irony or unexpected outcomes. Perhaps the protagonist's wealth in souls makes them a target for envy or manipulation in hell, subverting their expectations of a peaceful afterlife.  \n  - Employ a cyclical structure. Begin and end the story with the protagonist reflecting on a seemingly trivial event from their life that unexpectedly led to their current situation, creating a sense of narrative symmetry.  \n\n- **Creativity**:  \n  - Blend genres by incorporating elements of fantasy and horror. Describe hell with fantastical elements, such as surreal landscapes and bizarre creatures, while maintaining a horror undertone through the protagonist's unsettling realization of their wealth.  \n  - Reinterpret traditional tropes. Subvert the typical depiction of hell by portraying it as a bureaucratic system where souls are traded like stocks, adding a satirical twist.  \n  - Integrate unique elements to enhance distinctiveness. Introduce a character, such as a demonic financial advisor, who guides the protagonist through the complexities of soul currency, adding a layer of dark humor.  \n  - Use surreal settings to enhance creativity. Describe hell as a place where reality is fluid, with shifting landscapes and time behaving unpredictably, reflecting the protagonist's disorientation.  \n  - Employ humor and irony. Use the protagonist's interactions with hell's inhabitants to inject humor, such as their disbelief at being a millionaire in a place they never expected to be.  \n\n- **Development (Character and Setting)**:  \n  - Develop characters through interactions and dialogues. Use conversations with other souls and demons to reveal the protagonist's personality and their evolving understanding of their situation.  \n  - Create detailed and immersive settings. Describe hell with vivid details, such as the oppressive heat, the cacophony of tormented souls, and the opulent yet eerie architecture of the soul exchange market.  \n  - Explore the protagonist's emotional arc. Focus on their journey from confusion and denial to acceptance and introspection regarding their unexpected wealth.  \n  - Create multidimensional characters. Develop the protagonist with a complex background, revealing past decisions that unknowingly contributed to their soul wealth.  \n  - Use the setting as a reflection of internal states. As the protagonist grapples with their identity, describe how the environment shifts to mirror their emotional turmoil, such as landscapes that change with their mood.  \n\n- **Language Use**:  \n  - Employ vivid and sensory imagery. Use descriptive language to create an immersive atmosphere, such as the sulfurous air, the flickering shadows, and the chilling whispers of the damned.  \n  - Use varied sentence structures to enhance pacing and tone. Alternate between short, punchy sentences during moments of revelation and longer, flowing sentences during introspective passages.  \n  - Use dialogue to reveal character traits and advance the plot. Craft conversations that highlight the protagonist's disbelief and the cunning nature of hell's denizens.  \n  - Employ rhetorical devices and figures of speech. Use metaphors and irony to add depth, such as comparing the soul market to a stock exchange, highlighting the absurdity of the situation.  \n  - Use a narrative perspective that enhances engagement. Consider a first-person perspective to create an intimate connection with the protagonist's internal conflict and experiences.  \n  - Use humor and irony in dialogue and narration. Infuse the narrative with ironic observations about the protagonist's unexpected status and the absurdity of hell's economy.  \n  - Maintain a consistent and distinctive tone. Use a tone that balances dark humor with introspection, enhancing the narrative's themes of morality and identity.  \n  - Use concise and impactful language. Convey complex emotions and ideas succinctly, such as the protagonist's shock and moral dilemma upon learning of their wealth.  \n</story_rules>"
]