[
    {
        "title": "The tenth time is the good one!",
        "url": "https://archiveofourown.org/works/51849952",
        "fandoms": [
            "Sherlock Holmes - Arthur Conan Doyle",
            "Sherlock Holmes (1984 TV)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "26 Nov 2023",
        "language": "English",
        "words": "512",
        "chapters": "1/1",
        "collections": "1",
        "comments": "16",
        "kudos": "45",
        "bookmarks": "2",
        "hits": "456",
        "post_title": "Dr Watson doesn't tell us how he obtained the permission to publish Illustrious Client, just that he asked Holmes for it for TEN YEARS. This is how it went.\nPrepare for THE fluff.",
        "comment": "Sussex – 1924\nIt was a nice autumn morning in the Holmes-Watson household and the two men were sitting on their couch reading together. Dr Watson sat with a novel in his hands and his notebook at the elbow and with his husband snuggled on his chest, Mr Sherlock Holmes, smoking his pipe and reading, as it had always been his habit, the agony column of his newspaper, was sitting with his head on the doctor’s shoulder and his body on Watson’s lap, lovingly circled and held in place by the doctor’s arm, reading and commenting the advertisements and the news he read.\nWatson sighed, closing his novel and removing his spectacles for a moment “Holmes?” he called\nHolmes made a non-committal sound and raised his eyes from the paper “Yes, my dear? - he answered, lifting his head a bit to kiss the doctor’s cheek – Should I move?”\n“No, no. It's not that, Holmes. – the doctor inspired, bracing himself – I was thinking… What about I put in form of story the case of Baron Gruner?”\nHolmes face got a bit more serious and he puffed on his pipe for some seconds before sighing and shaking his head. He put down the pipe near Watson’s notebook and smiled. “Well, my darling, it can’t hurt anyone now, can it?”\n“So, permission given?” Watson almost couldn’t believe his ears\nHolmes grinned and raised his body from the doctor’s embrace to kiss his husband’s lips with sweet passion “Yes, my handsome Watson, you can publish it.” He murmured, cupping Watson’s cheek and caressing his cheekbone with his thumb.\nWatson laughed, squeezing the detective in a bone-crushing hug “Took your bloody time for it, Holmes! When I asked you if you wanted to marry me…”\nHolmes squeaked a bit, laughing at his companion’s reaction “I had promised you eternal love already, THAT time! And I was looking for a way to ask you if you would’ve liked to retire with me, i certainly couldn't have you waiting!” he grinned again\n“You’re insufferable, my love. MY insufferable detective.”\n“Retired detective. You are the most stubborn doctor. MY most stubborn and persistent doctor.”\nWatson kissed Holmes again “You wouldn’t like me in any other way”\n“And the opposite is also true.”\n“My man who took ten seconds to say yes to my proposal and ten years to allow me to publish one of his best cases”\n“Come on, now, Watson. – he pinched lightly the doctor’s shoulder – I observe you have one of your notebooks on the table and now I have little doubt that it contains your notes on the case… if not even a first draft.”\n“It could, my dear, it could. – The doctor laughed at the deduction, their game never stopped being funny – Would you like to hear the first draft? To correct anything I might have forgotten?”\n“Read on, my Watson, read on.” The detective snuggled deeper on the doctor’s chest, now resting his head on his pectorals and curling up even more against him as Watson took the notebook and began to read. Life felt good."
    },
    {
        "title": "Jealousy",
        "url": "https://archiveofourown.org/works/56192686",
        "fandoms": [
            "Sherlock Holmes & Related Fandoms",
            "Sherlock Holmes - Arthur Conan Doyle",
            "Sherlock Holmes (1984 TV)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "26 May 2024",
        "language": "English",
        "words": "514",
        "chapters": "1/1",
        "collections": "1",
        "comments": "6",
        "kudos": "14",
        "hits": "263",
        "post_title": "Holmes solves a case while preparing the cottage for himself and Watson. Then of course writes Watson about it!",
        "comment": "Mr Sherlock Holmes chuckled leaning against the counter top as he waited for the water to boil for their tea. \"Is everything alright, my darling?\" He asked as his partner entered the kitchen.\nDr Watson smiled and walked up to his companion to kiss his lips softly. \"Will you answer a question sincerely, dear Holmes? – As Holmes nodded, the doctor continued. – Did you phrase your letter that way only to make me jealous?\"\nHolmes smirked, circling his partner's waist and holding him close. \"Maybe I did, maybe I did not... I missed you.\" He concluded in a lower tone.\n\"So you did it on purpose.\" Stated the doctor matter-of-factly before turning off the fire under the water and setting their tea to steep.\nHolmes chuckled slinging himself around his husband's shoulders again \"It seems to me that it was rather the effective method. You're always so hot blooded, my love.\"\n\"You're a tease, husband mine. A couple more weeks of work and I'll move for good. For now, would you object to go on with the cuddles we interrupted?\"\nThe detective laughed more, kissing his husband again. \"Until the tea isn't ready, then I propose to move to the couch to enjoy it\"\n\"You always have such great ideas, dearest.\"\n\"Thank you, dear love. You needn't to play on jealousy to get me to come here, you could have just asked.\"\nHolmes whined a bit, setting to kiss his husband's strong neck. \"Didn't want to look... Needy? – He answered, a bit subdued. – But I missed you so, my darling.\"\nThe doctor hugged his husband closer to his chest. \"I will never get annoyed at you for asking for my company, my love. I missed you too, you know?\"\nHolmes nodded. \"You are wearing the Snake and not the Sun, sweetheart. You changed to the other pendant at some point this week?\" He asked, toying with the piercing through his dressing gown.\n\"More or less on Tuesday. I knew you weren't going to change yours, so I matched the other.\"\n\"You're such a romantic. Here's why my letter worked.\"\nWatson bit his jaw softly. \"You idiot. – He murmured, filling the word with love. – I was thinking... We might get a tattoo together. If you feel like that.\"\nHolmes grinned widely, tugging one of the sides of Watson's dressing gown open so to expose the moss rose inked on his old scar and bent to press a kiss on the flower. \"This is a magnificent idea, my darling. We should put out mind to it. Maybe I won't manage to make you jealous just with the tale of a case after I'll have your name inked on my skin.\" Chuckled he, still amused that his letter had worked.\n\"You are so magnificent that I will always be a bit jealous, sweetheart. – Laughed the doctor. – But I'm glad you like the idea.\"\n“I love it, John. Now let’s get the cups and move to a more comfortable position, what do you say?”\n“Excellent idea, beloved.” Answered the doctor, putting a quick kiss on his husband’s thin lips."
    },
    {
        "title": "Apology",
        "url": "https://archiveofourown.org/works/56112061",
        "fandoms": [
            "Sherlock Holmes & Related Fandoms",
            "Sherlock Holmes - Arthur Conan Doyle",
            "Sherlock Holmes (1984 TV)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "23 May 2024",
        "language": "English",
        "words": "581",
        "chapters": "1/1",
        "collections": "1",
        "comments": "12",
        "kudos": "16",
        "hits": "113",
        "post_title": "Lestrade believes he deserves some explanation. Mycroft is willing to give them.",
        "comment": "“I apologize.”\nThe detective closed the door of the stranger’s room and hung his hat and coat before answering. “You didn’t even give me time to get inside, Holmes.”\n“Still, I know why you’re here. I apologize for my silence regarding my brother.” Repeated Mycroft Holmes standing from his usual perch and finally facing Inspector Lestrade.\nThe inspector sighed and let himself fall on one of the ridiculously comfortable armchairs Holmes senior had chosen for his favourite club room. “Instead of apologizing, would you be inclined to explain? I believe you do owe me an explanation just as much as your brother does.”\n“I will not give Sherlock’s reasons, Lestrade. – Mycroft also sat down. – What do you want to know?” He asked. It was like this, their relationship. Lestrade asked questions, Mycroft answered. Or well, it was how it had started. Sherlock being away, Mycroft had reached out for the man his brother had always called the pick of the bad lot and indeed, he was an excellent, if very much conventional, detective.\n“I have two main questions for you, Holmes. Who knew and why you didn’t tell me?” The detective clasped his hands in his lap, to hide the slight tremble; he knew it was useless when he had Mycroft Holmes in front of him, but the man was nothing but a gentleman and would respect his dignity.\n“For safety, if you wish. Sherlock and I were the only people who knew. I believe the foreign office had a suspect, but I handled most of those practices myself, so it was reduced to the bare minimum. It was Sherlock’s own desire that nobody shouldn’t know. – Mycroft’s watery grey eye fixed on the detective’s. – Not even Dr Watson knew. I’ve talked to him just this morning.” He underlined.\nLestrade sighed deeply. “Indeed, I have another question, Holmes. You said for safety, doesn’t your brother trust any of us?”\n“You do him an injustice, just as he has done one to you. My brother… He holds you in the highest regard. That’s why I reached out to you in ‘91, you see. But he asked me to keep everything secret from everyone, he was afraid you would try to contact him in some way and, you see… - The man took a deep breath, hesitating before revealing so much of himself. – Had Sherlock not contacted me when he arrived in Florence, I would have been the first one to move mountains to find him, any small trace of him.” He chose his words carefully, trying to convey understanding.\nLestrade sighed again. “Yes, I would have done the same. And sure would have Dr Watson. I… can not deny to be slightly hurt by this, Holmes, but I understand. You’re a good man.”\n“That is not true. I work with politics, those make an intriguing man out of everyone in a way. Still, I’m a decent man enough to offer you my most sincere apologies, the advice to go talk to Sherlock properly and the offer to continue our friendship if you so wish.”\n“I shall be glad of it. And I thank you for having always been as honest as you could with me.”\nLestrade rose and offered Mycroft his hand. He smiled and shook it firmly. “I will see you here for our usual conversation on Friday then?”\n“Probably even before, we will see. I don’t have much to do now that the Adair Case got solved.” Smiled Lestrade taking his leave."
    },
    {
        "title": "Words of care",
        "url": "https://archiveofourown.org/works/53506594",
        "fandoms": [
            "Sherlock Holmes & Related Fandoms",
            "Sherlock Holmes - Arthur Conan Doyle",
            "Sherlock Holmes (1984 TV)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "03 Feb 2024",
        "language": "English",
        "words": "614",
        "chapters": "1/1",
        "comments": "8",
        "kudos": "50",
        "bookmarks": "1",
        "hits": "433",
        "post_title": "Watson is hurting after the Friesland disaster.\nHolmes is as tense as one of his violin strings.\nThere's a book.\nThey exchange roles.",
        "comment": "Sherlock Holmes was furious with himself.\nTheir last case had been a disaster. The detective paced in the sitting room, restless and growling at himself. The blasted steam of course still had to explode, of course. And clearly it had been his fault: once more, apparently, he co-\n\"Would you quit pacing the room like a tiger in its cage, Holmes?\" groaned Watson from couch.\n\"What would you have me do, then? - Holmes snapped - I can't play, I can't work, I almost killed you, Watson!\" his tone spanned from boiling with anger to the deepest despair in seconds.\nThe doctor smiled, comforting \"You didn't. You saved us, Holmes. Come here. - he moved slightly on the couch - Do not protest, I will lie on your lap.\"\n\"You should rest, my dear. - Holmes' tone was now worried - Your shoulder still hurts; I can see it from here. - his tone turned derisory - Not yet that old not to be able to see it...\"\n\"Holmes. - Watson's tone was sharp - What happened on that ship wasn't your fault, you saved our lives and many more. Sit, I beg you.\"\nHolmes deflated at the doctor's sweetened tone and sat down \"As you say, my dear. Here, put your head down.\"\n\"You're a very uncomfortable pillow, my Holmes\" joked the doctor, earning himself a soft swat on his good arm and the ghost of a smile on his partner's thin lips.\n\"How are you, John?\"\n\"The shoulder is still giving me hell, the leg's marginally better. I should practice a bit more if this is the level of effort your cases will require from now on\" the Man tried to joke a bit.\n\"Our cases, Watson. – his voice was tentative - If you are still crazy enough to want to be around me.\"\n\"Wouldn't've moved back to our bed 5 nights a week if I didn't want to be around you, my sweet man - he took one of his partner's hands and kissed its back softly before turning it and examining it closely - the blisters are mostly healed, my dear. Another two or three days and you'll be able to go back to your usual imprudent use of them.\"\n\"As my doctor says, Watson. Meanwhile, you need to rest.\"\n\"And I will. That's why I asked you to sit down.\"\n\"I shall read to you, if I can't play. Were you reading this?\" Holmes flapped a yellow-backed book in front of his partner's eyes.\n\"I was... It doesn't talk of sea. An adventure on dry land\"\n\"Thank God - Holmes barked a laugh - Let me see if I can make it work.\"\nHolmes opened the book at the signed page and began to read.\nWatson's stance relaxed further as he listened to his husband's voice and his eyes closed. Holmes was quite a good reader, he reflected as his long fingers started to play with his hair, and he delighted in reading to his smaller Irregulars but this was entirely new. Holmes willingly reading one of the adventure novels he so vocally despised, the new life they had been granted felt sweeter for this.\nStaying still, resting and healing after such a case, such a debacle, from Holmes' point of view, was no trifling matter for the detective; Watson knew he would have much favoured being out in search of evidence. Yet there he was, taking care of them both. His body relaxed gradually as he read and Watson's slowly released the tension it had been holding, his aches settling in a more constant and yet duller throb.\nIn few minutes, the doctor could feel sleep calling him and he put up no fight at all, to sleep near Holmes, that was safe."
    },
    {
        "title": "Chaos",
        "url": "https://archiveofourown.org/works/56096425",
        "fandoms": [
            "Sherlock Holmes & Related Fandoms",
            "Sherlock Holmes - Arthur Conan Doyle",
            "Sherlock Holmes (1984 TV)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "22 May 2024",
        "language": "English",
        "words": "684",
        "chapters": "1/1",
        "collections": "1",
        "comments": "6",
        "kudos": "14",
        "hits": "152",
        "post_title": "There is one mistery that will never be solved. Is it possible to keep 221b baker street tidy?",
        "comment": "Dr Watson growled as he made his way through the sitting room to his fellow lodger’s desk. He himself wasn’t exactly a tidy man, but this was excessive even for him! The floor and the carpet were barely visible over the litter of papers, books, manuscripts and similar relics abandoned around, he counted three half stumbles in a ten feet walk and the dancer’s gait he had to keep to avoid trampling over manuscripts of any sort sure wasn’t good for his leg.\n“Holmes. – He called. – I know you’re bored, but this is out of control! Now since it’s mostly your fault that we can barely walk through the sitting room, I do expect you to put some order into this absolute mess.”\nThe detective turned languidly on his chair. “Ah, my good doctor. – He said in a fittingly languid tone – I am after all just a humble human being. I certainly can not fight against entropy.”\nWatson was so taken aback by such a remark that it must have shown on his face, as his partner’s features curled in a half smirk. The doctor felt his fury boil over. “I don’t know what you’re talking about, but I do expect you to tidy up our sitting room. Immediately, Holmes. – He ordered in his best military voice. – If anything, it will relieve your boredom.” He raised his eyebrows, encouraging him to get up from the chair and put his mind to a productive and, indeed, essential task.\nThe detective sighed dramatically, rising elegantly and dancing toward one of the corners of the sitting room to begin his job.\nWatson allowed himself a satisfied -Ha!- As he sat down on his thankfully still free armchair and set to read his newspaper.\nHe was only few columns into it before he heard Holmes’ rather high pitched, laughing voice “Under my pipe rack on the right corner of the mantelpiece. There’s what I was talking about.”\nDr Watson leaned on the door frame, fondly looking at his husband reorganizing his room in his usual energetic and haphazard fashion. He was sitting cross-legged on the floor and if one ignored the white streaks in his hair and the lines on his face he could still pass for the young man he had forced to tidy up many times. The doctor chuckled, remembering the shock it had been to hear him, who boasted to have forgotten the structure of the solar system, talk about complex physical and chemical concepts like entropy and chaos in a system.\n“Unbelievable, I can see the carpet! – Joked the doctor – Has Mr Sherlock Holmes finally shook off his flesh bindings to join the gods? Have you finally found a way to ‘fight entropy’?”\nThe doctor laughed as his husband’s reply was to toss him a crumpled piece of paper. “That goes in the waste bin. – Holmes grinned looking up at his doctor. – And we would finish earlier if you helped instead of gloating.”\nThe doctor pressed a hand to his breast in mock outrage. “Gloating? Do you think the gentleman that I am would do such a thing? – Holmes’ flat gaze held the answer written in plain letters, Watson grinned at him. – Yes, I am and I will keep doing it. Also because It’s the last time or around the last time I see you sitting down in this room forced to tidy up!”\nHolmes laughed again. “Indeed! Next time you force me to do this it will be in Sussex! In our new cottage.”\n“I sincerely hope I won’t have to force you to tidy up there as well, my dear.” Grinned the doctor.\n“I remind you that chaos is inescapable and that we are, after all, just humans. Absolutely powerless in fighting entropy.”\nWatson favoured his grinning partner with a glare which held little to no heat. “Holmes. – He began. – I swear to God-”\n“Yes, yes. Don’t get too heated up, my dear fellow. After all I never let the situation really degenerate.”\nThe doctor sighed again, shaking his head fondly and smiling at his partner’s laugher. Certain things were truly inescapable."
    },
    {
        "title": "1. borrowing a sweatshirt or a coat",
        "url": "https://archiveofourown.org/works/59358235",
        "fandoms": [
            "Sherlock Holmes & Related Fandoms",
            "Sherlock Holmes (1984 TV)",
            "Sherlock Holmes - Arthur Conan Doyle"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "01 Oct 2024",
        "language": "English",
        "words": "732",
        "chapters": "1/1",
        "collections": "1",
        "kudos": "33",
        "bookmarks": "1",
        "hits": "276",
        "post_title": "Or You're Back Home\nWatson returns home after having been discharged from the army- add fluffyness\nIt's a vest and not a sweatshit because they didn't have sweatshirts in 1917 - still holmes stealing his husband's clothes",
        "comment": "As much as it could be seen as a dismissal, as a lack of appreciation for one’s services, Sherlock Holmes couldn’t but be happy about his husband’s discharge.\nHe had known of it for at least one day more than his dearest had, working in the intelligence offered striking possibilities when one was showing up to the office and not only working from home, but he had only left London on his own leave when Watson’s letter had arrived.\nAnd there he was, in Sussex, enjoying the sweet October sunshine in the year of our Lord nineteen-seventeen from atop the railing he and Watson had built more than 10 years prior, waiting for his Captain.\nDr Watson wasn’t surprised to not find Holmes waiting for him at the station with their car, it was their agreement. No station Welcomes and Goodbyes as having to stifle their feelings in those moments would have certainly made them more painful. He breathed in deeply the fresh country air and set off for his walk toward their bee-house, as Holmes called it.\nNothing could be better than half an hour of evening walk toward home, or rather, nothing but seeing one’s husband jump down from a railing and grin from ear to ear as one walks into one’s own garden.\nNeither of them properly\nran\ntoward the other, they weren’t as young as that any more as much as Holmes’ athletics still belied his true age. Holmes waited for him and Watson dove into his arms, breathing in deeply, relaxing after months of tension as he felt his husband’s strong, thin arms around his shoulders and his solid, sinewy body in his arms.\n“I missed you.” He sighed, breathing in his scent, tobacco, lemons, aftershave.\nHolmes broke the hug with a smile. “I missed you too.” He answered, then he kissed him, his hands buried in his hair, moaning as he felt his Watson’s arms tighten once more on his back as he answered the kiss with just as much vigour.\n“I’m back home.” Gasped Watson when they separated out of need for air.\n“You are, my dearest. – Holmes’ breath was just as laboured as he replied, ruffling his husband’s hair with his fingers. – Short hair doesn’t suit you my love.”\n“It will grow again, I also liked it better before this war. Is that my vest?” Chuckled the doctor, well used to his husband’s sometimes strange demonstrations of affection.\nHolmes laughed as he played with his Watson’s uniform’s belt and buttons. “How did you deduce?”\nIt was a game, of course, their game. “It’s too large on you, my darling, and a bit too short. Also, you have no clothes of this colour. – The doctor stroked one of his Holmes’ sharp cheekbones. – You needn’t look so worried, Holmes. What do you deduce of me?”\nHolmes smiled once more, and in that golden light he looked just like the young chemist he was when they had met. “You lost almost a stone, but you will be better in some weeks. You need to sleep properly as you are quite tired. Those dark circles under your eyes speak of anxiety, my John, and of pain. I could say your leg more than your shoulder, if I didn’t know that you’ve been hurt two weeks ago…” Holmes let his voice fade softly as he moved his hand to his husband’s side.\n“It’s but a graze, my dear. Some shrapnel during a rescue mission, I barely noticed it until I had finished with the poor chap’s surgery. It’s but a scratch, I stitched it close myself.”\n“I should like to check for it myself, my dear. As much as I know that your stitches are the best, you must have hidden it from your subordinates for quite a long time to end up stitching it on your own.” He stated\n“Those boys were shaking already, I couldn’t let them know that I was hurt. – Watson kissed his husband again and then placed a warning finger on his lips. – I will let you fuss, my dear fellow, but only after some good tea and in preparation for a proper bath.” He smiled.\nMr Holmes grinned at the proposition and lead his husband inside, draping himself on his shoulders as soon as they reached the kitchen. “We are home now, John.”\n“Yes. Yes, we are, my dearest Sherlock.” Answered the doctor."
    },
    {
        "title": "Empty",
        "url": "https://archiveofourown.org/works/56239201",
        "fandoms": [
            "Sherlock Holmes & Related Fandoms",
            "Sherlock Holmes - Arthur Conan Doyle",
            "Sherlock Holmes (1984 TV)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "28 May 2024",
        "language": "English",
        "words": "746",
        "chapters": "1/1",
        "collections": "1",
        "comments": "10",
        "kudos": "18",
        "bookmarks": "1",
        "hits": "180",
        "post_title": "\" \"Do you know, Watson,\" said he, \"that it is one of the curses of a mind with a turn like mine that I must look at everything with reference to my own special subject. You look at these scattered houses, and you are impressed by their beauty. I look at them, and the only thought which comes to me is a feeling of their isolation and of the impunity with which crime may be committed there.\"\n\"Good heavens!\" I cried. \"Who would associate crime with these dear old homesteads?\"\n\"They always fill me with a certain horror. It is my belief, Watson, founded upon my experience, that the lowest and vilest alleys in London do not present a more dreadful record of sin than does the smiling and beautiful countryside.\" \"\n- from copper beeches.\nAnd then they go to live in a rather isolated cottage on the sussex downs... UHM",
        "comment": "That Sherlock Holmes had excellent taste in houses was a thing Doctor Watson considered obvious, after all he had been the one to first find 221b Baker Street and to help him and Mary find a nice place for themselves at the time of his marriage.\nConfident in this dogma, the doctor would have been more than happy to leave to his partner the research of a suitable place for them to spend their retirement. Of course, the man had refused, on grounds that it was not like Watson would be just a fellow lodger or a guest, he would be one of the owners and as such he should have a word in the choice.\nWatson had kissed his husband during his speech, he was particularly proud of that kiss, since it hadn’t only shut his beautiful and very strongly opinionated husband up, but had made his careful and very excellently worded talk degenerate into a low whimper of pleasure and had made Holmes go weak at the knees and when they had broken the kiss out of need for oxygen, there were two pink blossoms on his high cheekbones and a soft look around his eyes.\nThey had got to an agreement, Holmes would take care of a first skim of likely locations and houses and then they would visit them together so that they could make a concerted decision. This was the\nseventh\nhouse they visited in a month.\nWatson made sure that there was nobody around and circled his partner’s waist, resting his head on his shoulder. “Seems like a pretty nice one, my dear.” He observed.\nHolmes tutted, but seemed excited. “I first want to see it inside before judging, but if what I’ve been told is true it seems to be quite perfect. It has a low perimetral wall which would obscure the view of the windows from the road and it’s rather isolated.”\n“And you told me it has a garden inside the wall and there’s more than enough space and flowers for the bees you wish to keep.”\n“Indeed, but what excites me is another thing. I should be able to show you once we get inside.”\nThe house was not completely furnished yet, but it didn’t matter for them, they would furnish it anew later in any case, but Holmes didn’t really explore it. He bolted up the stairs taking his Watson by the hand until he got one small attic that could accommodate some of their oldest and less used trunks easily and opened a small window.\n“Come, dear John, we can climb on the roof from here!” Grinned Watson’s favourite madman.\n“On the\nroof\n! – Was the disconcerted response. – My dear Holmes, how on heaven do you think it will manage to climb on the roof!”\nThe detective smiled, leaning down to kiss his thicker partner. “Your leg and your shoulders have not been bothering you for two weeks and you are unbelievably strong. You will fit through the window, dear man, you’re still lean enough and you won’t have to worry too much, I will be there to hold you safe.” He promised.\nWatson chuckled, flattered. “You always have such a way with words, my dear. Remember that I don’t have your same affinity with roofs, heights and all the such.”\n“I will.” Promised he before exiting the small window nimbly and flinging himself on the roof of the small cottage.\nWatson followed more slowly and carefully than his partner, relying at times on his Holmes’ steady hand.\nWhen they were both secure, Holmes just stood to his full height and looked around, inviting his husband to do the same.\n“Empty! – He laughed. – All the countryside around is completely empty! No nosy neighbours for half a mile in any directions but the sea, the village is a full mile away and we are fully isolated! You know what it means?”\nWatson grinned, understanding. “That who knows what crimes could be committed in such a house?”\nHolmes laughed again, with a smile that could have changed the weather. “I like this place. The climate, the sea, the countryside… we’ll have to work on it, but there’s everything we could desire.”\n“I like it too. Despite the sea, it’s not too humid and those paths seem delightful for a nice stroll with my husband. I would say that we should get it.”\n“And I agree with you, doctor.” Grinned he again before kissing his husband’s lips sweetly."
    },
    {
        "title": "2.Wrapped in a soft fuzzy blanket",
        "url": "https://archiveofourown.org/works/59428321",
        "fandoms": [
            "Sherlock Holmes & Related Fandoms",
            "Sherlock Holmes - Arthur Conan Doyle",
            "Sherlock Holmes (1984 TV)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "03 Oct 2024",
        "language": "English",
        "words": "783",
        "chapters": "1/1",
        "collections": "1",
        "comments": "10",
        "kudos": "18",
        "hits": "191",
        "post_title": "Holmes has only been back from the hiatus for some weeks and he and watson need to catch up on cuddles.\nAnd set some more matters a bit straight.",
        "comment": "It was almost crazy, thought Dr Watson, how easily they had set back into their old familiarity.\nHolmes had been back for less than a month and already it felt natural to think once more to 221b like ‘home’, and to visit Holmes there as ‘going home’.\nAnd there he was in fact going, since Holmes had organized a little evening program for the two of them: dining at 221b, a concert together, a stroll across London and then back home.\nThe detective greeted the doctor from the floor, inviting him to sit down besides him and sharing a soft kiss. “I’m glad you had a nice day at the practice, Watson.”\nThe doctor chuckled. “Magic tricks again, Holmes? I’m glad you’ve found a way to avoid those who want to speak with you without shooting at them from the windows.”\n“I need to put the Index in proper working order again, my darling, your help would be fundamental in this.”\nThe doctor chuckled and squeezed the younger man to himself. “I should be delighted to help you with that.”\nHolmes thanked him with a smile, leaning for a moment in his hold and answering only with a non-committal ‘uhm’ to his partner’s worries about the tension in his shoulders.\n“I’m just thrilled for tonight, my dear. Everything’s alright.” He smiled.\nThe evening turned out charming indeed, Mrs Hudson’s cooking being as superb as usual and the concert made even better by the chance to attend it in a private box, where the two men could share opinions unseen and unheard and Holmes’ hands were free to tap every particularly enjoyable passage on his partner’s leg.\nAs they came out of the hall, they were almost giggling, delighted by each other’s comments on the performance and thrilled by each other’s presence. Despite the slight humid chill of a late April night they made their way home on foot, arm in arm, just as they used to do years prior and just as they did back then, they climbed up home together.\nArrived at the sitting room, Holmes froze for a second and clicked his tongue.\n“It’s still too early to go to bed. – He stated, kicking his shoes away and discarding his coat on the back of a chair. – Come, we might chat a bit more if you’re agreeable.”\nThe doctor laughed at his Holmes’ antics, but removed his shoes, coat, tie and collar as well. “What do you feel like, my dear?” He asked, sitting on the couch where Holmes had tapped it and stealing a quick kiss from his lips.\nThe detective laughed, grabbing the blanket Mrs Hudson had brushed and folded on the couch’s arm and laying it on the two of them, tucking his own legs into it and leaning with his head on his husband’s good shoulder. “Just this. – He murmured. – Just us.”\nDr Watson almost startled at Holmes expressing his tenderness so clearly and with such calm, but recovered quickly, hugging his partner close to himself, playing with his fingers on his shirt, caressing him in slow strokes of his side. “Just us, then. – He answered, putting a tender kiss on his partner’s slicked back hair. – It feels good.”\n“It does. – Purred the detective, then he changed tone. – John, I apologize. I do need to ask you for something.” Holmes interrupted himself for a moment, changing his position slightly, so to be able to play with his husband’s shirt front himself, then started again after Watson’s understanding ‘uhm’.\n“Remember your request about publishing your stories again? I do think that we should avoid doing it. After this last case especially. I want us to be safe, my darling. Let those enemies of mine who don’t consult the newspapers think to me as dead for a while still. – He paused, hearing his Watson sigh. – I’m sorry, my dear, but it’s the safest course of action.” He added.\nWatson kept his silence for a few more minutes, still slowly caressing his husband’s body, then sighed again. “I suppose – He began. – that you considered all the possible consequences of those stories, right?”\n“I did.” Nodded Holmes.\n“Very well then. I would never put us in danger, you know it.”\nHolmes nodded, letting go of the last of the tension in his body. “Thank you for your understanding, Watson. Of course, I should be delighted if you kept up your habit of keeping a record of our cases, who knows, maybe in some years it will be safer to publish those.”\nThe doctor chuckled, squeezing his husband’s waist in thanks. “Thank you my dear. It’s so very beautiful to have you back.”\n“It’s so very beautiful to be back, my darling.”"
    },
    {
        "title": "The latest vegetable alkaloid",
        "url": "https://archiveofourown.org/works/52993738",
        "fandoms": [
            "Sherlock Holmes & Related Fandoms",
            "Sherlock Holmes - Arthur Conan Doyle"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "12 Jan 2024",
        "language": "English",
        "words": "826",
        "chapters": "1/1",
        "comments": "8",
        "kudos": "33",
        "hits": "259",
        "post_title": "“...Holmes is a little too scientific for my tastes—it approaches to cold-bloodedness. I could imagine his giving a friend a little pinch of the latest vegetable alkaloid, not out of malevolence, you understand, but simply out of a spirit of inquiry in order to have an accurate idea of the effects. To do him justice, I think that he would take it himself with the same readiness...\"\n-Stamford to John Watson in 'A Study In Scarlet'\nAnd then Holmes actually did something similar. Stamford reads the story.",
        "comment": "The middle of December was, for John Watson, quite a busy time. He had always loved preparing for Christmas and so he usually spent the first three weeks of December between trips back and forth to the city, decorating the cottage, writing cards and baking sweets with his partner.\nIn the morning the routine was simple, they would rise, often together, Holmes would go out to check on the bees as Watson prepared their breakfast. They would eat together and then, as Holmes often joked, captain Watson would take the lead and direct their Christmassy efforts.\nThat mid-December morning it was all going as planned. Holmes had been bundled up in an additional scarf to go check on the hives while Watson had laid his jumper on a chair and donned his apron for preparing their breakfast.\n\"I intercepted the postman, Watson! - called Holmes divesting himself from his coat - It seems you have a letter from London today.\"\n\"London you say? Who's the sender?\"\nHolmes approached his husband and circled his waist, giving him a light kiss on the cheek \"Apparently Stamford. Still cooking?\"\n\"SOMEONE has reorganized the pantry and I took 5 minutes for getting the ingredients. Do you know this ghost? I suspect he's quite the tall and agile fellow.\" was Watson's playful answer.\n\"Do we have a case, perhaps?\" grinned Holmes.\n\"No, I don't think so. I believe that I found that ghost already. - he chuckled - Read the letter aloud, that's a good Man?\"\n\"Of course, wouldn't want to distract you from the eggs. Let me see. Written by Stamford, of course, when he was in a quite amused mood with a broad pointed pen and blue ink. - the detective smiled at his husband's chuckle as he leant on the counter - it reads 'My dear Watson, good morning and I hope this letter finds you well,' uhm, usual pleasantries-\"\n\"For which - interrupted Watson - some of us care my dear\"\n\"Indeed, my darling. Well after the pleasantries that I will leave to your eye we get to the clue 'I have read your latest story on the Strand yesterday, and I wonder if you've found yourself thinking to that early conversation of ours, when I introduced you and Holmes.' Whatever has Stamford told you about me that time?\" inquired Holmes\n\"You would know had you read 'A Study In Scarlet' - Chuckled Watson - pass me the dishes, please.”\nHolmes obliged him \"Here you go, Chef. 'And I would be delighted if you could join me tomorrow in our old favourite pub for a drink and a chat' Now I'm curious, my dear. Whatever did you write in that book that can be linked to the Cornish Horror story? Here, the letter. He encloses a Christmas card for the two of us and Christmas wishes.”\n\"Thank you, Holmes. Get the tea\"\n\"Sure, my dearest Watson, but you' re avoiding my question...\"\n\"You wanted a case, didn't you? - the doctor's devilish grin was balanced by his playful and sparkling eyes - I believe you have, in this house, all the instruments to solve this case tomorrow as I am in London for a chat with old Stamford.\"\n\"I believe you'll find him in good health but a bit less strong than he was, his writing his open and good but a tad less decided. He was hesitating a bit to write what he did\" Holmes smiled pouring his partner a Cup of tea.\n\"I will take care to check out your deduction, my Holmes. Now eat your breakfast\"\nThe following day Watson met Stamford directly at the pub and after greeting each other and ordering a beer they sat down to chat.\n\"So. Took him a while but he did it\" Stamford's smile looked like the Cheshire cat’s.\nWatson laughed \"To be fair to him, he didn't add anything to my coffee...\"\n\"And he of course stayed right there to sniff the poison as well.”\n\"Just as you had predicted. He also apologized afterwards.\"\n\"My, Watson. Indeed? - Stamford was laughing - Age softens everyone, it would seem.”\n\"Doesn't work so much with him. - the doctor joined in the laugh - I left him with a case, you see. Whatever you had told me that could be linked to the devil's foot or, as he still says, the Cornish horror.”\n\"He always was a queer fellow. Come on, you can tell me. Did he try to poison you or himself other times?\"\n\"Only by filling the house with smoke, my friend! Usually, the only alkaloid in our coffee is caffeine.”\n\"I'm glad you two are doing well. Would have never imagined him retiring to the country, but retirement treats you both quite well, it would seem.”\n\"And your practice is also still treating you fairly well, it seems.\"\n\"Just well enough that I will be glad of some few days of holiday for Christmas.\" grinned Stamford as Watson chuckled before going on with their chat, from a topic to the other."
    },
    {
        "title": "22. Too freaked out to sleep alone",
        "url": "https://archiveofourown.org/works/59946088",
        "fandoms": [
            "Sherlock Holmes - Arthur Conan Doyle",
            "Sherlock Holmes (1984 TV)",
            "Sherlock Holmes & Related Fandoms"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "21 Oct 2024",
        "language": "English",
        "words": "860",
        "chapters": "1/1",
        "collections": "1",
        "comments": "13",
        "kudos": "36",
        "hits": "311",
        "post_title": "Holmes has only been back for like 10 days.\nAnd it's not as easy as one might think.\nHe needs a hug. And a talk.",
        "comment": "Dr John Watson tensed up in his bed, opening his eyes at the sound of soft footsteps.\nHe tried to force himself to relax, to force his instincts to calm down, to listen to the heavy rain hitting the road and the window panes, but couldn’t manage.\nHe expected it to happen, of course, and the footsteps weren’t what had waken him up. First it had been pacing down in Holmes’ room and the sitting room, books being taken up and put down again in annoyed, sharp moves, the sounds coming up from the first floor were almost enough for the doctor to picture his partner’s frantic moves.\nThe violin followed with its high, discordant, haunting notes, played without even bothering with the bow in an attempt to soothe his nerves.\nIt had been five minutes since Holmes had played the last note, and now he was clearly coming up.\nFew seconds later, the door slowly opened to a tall, skinny, pale figure in a white nightshirt. The detective stopped a bit at the threshold, trying to calm his breathing, trying to guess if the doctor was still asleep.\nWatson took him out of his doubt. “I’m not sleeping Holmes. – He breathed. – Come here, my dear fellow, don’t you stand there. It’s a chilly night.”\nAs the doctor moved to leave him space and open the covers, the detective padded softly toward the bed and climbed in at Watson’s invitation.\nHe didn’t lie down, but sat against the headboard with his knees tightly drawn against his chest and his arms hugging his legs. “I’m sorry I woke you up, Watson.” He uttered in the dark.\nThe doctor smiled. “I was having issues sleeping as well. – Lied Watson. – Come, lie down.”\nHolmes shook his head imperceptibly. “Can’t. It’s dangerous. – He breathed in shakily. – I… I can’t sleep…” He admitted.\nDr Watson sighed once more and rose, bolting the door of his bedroom. “It’s safe, I promise. I’m here to keep a look out, Holmes, please. Lie down with me.” He asked, trying to calm his partner down.\n“May I stay here?” Asked the detective, shyly.\nDr Watson sighed again, brushing his partner’s hair away from his forehead and kissing him there softly. “Of course. You will always have a place here. We care for each other, remember?” He murmured.\nThe detective trembled a bit but let himself slide under the covers, moaning softly as he felt his Watson’s arm circle his chest and hold him tight.\n“I know nights like this one are scary, Sherlock. I promise I know. But here we are safe.” He said reassuringly.\n“Thank you John. I’m very sorry, it’s such a childish thing-”\n“Shush. – Interrupted the doctor. – You have nothing to thank me for, Sherlock Holmes, and it’s not a childish thing. I felt in the same way when I returned from Afghanistan. I’m sure you remember.”\nThe detective shook his head. “I remember, but it’s different. You had been wounded, I… I am the one who’s hurt you now, I’m not a victim.” He protested.\n“You were hurt also. I have no doubt you have some new scars on yourself, my darling, and of course you were never safe for three years. That will hurt a man. Even the strongest one, even Sherlock Holmes.” Stated Watson.\n“But it was my decision. It… you are right, I\nhad\na choice, I could tell you, but. But I didn’t. And now I’m violating a boundary of yours again.”\nDr Watson sighed deeply. “We stated already that you weren’t thinking clearly at Reichenbach, and I have no reason to doubt that. And your actions came from your desire to keep me safe, and I can’t fault that either, even if you took the choice away from me. I understand why you’ve done it, I would have likely done the same.”\nHolmes sighed. “You’re a better man than I, John. I doubt you would’ve lied to me for three years.”\nThe doctor sighed, kissing his partner’s hair. “I don’t know if I would have managed to hold on for so long. – He admitted. – But I too would have returned to a man whom I love and who I think loves me. Just as you did, Holmes.”\nHolmes nodded his acquiescence, and the doctor continued.\n“And you’re violating no boundary, Holmes. The time I asked you for concerns making love again, building again what we had, our reciprocated confidence, not asking for a hug or some company when you can’t sleep. You will always have a place in my heart and in my bed, my dear fellow.”\nHolmes sighed and smiled a small smile. “Thank you John. You are truly the best and wisest man I’ve ever known. – He shivered a little, the doctor hugging him tighter. – Thank you.” He concluded, so softly Watson almost didn’t hear it.\nHe sighed and stroked his silky hair again. “Nothing to thank me for, dearest. Now try to sleep a bit.”\nThe detective nodded as the doctor kissed his forehead again.\n“Goodnight John.” He whispered.\n“Goodnight Sherlock.” Answered Watson as sleep began to dawn on them both again, hoping for a dreamless slumber."
    },
    {
        "title": "One whole layer of oysters",
        "url": "https://archiveofourown.org/works/58555930",
        "fandoms": [
            "Sherlock Holmes - Arthur Conan Doyle",
            "Sherlock Holmes (1984 TV)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "29 Aug 2024",
        "language": "English",
        "words": "864",
        "chapters": "1/1",
        "comments": "16",
        "kudos": "28",
        "bookmarks": "1",
        "hits": "256",
        "post_title": "Mr Sherlock Holmes has one weird obsession.\nAnd no, I'm not talking of tobacco ash. This is the one thing he's forbidden to speak about. And if he does, there are consequences awaiting him!",
        "comment": "Despite what has been written, leisure was not rare in the Holmes-Watson household.\nIt was a calm if chilly autumn afternoon and Mr Sherlock Holmes and Dr John Watson, late of 221b Baker Street, London, were leisurely occupying the time before their habitual evening walk by reading together on their couch, each in pursuit of their own interests. Mr Holmes laid with his head pillowed on his partner’s belly and his long legs crossed, one foot braced on the armrest, reading a book regarding the various critters found in the seas and oceans while Dr Watson amused himself by reading The Lancet and caressing with a casual touch his husband’s now longer, soft greying hair.\nAs Mr Sherlock Holmes let the book fall on his chest still open and stretched, slightly lifting his body leaning on his shoulders and foot and moaning softly, Dr Watson chuckled, bringing his hand lower to caress his high cheekbone. “Has the great Sherlock Holmes tired of the creatures of the oceans?” He asked playfully.\nHolmes moaned again, angling his head to look his partner in the eye. “Not yet. – He grinned. – Not until you will accompany me for a swim in mornings.”\nBoth men laughed as the doctor assured his detective to be very much of a dry land creature.\n“Yet you are so pretty when you swim, so at ease…” Admired the detective, capturing his husband’s hand to press a kiss on its back.\n“You old flatterer. – Admonished Watson playfully, kissing Holmes’ hand as well. – Food for thoughts?”\nHolmes’ often severe features were brightened by an impish grin. “You perhaps mean ‘case for thoughts’, dear fellow. – He joked. – I’m thinking… of Oysters.” He smirked.\nWatson huffed. “Really Holmes, not Oysters again, I beg of you.”\nTickled by his partner’s slight annoyance the detective smirked and continued, a playful smile on his thin lips. “But consider! Bivalves and monovalves aside, consider how pearls are made! If the seafloor were-”\nDr Watson snorted again, tugging slightly at his husband’s hair and interrupting him. “General rehearsal for your monograph on malingering?” He smiled, only half as much annoyed as he pretended to be.\n“Ah, you got the true strength of my acting in that case! No, no, Watson, I’m considering how the layers of Mother of Pearl can cover basically anything!” Continued Holmes, enthusiastically.\nDr Watson smiled and rolled up his paper to playfully tap his husband head. “Are you going to claim merits as a housekeeper over getting oysters for dinner again, my love?” He smiled, a hand already trailing down his husband’s side.\nOnce he had arrived at the level of his waist, Holmes squeaked and jumped up to perch himself on the couch’s armrest. “Those are forbidden tactics!” He laughed.\nThe doctor grinned back. “Just as oysters are a banned topic!”\nHolmes’ grin widened. “But imagine! A whole bed of oysters! Anything could get trapped by their valves! Too slow!” He grinned, jumping out of the couch and on Watson’s armchair to escape the playful swat with the rolled up paper!\n“Come down here you eel!” Laughed the doctor.\n“Anything! Maybe so many oysters could cover a the whole floor in mother of pearl! Slow, John, slow!” Grinned the detective after jumping from the armchair back to the couch and from that to his own armchair.\nWatson grinned again. “I’m not putting any effort in this, dear husband! – He warned, then gasped as he saw his man climbing on the armchair’s backrest and perching himself there. – You’re a damn squirrel!”\n“From fish to mammal, interesting transition! – He laughed. – Imagine, a fish mistakenly entering an oyste-”\nAs Holmes talked, his balance faltered and he fell back on the floor, right into his husband’s arms.\n“Yes, my dear cat? A fish swimming into an oyster?” Breathed the doctor right into his ear, a laugh in his voice.\n“He would get trapped, my love. Trapped in Mother of Pearl, fated to die and be embedded in that beautiful substance.”\nDr Watson laughed, squeezing his Holmes tight. “And this, my dear fish, is what happens to fishes who think themselves oh so clever.” He murmured, his mouth moving on what was visible of his husband’s neck to leave small kisses, his hands finding the hem of his wool vest and slipping inside it, working to tease his shirt out of his trousers.\n“And what would that be, my delicious bear?” Grinned the detective, basking in his husband’s kisses and melting in his strong hold.\nWatson smiled against his Holmes’ neck and put there yet another kiss, careful not to leave any mark, and then as his hands finally managed to slip under his shirt. “The punishment for talking of oysters, my sleuth hound.” He grinned planting his fingers in the most ticklish spot of his husband’s slim sides.\nHolmes squeaked, curling on himself in the useless attempt to escape Watson’s vice-like hold. “Joooohn! John please!” He yelped between laughter.\nThe doctor laughed together with him, holding him up in position, almost lifting him from the ground. “Oh my dear, dear Sherlock. – He grinned, flexing his fingers and delighting in his husband’s yowls of laughter. – You knew of the consequences, my love!”"
    },
    {
        "title": "11. Unexpected family gathering.",
        "url": "https://archiveofourown.org/works/59681179",
        "fandoms": [
            "Sherlock Holmes - Arthur Conan Doyle",
            "Sherlock Holmes (1984 TV)",
            "Sherlock Holmes & Related Fandoms"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "12 Oct 2024",
        "language": "English",
        "words": "946",
        "chapters": "1/1",
        "collections": "1",
        "comments": "12",
        "kudos": "16",
        "hits": "159",
        "post_title": "Not quite a festive family gathering, but for the Holmes family it's already a lot.\nRight after Master Blackmailer Mycroft is quite worried for his brother",
        "comment": "Mr Holmes chuckled as he heard the doorbell. He had expected such a call since their nocturnal visit to Mr Milverton.\nHe leaned back on his chair, swirling his solution so as to make all his copper crystals dissolve. \"Watson, would you be so kind as to open the door... Approximately now?\" He asked with a smile.\nThe doctor puffed on his pipe, putting down his book and moving toward the door. \"Are you expecting someone, dear fellow?\" He asked.\n\"Not quite, but i thought this visit probable. – Asked Holmes, then he raised his voice, taking on a theatrical tone. – Mycroft! What a surprise, brother mine.\"\nMr Mycroft Holmes didn't let himself be disturbed by the door opening suddenly in front of himself and by his brother's theatrical welcome. He had known Sherlock since his birth, he knew perfectly well that such behaviour was to be expected.\n\"Sherlock! – He greeted back. – Don't you try to pretend to be surprised. Good day, doctor.\"\nSherlock Holmes smiled slyly observing his brother's anxious demeanour and moved languidly covering his solution with a watch glass and then sitting opposite to him, on his own armchair, impudently slinging his legs over one of the armrests. \"Should I pretend not to know the reason of your surprise or I can communicate it to my Watson?\" He asked.\nMycroft Holmes straightened his posture, glaring at his brother. “If you know what lead me to alter my usual round, please. – He gestured toward an imaginary public. – Please, share your findings with us, Sherlock. Why am I here?”\nSherlock Holmes slouched deeper in his armchair, a ghost of a laugh on his lips. “Watson, my dear, would you mind handing Mycroft some brandy? It will be great for your nerves, brother. – He smiled again. – You are here because of Mr Milverton’s murder, right? You have somehow guessed that I was there that night.”\nMycroft glared harder at his brother, but accepted the glass of brandy, draining it in one gulp. “And why, brother mine, are you so relaxed about this?” He asked with barely contained anger.\nSherlock Holmes sighed deeply and moved to sit in a more proper way, leaning forward with his elbows on his knees, fingertips touching just under his nose. “Because, brother mine, you have no evidence. – He stated, a smile playing on his lips. – Nobody, not you, not that butler, not the servants, not even Milverton’s murderess or the police can prove anything about our presence there. Now, you’re a much cleverer man than this and than I am, and we both know it. What do you really want?”\nThe older Holmes clenched his jaw, then relaxed it. “You had a case?”\n“And an open bill with him.” Nodded Holmes.\n“Did he know?”\n“No, I would have never allowed him. Watson thinks he suspected somehow.”\nMycroft nodded, gravely. “Doctor. I know I can expect more prudence of you that I can from my brother. – He stated. – If ever Sherlock allows you to start publishing those stories again, let this one wait for some years before publishing it.”\nWatson nodded and smiled. “I thank you for the acknowledgement, Mr Holmes, but if you know of my prudence you should know I will take all the measures I can to ensure that nobody can recognize the people involved. Nobody but themselves of course. And I won’t of course publish any story anytime soon.”\nSherlock Holmes smiled, proud. “I won’t give my permission until we are close to retirement, as you both know.”\n“And as I agreed. - Smiled Watson back. – We are not that much crazy, Mr Holmes. I know that sometimes, certain things can’t be allowed to circulate.”\n“I still remember that your story of ‘The Second Stain’ turned the cabinets in a knocked wasp nest.” Sighed Mycroft.\n“And yet I didn’t publish it before the people directly involved had retired, and I didn’t publish it without taking care of changing around few names and dates so as to make them unrecognizable-”\n“To anyone but themselves, yes, yes. – Interrupted Mycroft. – Still. Be careful you two, a vacation for a while wouldn’t be such a bad idea.” He advised.\nAt this Sherlock Holmes laughed. “Jesus above, Mycroft, you’re really feeling paranoid today, are you not? Is Lestrade the issue? You can make him think whatever you want him to think and you know it as well as I do. Still. Watson has been bugging me to rest after this case, have you not, my dear fellow?” He grinned asking to his parter.\nWatson sighed, smiling sweetly to his partner but addressing the man’s brother. “You know him better than I do, Mr Holmes. You know his feelings about blackmailers, he strained himself during this case. If you can convince him to take a short vacation, I’ll be forever grateful for that.”\nMycroft Holmes laughed, for the first time in their encounter. “I do think a good start would be getting some dinner into you both, then I’m sure that maman’s house on the Channel should be quite free, and if you send word a few days earlier you know you’ll find it perfectly ready for a short, restorative stay.”\nThe detective smiled, staring in his brother’s light grey eyes, trying to guess his thoughts. “You sent word already?” He asked.\nMycroft tutted softly. “Guesswork now, Sherlock? Get up from that armchair and into your coat. You two are coming to the Diogenes for dinner today.” He smiled, getting up himself from his seat and snickering as he saw his brother stretch theatrically before finally rising far too gracefully for a man, Mycroft could tell, that had spent the afternoon stooped over his chemistry bench."
    },
    {
        "title": "Journey",
        "url": "https://archiveofourown.org/works/56276323",
        "fandoms": [
            "Sherlock Holmes & Related Fandoms",
            "Sherlock Holmes - Arthur Conan Doyle",
            "Sherlock Holmes (1984 TV)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "30 May 2024",
        "language": "English",
        "words": "965",
        "chapters": "1/1",
        "collections": "1",
        "comments": "8",
        "kudos": "15",
        "hits": "119",
        "post_title": "As Holmes and Watson move to sussex the Index and their archives move with them.\nOrganizing them back again in their new home can't be anything but a journey through memeory",
        "comment": "As much as they might desire to find calm and relaxation in their retirement, both Dr Watson and Mr Holmes were keenly aware of how much work the moving would take. In view of this, they had taken their measures: Mr Holmes had moved two months earlier than the doctor, accomplishing both to give time to the doctor to say all his private goodbyes and to start preparing the cottage and roughly tidying up their belongings in smaller solutions making it much easier and much less of a gruelling job, Dr Watson visited regularly and regularly shipped parts of their things. Despite all their preparations and planning, none of them had imagined even in their worst nightmares what would have been to transport their archive.\nThe archive was the collection of their 20-and-change years of detective and writing activity, it was composed by the Index, the commonplace books, the scrapbooks, Watson’s and Holmes’ separate notes on the cases and Watson’s drafts and writings. It was massive.\nIn early march 1904, while making the plan, they decided that it would be shipped in several properly labelled trunks by Doctor Watson and left alone until the last trunk hadn’t been received and only then they would re-organize it together.\nIt had taken five trunks filled to the brim and three weeks to ship it all and now the trunks had been sitting in their new sitting room for two weekly visits from Watson already, and, as much as the doctor put the blame of it on his husband, no jury would have declared him innocent.\nIt was a pleasantly warm Saturday morning toward the end of May that the two men swallowed their fear of the trunks and decided to tackle the beast.\nThe two of them wearing only a pair of comfortable trousers and their shirt, a pot full of black coffee and one full of tea to serve for their nerves, the bookshelves scrubbed clean of any dust and the boxes labelled and ready to be used. The detective and the doctor moved the trunks so that they could all be accessed comfortably and then set to begin.\nThey unloaded the first trunk completely and set to reclassify their oldest cases, Holmes sitting on the carpet and Watson organizing them in the boxes he had designed so many years earlier.\n“1883, Holmes. Careful, they should be ordered already.” He asked, adjusting the pipe in his mouth.\n“They are, but you should also include the two scrapbooks of that year, I believe. – Answered the detective handing him the files of the cases while keeping the scrapbook open on his knees. – Look here, so many things. There’s a photograph of us too.” He smiled.\nThe doctor grinned as well. “Look at those young chaps, how much time it passed. Anyway, no Holmes, the scrapbooks and commonplace books go in the boxes under the shelf. First we organize the cases, then the books.”\nThe detective laughed, dragging his husband down to steal a kiss. “As captain orders.”\nIt took them until lunchtime to organize all the cases, then after a light meal and some more coffee they set to reorganize the scrapbooks, Holmes still sitting on the carpet but the doctor relocating on the couch.\n“What a journey it is, Sherlock.” Smiled the doctor, nostalgic.\n“Indeed, through time. – Purred the detective as his husband ruffled his hair even more, making some strands fall over his eyes. – Do you know this pretty chap in a military uniform? I believe he would still look dashing with it.” He showed the photograph to his partner, who laughed.\n“Oh, I really don’t believe it to be the case, my love. That chap was at least ten years younger than I am now...”\n“But you look just as handsome now as you did back then. This goes in my private ‘Watson’ folder.”\n“Shouldn’t it go on the mantel?” Chuckled the doctor.\n“No, no. I have other photographs of yours for the mantelpiece.”\n“Not the other ones we took in ‘95, I hope.” He grinned.\n“Oh John, where you bring me in my memory. No, those are also in my private folder.”\n“As yours are in my own. This is the 1895 one?”\n“No, the 1886. One of the two I filled, I don’t know how your photograph ended up here. I believe because we also have your photograph with your comrades from the army here, also uniformed.” He showed another picture of a yet younger Watson.\n“So much time…”\n“As you said, a journey through memory. Let’s get the 1887-8 book. Few things happened that year, I only needed one book.”\n“Don’t you have portraits of Mrs Norton?” Informed himself the doctor.\n“No, my dear fellow. But I have yours, one photograph of you and Mrs Watson and one of us three together. You looked really handsome in that waistcoat.”\n“As you did with that suit, my lovely. Mary was beautiful as well.” Watson’s sentence ended up barely louder than a whisper and the detective reached up to pat his arm in comfort.\n“She was, beloved. She truly was.”\n“It’s how these journeys are, is it not? Beautiful stretches and some less pleasant ones.”\n“Indeed. We should have a trip, my love. A grand tour after we retire.” Proposed Holmes.\n“Around the world?\"\n\"Indeed. I should like to visit India with you.”\n“Then let’s finish this journey, let’s move properly and then let us set for a less metaphorical one.”\n“It’s a beautiful plan, my love. I like it.” Laughed the detective.\nWatson smiled, then sighed, determined. “Now let’s start again with the work, my love. We need to finish, so we can spend tomorrow lazying in bed.”\n“You scintillate today, my dear fellow! Yet another excellent plan.” Grinned Holmes, making Watson laugh."
    },
    {
        "title": "6. Cuddles after a bad day",
        "url": "https://archiveofourown.org/works/59527846",
        "fandoms": [
            "Sherlock Holmes & Related Fandoms",
            "Sherlock Holmes - Arthur Conan Doyle",
            "Sherlock Holmes (1984 TV)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "06 Oct 2024",
        "language": "English",
        "words": "971",
        "chapters": "1/1",
        "collections": "1",
        "comments": "8",
        "kudos": "23",
        "hits": "214",
        "post_title": "After their interview with Milverton holmes needs to unwind.\nWatson takes care of him",
        "comment": "As soon as he and Watson saw Milverton's carriage leave, Holmes exhaled, trying to let go of some tension as he sat down in his Watson's armchair cross legged, trying to force his racing brain to stop.\nIn an attempt to calm down, he regulated his breathing trying to follow a pattern he would employ for a meditation.\nThe effort didn't last more than five minutes, as he sprang once more up from the chair and started roaming the room.\n\"You look very much like a caged tiger, Holmes.\" Observed the doctor from Holmes' desk chair.\n\"I failed, Watson. But even if I did, we still learnt something, we do have something that we can exploit.\"\n\"Vanity?\" Asked the doctor.\n\"Vanity, fear, arrogance. All of these things. But for now my brain is racing too much to form a proper plan.\" Holmes huffed again, letting himself fall inelegantly on the couch.\nThe doctor turned on the desk chair observing his partner.\nHe was incredible. Holmes could make seem graceful what the rest of the world would call inelegant, the doctor saw it clearly: the energy contained in those long limbs, the tension that still held him coiled tight.\nHe clicked his tongue and put down his pipe. \"Come, my dear fellow. You need to rest, Holmes.\" He ordered.\nThe detective hissed between his teeth and protested. \"I can't take a nap at half past Six, Watson. I need to find a way to untangle that girl from this case.\"\n\"You will think better to it if you first allow your brain some rest. Once you're calmer organizing the facts will be much easier and they'll appear much more clear.\" He insisted with a smile, offering his partner is hand.\nThe detective smiled and took it, rising from the settée. “It is risky for us in this case.”\n“It would be if he knew of the depth of you ambitions, my dear. He doesn’t.”\n“Still, we can’t afford to let our guard down yet.” Sighed Holmes.\nThe doctor shook his head and leaned up to kiss his partner. “You are so ridiculously tall, my dear. – He murmured as their lips separated. – If we climb up to my bedroom and tell Mrs Hudson that we’re not to be disturbed we should be safe.”\nHolmes sighed again, cupping his partner’s face. “You are too good a man, John Watson.”\n“Come then. Come up.” Smiled the doctor, leading him upstairs by the hand.\nThe two of them didn’t undress further than taking off their shoes, jackets and waistcoats, but tucked in under the blankets to snuggle close, with Watson hugging his partner close and Holmes relaxing as soon as he felt his husband’s strong arms around himself.\n“Now, my dear, you could try rest a bit. – Smiled the doctor kissing his Holmes’ hair. – Or to tell me why you’re so tense.”\n“I knew he would refuse my deal, that’s the point. I knew he would refuse to lower his price and I knew of his… heartlessness. I just can’t suffer blackmailers. And the professional kind even less than the opportunist one.” Answered Holmes.\n“Holmes, are you thinking to Mr Trevor?” Enquired the doctor.\nHolmes breathed in deeply, shakily, then nodded. “Yes. I’m thinking of Victor Trevor and of his father. The callousness of blackmailers… It’s just the worst of all.”\n“Are you afraid, dear Holmes? – Asked Watson, then he reassured his husband. - There’s nothing bad in it.”\n“Afraid? Yes, probably I am afraid. Afraid of my Index, afraid of Milverton, afraid for us. We need to be really careful Watson, doubly so than usual.”\n“It is very brave of you to fight against a man who could destroy what you built in so many years, my darling. I’m very proud of you.”\n“Thank you my Watson. Hold me close, please. I wonder. Sometimes I do wonder if some of the people we catch and we let get away think me some sort of blackmailer, preparing my field for the future, I mean.”\nDr Watson sighed deeply once more, holding his partner even tighter. He knew the reason of his worry. Just like Milverton’s or Moriarty’s, Holmes’ knowledge of London, of England and of what happened under the shiny façade high society put on for the public was immense. The doctor rubbed his husband’s back, tracing with a thumb the shape of his scapula and feeling his spine. He mused that probably both Holmes’ desire to disprove the fear that he could blackmail his clients in the future and the client’s desire to recompense a man so that he could not be tempted to could be behind both Holmes’ high fees for his more high class client and the princely recompenses many of these men and women offered to him.\n“Your clients know your worth Holmes. They know that you wouldn’t blackmail them and they pay you very well so that you will not be tempted to. You are an honest man and people know, otherwise why wouldn’t you be employed with the police? Or why wouldn’t you exploit your remarkable brain for crime. Your Index and my records are a measure of safety for us, they help us stay safe after 1895, among other things.”\nThe detective sighed deeply, feeling himself melt in his husband’s arms. “Thank you Watson.” He said simply.\n“Nothing to thank me for, old boy. – Answered the doctor, glad to feel his husband’s arm finally circle his body. – Now we should try to catch some sleep. You have been sleeping awfully little in the last days.”\n“The best of men, yet always a doctor. – Joked Holmes a bit weakly. – You are right my dear fellow, maybe thinking to a plan would be easier after some sleep.”\n“Close your eyes then, Holmes. I’ll keep watch.” Promised Watson softly, kissing his hair protectively."
    },
    {
        "title": "Re-furnishing the cottage",
        "url": "https://archiveofourown.org/works/57782437",
        "fandoms": [
            "Sherlock Holmes & Related Fandoms",
            "Sherlock Holmes (1984 TV)"
        ],
        "rating": "General Audiences",
        "warnings": "Choose Not To Use Archive Warnings, No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "30 Jul 2024",
        "language": "English",
        "words": "1,010",
        "chapters": "1/1",
        "comments": "12",
        "kudos": "14",
        "hits": "132",
        "post_title": "Written this while i was very annoyed at a relative and to unwind AND after experiencing a similar domestic disaster.\nSo yes i'm projecting.\nThis is more or less How Holmes and Watson would deal with having to deal with both assembling a desk AND plumping issues in the kitchen.",
        "comment": "Dr John Watson was actually very proud of his idea for their new desks for the cottage.\nHa! These newfangled ideas were a life safer for men like them who really at times tended to spend a lot of time on end at their desk.\nThis solution was indeed perfect for them, two desks, the same model and colours on tone with the wall against which each desk rested, the high of the tabletop adjustable with a simple button, truly the marvels of Misters Swan and Edison as they would have once said so many years ago, and so, so much space for all the trinkets they had accumulated in more than a century of existence, space to manage properly all the electric cords this new century was bringing to their life, in a word: it was perfect.\nThere was, looking carefully, a downside.\nThe price was not as high as they had expected because they were to assemble them themselves.\nThat was simply the recipe for disaster.\nAnd if the perspective of having to assemble anything with the least patient consulting detective in the world wasn’t enough, on the day they expected the delivery they also had plumbing issues.\nAt least his leg wasn’t acting up, hot as that summer was.\nThe desk arrived just as they were mopping up the disaster in the kitchen, they had panicked and had outlandish idea of closing the water from the control centre only after getting soaked so much that they might’ve as well grown gills.\nLuckily they were well organized men and knew how to work in team, Watson sprinted to the door to get the desks and Holmes handled the damage control.\nThey decided for assembling the desks that very afternoon, and if one took into count that otherwise they would have only had to wait for the plumber it was a sound and good plan.\nThey mopped everything and had a quick lunch, moved their old desks so to create a working space and set to it.\nWatson took charge with little resistance from the detective who had decided to only stay with a fresh pair of pijama trousers after soaking his favourite one that morning.\n“Holmes! – Called the doctor. – Get here, old man, I need a hand.”\n“I thought you had taken charge, Captain.” Chuckled Holmes as he approached and stole a kiss from his lips.\n“Don’t distract me you fiend. Help me with the instructions.”\nHolmes snickered again. “Watson, that booklet is basically only drawings!” He exclaimed, outraged, then he took it up to study it.\nHe started again. “I suppose… This… – He turned the booklet sideways. – Yes, I’d say that you mounted well this bar uniting the legs. Now… you should connect this bar?”\n“Yes, we finished this part. Now… Oh no. Holmes, there’s text. It’s over.” Commented the doctor as he set to read.\n“Put the glasses on, old boy. – Murmured the detective handing him some thin, gold rimmed glasses he had been wearing since 1895. – I’m sure we can pull it off. Let me see.”\nThe detective took up the instructions book with a smug expression which fell as soon as he put his eyes on the actual text.\nHe shushed Watson’s chuckle and set to read it.\n“So now. Take the piece number… 7? Alright and fit it into the hexagonal hole…”\n“Do help me!”\n“Watson, you have to put it into the hole, the point is getting the hole.”\n“Are you listening to yourself? Come here and hold it as I fix the other end.”\nHolmes grinned. “Of course I do, old man. Now what?” he asked as the doctor fixed the knob.\n“Now we need to get the pieces from one to four, it says.”\nSaid pieces turned out to be what constituted the tabletop, and Holmes would have been glad to lend a hand in assembling it, if the plumber hadn’t rung the bell in that very minute.\nThe detective rose, telling his husband that he would be the one to care for it, threw on a dressing gown after the doctor’s laughing suggestion, jumped over the couch and opened the door ready to handle yet another human contact.\nWhen the workman had dealt with the issue on hand and he taken his leave, Holmes returned to the other task on end.\nHe found that Watson had assembled both tabletops and also the other part of the second desk and was only waiting for his help.\nWatson directed him to turn the legs of the table on to the underside of the tabletop and aligning the holes for the screws and then, Allen key in hand, to tighten all twenty-one of them for each table.\nThe doctor snickered as Holmes plopped down in his favourite cross-legged sitting and started to move to fix the screws by crawling on the floor.\nThe job was an easy one, and few minutes later they only had to turn the table back on and fix the electric parts.\nAs soon as the desks were finished, Watson approached his husband, leaning up to kiss him.\nHolmes answered the kiss with sweetness and passion, deepening it and circling his husband’s waist.\n“Now what, dearest man?” He asked as the kiss was broken.\n“Now, old man, - Watson’s right hand climbed from his waist in a little caress up to his sternum where he just laid the hand for a moment before poking his partner. – now we need to tidy up.” He grinned.\nHolmes groaned, as always annoyed by such duties. “Can’t we postpone it for a bit, my dear? I do feel like we both deserve a treat for having managed it so quickly. – He smiled, cupping Watson’s cheek. – And I’m rather sure I have a nice little treat just right here.”\nWatson laughed and kissed his partner again. “Your suggestion\ndoes\nhave merits Holmes. Maybe we could take a nap” He grinned steering his partner toward their bedroom.\n“A nap! You have always the most wonderful ideas, my Watson!” Grinned Holmes, hugging his husband as well."
    }
]