[
    {
        "title": "The Wedding Video",
        "url": "https://archiveofourown.org/works/57517435",
        "fandoms": [
            "Dark (TV 2017)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "20 Jul 2024",
        "language": "English",
        "words": "625",
        "chapters": "1/1",
        "kudos": "7",
        "bookmarks": "1",
        "hits": "71",
        "post_title": "While preparing for Ulrich and Katharina's silver wedding party, Magnus and Martha are telling Mikkel about the times they watched their parents' old wedding video, which Mikkel never saw because the VCR broke when he was a baby. Years later/earlier, he wishes he got the chance to tell them he just caught the live show.",
        "comment": "Mikkel had never seen it himself, because his parents’ VCR had given up the ghost not that long after he was born and they never bothered replacing it, but when it was coming up to Ulrich and Katharina’s wedding anniversary party, his parents got out the wedding photos, and Magnus and Martha talked about the times when they’d been made to watch the wedding video. At least, made to watch it was the way Magnus had put it; Martha had admitted that at the time, she’d enjoyed seeing her mother’s wedding dress and Hannah Kahnwald’s bridesmaid’s dress.\n“Remember how we used to laugh at Aleksander Tiedemann’s hair in the video?” Martha giggled, elbowing Magnus and turning to a picture of Ulrich with Aleksander and Peter Doppler.\n“Hey, Aleksander’s hair was very much in the fashion for the time,” Ulrich had laughed, gesturing towards the picture of himself. “It was certainly no worse than any of ours.”\n“Grandmamma Albers doesn’t look very happy,” Mikkel said as he turned over the page. He couldn’t remember Helene Albers very well; his grandmother had died two years earlier, and Mikkel hadn’t spent a lot of time with her before that apart from Christmas Day sometimes when he had to. He was okay with that, though; he mostly remembered her as scary, disapproving of everything, and he felt a lot more comfortable with Grandmamma Nielsen, even if she did sometimes start crying and talking about how he reminded her of Papa’s brother Mads.\n“Your Grandmamma Albers never liked me,” Ulrich explained, “and she didn’t think that your mother and I should be getting married. That’s why she looks miserable.”\n“Wasn’t that her usual expression?” Magnus asked. Ulrich shushed him, but with a wink that said he agreed.\n“Okay, I’ve confirmed everything with the food and drink, Charlotte’s bringing a few bits, Hannah says she’s got some plates and glasses for us, you kids just have to make sure you’ve tidied up and helped with the decorations before you even think about going to the lake with Jonas and Bartosz tomorrow,” Katharina said as she walked in. Martha immediately leaped up from her seat and started carrying some stuff upstairs; Mikkel giggled and said to Ulrich “Martha doesn’t want to miss out on spending time with Jonas.”\nUlrich laughed, asking Magnus if he planned on inviting Franziska Doppler to join them. Magnus was saved from answering by Martha walking back in and saying that Bartosz was really disappointed that he wouldn’t be able to make the party, since his parents’ celebratory dinner for the hotel opening was the same night.\n“That’s a shame,” Katharina replied. “Bartosz would have been more than welcome.” Mikkel picked up on the emphasis on Bartosz’s name, and wondered why, despite them being in the wedding photos, his parents weren’t really friends with Bartosz’s parents like they were with Jonas’s, and Franziska and Elisabeth’s, but decided that wasn’t the moment to ask.\n“Is the 80s playlist ready?” Katharina asked.\n“We’re doing good with it,” Martha replied. “We’re trying to replicate the songs from your wedding reception, so we have Heaven Is A Place On Earth, Never Gonna Give You Up, 99 Red Balloons…”\n“The ones you suggested, Jonas’s mother gave us some, and Martha got the rest from what she remembered of the wedding video!” Mikkel said.\n“Just be grateful you never had to actually sit through the video,” Magnus snorted, lightly hitting Mikkel on the back of his head.\nAs Michael sits towards the back of Winden Church, watching Katharina walk down the aisle towards Ulrich, Hannah as bridesmaid, as he watches Ulrich and Katharina’s first dance to 99 Red Balloons, he wishes he had the chance to tell Magnus he just caught the live show."
    },
    {
        "title": "The Nature Hike",
        "url": "https://archiveofourown.org/works/54859219",
        "fandoms": [
            "Sweet Valley High - Francine Pascal"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "31 Mar 2024",
        "language": "English",
        "words": "635",
        "chapters": "1/1",
        "kudos": "1",
        "hits": "18",
        "post_title": "Going on the charity nature hike to impress her latest crush had seemed a good idea to Jessica at the time. She just hadn't counted on mud, mosquitoes, blisters or her backstabbing best friend.",
        "comment": "“Whose stupid idea was this, anyway?” Jessica grumbled, rubbing at the blisters on her feet. “Why are we even on this charity back to nature hike? Caroline said Lisette’s had a sale on this weekend. I could be getting my blisters in a much more productive way.”\n“Wasn’t it yours, Jess?” Amy asked innocently. “I seem to remember you were the one who suggested we all go when you found out Michael was really into this nature stuff,” gesturing towards the new guy in their class, Jessica’s latest crush who was just ahead of them chatting with Winston and Todd.\nLila, meanwhile, glanced at Jessica’s strappy sandals. “Maybe you wouldn’t have had the blisters if you were wearing some more suitable footwear,” she smirked. “Didn’t Liz offer to let you borrow a pair of her walking boots?” Glancing at Lila’s trainers which had clearly only been bought within the last couple of days and not broken in yet, Jessica suspected that Lila was struggling just as much with blisters as she was, but didn’t say anything.\n“She’s right, Jess,” Elizabeth cheerfully said as she and Enid walked past them, trying to catch up with Todd. “I did tell you those sandals weren’t suitable footwear.”\n“And seriously, is no one else getting as bitten by these mosquitoes?” Ignoring her sister, Jessica slapped at her leg, trying not to think of the bites that would be visible on her leg very shortly, and grimaced at the muddy streaks she’d just noticed on her feet. It had seemed so simple at the time, signing them all up for this hike as soon as she’d found out Michael was organising it. Lila and Amy had complained about it when they first found out, although Lila had eventually come round to the idea and Amy had caved after that. However, Jessica was now starting to wish she’d listened to Lila and Amy’s earlier objections, or at least to Elizabeth’s advice about what to wear. She hadn’t given much thought to…mud, mosquitoes, grass, narrow paths, getting hot and sweaty. But at least it wasn’t raining like it had all day yesterday.\n“I’m gonna go…catch up with Winston,” Lila said. “I want to ask him a question about…our history assignment.” She ran off up the path towards him before Jessica had chance to respond.\n“Wait a minute,” Jessica said to Amy. “I have history with Winston. Lila isn’t even in that class. What’s she talking about?” As Jessica watched, Lila caught up with the guys who had now been joined by Elizabeth and Enid, pushed herself right between Winston and Michael, elbowing Winston out of his own conversation.\n“So that’s why she changed her mind,” Jessica hissed at Amy as Lila stumbled in what was completely obviously an attempt to make Michael think she’d injured herself so he’d help her along, even carry her if he thought it was that bad. Actually, in other circumstances Jessica would have had to hand it to her, and she’d certainly used that one herself in the past with (ugh) Jeremy Randall. Possibly even where Lila had got the idea. But right now, when Lila was throwing herself at the guy Jessica wanted to be with herself, despite being meant to be her best friend, Jessica couldn’t wait for them to get to their intended destination of the lake so she could push Lila right in it.\n“Well, I don’t think it exactly worked out for her,” Amy pointed at where Lila, having misjudged where to fall, had landed in a puddle, getting completely covered in mud, and had leapt up so fast to get out of the mud that it was completely obvious to Michael, and everyone else watching, that she wasn’t injured at all.\nSuddenly, Jessica was feeling a lot better."
    },
    {
        "title": "I Don't Want To Close My Eyes",
        "url": "https://archiveofourown.org/works/54096952",
        "fandoms": [
            "Awake (TV)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "27 Feb 2024",
        "language": "English",
        "words": "643",
        "chapters": "1/1",
        "collections": "1",
        "kudos": "2",
        "hits": "9",
        "post_title": "Michael's afraid to go to sleep, in case he wakes up in one of the other worlds again.",
        "comment": "Even as Michael laughs with Hannah in the kitchen, teases Rex about being late for school again, a part of him doesn’t dare fully relax into this moment he’d thought he would never experience again. He heads into work, things seem to be going well there; Bird’s back, cracking his usual jokes, no longer dead at the hands of his new partner Ed Hawkins, and he’s in talks about a promotion into Captain Harper’s job, acting captain in the interim but they’re hoping it’ll be permanent. Meanwhile, in this universe, Efrem Vega has his promotion to detective again and Michael’s partnered with him once more; for all Michael had been dubious about him when they were first paired in Hannah’s World, they had become friends, found they worked well together, so Michael’s happy to still have Vega as his partner while getting to work closely with Bird.\nThen he heads home, hangs out in the kitchen with Rex listening to his story about something Cole had done in school earlier that day, and yet even as Rex is telling the story, Michael’s only half listening because the other half of him can’t stop thinking about how lucky he is to be able to have this conversation with Rex at all, knowing that in just a few minutes Hannah’s going to walk through the door and he’ll be able to talk with them both in a way that he had previously taken for granted.\nWhen Hannah and Rex go to bed, Michael remains in the kitchen, brewing himself some extra-strong coffee; Hannah makes some joke about how he’s never going to be able to sleep that night. Michael can’t bring himself to tell her that that’s the whole point, that he’s scared that if he goes to sleep, he’ll find himself in the same nightmare again, where one of them, his wife or his son, is lost to him one day, then the next day he’ll wake up and find the other one gone.\nAs he sits there watching some stupid reality TV show repeat that he usually wouldn’t watch in a million years but is choosing to sit through anything, any old garbage that will keep him awake, he tries to tell himself that maybe there would be a way it wouldn’t happen, that he could keep going to sleep and waking up in this world, with both Hannah and Rex. Hannah’s there right now, waiting for him to come up to bed, yet Michael remains in the kitchen, not daring to close his eyes in case he wakes up in that prison cell again, trapped with no one believing his story about what really happened the night of the accident, Rex dead, Bird dead, Harper free and still in her position as captain. Or maybe he’ll wake up in Rex’s world, with Bird still alive, Harper in custody; in this world Michael will be free, yet knowing that if he stays in that world, he will never see Hannah again.\nThat time he’d got stuck in Hannah’s world after his encounter with Ed, he’d come to believe that Hannah’s world was the real one; as he’d made the decision to turn his back on the version of him in the cells, he’d come to the conclusion that Rex’s world was the real one; Michael wants to believe that this world he’s in now, where both his wife and his son survived the accident, is the real one, the one he’s going to stay in. Dr. Lee would probably tell him right about now that he’d constructed this one himself because he couldn’t let go of either Hannah or Rex; and a part of Michael wonders if he’s right, so he’s determined to resist sleep, in case he finds himself trapped in one of the other worlds, unable to return to this one."
    },
    {
        "title": "When I Paint My Masterpiece",
        "url": "https://archiveofourown.org/works/52263058",
        "fandoms": [
            "Dark (TV 2017)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "15 Dec 2023",
        "language": "English",
        "words": "651",
        "chapters": "1/1",
        "collections": "1",
        "comments": "1",
        "kudos": "14",
        "bookmarks": "3",
        "hits": "102",
        "post_title": "In 1986, Mikkel uses his art to keep his memories of the Nielsen family alive.",
        "comment": "For Mikkel, drawing was his way of keeping his memories alive.\nInes didn’t like it if he ever talked about the life he’d left behind in 2019, with Ulrich and Katharina, Magnus and Martha, and a part of him understood why, but at the same time, Mikkel didn’t want to lose those memories of his original family. So he’d draw variations on the themes of those he used to draw as a younger child which Katharina had kept on the fridge door for ages, a family group, Ulrich and Katharina, Magnus, Martha and Mikkel. He just didn’t show them to Ines; he’d show her pictures like ones he’d drawn of her, the one he’d drawn of Hannah Kruger when they first got together, or the one of Sloth from the Goonies (since Ines had never watched that, she wasn’t familiar with the character, but still found it a relief that Mikkel was drawing a fictional character rather than anything to do with his original family).\nHe did show Ines a picture he’d drawn of Harry Houdini, although she thought that was for some school project; although he didn’t talk about him in this house, Mikkel still chose to maintain that interest as a way of holding on to another tie to his life with the Nielsen family. For a long time, he’d looked at his bedroom wall when he’d woken up, expecting to see his The Great Mikkel Houdini picture on there, then the truth would slowly dawn on him once more.\nHe’d drawn one of a youth wearing a yellow raincoat, although the youth’s face was obscured; this was Mikkel’s way of dealing with his feelings towards Jonas, once his favourite of his siblings’ friends who was always there for an ultimate fist bump, now the person who had led him through the caves back in time to 1986. No matter how he tried, Mikkel could never understand why Jonas would have led him away from his life; sometimes he thought it must have been some kind of accident and Jonas had had no idea what was going to happen, other times he was convinced Jonas had done it deliberately for some reason Mikkel would never understand. Eventually, in a moment of anger, Mikkel had ripped that drawing up into pieces.\nSometimes he’d drawn the caves, still thinking that one day he would try and go back through them and see if he could find his way back to 2019 that way, yet he’d stopped planning on that after variations on the theme of a recurring nightmare where he’d go back into the caves only to come face to face with a velociraptor and realise he’d gone back to prehistoric times, or keep wandering through the caves and never arriving anywhere at all, or whichever way he went, he would always end up stuck in 1986. Then had come the day when Ulrich had turned up at his house. For that one moment, when his father had returned to him, Mikkel had allowed himself to believe that the nightmare was over, that he could finally return to the life where he was Mikkel Nielsen and not Michael Kahnwald, to his friends, to his mother, only for Ulrich to be taken away from him, back to that ward once more, and Mikkel was returned to the life he’d spent months desperate to escape.\nAfter that, Mikkel had given up hope, kept up the hobby but found it easier to draw anything that didn’t relate to his past life; the chalet Ines had taken him to for a holiday, more movie characters, animals, Hannah. Until the day came when he heard the announcement of his own birth, became more and more aware of his younger self’s existence as Hannah and Jonas were close to the Nielsens, knew that November 2019 was drawing ever closer, and found himself drawing the caves once more."
    },
    {
        "title": "And Here Is A Red Balloon, I Think Of You And Let It Go",
        "url": "https://archiveofourown.org/works/58186075",
        "fandoms": [
            "Dark (TV 2017)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "15 Aug 2024",
        "language": "English",
        "words": "673",
        "chapters": "1/1",
        "kudos": "7",
        "bookmarks": "2",
        "hits": "52",
        "post_title": "For the prompt \"cemetery walk\"; extended version of Jonas's scene in the graveyard in 2x01.",
        "comment": "Some were names of people Jonas had only known by sight, if at all; some, like Torben Woller, had been people he’d met at occasions Charlotte Doppler or Ulrich Nielsen had organised and invited coworkers to as well as family friends, so he’d known them to some extent. Others, like Aleksander Tiedemann, he had known well; Jonas paused by Aleksander’s grave for a moment, thinking of old memories such as Aleksander helping Jonas and Bartosz with their homework when they were in primary school, and how he’d appreciated the fact that Aleksander usually turned up to Bartosz’s school events (although he understood better now why his father often hadn’t, and regretted those moments of frustration he’d felt when Michael hadn’t attended events his friends’ fathers had). There may well have been other graves of people Jonas had known well, but had just not come across them yet; if the recording of Claudia Tiedemann from September 2020 was to be believed, few people from Winden had survived the events of 27th June.\nThere was no grave for Bartosz, for Magnus, for Franziska; Elisabeth had explained through Silja that none of the three of them had ever been seen again after the apocalypse, described the hours she and Peter had spent searching for Franziska and Charlotte at the time. She had also explained that there had eventually come a time when the search for any survivors had stopped; Jonas didn’t know whether the others had made it out of Winden 2020 before the apocalypse or if they still remained somewhere undiscovered in what was left of the town, although he held on to hope for the former. While Jonas and Bartosz had been on the outs at the time Jonas had been sent to 2052, Bartosz had been his best friend since they were in kindergarten; Jonas hoped that somewhere out there he had survived.\nGrandma Ines was here; apparently she died in December 2019, months earlier than the mass burials of 2020, yet her grave resembled those hurriedly put together after 27th June; Jonas could understand that Hannah may not have had the funds to have put together much of a funeral, but had she really had to arrange a grave that was at the opposite end of the graveyard from Michael’s? Jonas remembered that she had ripped Ines out of the family photograph for reasons he didn’t feel he understood at the time; this smacked of Hannah’s final act of revenge against Ines. Admittedly, he’d been angry with Ines himself after having realised that Ines had known the truth about his father for who knew how long, but she was family, she should have been there. As for Hannah herself, Jonas still didn’t know what had happened to her; there was no grave for her, no one seemed to know what had become of her following the apocalypse.\nJonas stood by the grave of Michael Kahnwald (he still struggled to think of his father as being Mikkel Nielsen); Michael had lain in this grave for 34 years, yet for Jonas it was only one year since he had got up that morning to find his father dead. As he laid the old family photo on top of his father’s grave, thought back to the days when they had all been a family together and time travel was nothing more to him than a TV show plot, he wished he still had the piece that had contained Ines, so that they could have been a family again.\nLastly, Jonas approached the grave of Martha, who according to the date on her gravestone had also died on 27th June 2020. His older self had said that the future already existed and therefore there was nothing he could do to change the timeline back when Mikkel first went missing, and at this point there appeared to be no way for him to escape 2053 anyway. All looked futile, yet Jonas had not given up hope that there could be some way that Martha could be saved."
    },
    {
        "title": "From Fire To Eternity",
        "url": "https://archiveofourown.org/works/60048991",
        "fandoms": [
            "School Spirits (TV)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "25 Oct 2024",
        "language": "English",
        "words": "691",
        "chapters": "1/1",
        "collections": "1",
        "kudos": "9",
        "hits": "60",
        "post_title": "The ghosts cross over, condemning Everett Martin to an eternity trapped in Split River High.",
        "comment": "He hadn’t thought it through initially.\nA few years had gone by in between the lab fire which had caused Everett Martin and Janet Hamilton to become trapped in Split River High as ghosts and Rhonda becoming the first to join them; a few years in which Janet had been his only company, barely able to tolerate his presence, unable to forgive him for the accidental starting of the fire which had claimed both their lives.\nRhonda’s presence had been a relief; finally, there was someone there who didn’t know the history of the fire and was quite happy to accept a version of events where Everett’s own negligence hadn’t been to blame. Having someone else there broke the tension that had existed between himself and Janet, and as time went by, as they were joined by Dawn, by Wally, by Charley, it became easier still.\nYet Everett continued to fear a day when they would all cross over, leave Split River High behind, leave him trapped in this building where he had remained since 1958. So it had been easy, at least at first, to act as though he was helping them to cross over while having no intention of doing anything of the kind; he’d been a teacher, part of the afterlife longer than any of them, the other ghosts had expected him to know what he was talking about and hadn’t questioned him. (Janet had been the only one to ever call him on it, to ask him why, if he knew anything at all about how to cross over, he’d never attempted it himself. But she’d only ever said that to him when they were alone, never in front of others, so none of the other ghosts ever picked that up and asked the same question).\nThe truth was that Everett didn’t want to face up to his own past, to admit that the fire had been caused as part of his own incompetence. Yes, there had been people who had said afterwards that it had been his fault, but the school had successfully hushed that up, trying to avoid the Hamiltons’ lawsuit, and eventually the matter had died a death. It was accepted as an accident, Everett told any new ghosts that someone else had caused it any time the subject came up, and he was able to avoid thinking about it. Time went by, there was no one there who could contradict his version of events (well, except for Janet, but she had never publicly done so). But the other ghosts…Everett had studied them all, knew the circumstances of all their deaths, and knew that it would be a lot easier for them to face their own pasts, that eventually they should have the means of crossing over.\nAnd he’d got away with it for years; ghosts had come, but none had gone, Janet had never contradicted his story, Everett Martin remained safe. Then had come the day when Dawn had crossed over, having talked about the day of her death with Maddie, having heard Maddie say that she was a good friend. What had seemed an unobtainable ideal was now a reality; it was only a matter of time before the ghosts crossed over, left him behind. Charley already seemed on the right path with the letter he had dictated for Emilio, Wally too was starting to deal with his history with his family and football. And now Charley, Rhonda, Wally and Maddie were starting to look into him, to question him.\nThe day was coming; Everett knew he couldn’t run from it any longer. It had started with Dawn, continued with Maddie Nears as she reclaimed her body, with the other ghosts losing their faith in him. They understood now that he had never been trying to help them cross over, they knew how to do it without him. He saw the ghosts, Charley, Rhonda, Wally, even Janet, crossing over, rushing straight at him as they did, letting him know what they thought of him and his lies. And Everett would be there, condemned to live out eternity in Split River High."
    },
    {
        "title": "Once I Had Dreams, Now They're Obsessions",
        "url": "https://archiveofourown.org/works/56817601",
        "fandoms": [
            "Yellowjackets (TV)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "F/F",
        "status": "Complete Work",
        "published": "22 Jun 2024",
        "language": "English",
        "words": "709",
        "chapters": "1/1",
        "comments": "1",
        "kudos": "9",
        "hits": "114",
        "post_title": "Taissa has achieved everything on her bucket list: she's married with a family, she's senator. Yet as her marriage crumbles and Other Tai surfaces, she feels she hasn't won at all.",
        "comment": "This was where Taissa had wanted to be. She should be happy right now. She’s senator, for fuck’s sake, she’s freaking senator, she beat that asshole Bathurst. It was what she had wanted ever since she was in elementary school, watching her parents swearing at Reagan every time he was on the news. She’d had the whole life plan, and as she’d been discussing with Shauna, she’d more or less kept to it. She’d got the degree she had always planned to achieve, she’d started the political career, she and Simone had married after getting together in their third year of college, and Sammy had completed their family. She had the life she had always intended to have.\nAnd yet right now Taissa felt like she hadn’t won anything at all; her marriage to Simone was hanging by a thread, and Taissa wasn’t even sure at this point whether she even wanted to fix it, would have been considering it at all if she didn’t have Sammy. Even if Taissa did decide to go back and try and fix the marriage, she didn’t know whether Simone would be open to the idea once she was out of hospital or whether she’d decide to walk away. Simone had been saying throughout the campaign that Taissa was prioritising her career over her family; Taissa was now admitting to herself that if she’d really still been in love with Simone, she might have made more effort to put their marriage before her campaign. Something she’s also been asking herself, but hasn’t admitted out loud to anyone as yet, is whether Simone still loved Taissa either; Simone had threatened to go to the press if Taissa didn’t step down as senator and get help. Was going to the press really the action of someone who wanted to make their marriage work?\nAnd it was starting to feel as though it may have all been for nothing anyway. Taissa had gone to the count fully expecting that she wouldn’t have won, she had her concession speech all prepared, and had been trying to tell herself that maybe it would all be for the best anyway, because it would give her the opportunity to fix things with her family. Of course, at that point, she hadn’t yet discovered the shrine in the basement, had no idea that Other Tai was back.\nIt seemed strange to Taissa now that she’d actually worried about other people’s perceptions of what had happened out there in the wilderness, making smart remarks about cannibalism like Bathurst or that kid who’d said it to Sammy, or Diane fishing for information at that dinner. Now that Taissa knows that Jeff was the blackmailer, she doesn’t fear anything about that time being made public; after the experience he’d had after the crash when the press were hounding him for information and then made up stupid shit when he wouldn’t engage, Jeff was hardly likely to go to the media, and besides, he was never really going to do that to Shauna. It was Other Tai that Taissa feared now, never knowing when the other one was going to appear, fearing that she may appear when Taissa was making some public appearance as senator, fearing even more that she may come to the surface when Taissa was alone with Sammy.\nVan was who Taissa needed right now; Van, who had tried offering Taissa real options for help rather than threats about the press, Van, who had slept tied to Taissa every night to keep her safe, Van, with whose help the other Taissa had seemingly disappeared years ago. Now just when Taissa thought there might be another chance for them, here Van was telling her she’d been diagnosed with cancer, that she had months to live. And while Lottie had seemed to be implying that the wilderness was pleased with them, would give them something in return, Taissa had always been less convinced by all that stuff than Van and the others. She found herself facing a future where she would lose Van, just as they had found each other again.\nTaissa had, on paper, achieved everything she’d ever wanted, yet it felt to her as though she was back where she had started."
    },
    {
        "title": "Never Watch Your Life Slide Out Of View",
        "url": "https://archiveofourown.org/works/57334384",
        "fandoms": [
            "Young Royals (TV 2021)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "13 Jul 2024",
        "language": "English",
        "words": "799",
        "chapters": "1/1",
        "kudos": "10",
        "bookmarks": "1",
        "hits": "190",
        "post_title": "Now he's no longer the Crown Prince, for the first time in a long time Wilhelm has no idea what the future holds.",
        "comment": "It’s the first time in a long time that Wilhelm has no clue what’s around the corner for him. For most of his life, he’d expected to be a working royal, technically Erik’s heir until such time as Erik had children of his own, so unlikely to ever have to actually take the throne. Then when Erik died, Wilhelm had known that his destiny lay somewhere else entirely, that he was to take the throne in Erik’s place. Now he’s made the choice to be honest with his family, to say that he doesn’t want to be Crown Prince any more, that he’s chosen Simon, he no longer knows what lies in store.\nHe doesn’t know where he’s going to be going to school for the next academic year; while he knows that Hillerska’s closure is being appealed, he’s not sure how successful that’s going to be. Yes, everyone involved in the initiation will have gone, yes, the school will be under new management, but will that be enough for the appeal to be successful? Wilhelm knows that if the attempt to appeal the closure does fail, his parents could always choose to send him back to his old school from before he started Hillerska, or find somewhere else altogether, but he’s not sure whether he would want that now, to be at a school without Simon, Felice and Sara.\nAugust’s called, thanking Wilhelm for speaking to his parents about making him the heir to the Swedish throne. Wilhelm’s not sure how their relationship will be in the future; although they are family, until recently they had never been friends, and there’s still enough water under the bridge that he’s not sure how easy it will be for them ever to really be close. At one point, he hadn’t thought he could forgive August for the sex tape, and more recently August’s shattering of Wilhelm’s illusions about Erik by revealing Erik’s role in the initiation had driven a wedge between them; yet a part of Wilhelm actually thinks he wouldn’t mind now talking about Erik with August, since August had reassured Wilhelm that Erik would have loved him. They’ll still see each other again as cousins; after all this time of disliking August, Wilhelm considers the idea that they could become something closer to friends.\nWilhelm’s never thought about the idea of a career. Why would he? Until now, he’d never expected to have any choice in the matter; whether as Crown Prince or another working royal, heir to Erik, the choice had already been set in stone for Wilhelm. For Simon and Sara and Felice, Rosh and Ayub, even August’s friends, futures not fixed in the same way, they had always expected to have some kind of career; Wilhelm knew Simon had wanted a career in music, although he had never been sure that it would actually happen. If he’s honest with himself, he has to admit that he’ll never truly leave the public eye; even though he has taken the step back from the throne, he’s still well enough known that he’ll always be recognised as a member of the royal family, never able to blend into the background and live a truly normal life in the way that his friends can. Will anyone even take him seriously when he does apply for a job, or will they decide that the downsides of the media attention outweigh the benefits of hiring him, or think he’s just playing at being a regular person before going back to the Bank of Mama and Papa, back to the royal family? They would have no worries on that score; Wilhelm knows he doesn’t want to go back to that life, was never really happy even as he went through the motions of the public appearances. And once the news is officially out there that he has abdicated as Crown Prince, Wilhelm knows that in the short term at least, he’ll be getting lots of media attention as Sweden processes the news (he’s already thought that he’d better suggest to Simon that he avoids looking at social media for at least the first few weeks, to avoid the comments from idiots.) Although August did say when they spoke that hopefully, as new Crown Prince, he’ll be able to turn at least some of the media focus to himself, take it off Wilhelm and Simon.\nBut a lot of this is either out of his hands anyway (the future of the school), or things that Wilhelm can take time to make a decision about rather than having to commit to anything straight away (any future career); Wilhelm doesn’t know what the future holds for him, but maybe right now he doesn’t need to. He can enjoy this summer with his friends, with Simon."
    },
    {
        "title": "The Voice Of The People Must Not Be Denied",
        "url": "https://archiveofourown.org/works/54257209",
        "fandoms": [
            "The Blemished - Sarah Dalton"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "04 Mar 2024",
        "language": "English",
        "words": "967",
        "chapters": "1/1",
        "collections": "1",
        "kudos": "2",
        "hits": "9",
        "post_title": "\"It seemed strange sometimes for Elena to think of how she’d believed, back when she was in primary school, that she was even more perfect than the rest of her GEM classmates because her parents had chosen to create her from the genes of that long since dead actress Angelina, rather than using any of their own genes, and even stranger now for her to think that at the time, she’d thought it mattered.\"\nThe regime of the Genetically Enhanced Men is over; Elena tries to help people come to terms with a society where their so-called perfection is no longer prized, just as she and her friends deal with their own issues with the old regime.",
        "comment": "The former beauty contestants Elena’s helping as part of her foundation are all finding it hard to adjust to the fact that their looks, their perfect health with all diseases eradicated, no longer hold the same value they did under the old Genetically Enhanced Men regime. Elena understands this; before she had got to know Mina, she had been just the same as them, or at least thought she was, and it had taken time for her to adjust too, and even longer for her to understand that she could help them.\nIt seemed strange sometimes for Elena to think of how she’d believed, back when she was in primary school, that she was even more perfect than the rest of her GEM classmates because her parents had chosen to create her from the genes of that long since dead actress Angelina, rather than using any of their own genes, and even stranger now for her to think that at the time, she’d thought it mattered. Sometimes Elena thought it was a good thing that she didn’t share any genes with these people who didn’t understand her and had made no attempt to even try; it had made it easier for her to pretend growing up that Clare, the nanny who had been the real mother figure in her life, was her actual mother. Other times, she’s wondered why her parents had thought it even mattered that she had this actress’s genes, why Elena’s having the perfect appearance had mattered more to them than her actually being a part of them. Sometimes, she’s wondered if she would have had a closer relationship with her parents if she had shared their genetic material.\nIt’s something she’s talked about with Sebastian sometimes; Sebastian did share genetic material with his parents, had still felt enough of a bond with his father to respond to the bogus summons that his father had sent via Mina’s uncle Matthew, yet in the light of his father’s actions, Sebastian has admitted that he’s sometimes wished that he didn’t share genes with his parents. All of them, Mina, Ginge, Angela and Cam, Daniel and Elena herself, have told Sebastian that they don’t hold him responsible for anything that happened with his father, that they see him as a totally different person, that it’s Sebastian’s choices, not his genes, that make him who he is. Sebastian’s coming to accept that, and Cam especially has been a help to him as he’s had the same struggle with his own father; as he and Ginge are helping with the rehabilitation of Margaret Murgatroyd’s army of clones into society, he’s imparting the same message to them. “Sometimes,” he’d said to Elena, “I even believe it.” He’d been partly joking, but Elena knew that there was some truth in it, that doubts still sometimes crept in even as Ginge and their other friends worked hard on convincing him.\nShe’s talked about it to some extent with Mina, too – Mina, whose mother had experimented on her genes in a different way, given her the abilities that had made her see herself as a freak for years. Elena had had it drummed into her for so many years that the likes of Mina and Angela were blemished, flawed, yet as she spent some time with Mina, she came to the conclusion that the more unique features of the so-called Blemished were actually more interesting than her own so much prized for being those of the actress. Anna Hart had intended for Mina to become the perfect weapon; it may have gone in a way that she had never imagined but Mina’s power had helped them win the fight against the Ministry, yet Elena knew a part of Mina was always going to struggle with the knowledge that her powers had ultimately killed her father. From what Elena understood, Mina had never quite got to the point of wishing not to be related to her mother, Anna’s sacrifice of her life for Mina’s at the end having gone some way towards Mina making her peace with her, but Mina was still able to understand where Elena was coming from.\nAs for the friends she’d had back in Area 14 before the GEM regime was overthrown…they’re trying to adjust to the new regime, although after everything that Elena’s been through, she feels like she has nothing in common with them any more. It makes her sad to think of all her shared history with Clarissa, how they’d only just reconciled after their big fight right before the Miss Area 14 contest and now Elena felt like she and Clarissa had moved apart again. Clarissa could never understand all the things Elena had seen during her time in London with the resistance, how Jake had shown her (just as she had been starting to understand from Mina) that there was a whole new world beyond the Ministry, beyond the world of Genetically Enhanced Men, of beauty contests and reality TV. To her old friends, all that stuff that feels so superficial to Elena now still matters. They still meet up; Elena doesn’t want to let go of all those years of friendship, she’ll still try and keep it going for as long as she can, but when they see each other, it’s awkward and they don’t have a lot to say to each other now. It’s easier for Elena to be around people like Mina and Sebastian, people who have experienced the war, people she finds it easier to relate to now.\nPerfection no longer matters in the new society forming under Mary’s rule; other values are what matter now, differences are prized and valued. It’s not “perfect”, but it’s as good as it’s ever likely to get, and that’s good enough for Elena."
    },
    {
        "title": "Come Unleashed, You're Set Free",
        "url": "https://archiveofourown.org/works/58877554",
        "fandoms": [
            "School Spirits (TV)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "11 Sep 2024",
        "language": "English",
        "words": "976",
        "chapters": "1/1",
        "comments": "1",
        "kudos": "14",
        "bookmarks": "1",
        "hits": "92",
        "post_title": "Rhonda's finding it so much harder being stuck in the shithole that is Split River High now that Dawn's crossed over and Maddie's got her body back.",
        "comment": "They’ve all talked about it enough times over the years, and as the longest serving member of the Split River High Afterlife Support Group, Rhonda’s sat through more of these discussions than any of them. After Maddie had finally managed to communicate to those friends of hers, Simon, Nicole, Xavier and Claire, that Janet had stolen her body, and they’d all set off on the road trip to bring her back, Maddie had started the conversation again, only this time with a difference.\nBefore, when they’d talked about the places they’d missed, where they would go if they got the chance to leave Split River High, it had always been a hypothetical conversation. Wally had reminisced about the tree he’d fallen out of at his grandparents’ place and broken his arm when he was about six years old, how he’d always given the tree dirty looks every time he saw it when he visited them since, but how he actually wouldn’t mind seeing it again now. Janet used to talk about how she’d like to see her home again; Charley had asked once wouldn’t she find it weird seeing it again with strangers living there, and she’d shut him down. There hadn’t been the opportunity for Rhonda to ask Janet whether she had tried going back to her old home while she was in Madison’s body, but Rhonda wondered now whether she had, and whether Charley had been right. As for Rhonda herself, there wasn’t anywhere in Split River that she particularly gave a shit about ever seeing again. Certainly not home, with a father who was never there, probably banging his secretary, and a mother who was more interested in having a clean and tidy show house than actually being there for Rhonda. But if she did get the chance to go somewhere that wasn’t the high school, she’d quite like to go to Berkeley, where she should have gone had she lived.\nThey could talk about getting to see Niagara Falls, or vacationing on the beach in Aruba, all they liked, but they knew they were never going to get the chance to go anywhere other than good old Split River High. And then suddenly there was Maddie, talking about how something as trivial as going to the grocery store was going to have so much more meaning for her now that she’d been trapped in the high school, and part of Rhonda was happy for her, but another part resented her for it, was struggling to stop herself from pointing out that she was telling this to a bunch of people who were never going to get that chance again and were still stuck in the same old high school.\nThey’d all developed their own coping mechanisms; while most of them had been there for so long now that they were okay with being in the same room where they originally died, Rhonda remembered Charley taking a while to be able to bring himself to go into the dining room, and she’d eventually caught on to the fact that Janet used to try and find out the dates of the fire drills ahead of time so she could get herself away from the rest of them and panic in peace (she also used to factor in the obligatory idiot senior setting off the alarm as a last day prank, but struggled with any other pranks, alarms set off by cigarettes, faults with the system causing an unexpected alarm). Rhonda herself had certainly avoided Manfredo’s room for a while until it was refurbished into separate classrooms.\nOf course, there was still the possibility that she could cross over, but Rhonda was starting to have doubts about that as well. Martin, that asshole, had been stringing her along with his bullshit about being able to help her cross over, when he’d been doing nothing of the kind, and Rhonda frankly doubted he even knew how to himself. After Dawn had crossed over, and the guys had started wondering whether looking back at their past was going to help them, rather than hinder as Martin always said, they had all been trying. So far, none of them had managed; Charley and Wally were still optimistic that they might get there, Rhonda less so. She wasn’t going to lie, there was a part of her that quite enjoyed the idea of them all crossing over, while that asshole Martin remained trapped in the high school where he’d tried to keep everyone else stuck with him so he wouldn’t be alone, giving them duff advice to achieve that. Possibly a more fitting punishment for him than going to the other place, which she’d also wondered about.\nOne time, she’d asked Wally whether he would have ever considered doing what Janet did, possessing someone else’s body so he’d have the opportunity to be with Maddie in the physical world. He’d immediately shut that down, saying Maddie had talked to him about how she felt about knowing that Janet had been possessing her body, and he knew that she wouldn’t want to be with him in that way. Rhonda had immediately backed off, saying it was a joke, and started talking to Charley about something else. It wasn’t something Rhonda actually intended to do, and she hadn’t had the full facts when she’d talked to Martin about him “doing for her what he did for Janet.” But while she wasn’t going to admit it to Wally, a part of her had wondered about the idea, about what it would be like to get the hell out of the school just once, even just for an hour.\nShe wouldn’t do it; Maddie’s path out of this shithole was in getting her body back, Rhonda’s would be crossing over. She didn’t know how, or when, but one day Rhonda would get there."
    },
    {
        "title": "Wish There Was Something I Could Do To Save You From What's Coming",
        "url": "https://archiveofourown.org/works/53158192",
        "fandoms": [
            "Dark (TV 2017)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "19 Jan 2024",
        "language": "English",
        "words": "1,059",
        "chapters": "1/1",
        "collections": "1",
        "comments": "2",
        "kudos": "27",
        "bookmarks": "4",
        "hits": "236",
        "post_title": "Michael's first encounter with his younger self.",
        "comment": "Hannah had noticed Michael was distracted, of course, yet how could he explain that it was coming up to the time of his own birth in the original timeline? Jonas had even made a comment about it when Martha had told him that the new baby her mother was expecting was due around that time, said something like wouldn’t it be funny if the new baby was born on Michael’s birthday. (He’d kept celebrating his original birthday when he first arrived in the 1980s; he’d wanted to hold onto at least one thing from his life before, and that had been the easiest thing to keep. He’d spent so long answering to a name that was not his own, not turning round when someone called out Michael because he still kept expecting to hear Mikkel, and living in a house that was not the one he still thought of as home, was celebrating his birthday on the correct day too much to ask?)\nHe could still remember a time in his past, in Jonas’s future, when Jonas had come over on Mikkel’s birthday with a little present for him. Magnus had asked Jonas how he even remembered Mikkel’s birthday, and Jonas had shrugged. “It’s the same day as my dad’s.” Young Mikkel, at the time, could have had no way of knowing the significance of that; he’d just thought it was cool that he shared a birthday with Jonas’s father, although he didn’t really know the guy. Hannah Kahnwald was over at their house quite a lot, but he didn’t usually go with her. Today, Michael understood why that was; it had been easier for him to avoid spending time with the Nielsens, knowing he could never truly be part of their family again, always worried about the possibility of letting slip something that hadn’t happened yet, or something that Michael Kahnwald shouldn’t have known about.\nMichael had known what Hannah was going to say as soon as she’d walked in, gesturing at him with her phone: “Ulrich just texted, Katharina’s had the baby. It’s a boy, and they’re going to call him Mikkel.” Jonas had cheered, said something about how he’d told Martha it was going to be today. As Jonas started asking when they could go over and see the baby, and Hannah was trying to explain that Ulrich and Katharina probably weren’t ready for visitors that day but as soon as they were, they’d call her and she’d take him over, Michael felt like he’d been punched in the stomach. He’d known for ages that this day was coming, but until now he’d put off dealing with thinking about the day when his two timelines were going to collide.\nHe'd thought about making an excuse when Ulrich and Katharina called inviting the Kahnwalds over to meet the new baby, but had quickly realised he couldn’t – even if he’d come up with a convincing story for Hannah and cried off on that specific day, they were going to keep asking, and Winden was a small town, Hannah was friends with the Nielsens, Jonas was friends with Magnus and Martha, they had mutual friends. One way or the other, Michael was going to meet Mikkel.\nHannah could sense something wasn’t right, kept asking Michael if he was okay as they made their way over, Jonas clutching the teddy bear they had bought (Michael remembered that teddy, still had it in his cupboard in 2019, he just hadn’t remembered before now who’d given him that one as he’d had so many toys at the time). A part of him was tempted when she said that if he wasn’t feeling well, maybe he should go back home, but he knew he shouldn’t take up the offer; he had to get this over with one way or the other.\nUlrich greeted them at the door, ushered them in to where Katharina, looking tired, was holding baby Mikkel; Martha took the teddy bear from Jonas while Magnus made a comment about how he wished they’d take the baby away with them because his crying had been keeping him awake. As Ulrich launched into a story about how his car had a flat battery and Peter Doppler had to give him a jump start before he could actually get Katharina to the hospital, Michael thought about how he had heard all these stories so many times before, never knowing that one day he would be witnessing all of this himself. For one moment he wondered if there was anything he could do to change things, to warn Ulrich and Katharina of what was about to happen in 2019, to keep the family together, but he knew that he wouldn’t be believed, that if he said anything he’d most likely just end up on the same ward where Ulrich would spend the last thirty years of his life. Michael had thought so much about that over the years, the time Ulrich had come back for him and they had been so close to getting back to their own time before they were captured, Michael returned to Ines, Ulrich to the ward, and wondered whether he could have done anything differently then, too, so that they would have been able to escape.\n“Would you like to hold him?” Katharina asked. Michael took a step back, flinching; Hannah saw this but misinterpreted, told them how it had taken Michael a few weeks before he’d dared to hold Jonas without worrying he was going to drop him. How could Michael explain that he didn’t know what would happen if he was to hold his younger self? While he thought most likely nothing would happen, that he would just hold himself for a few minutes and then pass himself back to Katharina or Ulrich, he couldn’t help but remember something from some comic book where some character’s encounter with their younger self had caused some kind of implosion.\nKatharina was looking at him oddly; realising there was nothing else for it, Michael reached out and took the baby from her. As he looked down at his sleeping younger self for the first time, nothing happened, baby Mikkel slept on, and Michael felt momentarily foolish for having expected anything else. He’d got this hurdle out of the way, but Michael knew that a new struggle was only just beginning."
    },
    {
        "title": "Please Don't Bother Trying To Find Her, She's Not There",
        "url": "https://archiveofourown.org/works/58876756",
        "fandoms": [
            "School Spirits (TV)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "11 Sep 2024",
        "language": "English",
        "words": "1,178",
        "chapters": "1/1",
        "collections": "1",
        "kudos": "17",
        "hits": "122",
        "post_title": "Simon thinks he's banished the figment of his imagination that was the Maddie ghost, then comes to realise that it makes no sense that he would only see said figment of his imagination at school,",
        "comment": "As Simon walked away from Maddie, or at least what he had thought was Maddie before he’d come to the conclusion that for the last few weeks he’d been talking to something created by his imagination, he thought that in confronting her, in facing up to it, that would be the end of it. The video Nicole had sent him was clear enough; Maddie was alive, she was heading out of town without even bothering to tell him, her supposed best friend. He’d been creating a version of Maddie in his mind, talking to her, even trying to solve her supposed murder, and Maddie had made the choice to cut him out of her life with no explanation.\nHe went home and called Nicole; they talked for a while about what that video of Maddie in Xavier’s truck might mean, and speculated on why Maddie might have taken off like that but weren’t able to come up with anything that made sense to them both. He called Claire to ask if there was any update on Xavier; Claire said that he wasn’t awake yet and his asshole father had sent her away from the hospital, but she was going to go back the next day and would contact him if she heard any more.\nMaddie didn’t appear to him. Simon didn’t think anything of that; he thought he’d put an end to the matter when he finally told that figment of his imagination goodbye, and he wasn’t going to see her again. (Except maybe in the back of a police van, if anyone did successfully track her down; Simon was annoyed with himself that he still cared.)\nHe headed into school the next day, took his seat in Anderson’s classroom and waited for the sub to arrive, then blinked in surprise at the sight of Maddie sat in her old chair.\n“You’re not here!” he snapped.\nClaire’s friend Ava gave him a weird look; Nicole walked in and took the seat next to him, asking what he just said.\n“Ah, it’s not here,” Simon improvised. “My notebook. It’s on my bedroom floor.” Nicole seemed to buy that; Simon was determined to keep his focus on the lesson, ignoring Maddie sat at her desk, reaching out to him. When the class ended, he made sure he was first out of the door, ignoring the sound of Maddie’s voice calling out to him, made his way to his next class without waiting for Nicole. Maddie wasn’t there in his next class; Simon flashed back to a conversation they’d had before about how he could only see Maddie in a room where someone had died, and figured that no one must have ever died in this classroom.\nStop being such an idiot,\nSimon told himself.\nThis isn’t real.\nHe got through the rest of the school day, ditching lunch in the cafeteria so he wouldn’t have another sighting of Maddie, headed home, took a call from Claire saying Xavier had woken up, but was still very groggy and it might be better to wait until the next day to stop by.\nMaddie didn’t appear; Simon knew she wouldn’t, because she wasn’t real.\nThe weekend passed; Simon went round to Nicole’s, Sunday they visited Xavier in hospital, where he was less groggy now but said he couldn’t remember much about the accident and hadn’t got a look at the driver of the truck. Simon and Nicole didn’t show him the video; Claire had asked them to leave it for a bit, give Xavier a bit more time to recover before having that conversation with him. Simon was okay with that; he still wasn’t sure if he should show it to anyone. He might have considered the police if he’d had any confidence in how it would be handled; unfortunately, the sheriff was Xavier’s father, who was an ass.\nMaddie didn’t appear at the hospital. Why would she? She wasn’t real.\nSimon headed into school on Monday morning, confident that after a couple of days with no Maddie manifestations, he’d finally closed the door on it…until he got as far as the football field for his first period gym class, only to see Maddie sitting on the bleachers.\nYou’re not here,\nhe told himself as he tried to focus on class, looking anywhere but where Maddie was, trying to ignore her shouts.\n“Janet Hamilton!” Maddie was yelling. “Look it up. Fire in the labs, 1958. That’s who was driving the truck. That’s who’s stolen my body.”\nHe wanted to dismiss it, yet at the same time, he was no longer sure; why would a figment of his imagination conjured up to help deal with his grief be shouting at him about someone he’d never heard of? Wally Clark, sure; Simon could have come up with that name, since there was a stadium in the grounds named after that guy and Simon had seen it at every gym class since freshman year. And he thought he remembered some older kid, a friend of his cousin, telling him the legend of the girl who got murdered by her guidance counsellor; he didn’t remember his cousin’s friend mentioning her name, but it wasn’t impossible he’d said it was Rhonda. But Janet Hamilton, a fire in 1958, that meant nothing to him.\nThere wasn’t going to be anything, Simon thought as he typed into Google. Just some stories about genealogy records, an amateur production of Hamilton starring Janet whoever, stupid shit that wasn’t going to mean anything to him. But when Simon looked at the search results, the first hit that came up was a fire in the science lab at Split River High in 1958, claiming the lives of teacher Everett Martin (another name Maddie had mentioned to him before) and a pupil named Janet Hamilton. If the Maddie Simon had been seeing really was a figment of his imagination, how could she have given Simon this name and story that he’d had no reason to know about, and then have the story turn out to be true?\nThat wasn’t the only thing that had turned out to be true that Simon couldn’t otherwise have known; he’d have had no way of knowing about Anderson’s fraud with the old band uniforms without Maddie, or that the number Anderson had called belonged to Claire (who Simon wasn’t even really friends with at that point and didn’t even have her number). And if she was really a construct of his imagination, why did she never appear when he was at home, or in town, or anywhere other than the high school? So, much as it sounded impossible, Simon had to admit to himself that Maddie must have been real, that she was telling the truth and that was this Janet character on that video driving the truck.\nFirst thing he was going to do when he got to school was find Maddie, and then start brainstorming about how he would track down this Janet. He’d make it up to her; he’d help her get her body back."
    },
    {
        "title": "Begin Again",
        "url": "https://archiveofourown.org/works/55567006",
        "fandoms": [
            "Yellowjackets (TV)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "F/M",
        "status": "Complete Work",
        "published": "29 Apr 2024",
        "language": "English",
        "words": "1,281",
        "chapters": "1/1",
        "comments": "1",
        "kudos": "5",
        "hits": "106",
        "post_title": "It's Shauna and Jeff's first official date post-rescue, but Shauna's still haunted by the spectre of Jackie and her own relationship with Jeff and ends up losing her temper in the restaurant.",
        "comment": "As Shauna got ready for her first official date with Jeff post-rescue, she found herself flashing back to the night back in freshman year, helping Jackie get ready for her own first date with Jeff. Jackie had been so excited, had tried on about six different outfits before settling on the one she eventually wore, had started babbling on about the possibility of double dating with Shauna and Randy in the future despite the fact that Shauna thought Randy was a major idiot (which Jackie knew full well). If Shauna ever went on a date with anyone, Jackie was always right there, suggesting to Shauna something that she would have worn herself, rather than what Shauna actually felt comfortable in; for a moment Shauna imagined she could hear Jackie’s voice, steering her towards a particular outfit that would have looked much better on her than on Shauna, then shut her ears to it, reaching for the outfit of her own choice. Jackie wasn’t here; Jackie didn’t get to dictate Shauna’s choices any more.\nBack in middle school, and at the start of freshman year, Jackie had had a crush on a different guy every week, getting over them as quickly as they’d started, and as Shauna had walked home from Jackie’s before Jeff arrived, she hadn’t really thought that this time would be any different. A couple of dates maybe, and then Jackie would be talking about someone else. But instead, they’d carried on dating, become the couple that everyone would have expected to become prom king and queen, if Jackie had lived to make it to prom.\nSometimes, there had been times when Jeff had picked Jackie up from Shauna’s for their dates instead of her own place; Shauna wondered whether, as he walked up her drive to collect her tonight, he’d be thinking of those days, if he’d have that moment of expecting Jackie to be the one to open the door and she’d then see the flash of disappointment in his eyes when he realised Shauna and not Jackie was waiting at the door. She’d admitted as much to Taissa and Van the day before; Taissa had said that she shouldn’t think like that, that Jeff had chosen to date her because he wanted to date her. As Shauna opened the door to Jeff, she saw the look on his face as he took her in, knew that she’d made the right choice of outfit, and thought maybe the night was going to be okay.\n“He took me somewhere fancier,” Jackie’s voice whispered in Shauna’s ear as they walked into the Italian restaurant. “Do you remember? He took me to that very expensive French place.”\nYes, Shauna did remember, and yes, it had been one of the factors in why Shauna had chosen the Italian instead, because it was somewhere that held no associations with Jeff’s relationship with Jackie. But as they walked in, as people turned round to stare at them as if to ask what she was doing there with her best friend’s former boyfriend (there had been enough news coverage at the time, including interviews with Jeff that he said were just made up because his father had told the press where to go and they never really spoke to him, that everyone pretty much knew Jeff as Jackie’s boyfriend at that point), Shauna found herself thinking that maybe it would have been a better idea to have gone somewhere outside of Wiskayok, somewhere that people wouldn’t know them.\n“Want me to say something?” Jeff asked as he saw some couple staring at them taking their seats; Shauna shook her head. “Let’s just leave it, they’re not worth it.” In her mind’s eye, she saw Jackie grinning at the couple, saying “Take a picture, it’ll last longer.”\nShe’d imagined this so many times, what she would say to Jeff when she saw him again, how she’d explain to him about Jackie, where she would even start the whole conversation about the baby (that still hadn’t happened; she’d thought she was going to bring that up when she first got home, but their first meeting had been awkward enough that she didn’t think it was the moment.) It was stupid, they’d never had any trouble thinking of things to say to each other before, why was Shauna finding it so hard now? She should just bite the bullet and blurt out something, nothing either of them could say could be that bad, right?\n“So, I met up with Jackie’s family yesterday,” Jeff began.\nOkay, maybe Shauna was wrong.\n“I didn’t tell them we were coming here tonight,” Jeff continued, and Shauna thought that was probably the best thing; she wasn’t ready for that conversation with Jackie’s family, especially if this ended up being their first and last date, so she just mumbled something about how it had been a while since she’d talked to them and should really make the effort.\n“They miss you, Shipman,” Jackie’s voice sounded in her ear again. “Remember when you were round there practically every day?”\nIt was a relief when the waiter came to take their order, Shauna quickly ordered her pasta, then started asking Jeff about the furniture store he was working at. Jeff started telling her a story about a particularly difficult guy he’d had to deal with the day before, and as Shauna laughed at the story, she started thinking that maybe she’d been worrying about nothing, that the night was going to go well after all.\nUntil their orders arrived. And it wasn’t what Shauna had ordered. In a twist of fate, the chicken dish they’d brought over was exactly what Jackie would have ordered.\nThe waiter was very apologetic, said the order was for another table and he hadn’t realised the mistake because one of those diners had given the same order as Jeff, and Shauna didn’t want to make a big deal of it; he couldn’t have known that he’d just served her Jackie’s favourite. But Shauna found herself getting angry at him, demanding another pasta free of charge.\n“Shauna, I think that really was an accident,” Jeff began, but Shauna snapped “Jackie’s favourite food, the kind of date you’d go on with Jackie, everyone’s staring at us wondering what you’re doing with me instead of Jackie. Maybe this whole thing was a big mistake.”\nThey ate their meal in silence, paid up and left; Shauna could tell that Jeff wasn’t really sure what to say next. She started thinking about the time they’d spent together before; while “bunk ups on the back seat of Jeff’s car after Jackie had been dropped off at home” wasn’t exactly an ideal date, it was all they had known before, and she did want something different from that.\n“What I should really have done,” Shauna began, “is suggested that we do something just for us, whether that’s hanging out at your place watching crap television, or just getting the hell out of Wiskayok for the night. But not the same kind of dates you used to go on with Jackie. Something spontaneous.”\n“That works for me,” Jeff seemed relieved that Shauna had calmed down and wasn’t yelling any more. “Next week, we can try something again. I’ll surprise you. But it won’t be a formal date like this one.”\nAs they got into Jeff’s car, Shauna thought about the awkward conversations she still had to have with Jeff, but knew tonight wasn’t the night to bring those subjects up. She should have known better after everything that happened with Jackie; the night would have gone so much better had she just been honest with herself and Jeff."
    },
    {
        "title": "Do They Know It's Christmas Time At All?",
        "url": "https://archiveofourown.org/works/60423088",
        "fandoms": [
            "From (TV 2022)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "09 Nov 2024",
        "language": "English",
        "words": "1,545",
        "chapters": "1/1",
        "collections": "1",
        "kudos": "8",
        "hits": "77",
        "post_title": "Ethan's the only one to remember it's Christmas.",
        "comment": "Ethan was beginning to wonder if he was the only person who had realised it was nearly Christmas.\nMaybe it wasn’t. Maybe it was like Narnia here, where it was always winter and never Christmas. But that couldn’t be right; Victor had told him once that it was weird when the leaves started falling from the trees because they didn’t usually do that. For Ethan, it was weirder that it had never happened before here; it happened every year in the outside world, everyone knew that.\n“Do you think Mom and Dad remember it’s nearly Christmas?” he asked Julie at one point.\nJulie rolled her eyes. “Mom and Dad are so busy arguing right now that I’m not sure they remember we even exist. Why do you think Kenny moved out? I’m surprised no one’s heard them in the outside world and sent a search party to find us.”\nThat was true. But still, even if his parents hadn’t remembered, maybe someone else did; Donna might remember, or Kenny, or Boyd. Maybe not Victor; he hadn’t even marked his own birthday for years until Henry arrived in town and wanted to mark it with him. But someone had to have remembered. Ethan wondered how they celebrated it here. Did they do something in the diner, or in Colony House, or did everyone just celebrate it with their own families?\n“What is there to even celebrate anyway?” Julie asked when Ethan put this question to her. “We’re stuck in this shithole, no friends, no grandparents, and you’re sure not going to get a visit from Santa here.” Actually, Ethan had caught on about Santa the previous year because he realised Santa used the same wrapping paper as his parents, but that wasn’t the point. After everything that had happened, the town needed to do something to celebrate Christmas, to have just that one happy day.\nTurned out, it wasn’t only his family who hadn’t known it was Christmas. Bakta had arranged a grand reopening of the diner which most people were at, and Ethan thought that would be a good opportunity to ask how those who had been in the town for a Christmas before now usually celebrated.\n“Christmas?” Kenny had said. “Huh. I hadn’t even noticed.”\n“I couldn’t face it last year,” Kristi replied. “That was my first one here, without Mari.”\n“Who even gives a shit?” Randall snorted.\n“But it’s Christmas!” Ethan exclaimed. “Christmas is important. We have to do something. Boyd, Donna, you’ve been here the longest. What do you usually do?”\n“I’m sorry, Christmas is important?” Boyd rounded on Ethan. “We just lost four people in this last week. I’ve been trying to keep everyone alive, working together, instead I’ve got people not letting me do that, turning on each other, trying to do their own thing. And I’m trying to hold my family together. I’ve been trying to find a way of getting us all home, and finally I thought there was some hope of that, but we’re still just as trapped here with those things. And Christmas is important?”\n“Hey, back up there,” Jim interrupted, taking a step right up close towards Boyd’s face. “Who the hell said you could talk to my kid like that?”\n“Okay, maybe we should all just take a few seconds to calm down here,” Kenny said as he hurriedly stepped between the two, Jade coming to his aid to hold Jim back. But Ethan saw none of this, because he had already turned to run out of the door.\n“I was a bit harsh on him there, wasn’t I?” Boyd asked.\n“We all know what you’ve done for us, and we’re all grateful,” Kenny began, “but none of what’s happened was Ethan’s fault. He maybe didn’t pick the best moment to bring it up, but he’s a kid. At Ethan’s age, Christmas is a big deal.”\n“You know, the reason I asked Kenny about reopening the diner in the first place was to try and boost all our morale,” Bakta pointed out, “and this sounds like the kind of thing I had in mind. I’m going to open this place to the whole town on Christmas Day. Donna, can I count on Colony House, want to give me a hand?”\n“When I was looking at the stuff in the basement and found the camera, I’m sure I saw a box of Christmas decorations,” Elgin put in. “I’ll go look again and if I find them, I’ll bring them over and decorate the place for you.”\n“Then I guess it’s settled,” Boyd replied. “We’re going to have a Christmas.”\nEthan didn’t know why Julie was so insistent on going over to the diner that morning. Usually, she wouldn’t even have been out of bed for at least another two hours. And he hadn’t a clue where either of their parents were; still, at least they hadn’t woken him up arguing again.\n“Why did you want to come here?” he asked.\n“You’ll see,” Julie replied as she pushed open the door.\n“Merry Christmas!”\nEthan glanced around to see what he thought must be everyone from the town; Kristi and Marielle, Henry and Victor, Elgin and Randall, and there was his mother.\n“You weren’t the only person who wanted a Christmas,” Henry explained, gesturing towards Victor. “I’ve missed so many Christmases with my son. I’m not going to miss out on the first chance we get to spend Christmas together in years.”\n“Does this look straight to you?” Elgin asked from the top of a stepladder, Randall holding it steady, as he fixed the corner of a Merry Christmas banner to the wall.\n“Yeah, you’re good,” Randall replied.\n“There, that’s the last one.” Elgin jumped down from the ladder. “Who knew that Colony House would hold this many Christmas decorations? Even if that banner does say Happy New Year 1979.”\n“Yeah, you could have left that one,” Randall laughed.\nKenny and Jade walked in, carrying big crates of the fresh vegetables towards the kitchen, where Bakta and Donna were preparing a delicious-smelling roast dinner. “Where do you want these?” Kenny asked.\n“Just over there,” Bakta gestured towards a worktop before fiddling with the oven controls.\n“You do realise it’ll be bread and water for the next month to make up for this, right, kid?” Donna said, but Ethan saw the smile at the corners of her mouth.\n“Here, let me give you a hand with that,” Jade had put his crate down where Bakta indicated, and stepped over to help Jim, who had just walked in through the door with a heavy box.\n“What’s in that?” Ethan asked.\n“Don’t even think about it,” Jim smiled. “This is from the bar.”\nAs Ethan took a seat next to his mother, Boyd broke away from his conversation with Ellis to approach him. “Hey, Ethan. I’m sorry I snapped at you before. You were right, we all needed this, and I should have listened to you instead of dismissing the idea.”\n“That’s okay,” Ethan replied. “It doesn’t matter.”\nAs Boyd turned to head back to Ellis, Ethan called out to him again. “Hey, Boyd?”\nBoyd turned back around.\n“Merry Christmas.”\n“Are you glad we did this now after all?” Kenny asked as he and Boyd sat down to their dinner with Jade, Ellis, Fatima, Kristi and Marielle.\nBoyd watched as Ethan chatted and laughed with Jim and Tabitha, as Julie started moving the chairs so Elgin and Randall could join their group, as Bakta and Donna finally took their seats among a big table from Colony House, as Victor saw Sara standing alone and called her over to join him and Henry at the table next to Ethan’s.\n“Yeah, I think this has done us all good,” he replied. “All this working together to give the kid as good a Christmas as we could, it was what we needed. It helped to give us all something else to focus on.”\nOh, fuck.\nBoyd suddenly remembered where he had heard those words before, spoken by the one person who wasn’t here.\n“I’ll be back in a minute. Kristi, Marielle, don’t let these guys help themselves to my pigs in blankets.” He ran out of the diner, made his way towards the ambulance where Acosta had been sleeping, unable to face any of the others after the welcome she had previously received.\n“Hey, Acosta. So, we all just put together a Christmas celebration, and I realised you were right in what you said before, about us all needing something to focus on. I shouldn’t have shut you down at the time. So come on, join us in the diner. There’s plenty of food.”\nAcosta looked awkward as she walked in the diner, but Bakta started preparing another plate of food, and Kenny immediately waved her over, said there was a spare seat next to him (where she sat with her back facing the big table from Colony House, who had been Nicki’s friends).\nAs Boyd looked around at all his friends, he wondered if this would become the new tradition for the town. Maybe it would continue next year; maybe they would have found their way back home by then. But either way, whatever happened, Christmas wouldn’t be just forgotten about again."
    }
]