[
    {
        "title": "an (unintentional) offer for a pillow",
        "url": "https://archiveofourown.org/works/53901880",
        "fandoms": [
            "The Lord of the Rings - J. R. R. Tolkien",
            "The Lord of the Rings - All Media Types",
            "The Lord of the Rings (Movies)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "18 Feb 2024",
        "language": "English",
        "words": "604",
        "chapters": "1/1",
        "comments": "10",
        "kudos": "165",
        "bookmarks": "15",
        "hits": "1,354",
        "post_title": "» Aragorn, caught in the delicate balance between sleep and wakefulness, mumbled incoherently, nuzzling into Legolas' shoulder. Legolas decided to play along, patting Aragorn's head with exaggerated sympathy. «\nOr\nAragorn falling asleep again while braiding Legolas' hair in the morning.",
        "comment": "In the first light of dawn, Aragorn stirred from his slumber to find himself nestled within the comforting embrace of their makeshift campsite. The crackling remnants of the previous night's fire were mere embers now, and the air was filled with the serene quietude that only early morning offered. As he opened his eyes, he realized that Legolas was already up and about.\nHe moved gracefully, like a wisp of morning mist, his nimble fingers attending to the various tasks needed to prepare for the day ahead. Aragorn, however, struggled to shake off the remnants of sleep that clung to him, his limbs heavy with the warmth of the blanket he'd yet to fully escape.\nNoticing Aragorn's awakening, Legolas glanced at him, a playful spark in his eyes. \"Good morn, sleepy ranger. You look as if you need a bit more time in the dream realm.\"\nAragorn stretched as he sat up, the stiffness of the night dissipating with each movement. \"Elves and their boundless energy in the early hours,\" he muttered with a smile.\nLegolas chuckled, \"Indeed. Now, care to lend me your skilled hands for a moment?\"\n\"What do you need?\" Aragorn asked, trying to rub the last vestiges of sleep from his eyes without much success.\n\"Would you braid my hair, Aragorn?\" Legolas asked with a sweeping gesture to his long, golden hair.\nAragorn, being well-acquainted with this routine, welcomed the familiar task. He nodded, settling behind Legolas. His expression softened as he reached for Legolas' hair, the familiar feeling of it comforting.\nHowever, it seemed the peaceful task had a rather unintended effect on Aragorn - the gentle lull of dawn coupled with Legolas' soothing presence made him feel inexplicably drowsy.\nStill, Aragorn ran his fingers through the silky strands of the elf's hair, deftly weaving them into his telltale braids. Yet, the repetitive motion, combined with the soft murmur of Legolas' voice recounting their plans for the awaiting day, was almost hypnotic.\nUnbeknownst to Legolas, who continued with his cheerful recitation of their plans, Aragorn's eyelids grew heavier with each pass of his fingers.\nAs Legolas noticed Aragorn's increasingly sluggish movements, he couldn't help but smile. Rather than waking up, Aragorn appeared to be drifting back into a light slumber.\nSoon enough, Aragorn's head began to dip, eventually resting on Legolas' shoulder. The braid, which had started as a meticulous creation, now took on a more haphazard pattern as Aragorn's focus wavered.\nLegolas chuckled, the sound resonating through the quiet morning. \"It seems my request for a braid has turned into an offer for a pillow,\" he teased, turning his head to place a gentle kiss on Aragorn's temple.\nAragorn, caught in the delicate balance between sleep and wakefulness, mumbled incoherently, nuzzling into Legolas' shoulder. Legolas decided to play along, patting Aragorn's head with exaggerated sympathy.\n\"There, there, my tired ranger,\" Legolas cooed playfully. \"Rest. I'll keep watch over your dreams for another while.\"\nAragorn's response was a muffled, contented sound and, with that, Legolas resumed the braiding, allowing Aragorn to rest against him.\nAs the sun ascended higher, casting its golden glow over the landscape, Aragorn eventually stirred from his impromptu nap. The hazy veil of sleep lifted, revealing a slightly disoriented but sheepishly grinning ranger. \"I suppose I should have had a bit more sleep during the night.\"\nLegolas laughed, melodic and warm, \"No harm done, my dear. Moreover, your choice of pillows is impeccable.\"\nWith laughter echoing through the early morning air and the gentle breeze carrying the promise of new adventures, they continued their journey - bound by love and the simple joy of sharing the dawn."
    },
    {
        "title": "of woodland instincts",
        "url": "https://archiveofourown.org/works/51540319",
        "fandoms": [
            "The Lord of the Rings - J. R. R. Tolkien",
            "The Lord of the Rings - All Media Types",
            "The Lord of the Rings (Movies)"
        ],
        "rating": "General Audiences",
        "warnings": "Choose Not To Use Archive Warnings, No Archive Warnings Apply",
        "relationships": "Gen, M/M",
        "status": "Complete Work",
        "published": "12 Nov 2023",
        "language": "English",
        "words": "636",
        "chapters": "1/1",
        "comments": "6",
        "kudos": "261",
        "bookmarks": "22",
        "hits": "2,843",
        "post_title": "Legolas leaned against a tree, his silver-blond hair catching the dappled sunlight as he smiled at Aragorn. The ranger returned the smile, a shared understanding passing between them. But as their hands reached for each other, a sudden noise shattered the tranquility.\nOr\nMerry and Pippin are a bit too curious for their own good.",
        "comment": "The air in the woods was filled with a serene quiet, a\nrare\nquiet, the gentle rustle of leaves overhead and the soft padding of their own footsteps the only sound. Aragorn and Legolas had stolen away from the prying eyes and constant chatter of the Fellowship for a moment, seeking a quiet glade where they could enjoy the solitude.\nLegolas leaned against a tree, his silver-blond hair catching the dappled sunlight as he smiled at Aragorn. The ranger returned the smile, a shared understanding passing between them. But as their hands reached for each other, a sudden noise shattered the tranquility.\nA branch snapped, the sound echoing through the peaceful glade. Legolas, reacting on pure instinct, spun around, drew his bow, and released an arrow in the direction of the noise. Often had his woodland instincts protected the fellowship from prying eyes, but it seemed that day his judgement was a tad off. The arrow embedded itself in a tree trunk with a thud,\nperilously\nclose to where two terrified hobbits were frozen in place.\nPippin's eyes were wide, his hand clamped over his heart and for a moment it looked like he would faint from shock. Merry, recovering more quickly for he was a few steps behind, steadied him, though both hobbits wore expressions of sheer terror. Legolas, realizing what had happened, swiftly lowered his bow, his face a mix of horror and apology.\n\"Oh, dear Valar!\" Legolas exclaimed, rushing towards the hobbits. \"I did not mean... I did not expect it to be you. Are you hurt?\"\nPippin, still pale as snow, shook his head. \"No, not hurt. Just scared out of my wits!\"\nMerry, trying to inject a bit of humor into the situation, added, \"Aye, Legolas, I think you took a few years off our lives with that shot.\"\nAragorn, who had been silent, now stepped forward, trying to suppress a chuckle. \"You two should know better than to sneak up on an elf, especially one as skilled as Legolas.\"\nLegolas, looking genuinely distressed, apologized profusely. \"I did not mean for this to happen. I thought... I thought it was an enemy.\"\nPippin, finally finding his voice, retorted, \"Well, next time maybe give a warning before you start shooting arrows!\"\n\"One would not warn an orc before sending an arrow through it's head,\" Aragorn replied, leaving Pippin momentarily dumbstruck.\nStill, Legolas continued to apologize and Aragorn couldn't help but find the situation amusing. He put a comforting hand on Legolas's shoulder. \"No harm done, meleth nîn (my love). Just a little too much woodland vigilance, that's all.\"\nAfter ensuring the hobbits were indeed unharmed, Legolas, still red-faced, led them back to the Fellowship. The two hobbits, though shaken, seemed more entertained than upset by the incident, sharing a few glances and chuckles among themselves.\nLater, as the Fellowship resumed its journey, Aragorn walked alongside Legolas, a playful glint in his eyes. \"Next time, my love, perhaps consider the Hobbit's curiosity and mischief before firing off arrows. We wouldn't want to lose our Hobbit friends to heart attacks.\"\nLegolas sighed, still embarrassed but managing a smile as he sought Aragorn's hand. \"I will keep that in mind, Estel. I did not intend for such chaos.\"\nAragorn squeezed Legolas's hand, reassuring him. \"As I said before, no harm done, and now we have a tale to tell. The time Legolas mistook hobbits for orcs. Maybe we can coax a laugh out of Frodo with that.\"\n\"I would hope so, it would be a delightful sight to see the ringbearer smile again,\" he replied.\nAs they set up camp that night, the Fellowship's laughter did indeed echo through the woods as Pippin animatedly retold the tale — a reminder that even in the midst of danger and adventure, there was room for joy and camaraderie."
    },
    {
        "title": "once upon a time",
        "url": "https://archiveofourown.org/works/58937896",
        "fandoms": [
            "The Silmarillion and other histories of Middle-Earth - J. R. R. Tolkien"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "14 Sep 2024",
        "language": "English",
        "words": "775",
        "chapters": "1/1",
        "kudos": "8",
        "bookmarks": "1",
        "hits": "53",
        "post_title": "» The night beyond the windows was cold and dark, but within their hut, a cocoon of warmth and affection enveloped them. The hearth crackled and popped, radiating a gentle heat that banished the chill from the room.\n\"Tell me a story,\" Túrin whispered, his voice soft like the rustling leaves in a gentle breeze. \"Please?\" «\nOr\nJust another night on the borders of Doriath spent telling stories.",
        "comment": "Under the soft glow of the hearth fire in their cozy hut on the borders of Doriath, Beleg and Túrin once more found solace and comfort in each other's presence, as they often did when the world did not demand their attention. The flames cast dancing shadows across the room, creating an ambiance of warmth and intimacy.\nTúrin sat cross-legged on the rug before the hearth, his back propped against a stack of cushions, his eyes fixed on the flickering flames. Beleg was sprawled out beside him, his head resting in Túrin's lap. His silvery hair, a stark contrast to the rich tones of the rug, flowed like a river of moonlight.\nTúrin's fingers idly traced patterns through Beleg's hair, combing through the silken strands. It was a soothing ritual, one that had become second nature to them. Beleg closed his eyes, a contented sigh escaping his lips as he relished in the sensation.\nThe night beyond the windows was cold and dark, but within their hut, a cocoon of warmth and affection enveloped them. The hearth crackled and popped, radiating a gentle heat that banished the chill from the room.\n\"Tell me a story,\" Túrin whispered, his voice soft like the rustling leaves in a gentle breeze. \"Please?\"\nBeleg's lips curved into a smile even though his eyes remained closed. \"Very well. What kind of story would you like to hear tonight, my love?\"\nTúrin's fingers continued their rhythmic dance through Beleg's hair as he contemplated. \"Tell me of a great adventure, one where heroes rise against insurmountable odds.\"\n\"So it shall be,\" Beleg began, his voice a soothing murmur. \"Once upon a time, in a land not so different from our own, there lived a valiant hero named… Túrin. He was known throughout the realm for his bravery and unyielding spirit, even though he was a bit stubborn and reckless.\"\nTúrin chuckled softly. \"Go on.\"\n\"Yet, even the bravest of heroes have their moments of doubt,\" Beleg continued. \"And so it was that Túrin found himself facing a formidable foe, a dragon of immense size and power.\"\nTúrin's fingers stilled in Beleg's hair, his eyes focused on the imaginary world his lover was weaving with his words. \"How did he defeat the dragon?\"\n\"Ah, patience. That is the heart of the tale,\" Beleg replied. \"Túrin knew that he could not conquer the dragon through strength alone. So, he embarked on a quest to find the dragon's secret weakness, a vulnerability that even the mightiest of beasts possessed.\"\nAs Beleg's storytelling continued, the room seemed to fade away, and Túrin found himself immersed in the adventure. He listened with rapt attention, his mind painting vivid images of the hero's journey, the dragon, and the ultimate triumph of good over evil.\nOutside, the wind whispered secrets to the trees, but within their hut, Beleg's voice was the only sound that mattered. The flames in the hearth danced to the rhythm of the story, casting ever-shifting shadows on the walls.\nAs Beleg's tale neared its conclusion, Túrin felt a profound sense of contentment wash over him. The world beyond their walls could be chaotic and unforgiving, but here, in their little haven, it wouldn’t reach them.\n\"And so,\" Beleg concluded, \"Túrin, armed with the knowledge of the dragon's weakness, faced the beast one final time. He waited for a fortunate moment to strike and, with a heart full of courage and determination, he struck true and thus brought an end to the reign of terror.\"\nTúrin smiled down at Beleg, his heart filled with admiration and love. \"Thank you for this story. Though I think it would do Túrin good if he had someone to rely on by his side, perhaps someone called Beleg?\"\nBeleg opened his eyes and gazed at Túrin with a tender expression, though worry was beginning to creep in. \"Then you might as well make this story a future prediction. We do not know if or when Morgoth will let his worms loose against us.\"\nLeaning down, Túrin captured Beleg's lips in a gentle kiss, a testament to the love that bound them together. Their lips met with a soft and lingering sweetness, like the taste of honey on a crisp autumn morning.\n\"Then we will meet those creatures head on and rise triumphant, just how the hero in your story did,\" Túrin whispered against his lover's lips.\nAs they pulled away, Túrin settled back against the cushions, his fingers resuming their gentle caresses through Beleg's hair. The fire continued to burn brightly, casting a warm and inviting glow over their sanctuary.\nFinally, another undisturbed evening that was theirs alone to enjoy."
    },
    {
        "title": "a few tricks up the sleeve",
        "url": "https://archiveofourown.org/works/54931663",
        "fandoms": [
            "The Silmarillion and other histories of Middle-Earth - J. R. R. Tolkien"
        ],
        "rating": "General Audiences",
        "warnings": "Choose Not To Use Archive Warnings, No Archive Warnings Apply",
        "relationships": "Gen, M/M",
        "status": "Complete Work",
        "published": "03 Apr 2024",
        "language": "English",
        "words": "809",
        "chapters": "1/1",
        "comments": "2",
        "kudos": "34",
        "bookmarks": "3",
        "hits": "373",
        "post_title": "» Annatar grinned, twirling the dagger between his fingers with practiced ease. “Did I frighten you?” he replied, his tone teasing. “I have to admit, I do have a few tricks up my sleeve,” he added, his tone casual as if they were discussing the weather. «\nOr\nA friendly spar to pass the time… right?",
        "comment": "The air in the practice yard of Eregion’s stronghold was crisp, carrying with it the faint scent of iron and the distant clang of metal from the nearby forges. Celebrimbor stood opposite Annatar, practice sword in hand, a curious expression on his face as he studied his companion.\n“Are you sure about this, Annatar? I wouldn’t wanna force you.” Celebrimbor asked, a hint of uncertainty in his voice. He had suggested the friendly spar on a whim, as a way to pass the time and perhaps even gauge Annatar’s proficiency with combat, considering his expertise in crafting weapons and armor.\nAnnatar, however, seemed unfazed by the prospect, a confident smirk playing at the corners of his lips. “Of course, Tyelpe,” he replied picking up a practice sword, his tone laced with amusement. “I’m always up for a challenge.”\nWith a nod, Celebrimbor took a step back, readying himself for the bout to come. He had sparred with many skilled warriors in his time, but there was something about facing off against Annatar that set his nerves on edge.\nAs they circled each other, their movements fluid and precise, Celebrimbor couldn’t shake the feeling of unease that prickled at the back of his mind. There was an intensity in Annatar’s gaze, a determination that belied his usual easygoing demeanor.\nThe clang of practice swords echoed through the empty yard as Celebrimbor and Annatar faced off against each other. Celebrimbor couldn’t help but marvel at Annatar’s grace and agility - he moved with a dancer’s finesse, his every movement calculated and deliberate, darting in and out of his reach as he sought to land a blow.\nCelebrimbor, on the other hand, relied more on his years of formal training and experience, parrying Annatar’s attacks with ease and countering with lightning-fast strikes of his own.\nSuddenly, Annatar lunged forward, his practice sword flashing in the sunlight as he aimed a swift strike at Celebrimbor’s side. Reacting on instinct, Celebrimbor deflected the blow with his own sword, the shrill clash of metal ringing out through the yard.\nThey continued to exchange blows, each trying to anticipate the next steps. Mingled with an inexplicable hint of panic, Celebrimbor felt a surge of admiration and respect for Annatar’s skill and prowess, despite a seeming lack of formal training.\nBut just as Celebrimbor began to let his guard down, thinking he had figured out Annatar’s approach to combat, the Maia's expression shifted, a mischievous glint dancing in his golden eyes. Without warning, he dropped his practice sword, reaching instead for a dagger concealed at his waist.\nCelebrimbor’s eyes widened in alarm as Annatar closed the distance between them, the dagger flashing in the sunlight as it arced toward him. Instinctively, he raised his own sword to block the attack, but Annatar’s movements were too quick, too precise.\nIn the blink of an eye, Celebrimbor found himself staring down the length of the dagger, its edge hovering dangerously close to his throat. He froze, his breath catching in his throat as he realized the gravity of the situation - if Annatar had desired it, he could have struck him down without hesitation.\nFor a moment, there was silence, broken only by the sound of their labored breathing. Then, to Celebrimbor’s surprise, Annatar let out a hearty laugh, the tension melting away as quickly as it had appeared.\n“Well, that was unexpected,” Celebrimbor managed to say, his voice shaky with adrenaline.\nAnnatar grinned, twirling the dagger between his fingers with practiced ease. “Did I frighten you?” he replied, his tone teasing. “I have to admit, I do have a few tricks up my sleeve,” he added, his tone casual as if they were discussing the weather.\nCelebrimbor couldn’t help but chuckle, shaking his head in disbelief. “I suppose I should have known better than to underestimate you,” he admitted.\nAnnatar’s grin widened, his eyes sparkling with mischief. “Don’t worry, Tyelpe dear,” he said, his voice low and conspiratorial. “I promise to only use my combat skills for your protection, should the need arise.”\nDespite the jest, Celebrimbor couldn’t shake the lingering sense of unease that lingered in the back of his mind. He now knew that Annatar was more than capable of defending himself – and others – should he wish to. But there was something about the ease with which he concealed and wielded the dagger that left him unsettled.\nPushing aside his concerns for the moment, Celebrimbor offered Annatar a wry smile. “I’ll hold you to that,” he said, his voice tinged with amusement.\nWith a nod of agreement, Annatar picked up and returned his practice sword to its sheath, the tension of the spar dissipating like the morning mist. As they made their way back to the forges, Celebrimbor couldn’t help but wonder what other surprises Annatar had up his sleeve – and whether he\ntruly\nwanted to find out."
    },
    {
        "title": "Warmth",
        "url": "https://archiveofourown.org/works/52077592",
        "fandoms": [
            "The Silmarillion and other histories of Middle-Earth - J. R. R. Tolkien"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen, M/M",
        "status": "Complete Work",
        "published": "06 Dec 2023",
        "language": "English",
        "words": "1,000",
        "chapters": "1/1",
        "comments": "2",
        "kudos": "23",
        "bookmarks": "2",
        "hits": "114",
        "post_title": "He leaned over Túrin, concern etched on his features. \"I will return soon. Mablung will keep you company in my absence. Rest and let his remedies do their work.\"\nTúrin nodded, but the prospect of Beleg leaving left an ache in his chest. \"Just come back to me,\" he murmured, his voice raspy and weak but still filled with a plea.\nBeleg's lips pressed softly against Túrin's forehead. \"I will. I promise.\"\nAs Beleg left, the hut seemed to lose some of its warmth.\nOr\nTúrin gets sick and Beleg cares for him, but duty is inevitable, so Mablung also takes part in caring for Túrin.",
        "comment": "The winds outside Beleg's hut whispered through the trees, carrying the promise of autumn on their gentle breath. Inside, the air was filled with the scent of herbs and a comforting warmth from the hearth. Túrin lay wrapped in blankets, a mere shadow of his usual vibrant self, weakened by a bout of sickness.\nBeleg had been by his side since the first signs of fever had appeared. His hands moved with practiced ease, wet cloths dabbing Túrin's forehead, and herbal infusions brewed to ease his discomfort. His healing methods involved delicate touch, soothing words, and a persistent determination to bring comfort - and it was a balm to Túrin, for soon he found solace in the warmth of the hut and the unwavering presence of the elf by his side.\nYet, duty called, and Beleg, reluctantly, had to answer. A patrol was unavoidable.\nHe leaned over Túrin, concern etched on his features. \"I will return soon. Mablung will keep you company in my absence. Rest and let his remedies do their work.\"\nTúrin nodded, but the prospect of Beleg leaving left an ache in his chest. \"Just come back to me,\" he murmured, his voice raspy and weak but still filled with a plea.\nBeleg's lips pressed softly against Túrin's forehead. \"I will. I promise.\"\nAs Beleg left, the hut seemed to lose some of its warmth.\nThen, Túrin, although on the mend, found himself alone with the flickering fire and a sense of longing for Beleg's presence, until sleep embraced him at last.\nThe next morning, as the light seeped through the window, Túrin heard the familiar creak of the door, and his heart lifted, expecting to see Beleg. However, it wasn't Beleg who entered but Mablung, steadfast friend and healer in his own right, just as Beleg had told him.\nHowever, his methods were starkly different from Beleg's gentle touch. Túrin knew that Mablung would insist on rest and that he might even make him drink potent herbal concoctions that would be bitter on Túrin's tongue. He didn‘t even want to imagine it.\nMablung came to him carrying a pouch filled with herbs and a thoughtful expression that spoke of efficiency rather than tenderness. His greeting was brief, \"How are you feeling, my friend?\"\n\"Better, I suppose,\" Túrin replied weakly. \"But where's Beleg? Isn't he back from patrol?\"\nMablung settled by the bedside, his eyes inspecting Túrin with a critical gaze. \"No, he's not back yet. I'm here to make sure you don't relapse in his absence, but he should have told you as much already.\"\nTúrin endured the change in care with a disgruntled expression, eyeing the vials of herbs with a mixture of suspicion and distaste. Mablung, immune to his patient's grievances, continued his work with stoic determination to nurse Túrin back to health.\nThe day wore on with Mablung's efficient care. He made sure Túrin drank the herbal concoctions and ate the broth he made, checking temperature and pulse with a measured precision that spoke of years of experience. Túrin, while appreciative of the care, couldn't help but long for the gentleness that Beleg would have brought.\nDays rolled on, and Túrin\ndid\nimprove under Mablung's care. His coughs lessened, his strength returned and color began to return to his cheeks. Yet, a subtle melancholy lingered in the air — the lack of Beleg's comforting presence was palpable.\nThen, as autumn leaves painted the forest in hues of gold and russet, Beleg returned. The door creaked open, and the air seemed to brighten as he stepped inside. Túrin, wrapped in blankets, looked up with a glimmer of hope.\n\"I'm back,\" Beleg announced, his eyes immediately finding Túrin's figure lying on the bed with Mablung sitting on the floor in front of him in the dimly lit room.\nThe relief on Túrin's face was palpable. Mablung acknowledged Beleg with a nod and a smile as he rose from his vigil by the bedside. \"He's on the mend. Just needs rest.\"\nBeleg approached, a small smile etched on his features. He sat down on the bed, reaching out to brush a strand of hair from Túrin's forehead. \"How are you feeling?\"\nTúrin didn't even hear the question. The sheer joy of having Beleg back and near again was enough to make him forget everything else. So instead of answering, he shifted on the bed to wrap his arms around Beleg's waist and settle his head in the elf's lap.\n\"Easy there,\" Beleg chuckled, but he reached out to place a hand on the side of Túrin's head anyways. His touch was a balm that worked differently from Mablung's herbs - and felt so much better.\n\"I missed you,\" Túrin mumbled, his voice muffled against the fabric of Beleg's tunic. Nestled in Beleg's arms once more, he felt the pieces of himself aligning, merging into a singular sense of well-being.\nThe elf's fingers traced the curve of Túrin's cheek, and he pressed a soft kiss to his forehead. \"I missed you too,\" Beleg whispered back.\nTúrin, finally comforted by Beleg's return, leaned into the touch. \"Mablung's methods are effective, but I prefer yours.\"\nA dramatic cough erupted from behind them, where Mablung stood, feigning offence.\n\"Don't act like I've been torturing you these past few days when you're actually feeling better now,\" Mablung scoffed, crossing his arms in front of his chest.\nBeleg chuckled as he turned to him, the sound a melody that resonated with familiarity and love. \"I thank you for undergoing the labour of caring for Túrin, my friend. Though I shall take over again from here. You may return to your own hut or share a meal here with us.\"\nAt those words a smile spread on Mablung‘s face and he settled on a rug once more, beginning to cook a simple stew.\nBeleg sat beside Túrin still, a hand gently carding through his hair, a silent affirmation that he was back, and the hut, once again, was filled with the warmth of their shared presence."
    },
    {
        "title": "Contentment",
        "url": "https://archiveofourown.org/works/59355061",
        "fandoms": [
            "The Silmarillion and other histories of Middle-Earth - J. R. R. Tolkien"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "01 Oct 2024",
        "language": "English",
        "words": "1,102",
        "chapters": "1/1",
        "comments": "2",
        "kudos": "53",
        "bookmarks": "7",
        "hits": "569",
        "post_title": "» Here, in Eregion, mornings were far kinder than they had ever been before. There were no harsh commands from a mad Lord, no looming shadows or endless hours of grueling labor. No oppressive darkness, and the silence was neither filled with dread nor foreboding.\nHere, the mornings were filled with light, warmth, and the soft rustling of leaves outside their window. Here, there was Celebrimbor - gentle, patient, and steadfast. The thought alone made Annatar sigh contentedly as he felt Celebrimbor shift beside him. «\nOr\nMorning fluff",
        "comment": "The morning sun filtered softly through the windows of their shared chambers, casting a gentle golden glow over the room. The air was warm, the bedding luxurious, and Annatar was nestled comfortably beneath it, wrapped in the arms of his husband. He could feel Celebrimbor stirring beside him, and as much as he wanted to remain in the pleasant half-dream that held him, the warmth of the waking world was tugging at him, insisting he acknowledge the day.\nHere, in Eregion, mornings were far kinder than they had ever been before. There were no harsh commands from a mad Lord, no looming shadows or endless hours of grueling labor. No oppressive darkness, and the silence was neither filled with dread nor foreboding.\nHere, the mornings were filled with light, warmth, and the soft rustling of leaves outside their window. Here, there was Celebrimbor - gentle, patient, and steadfast. The thought alone made Annatar sigh contentedly as he felt Celebrimbor shift beside him.\nA gentle pressure against his cheek made him stir at last, his lips curving into a small smile even before he opened his eyes. Another kiss, then another, soft as the touch of a breeze. Annatar remained still, letting the sensation wash over him.\nHe let out a quiet hum of pleasure as another kiss landed, this time on his cheek, and another, traveling down toward his jaw. It was a ritual Celebrimbor often indulged in when he thought Annatar was still asleep, lavishing him with affection as if he couldn’t help himself.\nIt was a far cry from the mornings Mairon had known, and the contrast only deepened the sense of comfort Annatar felt. In Angband, mornings had been cruel. Cold reminders of the endless demands of his lord, the relentless pursuit of power, and the ever-present danger of what failure might bring.\nAnnatar allowed himself a moment to simply breathe, to take in the peace of this morning. In Angband, there had been no such luxuries - no soft beds, no quiet mornings with a lover beside him. Morgoth had demanded obedience, demanded perfection, and Mairon had given it, if only to survive. He had crafted, schemed, and built empires - only for it all crumble in the end.\nBut Celebrimbor didn’t need to know any of that. He didn’t need to know the depths of Annatar’s past, or the darkness that lingered in his heart. He only needed to know that Annatar was here, in this moment, thoroughly enjoying every bit of attention he lavished upon him.\nAnnatar shifted slightly, cracking his eyes open to catch a glimpse of his husband’s face - so full of affection, so content in this peaceful moment. It was an image he wanted to savor. He let his eye close again, burying himself deeper into the blankets and into Celebrimbor's embrace.\n\"Are you still asleep, or are you simply enjoying being spoiled?\" Celebrimbor's voice was soft, teasing, as yet another kiss brushed against Annatar's skin, this time at the corner of his mouth.\nAnnatar let out a low chuckle, still not fully opening his eyes. \"Do I need to choose?\" he murmured, his voice a little rough with sleep, but undeniably pleased.\nCelebrimbor laughed quietly, his hand moving to stroke Annatar’s hair in slow, gentle motions. \"You’re spoiled enough as it is,\" he said affectionately. \"But I suppose I’m to blame for that.\"\n\"You are,\" Annatar agreed, his lips curling into a smirk even as he kept his eyes closed. \"But I won't complain. Mornings like these are infinitely preferable to what I once knew.\"\nThere was a pause, and Annatar regretted letting the comment slip. Celebrimbor's hand stilled in his hair, and Annatar could feel the slight tension that came with his husband's curiosity. But Annatar was quick, and before Celebrimbor could ask any questions, he tilted his head slightly, nuzzling into his touch.\n\"All you need to know, love,\" Annatar murmured, his voice low and tender, \"is that I thoroughly enjoy waking up like this. With you.\"\nThe tension melted away almost instantly, and Celebrimbor’s hand resumed its gentle caress through Annatar's dark hair. \"As you should,\" he replied, leaning down to press another kiss to his forehead. \"One day, you’ll tell me what that comment meant.\"\n\"Perhaps,\" Annatar conceded, his smirk softening into a genuine smile as he allowed himself to relax fully again. \"But not today. Today, I think I deserve a little more indulgence, don’t you too?\"\nCelebrimbor sighed, but it was full of fondness. \"You’re incorrigible,\" he muttered, though his tone was nothing but affectionate.\nAnnatar hummed in agreement, shifting slightly to curl closer to Celebrimbor, feeling the warmth of his body against his own. He lifted a hand to trace the curve of Celebrimbor’s jaw, his touch as soft as the kisses he had received earlier.\n\"Do you ever tire of this?\" Annatar asked, his voice a quiet murmur. \"Waking up just to indulge me?\"\nCelebrimbor smiled, shaking his head. \"Never,\" he said, without hesitation. \"I think I enjoy it as much as you do.\"\nAnnatar let out a soft hum of amusement, his fingers threading through Celebrimbor’s dark hair. \"I am a very lucky Maia,\" he said, his tone light but sincere. \"To have such a devoted husband.\"\nCelebrimbor’s smile softened, and he leaned in to kiss him again, this time on the lips, slow and gentle. \"And I, a very lucky elf.\"\nFor a moment, Annatar’s heart twisted, a fleeting reminder of the lie that lingered beneath his skin - the lie he had crafted so carefully, the persona he had built to make Celebrimbor trust him. He pushed it aside, buried it deep. There was no need to think of such things now.\nHe kissed Celebrimbor back, his hand slipping to rest at the small of his back. \"Then we might both be fortunate,\" Annatar whispered against his lips.\nThey stayed like that for a while longer, wrapped in the warmth of each other, the world outside forgotten. Annatar’s past was a distant memory, a shadow that hovered at the edges of his mind but did not touch the present. Here, in this bed, in Celebrimbor’s arms, he could pretend that this was all there was - that this peace, this love, was everything.\nHe knew it wouldn’t last forever. One day, his plans would come to fruition, and the peace would shatter. But for now, in the morning light, with the elf he had come to love so deeply, Annatar allowed himself the luxury of forgetting what the future held - the luxury of feeling something he hadn’t allowed himself to feel in a long time.\nContentment."
    },
    {
        "title": "Enough of the slow tunes",
        "url": "https://archiveofourown.org/works/51383818",
        "fandoms": [
            "The Lord of the Rings - J. R. R. Tolkien",
            "The Lord of the Rings - All Media Types",
            "The Lord of the Rings (Movies)"
        ],
        "rating": "General Audiences",
        "warnings": "Choose Not To Use Archive Warnings, No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "05 Nov 2023",
        "language": "English",
        "words": "1,225",
        "chapters": "1/1",
        "comments": "4",
        "kudos": "223",
        "bookmarks": "14",
        "hits": "2,306",
        "post_title": "With a swift movement of his hand, he gestured to the musicians, his voice rising above the soft melodies.\n\"Enough of the slow tunes,\" Legolas announced with a laugh that danced through the air like the whisper of leaves. \"Let us have a taste of Mirkwood's spirit!\"\nOr\nLegolas plans to engage Aragorn in a dance, while Thranduil and Elrond observe them from a distance.",
        "comment": "A grand celebration in Mirkwood was always an event of unparalleled elegance. Elves from different realms had gathered to share in the joy of the occasion, and the air was alive with an undercurrent of excitement. The music that filled the hall was soft and ethereal, much to the tastes of the Rivendell elves, the notes weaving a tapestry of tranquility and grace. Many swayed to the slow melodies, their movements fluid and harmonious.\nFrom a vantage point away from the heart of the celebration, Thranduil and Elrond watched the scene. The two elven lords stood side by side, wine glass in hand, their expressions laced with amusement.\nAmong the gathering, Legolas, prince of Mirkwood, stood at the center of the festivities. His eyes were bright, his silver-blond hair shimmering in the soft light. Despite the tranquil atmosphere, there was an undeniable energy within him, a spark that seemed ready to burst into flame any moment.\nAs the music flowed like a gentle river, Legolas' eyes met Aragorn's across the hall, and an impish grin curved his lips. It was a look that spoke of mischief, of a hidden plan that only he was privy to. With a swift movement of his hand, he gestured to the musicians, his voice rising above the soft melodies.\n\"Enough of the slow tunes,\" he announced with a laugh that danced through the air like the whisper of leaves. \"Let us have a taste of Mirkwood's spirit!\"\nThe musicians, caught off guard by Legolas' request, exchanged glances, before looking to their king. When Thranduil made no move to deny his son's request, they couldn't refuse the prince's command. The soft melodies transitioned into a lively tune, the rhythm quickening and the notes becoming more spirited.\nThe change in tempo was like a burst of fresh air, and the spark caught fire. Legolas began to move, his body swaying to the rhythm with a fluid grace that held the entire hall captive. His feet moved effortlessly, each step a dance in itself.\nIn the distance, Thranduil and Elrond could be seen smiling as they refilled their glasses.\nAragorn stood on the sidelines, though slowly came closer, his eyes fixed on Legolas. The prince's transformation was mesmerizing. He had always known Legolas to be a creature of the forest, untamed, but he was known to be reserved at official gatherings. But somehow, here, in the heart of the celebration, Legolas came alive just as he usually did among the trees, his spirit shining as brightly as the stars above.\nAs the music wove its spell, Legolas spun and twirled, his laughter ringing like silver bells. And then, in a move that Aragorn couldn't have predicted, Legolas turned and extended his hand towards him. The invitation was clear, an unspoken challenge in his eyes.\nFor a moment, Aragorn hesitated, his heart racing in his chest. He was not an elf and far removed from their natural grace, moreover the intricate dances of Mirkwood's realm were foreign to him.\nBut then he remembered the countless adventures he and Legolas had faced together, the battles fought side by side, and the moments of quiet understanding they had shared.\nWith a determined smile, Aragorn stepped onto the dance floor, taking Legolas' hand. The moment their fingers touched, a surge of energy coursed through him, and his doubts vanished like mist before the morning sun.\nLegolas pulled him into the dance, and Aragorn surrendered to the rhythm. They moved together, their steps perfectly synchronized despite their differences. As they spun and swayed, laughter bubbled from Aragorn's lips just like it did from Legolas', and he felt a sense of liberation he had never known before.\nThe other elves watched in awe as they, the prince of Mirkwood and the mortal ranger, danced with an intensity and passion that matched every note of the music. The celebration had taken an unexpected turn, but the joy in the hall had only become more infectious.\nThranduil's eyes too were fixed on his son, who was dancing with an energy and joy that spoke of a spirit unburdened. There was a rare lightness to Legolas' movements, which brought a smile to the king's face.\n\"Look at him, Elrond,\" Thranduil remarked, his voice tinged with pride. \"He dances as if the very essence of Mirkwood courses through his veins.\"\nElrond nodded, his gaze thoughtful. \"Indeed, Thranduil. This is the Legolas we rarely get to witness. It's as if the music and the dance have allowed him to shed the mantle of his title and simply be.\"\n\"I wonder if that's all,\" Thranduil whispered as they watched Legolas twirl and spin, his laughter filling the air. Beside him, Aragorn matched his every step, a mortal ranger dancing with the grace of an elf. The contrast was striking, yet they moved together as if they had known each other's steps for a lifetime.\nElrond's eyes shifted to Aragorn, a glimmer of realisation dawning in his gaze. \"It's as if he's under a spell, Thranduil. As if Mirkwood has bewitched him, never would he have danced like this in Rivendell.\"\nThranduil raised an eyebrow, his curiosity piqued. \"You speak of Aragorn, I assume?\"\nElrond nodded, his gaze never leaving the dancing duo. \"Yes, Aragorn. It seems your prince has stolen his heart.\"\nThranduil's lips quirked into a small smile. \"If that is his only crime, I assure you the thief gives as much as he takes.\"\nElrond turned to Thranduil, his expression one of true surprise. \"You think so, Thranduil? You think he has found a kindred spirit in Aragorn?\"\nThranduil's gaze softened, his eyes returning to the dance floor where Legolas and Aragorn still moved in perfect harmony. \"Indeed I do, Elrond. Their bond seems to transcend the differences that would keep them apart.\"\nAs the music gradually slowed and the dance came to an end, Aragorn and Legolas found themselves breathless but exhilarated. Applause erupted around them and they stood together, their eyes locked in a moment of shared understanding, mutual but unspoken affection. They turned to the applauding crowd and bowed with bright smiles plastered on their faces.\nElrond turned to Thranduil, a knowing smile on his lips. \"You might be onto something, old friend. In their dance, I see the promise of a future that is bound by neither race nor fate.\"\nThranduil nodded, his gaze returning to his son with a mixture of pride and quiet contemplation. \"May they continue to dance through the challenges that lie ahead, Elrond,\" he declared, raising his glass as he turned back to the Lord of Rivendell. Elrond followed suit, raising his glass to match Thranduil.\nAs the clapping ceased the two elven lords watched as Aragorn and Legolas left the dancefloor, hand in hand.\nLegolas leaned in, his breath warm against Aragorn's ear. \"You sure are more than a ranger, Estel,\" he whispered, his voice carrying a hint of mischief. \"Tonight, you danced as an elf.\"\nAragorn chuckled, his heart full. \"And you, my prince, have shown me the heart of Mirkwood's spirit.\"\nTheir laughter mingled, a melody of joy and camaraderie. As the celebration continued around them, they stood together, two souls entwined.\nTheir dance was remembered as one that celebrated the bonds that could be formed between different worlds, a dance that spoke of a love that defied all odds."
    },
    {
        "title": "the golden Maia in the mirror",
        "url": "https://archiveofourown.org/works/59025454",
        "fandoms": [
            "The Silmarillion and other histories of Middle-Earth - J. R. R. Tolkien"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "17 Sep 2024",
        "language": "English",
        "words": "1,540",
        "chapters": "1/1",
        "comments": "10",
        "kudos": "67",
        "bookmarks": "5",
        "hits": "499",
        "post_title": "» Celebrimbor’s eyes, those eyes full of love and admiration, gazed upon him as though he were some sacred being. A being of light and goodness. «\nOr\nCelebrimbor likes to dress Annatar in the finest garments and jewellery Eregion has to offer.",
        "comment": "Annatar stood motionless in the center of their chambers, his sharp eyes fixed on Celebrimbor as the elf moved with careful precision. The Lord of Eregion, ever the artisan, fussed over him with an artist’s devotion. His deft hands worked as though Annatar were the finest creation Celebrimbor had ever crafted.\nThe robe that Celebrimbor had chosen for him was white, the purest shade of ivory, embroidered with intricate gold thread that shimmered with every shift of light. The golden patterns traced delicate paths along the sleeves, cuffs, and collar - patterns that Celebrimbor had designed specifically for him. It felt like being cloaked in sunlight, radiant and resplendent. The stark contrast of white and gold against his skin was deliberate, no doubt. Celebrimbor’s vision of him, made manifest.\nCelebrimbor knelt in front of him, adjusting the robe, pulling the fabric tight before stepping back to admire his work.\n“Beautiful,” he murmured as he took Annatar’s hand, slowly sliding a golden ring onto his finger - one he had forged himself, as always. Annatar’s gaze shifted downward, watching those gentle, reverent hands as they moved to adorn him with the finest of Celebrimbor’s jewellery.\nMore golden rings, each delicate yet powerful, slipped onto his fingers, their metal cool at first, then warming against his skin. Bracelets followed, the slight clink of metal-on-metal filling the room as they rested perfectly around his wrists.\nCelebrimbor’s fingers grazed his skin as he adjusted each piece of jewellery with meticulous care, tracing the lines of his palm, before he lifted his hands to his lips. A soft kiss, reverent - his face alight with the quiet satisfaction of a craftsman. He wasn’t just dressing Annatar. No, to him, this was something more profound - an act of adoration. “So beautiful, so pure,” Celebrimbor murmured, almost absentmindedly as if it were a fact, not an observation.\nAnnatar almost flinched, but he schooled his features into a soft smile instead, letting Celebrimbor’s words wash over him.\nPure.\nCelebrimbor said it with such certainty, with such love, that Annatar felt a painful pang in his chest.\nCelebrimbor’s eyes, those eyes full of love and admiration, gazed upon him as though he were some sacred being. A being of light and goodness.\nHe wanted to believe it. He wanted to believe for just a moment that he\nwas\nthe being Celebrimbor saw - a radiant Maia of golden light, of beauty, of creation. But beneath the layers of fabric and gentle touches lay the truth that neither of them could escape. Mairon was long gone, twisted into something darker, something more ruthless. Annatar, this beautiful façade, was nothing more than a vessel for his plans.\nBut Celebrimbor - Celebrimbor saw none of that. His grey eyes were soft with affection as he lifted another piece of jewellery, a golden bracelet, and fastened it around Annatar’s wrist. His hands were steady, as though every movement was part of some sacred ritual. It almost felt like worship, the way Celebrimbor handled him. As if Annatar were something holy, something worthy of reverence.\nAnd Annatar, in his weakness, found himself craving more of it.\n“Tyelpe,” he said softly, his voice steady yet touched by something unspoken. “You flatter me too much.”\n“Not enough, I think,” Celebrimbor replied with a small smile, stepping behind him now, his fingers combing carefully through Annatar’s golden hair, untangling each strand. It was a tenderness that caught Annatar off guard, even now. He felt the reverence in every movement, the soft hum of concentration that always accompanied Celebrimbor when he was working on something precious.\nAnd Annatar - Sauron, Mairon, a dark lord hiding in plain sight -\nfelt\nprecious under those hands.\nIt was a ridiculous notion, of course. How could he, who had once sworn himself to Melkor, feel anything other than the heavy burden of his own betrayal, the weight of his corrupted power? But here, in Celebrimbor’s presence, in the Lord of Eregion’s deft, tender care, Annatar almost forgot.\nAlmost.\n“Hold still,” Celebrimbor murmured, his voice soft with affection. He carefully smoothed the final strands of Annatar’s hair into place, his fingers lingering for just a moment longer than necessary, as if savoring the feeling of his golden locks on his fingers.\nAnnatar closed his eyes for a brief moment, allowing himself the luxury of leaning into Celebrimbor’s touch. For this one moment, he could be Mairon again, the Maia of Aulë, the one who crafted wonders of fire, metal and gemstone. In this moment, with Celebrimbor gently adorning him, he could believe he was still that being of light, untouched by shadow.\nHe opened his eyes again when he felt the cool weight of a circlet being placed upon his brow. Gold, of course, delicately wrought with Elven designs and set with a single, brilliant gem in the center. Celebrimbor adjusted it slightly, then stood back, his gaze appraising, his lips curving into a look of quiet satisfaction.\n“There,” Celebrimbor said softly, stepping aside to let Annatar see his reflection in the tall mirror before them. “Perfect.”\nAnnatar turned his head slowly, eyes drawn to the figure in the glass. For a moment, he didn’t recognize the reflection. The being staring back at him was resplendent in light and purity, his golden hair catching the golden light of day, the whites and golds of his attire glowing like the sun itself. He looked every inch the Maia he had once been under Aulë’s guidance - bright, radiant, and untarnished by the darkness that had consumed him.\nFor the briefest of moments, he saw Mairon in the reflection - shining, unmarred, brilliant with the light of the Valar. The one who had not yet fallen. The Maia who had forged wonders, who had sung the songs of creation with fire in his veins. The fire of the forge burned in his eyes, the passion for creation and beauty that had once driven him.\nAnd beside him stood Celebrimbor, his Lord, his artist - his other half.\nBut the moment passed, and the image before him felt like a cruel illusion. He was no longer Mairon, no longer the pure, shining Maia. His heart, twisted and blackened by his time under Melkor, would never again be as Celebrimbor saw it. The radiance in the mirror was a lie.\nYet, Celebrimbor looked at him as if he were still that Maia of fire and song.\n“Do you like it?” He asked, his voice soft with affection, his hands resting gently on Annatar’s shoulders as he admired his work in the mirror.\nAnnatar swallowed hard, his throat tightening as he tore his gaze from his reflection in the mirror and looked instead at Celebrimbor's. The elf was smiling at him, that soft, affectionate smile that always made Annatar’s heart clench in ways he wished it wouldn’t.\nHe believes it, Annatar thought bitterly. Celebrimbor truly believed that Annatar was this being of purity and light. He had no idea of the darkness that lurked beneath the surface, the corruption that had twisted his soul beyond repair.\nAnnatar forced a smile, his heart heavy with the weight of the deception. “I do,” he replied quietly, his fingers brushing against the golden rings adorning his hands. “You’ve made me look wonderful… ethereal even,” He hesitated, searching for the right words. “You’ve made me look like the being I remember myself to be.”\nCelebrimbor pressed a gentle kiss to the side of his neck, resting his chin on Annatar’s shoulder. “You are that being,” he whispered, his voice full of love and conviction. “You are more than you know, and more than you let yourself believe.”\nAnnatar closed his eyes, a knot tightening in his chest. He wanted to believe it. He wanted to believe that the darkness hadn’t fully consumed him, that light could still exist within him. But he knew the truth. He was plotting Eregion's downfall, after all.\nHe wasn’t Mairon anymore. And this - this happiness with Celebrimbor - was as fragile as the delicate circlet resting on his brow.\nAnnatar leaned into Celebrimbor’s touch, the warmth of the elf’s hands grounding him in the moment, even as his mind wrestled with the darker truths he kept hidden. For now, he would let himself believe the lie. For now, he would let Celebrimbor’s love make him feel whole.\nHe smiled again, more genuinely this time, as he turned to face Celebrimbor. \"I am fortunate,\" he murmured, his voice low and filled with a tenderness he rarely allowed himself to show. “Fortunate to have you, Tyelpe.”\nCelebrimbor’s eyes softened, and he pulled Annatar close, his hands resting lightly against the Maia’s back. “No,” Celebrimbor whispered, pressing a kiss to his lips, soft and full of promise. “It is I who am fortunate.”\nAs he pulled away, Annatar’s heart twisted painfully in his chest as he stared at the elf who loved him so fiercely, so completely. At least for now, he would try to be the being Celebrimbor saw in him.\nAnd as Celebrimbor led him away from the mirror, speaking enthusiastically about a new project he had in mind, Annatar cast one last glance at his reflection.\nThe golden Maia in the mirror smiled back at him, radiant and pure.\nBut the shadow lurking beneath his skin remained."
    },
    {
        "title": "I don’t seek peace",
        "url": "https://archiveofourown.org/works/59995921",
        "fandoms": [
            "The Silmarillion and other histories of Middle-Earth - J. R. R. Tolkien"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen, M/M",
        "status": "Complete Work",
        "published": "23 Oct 2024",
        "language": "English",
        "words": "1,721",
        "chapters": "1/1",
        "kudos": "28",
        "bookmarks": "1",
        "hits": "258",
        "post_title": "» Annatar moved closer, his hand reaching out to cup Celebrimbor’s face, just as he had done so many times before. That familiar touch, that warmth… Celebrimbor’s heart clenched with longing.\nBut before he could speak, Annatar’s mouth opened, and the words that spilled from his lips were ice. «",
        "comment": "Celebrimbor turned away from Nienna’s touch, curling into himself on the bed at last, as if he could shut out the weight of their sorrow. His mind, exhausted from endless cycles of grief and confusion, finally surrendered to sleep - deep and dreamless at first, mercifully void of the torment that usually awaited him.\nBut then, slowly, a golden light filled the room.\nWhen he opened his eyes, a familiar warmth washed over him. His heart stirred, a flicker of recognition sparking in his chest.\nAnnatar.\nHe blinked, sitting up as he took in the sight before him. No one else was there - no Nienna, no Irmo, no Estë. Only him.\nOnly\nAnnatar.\nHis beloved, the one who had once filled his life with warmth, even if that warmth had ultimately burned him.\nIt was too good to be true, yet that was exactly how it had always been with Annatar. Too perfect, too radiant, too intoxicatingly beautiful. But here he was, standing by the bedside, his golden eyes shining with that same soft glow Celebrimbor had come to associate with love, with comfort, with devotion.\nAnd for a brief, fleeting moment, Celebrimbor allowed himself to believe it was real. To believe that his Annatar had come back to him, that the torment of the past had somehow been washed away.\nAnnatar moved closer, his hand reaching out to cup Celebrimbor’s face, just as he had done so many times before. That familiar touch, that warmth… Celebrimbor’s heart clenched with longing.\nBut before he could speak, Annatar’s mouth opened, and the words that spilled from his lips were ice.\n“Listen, Tyelpe,” he said, and the tone - it was\nwrong\n, cold and sharp, laced with a cruelty that sent a chill down Celebrimbor’s spine. Not the warmth of Annatar, but the venom of Sauron. “It was all a lie. Everything. You were never cherished. You were never loved. You were nothing but a tool. You were always just something to be used.”\nCelebrimbor blinked, the words felt…\nwrong.\nNot just the words, but the way they were spoken. The tone, the phrasing - it was all wrong. Annatar, even at his most cruel, had never spoken to him like this. Even when he revealed his true nature, when the mask of the golden Maia fell away, he had never been this… detached.\nCelebrimbor didn’t flinch. He didn’t recoil. Instead, a dry, humorless laugh escaped his lips, almost involuntary, as if some part of him had grown tired of this charade. He looked into Annatar’s eyes - those golden, familiar eyes - and now saw the cracks in the illusion.\nAnother humorless laugh escaped his lips before he could stop it. He shook his head slightly, feeling the weight of the dream fall away, like an illusion dissolving before his eyes.\n“That‘s not him, Lord Irmo,”he murmured, barely loud enough for the Valar, who he knew must be watching from beyond the dream, to hear.\nAnnatar’s expression shifted, a flash of surprise flickering across his face. It was so vivid, so accurate to the way Annatar had looked at him in life, that it almost made Celebrimbor falter. But he pressed on.\nHe reached out, grabbing Annatar’s wrist with a gentleness that surprised even him. He pulled him closer, their faces now mere inches apart. The golden light flickered in Annatar’s eyes, but Celebrimbor’s gaze remained steady, unyielding.\n“Listen, Annatar,” he said, his voice low, steady. “I love you. I’ve loved you from the very start. Even if most of it was lies, you can’t deny that some of it was real. I’ve seen you -\ntruly\nseen you. Like you’ve seen me. I will never unsee you.”\nThe words hung between them, heavy with a bittersweet finality. And there was a flicker of something - something almost startled - in the Maia’s eyes. His expression faltered for a brief second, as if caught off guard by the words. The illusion held, but barely. And in that moment, Celebrimbor’s heart softened, even in the midst of the dream.\nHe pulled Annatar into an embrace, wrapping his arms around him and burying his face into the familiar warmth of his shoulder.\nIt was the closest thing to relief he had felt in what seemed like an eternity.\nEven if this was a dream, even if it was a lie, it felt real enough. Real enough to bring some comfort, some fleeting sense of peace.\nAt last, the dream dissolved, and Celebrimbor woke again, blinking in the soft morning light of Valinor. He almost grumbled in irritation, the soft embrace of the dream slipping away as reality set in.\nFor a brief, fleeting moment, he felt the warmth of Annatar’s embrace linger around him like a ghost. He hadn’t wanted to wake, not from this. Not from\nhim\n.\nThe light that had bathed the dream, the vivid sensation of Annatar’s hand on his face, had been so real - so painfully, beautifully real - that for a few precious moments, he had believed it. He sighed, closing his eyes again, trying to hold onto that feeling just a little longer.\nThe sound of hushed voices finally reached his ears. Undoubtedly, Nienna, Irmo, and Estë were gathered near him, speaking quietly amongst themselves. Their voices were low, almost inaudible, but Celebrimbor caught fragments of the conversation.\n“…perhaps it was too much,” Nienna was saying, her voice filled with concern.\n“I don’t know if it was the right choice,” Irmo was saying, his tone contemplative. “It may have brought him closer to the truth. Maybe it was progress…”\nEstë’s face was calm, though her expression held a trace of pity as she responded, “The dream didn’t shatter him, but I fear it only reinforced what he already believes. Is it progress if he still clings to that which harms him?”\nCelebrimbor couldn’t help but sigh. He shifted in the bed, sitting up slowly, and the movement caught the attention of the Valar. Nienna’s sad eyes turned to him, her expression softening, while Irmo and Estë regarded him with a mixture of concern and curiosity.\n“How do you feel, Tyelpe?” Nienna asked, her voice as gentle as ever.\nCelebrimbor ran a hand through his dark hair, the faintest traces of a smile on his lips - though it was more tired than anything else. “How do I feel?” he repeated, his voice dry, hollow. “I suppose that depends on what you were hoping for.”\nIrmo stepped forward, his gaze serious yet patient. “We were hoping to guide you toward acceptance, Celebrimbor. To help you see the truth of what has happened, and to let go of what binds you.”\nCelebrimbor snorted softly, shaking his head. “\nAcceptance\n?” he muttered under his breath, his voice laced with bitterness. “What exactly am I meant to accept? That I was a fool? That I trusted someone who played me from the start? That everything I believed in was a lie? I\nknow\nthe truth.”\nHe looked up then, meeting Irmo’s gaze head-on. “Lord Irmo, you induced that dream,” he continued, his voice hardening, “You tried to make Annatar cold, cruel. Tried to force me to see the darkness in him.”\nIrmo nodded slowly. “I wanted to help you confront the truth.”\n“Truth?” Celebrimbor repeated, his lips twitching into a faint, bitter smile. “And yet you got it wrong. He wouldn’t have spoken like that. He wouldn’t have used those words. You made him too cold. Too cruel. He wasn’t always like that. Even at his worst… he knew me too well.”\nThe silence that followed was heavy, thick with unspoken tension.\nTruth be told, Celebrimbor already knew what they feared. He had known for some time now.\nHe\nshould\nlet go. He\nshould\nheal. He should hate the one who had manipulated, used, and ultimately destroyed him. He should want to forget the lies, the betrayal, the darkness that had consumed him.\nHe didn’t want to.\n“I know who Annatar really is,” Celebrimbor said, his voice barely above a whisper now. “I know what he did to me. But I also know that no other could’ve brought me where he did. I loved him for it. I still do.”\nThat, more than anything, seemed to silence the Valar. They had heard this before, of course, but it never grew easier for them to understand. To hear Celebrimbor speak of love when the very one he loved had betrayed him so deeply.\nBut Celebrimbor knew, even Sauron’s lies had threads of truth woven into them.\nHe had seen the surprise in Annatar’s eyes when he pulled him close in the dream. That had been bittersweetly accurate.\nFor once, the dream had felt right. The expression, the flicker of genuine feeling behind those golden eyes -\nthat\nwas real. That was the Annatar he knew. The one who had adored him, even if it had been twisted by darker motives.\nNienna’s tears had begun to flow again, her sorrow for him endless. Estë stood quietly, her expression unreadable, but there was no disappointment in her gaze - only quiet empathy. Irmo’s face remained thoughtful, though he said nothing for a long while.\nI love you,\nhe had whispered to the illusion in his dream. And it hadn’t felt like a lie.\nNow, sitting in the sterile reality of his chamber, the memory of the dream felt more like a gift than anything else. He didn’t care if the Valar thought it a step backward.\nAfter a long pause, Irmo finally spoke again. “It is your choice, Tyelperinquar. But understand this - clinging to what was, to what\nyou believe\nwas real, may not bring you the peace you seek.”\nCelebrimbor closed his eyes, exhaling slowly. He lay back in the bed, staring up at the ceiling. “I don’t seek peace,” he said softly.\nNo, he didn’t need peace. All he wanted was the memory of Annatar, of the golden light, of the lies that had felt so achingly real.\nEstë’s expression softened, no longer tinged with disappointment, but with something like understanding. Irmo, however, remained quiet, his gaze thoughtful, as if he was weighing Celebrimbor’s words carefully.\nEstë finally spoke now. “You still believe that some part of him truly cared for you?” Her voice was soft, almost as if she had begun to understand his feelings.\n“I\nknow\nhe did,” Celebrimbor replied, his tone unwavering."
    },
    {
        "title": "for this one, brief moment, everything was perfect",
        "url": "https://archiveofourown.org/works/59246539",
        "fandoms": [
            "The Silmarillion and other histories of Middle-Earth - J. R. R. Tolkien"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "27 Sep 2024",
        "language": "English",
        "words": "2,022",
        "chapters": "1/1",
        "comments": "6",
        "kudos": "72",
        "bookmarks": "10",
        "hits": "610",
        "post_title": "» “I sometimes think,” he continued softly, his fingers now tracing the delicate shell of Celebrimbor’s ear, where he had placed a small, intricate cuff adorned with moonstones, “that you could have been one of the Ainur. A Valar, even.” There was a wistful note in his voice, a yearning for a reality that could not be.\nCelebrimbor opened his eyes, glancing at Annatar with a soft smile. “A Valar?” he repeated, amusement lacing his tone. “I am far from that, I assure you.” «\nOr\nThere are days when Annatar wants to treat Celebrimbor as if he were a Valar.",
        "comment": "The sun was nearing its zenith, and the light filtered through the tall windows of their private chamber in soft, golden beams. It cast an ethereal glow upon the two figures within, making the room seem suspended between reality and some otherworldly realm.\nThe light played upon the fine lines and contours of Celebrimbor’s face, making him look almost sublime, as though he were carved from light itself. Annatar sat perched in Celebrimbor’s lap, his fingers deftly weaving delicate jewels into the elf’s dark hair - it was as if he were offering a prayer to some higher power, and in a way, he was. Each gem, whether sapphire, diamond, or ruby, caught the light, adding a constellation of glittering stars to the already striking midnight of Celebrimbor’s locks.\nThey were alone in the quiet room, the only sounds being the soft murmur of the wind outside and the occasional clink of metal as Annatar reached for another jewel from the small velvet box beside him. There was no rush, no pressure. Just the slow, deliberate act of adorning Celebrimbor, of turning his beloved into a vision that could have rivaled the splendor of the Valar themselves.\nToday, the rings and their grim purpose were far from Annatar's mind. There were no dark thoughts, no heavy burdens weighing down his heart. There was only this moment, where the world beyond ceased to exist and it was just them - Annatar and his beloved, enshrined in their own sanctuary of light and affection.\nCelebrimbor, for his part, seemed content to indulge Annatar’s whims. He sat still, his back against the plush cushions on the wide settee, his arms loosely wrapped around Annatar's waist, as the Maia adorned his dark hair with jewels.\nTo an onlooker, it would have seemed like a scene from a dream - an image of devotion and love, of absolute adoration. And, for Annatar, it very much was.\nAnnatar leaned in, pressing a feather-light kiss to Celebrimbor’s temple as he secured a small, delicate sapphire above his ear. “Perfect,” he whispered, his voice almost reverent. “You look divine. Like a star in the heavens.”\nCelebrimbor chuckled softly, his head tilting slightly as he glanced at Annatar with a fond, amused smile. “You have a flair for exaggeration, my love,” he said, though there was no denying the warmth in his gaze, the way he leaned into Annatar’s touch. “It’s just a few jewels.”\nAnnatar’s eyes sparkled with something almost feral, his grin widening as he pressed a gentle kiss to the corner of Celebrimbor’s lips. “Nothing is ever ‘just’ anything when it comes to you, Tyelpe,” he said, his voice carrying a hint of playfulness, but underneath it lay something deeper, something almost solemn. “You don’t see yourself the way I do.”\nHe leaned back slightly, his eyes roving over Celebrimbor’s face, the curve of his lips, the sharp line of his jaw, the eyes that had fallen closed in contentment, the elegance that seemed to radiate from him in effortless waves. Annatar felt something fierce and tender rise in his chest, a feeling that was almost too much to contain, too big for even him to grasp fully.\n“I sometimes think,” he continued softly, his fingers now tracing the delicate shell of Celebrimbor’s ear, where he had placed a small, intricate cuff adorned with moonstones, “that you could have been one of the Ainur. A Valar, even.” There was a wistful note in his voice, a yearning for a reality that could not be.\nCelebrimbor opened his eyes, glancing at Annatar with a soft smile. “A Valar?” he repeated, amusement lacing his tone. “I am far from that, I assure you.”\nAnnatar shook his head, his fingers gently twining another jewel into Celebrimbor’s hair. “No, you would have been perfect. You are perfect. Kind, wise, strong - everything a good Valar should be.”\nCelebrimbor chuckled softly, the sound vibrating through Annatar’s chest. “You speak as if you’ve forgotten the many faults I have.”\n“Faults?” Annatar echoed, his voice filled with mock disbelief. “What faults, Tyelpe? If you have any, they are but the tiniest blemishes on a diamond, insignificant against your brilliance.”\nCelebrimbor raised an eyebrow, clearly amused by Annatar’s words, but he allowed the Maia his whimsy. It was rare for Annatar to indulge in such fanciful thoughts, to be so open with his affection, and he didn’t want to break the spell.\n“You would have made a fine ruler of Maiar, my lord,” Annatar continued, his voice soft, almost wistful.\nThe elf let out a soft sigh, his eyes closing again as he savored the warmth in Annatar’s words, the sheer adoration that shone in his gaze. He felt the weight of the jewels in his hair, each one a symbol of Annatar’s love, of his desire to adorn and protect. “And what would you do then, my dear? If I were a Valar?”\nAnnatar pressed his forehead against Celebrimbor’s, his breath mingling with the elf’s, his heart thundering in his chest. “If you were a Valar, if I could make you one, I would serve you as your most loyal Maia. I would follow you without question, without hesitation. There would be no desire for anything more than to be by your side.”\nThere was something almost sad in his tone, a longing that Celebrimbor couldn’t quite place. He opened his eyes and reached up, his hand gently cupping Annatar’s cheek, forcing him to meet his gaze. “You would?” he asked, his voice tender.\n“Yes,” Annatar whispered, his eyes dark and serious. “I would worship you like the very sun and stars. I would be yours, completely, without lies, without hesitation. You would never need to doubt my loyalty.”\nCelebrimbor blinked, taken aback by the intensity in Annatar’s eyes, by the raw sincerity in his words. He raised another hand, cupping Annatar’s cheek, his thumb brushing over the Maia’s cheekbone with a gentleness that seemed almost out of place in such a powerful hand. “You speak as though I am some ancient deity, Annatar, when I am but an elf. No more than that.”\nAnnatar’s heart ached at the simplicity of those words. “If the world were fair, you would be a Valar, and I would serve only you, as I do now.” He placed another jewel, a diamond this time, near the crown of Celebrimbor’s head, his fingers brushing against the silky strands with almost painful tenderness.\nCelebrimbor chuckled softly, one hand sliding down to rest against Annatar’s chest, feeling the steady beat of his heart beneath his fingertips. “But would you not get jealous, my love? If other Maiar were to serve me as well?”\nAnnatar froze for a moment, his fingers stilling as he considered the thought, a brief flash of possessiveness crossing his mind. “I would be, I suppose,” he admitted, leaning in to press a kiss to Celebrimbor’s lips, soft and sweet. “But as long as I was the one to adorn you like this, to worship you as I do now, I think I could bear it.”\nCelebrimbor’s hand moved to cup the back of Annatar’s neck, deepening the kiss for a moment before they pulled away, foreheads resting together. “You say the most beautiful things,” he whispered, his eyes half-closed as he took in the Maia’s words, the sincerity in his gaze.\n“It is easy, when I have you to inspire me,” Annatar replied, his fingers resuming their work. He added another jewel, and then another, each one placed with care, each one a declaration of his devotion. “You have no idea how often I wish things were different. That you were… more?”\n“Is being an elf not enough for you?”Celebrimbor asked, his eyebrows raising slightly, a hint of amusement in his eyes.\nAnnatar’s gaze softened, his hand coming up to caress Celebrimbor’s cheek. “You misunderstand me, love. You are more than enough. It’s that the world doesn’t deserve you as you are. If I could, I would elevate you to the heavens. You would be more than…say\nMelkor\never was, in his prime. Beautiful, powerful, kind and just - everything he wasn’t.”\nHis voice dropped to a whisper, and he closed his eyes, as though the thought itself was too beautiful, too painful to bear. “If only… things were different.”\nCelebrimbor was silent for a long moment, his eyes searching Annatar’s face, his own heart aching at the unspoken sorrow in the Maia’s voice. He knew there were things Annatar would not - could not - say, secrets he kept close to his chest, burdens he bore alone. But in this moment, Celebrimbor felt the weight of something unnameable between them, a shadow that lurked just beyond the reach of the sunlight.\nHe tilted Annatar’s chin up, forcing the Maia to meet his gaze. “We cannot change what is, Annatar,” he said gently, his voice steady and sure.\nAnnatar swallowed hard, his eyes shimmering with a depth of emotion that seemed almost too vast for his form to contain. He nodded, unable to speak, his throat tight, as he placed the last jewel in Celebrimbor’s hair - a large, radiant star sapphire that sat in the center above his forehead, catching the light and refracting it in a dazzling array of colors. Annatar sat back, his eyes drinking in the sight of Celebrimbor, now adorned like some celestial being, a vision of light and dark.\n“You’re beautiful,” he breathed, his hand trembling slightly as he reached out to cup Celebrimbor’s face, his thumb brushing gently over the curve of his cheek. “My beautiful, perfect Tyelpe.”\nFor a moment, Celebrimbor saw the barest flicker of something in Annatar’s eyes - a vulnerability, a longing so deep and raw that it took his breath away. He leaned forward, his hands sliding around Annatar’s waist, pulling him close. “And I am yours,” he whispered, his lips brushing against the Maia’s. “Whether I am elf, Valar, or something in between. I am yours.”\nAnnatar’s breath hitched, his eyes closing as he leaned into Celebrimbor’s embrace, his arms wrapping around him tightly. “If only that were enough,” he murmured, the words barely audible, lost in the rustle of fabric.\nAnnatar closed his eyes, savoring the warmth, the gentleness. He wished, with every fiber of his being, that it could be enough. That he could be content with this, with just the two of them, without the weight of his plans and ambitions. But he knew it was a fleeting wish, a dream that could never last.\nBut for now, it was. For now, he could let himself believe in this, in the warmth of Celebrimbor’s arms, in the sweetness of his kiss. For this moment, he allowed himself to believe in a future that could never be, in a reality where he could stay by Celebrimbor’s side without fear, without deceit.\nHe would let himself imagine that they were more than what they were - two beings caught in a web of fate and deceit. He would pretend that they were just lovers, lost in a moment of peace and intimacy, without the shadow of what was to come hanging over them.\nFor this one afternoon, he was content to be here, in Celebrimbor’s lap, placing stars in his hair and pretending that they could be happy. Even if it was all a lie, he would hold onto it for as long as he could.\nAnd maybe, just maybe, in that small, hidden part of his heart, he could believe that it wasn’t entirely a lie. That there was some truth to the love he felt, to the devotion that shone in his eyes as he gazed at Celebrimbor.\nHe leaned in, pressing a kiss to Celebrimbor’s forehead, just below the radiant sapphire, his lips lingering there. “I love you,” he whispered, the words a vow, a promise that he couldn’t keep but wanted to more than anything. “More than you will ever know.”\nHe could pretend, for just another moment, that there was no shadow on the horizon, that they could stay like this forever, wrapped in each other’s light - that for this one, brief moment, everything was perfect."
    }
]