[
    {
        "title": "Can I Be Real For a Second?",
        "url": "https://archiveofourown.org/works/53636800",
        "fandoms": [
            "Hamilton - Miranda"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "08 Feb 2024",
        "language": "English",
        "words": "638",
        "chapters": "1/1",
        "comments": "1",
        "kudos": "25",
        "bookmarks": "1",
        "hits": "397",
        "post_title": "Day 8:  \"Why won't it stop?\"\nGeorge Washington Reflects on his losses during 1777.",
        "comment": "George Washington understood what losing was like. He had lost men horrifically when he was led into a massacre. He still could hear those men even in his sleep years later. He vowed to never allow such a thing to happen again, and he was determined to always be valiant in battle. He was known for his courage and bravery and for the numerous times he led his troops.\nThese last few months of the Revolution had been nothing but losses, both perceived and real. He needed a victory to reestablish his credibility and morale. He knew that the next battle would be crucial. Washington needed to make sure his troops were prepared and ready for the challenge.\nThe Brandy Wine campaign had ended in a draw, his beloved Major General Lafayette was shot in the leg as they retreated. And days ago, he thought his right-hand man Hamilton had perished in the Schuykill River, only for the young man to re-appear when they were drinking to his memory. The solemn atmosphere soon turned to laughter at their youngest appeared in the door, sopping wet from the river with a scowl.\n“Why won’t it stop?” George sighed, tapping his quill, the ink making messy, uneven splotches on the parchment.\nSighing, Washington stood and pushed his chair out from the desk, its screech loud as it slid on the floor.  He paced, thinking. The number of victories didn’t balance with the losses they had this year in battle. These could not go on.\nDespite the training from Von Stuben and the improved military discipline, their defeats had still been humiliating, their victories costly, and the enemy seemed as numerous as ever. He had done his best, he knew. And that, after all, was all God and men could ask of him.\nGeorge took a step towards the door and taking a candle, strode down the hall towards the aides' room. Opening it quietly, as it was past midnight. He peered in and found, surprisingly, that Alexander lay asleep on his camp bed, snoring softly. Washington knew the young man worked too hard; the work piled on his shoulders like snow on a roof. In the other bed was Laurens, also sleeping soundly, if not more loudly by the sound of the snores.\nHe next took steps towards the second to last door of the wing and opened it slightly to reveal a lantern burning bright, a figure slumped in a chair next to the occupied bed. Stepping in, he saw Lafayette-Gilbert shifting uncomfortably in his bed, his face shining with sweat as he twisted in dreams. The Marquis twisted his head to the side, the flannel sliding from its place.\nWashington stepped in, placing the candle on a sideboard before turning to his young French friend. Taking the cloth, he dipped it in a nearby basin of water, squeezed out the excess, and returned it to Lafayette’s forehead.\nHazy brown eyes opened as the Frenchman formed a smile on his lips as he whispered, \"Mon General.\" Weakly, he lifted his hand, attempting to reach out to Washington. Graciously, George took hold of Lafayette's hand and gave it a reassuring pat. \"Rest now, my friend. Sleep well and recover for me.\"\nGeorge let go of Lafayette's hand, carefully placing it back on the plush mattress. Lafayette's eyes, the color of rich chocolate, fluttered shut as he drifted back into a peaceful slumber. Picking up the candle again, Washington stepped back into the hallway and silently closed the door behind him. He returned to his quarters, setting the candle back down on his desk and opened a missive about military strategy from South Carolina.\nHe would work harder, vowed to put in extra effort, refine his military strategies, and ultimately emerge victorious, ensuring the safety of those entrusted to his command."
    },
    {
        "title": "Look at where you are, Look at where You Started",
        "url": "https://archiveofourown.org/works/53466229",
        "fandoms": [
            "Hamilton - Miranda"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "02 Feb 2024",
        "language": "English",
        "words": "972",
        "chapters": "1/1",
        "comments": "3",
        "kudos": "29",
        "bookmarks": "2",
        "hits": "313",
        "post_title": "Day 2: solitary confinement\nLt. Colonel Alexander Hamilton contemplates the purpose of being captured and interviewed King George in England.",
        "comment": "Alexander could hear the pattering of the rain from the Tower’s barred window, raindrops splashing against the brick. He held out his hands, allowing the water to gather before closing his eyes and taking a drink. Sighing, he plunked back onto his cot and closed his eyes. He only knew time was passing as the sun rose and fell, as well as when the few meager meals were passed to him throughout the day.\nExhaustion had clung to him like a shadow those first few days. He had slept as much as he could during the nights aboard the ship that was spiriting him to England, though the guards had a nasty habit of waking him whenever he started to fall asleep. He had been taken from the ship in Portsmouth in a carriage to the Tower via orders by King George. Those first few nights in his prison cell, despite the slight chill of late spring, Alexander slept for nearly two days. It had alarmed the Tower guards enough that a physician was called for and he was examined, only for the doctor to conclude that he was indeed just suffering from exhaustion.\nNow he was awake and pacing the tiny confines of his “quarters” as the guards here liked to call them. To be honest, Alexander was expecting less as a prisoner of war; but his cell was fairly sized with a bed and a small table with a pitcher of water and a basin for washing. When he arrived at the Tower, he’d been told that he would have an audience with the King. But days had gone by, and he still had no news of such a meeting.\nAlexander paced the length of his cell, thinking. What would be the purpose of going through all the trouble of capturing him? Why him? Surely being a Lt. Colonel was not important enough to be taken all the way to England and have an audience with King George of all people. There were high ranking generals from their side that should have garnered the “honor,” not him. And why an interview with the monarch of England? If that man thought he’d get any information out of Alexander Hamilton, he would be sadly mistaken.\nHe drew a hand to his face and scrubbed at the stubble beginning to form into a full beard. The days of silence with only the sounds of the door shuttering open and the ravens below had begun to drive him slightly mad. It was so strange for him to experience loneliness after spending so much time in solitude following his mother's passing. But then, he had his military ‘family.’ At headquarters, he was surrounded by the everyday cacophony of the other soldiers talking, hurrying in an out with heavy footfalls. In the evenings, he, Laurens, Lafayette and the other aides gathered for supper and spoke voraciously or told jokes and laughed.\nNow he was in enemy hands, thousands of miles away from home and alone. There would be no rescue, only perhaps a prisoner exchange if he were lucky. At worst-but he didn’t have to think about that. He was one of many, including Washington that were in open rebellion against the King of England and the penalty was death in any case. He didn’t care. This rebellion would go on without him; Washington could surely find another right-hand man to carry out his correspondences and put up with his fits of temper.\nTo die a soldier’s death would be the highest honor to his mind. Still, it nagged at him to be dragged all the way across the ocean for whatever nefarious purpose the monarch had in mind for him. Alexander knew the need to respond cautiously to questions by anyone (but especially the King) in order to avoid unintentionally revealing any information.\nA low gurgling croak garnered his attention. Looking up, Alexander saw the dark plume of a raven perched on the window’s tiny ledge. The bird brought him a sense of joy as he gazed upon it. He strode to the window, feeling a cold breeze that made him shiver slightly.\n“Afternoon, Archimedes.” Alexander said while he fished in his pocket for the last bit of bread from breakfast earlier that day, breaking it into pieces and offering a bit to the raven. For entertainment, Alexander had taken to dropping bread into the courtyard when the guards weren’t looking, then left it on the windowsill in hopes that they would fly up. Not long after, his plan had worked, a raven perched there every day to take proffered food from Alexander, and he in turn, had a little company in this cold, silent tower cell. He didn’t know the birds' names (or if they even had one), but a bird had done so enough times that he had given it a name.\n“Hello.” it responded in a clear enough tone that one could mistake it as a human. Alexander found that ravens were intelligent and with enough practice, would repeat words taught to them. He scratched under the raven’s bill at its neck. He aimlessly pet the raven though his thoughts were elsewhere.\nAlexander let his shoulder sag and hand drop, the raven perching its head to one side with curiosity. He didn’t want to die here, as just another traitor to the Crown...he wanted to die in battle, in glory and perhaps with his name in history books. Now he might not have that opportunity again.\nHe took a deep breath and closed his eyes, determined to find the courage to face whatever was about to happen. He opened them again, steeling himself for whatever was to come. For himself, for General Washington, for the Revolution. The raven squawked and flew away, leaving Alexander alone with his thoughts and his fate."
    },
    {
        "title": "Raise a Glass",
        "url": "https://archiveofourown.org/works/59650360",
        "fandoms": [
            "Hamilton - Miranda",
            "18th Century CE RPF"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "11 Oct 2024",
        "language": "English",
        "words": "1,000",
        "chapters": "1/1",
        "comments": "2",
        "kudos": "9",
        "bookmarks": "1",
        "hits": "135",
        "post_title": "On a rainy autumn night, Lafayette tackles with duty when a letter arrives from France.",
        "comment": "Autumn’s chill mingled with rain, making day and night miserable for the Continental Army. The days had grown shorter, and the campaigns against the enemy had become more sporadic until they would draw to a close for the year. Officers and enlisted men alike found refuge in their tents on such a raw night. The last leaves on the trees were falling and snow would soon overtake the landscape in the last months of 1778.\nLafayette sat on his camp bed, the glow of the lantern filling the minimal space with light. He re-read the letter from his beloved wife for the third time that day. Adrienne had solemnly broken the news of their daughter’s death. He couldn’t stop crying. His beloved child, whom he’d known for less than a year, was now buried. He hadn’t even been able to attend the funeral, having only heard of her passing one month later.\nTheir first child, the beginning of their legacy, had died. Adrienne—oh, poor Adrienne! —was suffering this loss alone. He should have been there to console her at such a time. She had been with child by the time he left France to join the revolution in America.\nHe was met with reluctance at being given the rank of Major General and assigned to work alongside the great General Washington himself. Soon, he had shown his zeal and earnestness for the cause after being wounded at Brandywine Creek. His troops and supplies had brought much-needed relief to the Army and a gesture of goodwill to their American allies upon their arrival, but it had dwindled now to near nothing.\nLafayette ran a frustrated hand through his hair. “What on earth am I doing here?” he asked himself aloud. As he stood, the letter fluttered to his blanket. He was torn between his commitment to the Revolution in America and his bereaved wife and family in France. More than once, he had thought of going back home. But he could not leave his comrades, especially as he was now a leader among them. Gilbert felt as sense of loneliness without Adrienne, and he longed to be by her side again.\nHe heard a knock on the tent-pole and the familiar voice of Alexander Hamilton. \"Laff? May I come in a moment?\"\nLafayette turned his back to the tent flap letting out a sigh. He craved solitude to process his sorrow. Another part of him still wished for company. He tried to regain his composure by rubbing a sleeve over his eyes and inhale deeply. “Come in, Mon Ami. What brings you to my tent on such a rainy evening?”\nAlexander’s face bore no smile, instead it reflected a deep sense of worry. “Laff, are you alright? You seemed…. distracted today.”\n“It’s nothing, my friend.” Lafayette said airily, trying to regulate his voice so it would not tremble.\n“What’s wrong, Laff? Your eyes are all red and puffy.” Alexander’s eyebrows knotted together. “Bad news from home? Not your wife?”\n“Damn, you’re too good at seeing people, mon ami.” Lafayette sniffled, wiping away tears that had begun to spring anew. He picked up the letter, glancing at the words again. “My-my daughter...Henriette...passed away.” He put a hand to over his eyes again. “I... I should have been there, Alexandre. My wife will never forgive me for gallivanting to America and leaving her alone.”\nAlexander’s face shifted with sympathy. “I’m so sorry Laff. I don’t think I have the words to express how regretful I am at the loss of your child.” He helped his friend sit on his bed, the cot dipping at their weight. They sat in quiet before he spoke again. “My mother….” He looked away with his own grieved look, “she died.\" Alexander paused, taking a breath before adding, \"I remember my uncle telling my brother and I that she went to Heaven. Your daughter...she’s in Heaven.”\nLafayette’s breath hitched as his heart grappled with both grief and guilt, eyes welling with tears he let fall. He placed a tentative hand to his chest. “I didn’t even know my child for very long, Alexandre. I can’t imagine what my absence is having on the family.”\n“You were fighting for a cause, Laff. I’m sure-” Alexander said putting a hand to his friend’s shoulder.\n.\n“Yes, but for the ideal or my ego, Alexander?” Lafayette interrupted, troubled eyes swinging towards him. “I was only given my rank in the Royal Black Guard because of my father-in-law. I had a life of privilege. I was naive when I arrived here. I thought that I would fight, and Andrienne would be waiting with my daughter.” He gave a shuddering laugh, “I dreamed of glory and adventure and selfishly left Adrienne alone and defied not only my family, but my King and Queen as well. I’ll be lucky not to be exiled when I return home.”\n“Regardless of the reasons, Gilbert,” Alexander said gently, his gaze steady but still kind, “I’m sure they understand and know you mourn as well.”\nLafayette dropped his head in his hands anxiously, his voice shuddering. “Still, I don’t know what to do. To return to France or stay.”\nAlexander sighed heavily. “You must do what is right in your heart, Laff. Just know that you have earned the respect of not only your own men, but the men of the Continental army; including the General and me.”\nThe Frenchmen allowed himself a little smile. “Merci, Alexander. I think I will just go on leave, mon ami, I will not leave the fight for your freedom.” He stared at the empty glass in his hand. “Will you raise a glass in her memory with me?” He reached for another vessel and poured some wine in his friend’s, then his own.\nAlexander cleared his throat and raised his wineglass. “To your daughter.”\n“To my daughter.” Lafayette echoed solemnly. They clinked their glasses together in a quiet toast and drank silently for the rest of the night."
    },
    {
        "title": "Try Not to Crack Under the Stress",
        "url": "https://archiveofourown.org/works/53853700",
        "fandoms": [
            "Hamilton - Miranda"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "14 Feb 2024",
        "language": "English",
        "words": "1,008",
        "chapters": "1/1",
        "comments": "1",
        "kudos": "14",
        "hits": "213",
        "post_title": "14. Blood stained tiles.\nA day at Monticello goes sour...",
        "comment": "Jemmy’s visits to Monticello were always the highlight of his journeys home. They met during a break in government early in April 1794. James Madison work as a House Representative did not allow him many days of reprieve to visit his friend at his house in Virginia, so those time that he could meet with his friend were always appreciated.\nJemmy sipped his brandy that had been proffered by Thomas, listening to the ticking grandfather clock.\nHe took a sip while their was a lull in their conversation. “I noticed the bust of Alexander Hamilton you had added to your entryway hall. Thomas.” He looked down at the brandy’s dark amber color. “That surprises me.”\nThe former Secretary of State merely shrugged.  “They will oppose themselves in death and in life.”\nMadison took another sip of whiskey. “I hope you aren’t telling me something, Thomas.”\nThomas laughed a little. “No, I’m in good health, Jemmy. So is Hamilton, I hear.” He gave his friend a concerned look replacing the mirth. “You don’t look well, Jemmy. Your hand is twitching.”\nJames glanced at his trembling hand, his lips pursed in concern. \"It's nothing to worry about, Thomas. I've simply been writing excessively lately.\" Rising to his feet, he added, \"May I borrow your water closet?\"\nJefferson frowned at Jemmy’s avoidance of the question. “You know where it is, Jemmy.”\nJefferson watched as his fellow Virginian nodded and exited the sitting room, leaving him alone with his thoughts. A heavy sigh escaped his lips as he shook his head in disappointment. He couldn't help but feel a pang of sadness, wishing that Jemmy would let down his guard and confide in him as Thomas often confided in him.\nHe waited patiently, listening to the grandfather clock in a corner, sipping slowly at his brandy. Looking up, Thomas found that it had been nearly ten minutes since his friend had left. His eyebrows knitted, concerned. Thomas got up and paced for a few minutes, more time ticking away and his worry heightening.  Finally, he gave a resigned sighed and went to find Jemmy.\nThomas cautiously approached the water closet, tapping gently on the door only to find it open.  An unsettling feeling gnawed at him. \"Jemmy?\" He called out, walking down a hallway that led to the kitchen. Perhaps his friend had gone for a glass of water. Silence greeted him, and his stomach twisted into knots.\nHe turned down a hallway. “Jemmy?” He found his friend lying face down prone on the tiled floor, blood smearing the tile. He rushed over to his side, kneeling away from the blood that had oozed from his head.\n“Jimmy!” He qently flipped his friend over, revealing a deep gash on his forehead. Stepping back in shock, he urgently called for help. “Jerome!”\nHis servant appeared, taken in the scene with a little shock before meeting Jefferson’s eyes. “Send for his doctor, quickly now! And tell Daniel to come help me!”\n*~*\nTwenty minutes later, Thomas was called into the room where Jemmy was being examined.\nDoctor Renault spoke up after straightening up. “He’s alright, Mr. Jefferson. He just hit his head on the table he was trying to steady himself on perhaps.” James sported a square bandage that concealed the left corner of his head,  his eyebrows knitted even in unconsciousness. His expression grew more serious. “Mr. Madison suffers from epileptic fits at times.”\nThomas cast a quick glance at his companion, his voice trembling as he echoed, \"Epileptic fits?\" He repeated with a tremble. Jemmy never mentioned that he suffered from that.\n“They aren’t usually very terrible, though things like alcohol can sometimes trigger them.” Doctor Renault continued.   Could that be the reason behind Jemmy's small sips of whiskey during their conversation?\n“He’ll be fine, Mr. Jefferson.” Doctor Renault remarked, packing up his bag. “Mr. Madison will likely need something to replace the lost blood. I recommend some broth or hearty soup. He’ll probably be dizzy, so you might want him to stay in bed for a while.”  He nodded to Thomas. “Good day, Mr. Jefferson.”\n*~*\nWhen Jemmy woke sometime later, he found Thomas in a chair next to him. His friend came over to the bed, face darkened with worry. “Jemmy? How are you feeling?”\nThe tall Virginian saw Madison wince. “My head aches.” He muttered, putting a hand to his forehead and felt the bandage with a frown.\n“You fell down in one of the hallways, Jemmy.” Thomas said quietly, “hit your head on the edge of a side table, apparently.” He poured a glass of water for Jemmy and handed it to him. His friend took it with a nod, then drank it down. “When you were going to tell me you suffered from epilepsy, Jemmy?” he asked quietly.\nJames looked at the glass rather than at Thomas. “I suppose the Doctor told you?”\nThomas pursed his lips. “He did.” He sat next to Jemmy again in the chair. “When are you planning to tell me?”\n“I was going to tell you tonight.” He looked down, his voice breaking. “Forgive me, Thomas. I didn’t want to burden you with my suffering.”\n“You’re my friend, Jemmy. I share your burdens and you share mine.” He placed a reassuring hand on his friend’s shoulder.  He stood, “Now, I’ve had my cook make you up a nice hearty soup. Doctor Renault said you would need to build back your blood. Shall we dine in here or would you like to sit in the dining room?”\n“Here would be fine, if that’s alright with you?” Thomas saw by the relaxed shoulders that a weight being lifted off Jemmy's shoulders. He smiled at his friend and thanked him for the kind gesture. They sat down to eat, enjoying the warm soup and the company.\nAs they finished their meal, Jemmy couldn’t help but feel a sense of contentment and peace. They both knew that no matter what challenges they may face, each had a friend by his side who would always be there for him."
    },
    {
        "title": "What is a Legacy?",
        "url": "https://archiveofourown.org/works/54262651",
        "fandoms": [
            "Hamilton - Miranda"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "05 Mar 2024",
        "language": "English",
        "words": "1,089",
        "chapters": "1/1",
        "comments": "1",
        "kudos": "30",
        "bookmarks": "4",
        "hits": "421",
        "post_title": "Day 28: \"No, not like this\"\nThe Marquis de Lafayette returns to America for a bittersweet reunion with the Hamiltons in 1784.",
        "comment": "Alexander and Eliza eagerly awaited the arrival of the ship carrying the esteemed Marquis de Lafayette at the bustling New York harbor. The news of this French revolutionary hero's visit had stirred up immense excitement, as it seemed the entire city had flocked to the docks to greet him.\nFinally, the ship called the Eagle arrived in the Harbor with much fanfare. There was a roar of cheers as Lafayette appeared at the gangplank, waving and blowing kisses.\nAlexander chuckled, \"He really knows how to steal the spotlight!\"\nAnd you don’t, darling?” Eliza teased.\n“C’est Moi? Never!” He gave her an amused smile.\nLafayette quickly spotted Alexander and Eliza in the midst of the bustling crowd, exchanging greetings with a warm smile. \"My friend!\" he called out, waving enthusiastically.  The sea of people seemed to part as Lafayette made it to the Hamilton’s side, embracing Alexander with a fierce hug.\n“It’s good to see you, mon ami!” Alexander grinned ear to ear, then gestured to Eliza, “You remember my wife, Eliza?”\nThere was a twinkle of amusement as he took her hand to kiss, huskily saying. “Enchante encore, Madame Hamilton.”\n“How was your journey over, Laff?” Alexander asked.\nLafayette's face twisted into a scowl. \"The ocean was incredibly turbulent. I had to stay holed up in my cabin for most of the voyage.\"\n“Ah well, you’re a good soldier, just a lousy sailor.” Alexander joshed, patting his shoulder in a mock conciliatory manner. He elbowed his friend. “Come on, I’ll tell the porter where to take your bags. You’ll be staying at our house.”\n“Merci, Mon Ami!” Lafayette beamed.\n*~*\n“Ah, so here is le petite princess!” Lafayette exclaimed as Eliza took the baby from her maid’s arms and placed them into the Frenchman’s arms. Angelica gurgled as Lafayette gently rocked her with a grin on his face.  “She looks like your dear wife, Mon Ami.”\nAt Alexander’s mock pout he amended with a laugh, “Though she has your face, Alexandre.”\n“You’re very natural at that, Monsieur.” Eliza said with a giggle.\nNow it was Lafayette’s turn to chuckle, “And why not? I have three little ones of my own.”\nEliza smiled kindly. “How is your wife and children, Monsieur Lafayette?”\nLafayette's face softened as he spoke fondly of his family. \"They are all well, merci. My wife is my pillar of strength, and my children bring so much joy to our lives.\"\nEliza nodded, clearly pleased to hear about their well-being. \"I am glad to hear that. Family is such a blessing, isn't it?\"\nLafayette nodded in agreement. \"Indeed, it is. I am truly grateful for my loved ones.\" He cooed at the baby who gurgled happily.\nFrom the back, they heard a door shut loudly and small footfalls on the wood floors. Phillip came in, wearing his nicest dark blue suit that had patches of dirt on it.\n“Phillip Hamilton!” Eliza admonished, “You were not to get your suit dirty as we were expecting company!”\nThe youngest Hamilton boy just gave him a toothy smile and looked only slightly sorry. “Sorry, mamma.”\nAlexander just put a hand on his son’s back and chuckled. “Monsieur Lafayette, this is my son, Phillip.”\nLafayette's eyes twinkled as he looked down at Phillip, his face breaking into a warm smile. \"Ah, a chip off the old block, I see,\" he said teasingly. \"I was causing trouble too when I was your age.\"\nLafayette's easy charm and playful banter put Phillip at ease, and soon the three of them were engaged in lively conversation, sharing stories and jokes as if they had known each other for years. The elder Hamilton looked on with a sense of contentment, happy to see his son forming an easy acquittance with the Frenchmen.\nAlexander smiled at the sweet interactions between the two, before his felt tears well up.\nIf only Laurens were here to share in this....\n*~*\nLater in the night, after the children and Eliza had gone to bed, Lafayette found a light burning from under the door of Alexander’s office. Knocking softly he heard a soft “Come in.”\nAlexander was slouched in his desk chair with a drink in his hand, a bottle half empty on the desk.\n“Mon ami? You’re drinking without me?” He said trying to sound amused.\nAlexander gave him a sad smile and gestured to the couch. “Have a seat.”\nHe found another glass and poured some alcohol and handed it to the Marquis.\n“So,” Lafayette began, twirling the liquid in the glass. “Why are you down here drinking alone, Mon Ami? Have I done something to make you unhappy?”\nAlexander blurted out a firm \"No!\" before shuffling awkwardly in his chair. He gave his friend a sad look. “I love that you’re here, but….” He took a sip of his drink. “It reminds me of our drinking days back in the army. I….”\n“You miss Laurens, don’t you?” Lafayette said quietly.\nAlexander nodded, his eyes welling up with tears. \"I miss him every day,\" he admitted. \"I can't believe he's gone. Not-not like this.\" He looked up to Lafayette, holding a hand to his mouth and swipe away the tears. “Why-why did he have to die, Laff?” he asked hoarsely. “The war was over. He didn’t have to fight any more...”\n“Alexander,” Lafayette sighed, “John fought because he believed in the cause. He wanted to set slaves free and the only way he thought to do so was to fight.”\nAlexander furrowed his brow, still struggling to understand. \"But was it worth it? Was his sacrifice worth it in the end?\"\nLafayette paused, choosing his words carefully. \"John's sacrifice, like all sacrifices made for freedom and justice, may not always seem worthwhile in the moment. But his legacy lives on, Alexander. His bravery and his passion will inspire generations to come. We must honor his memory by continuing the fight for the ideals he believed in.\"\nHe reached out and squeezed Alexander's hand in a gesture of support. \"I understand, my friend. Laurens was a great man, and he will always live on in our memories.\"\nThe two friends sat in silence for a moment, lost in their thoughts and memories of their fallen comrade. Finally, Lafayette spoke up. \"Let's raise a glass to his memory and his legacy.\"\nAlexander managed a small smile through his tears and raised his glass. \"To Laurens,\" he said softly.\n\"To Laurens,\" Lafayette echoed, clinking their glasses together. And in that moment, they found comfort in each other's presence and in their shared grief."
    },
    {
        "title": "Observing the Unseen",
        "url": "https://archiveofourown.org/works/55353538",
        "fandoms": [
            "Hamilton - Miranda",
            "18th Century CE RPF"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "21 Apr 2024",
        "language": "English",
        "words": "1,103",
        "chapters": "1/1",
        "comments": "4",
        "kudos": "20",
        "bookmarks": "2",
        "hits": "202",
        "post_title": "As the soldiers prepared for the historic battle of Monmouth in 1778, the aides de camp of Washington are unexpectedly treated to a mesmerizing celestial spectacle - a solar eclipse.",
        "comment": "Summer had taken full possession of the Eastern Coast. Washington’s troops were buzzing about the camp, readying for a campaign at Monmouth Courthouse that was to commence four days hence. But that was not the only event that was bringing about both excitement and fear among the men; on the 24th of June, there was to be a solar eclipse that had been reported in newspapers at the beginning of January.\nNothing in Washington’s inner circle had changed despite the solar event. Battle plans were still being drawn up, the office was busy with more correspondence being written, orders were being directed by the Commander-in-Chief of the army. The aides-de-camp were not so busy as that they scarcely discussed topics that were not related to the upcoming battle at dinner. Except for tonight, when they had a reprieve long enough to talk about something else.\n“Did you see the newspaper today? There’s to be a solar eclipse the day after tomorrow.” John said between the bits of his meager stew of salted beef and potatoes.\n“Some of the soldiers are calling it a bad omen it being so close to the upcoming battle.” Alexander sighed and rolled his eyes.\nLafayette shrugged, “I see it as a good omen. The brightness of the Revolution, the periods of darkness where we’ve lost battles, and the sun re-appearing means our cause will shine brightly again with won battles.”\n‘You are very optimistic,\nMon Ami\n.” Laurens said with a quirked smile.\n“Though I will admit that I have not ever seen a solar eclipse before in my life. It will be interesting to observe it given the chance.”  Meade returned.\n“Nor I. Let’s just hope we’re not overwhelmed with paperwork.” Hamilton added dryly.\n“I mean, it’s not going to be hard to miss, really.” Laurens laughed.\nAs the group continued to discuss the upcoming solar eclipse and its possible implications, the conversation in the room shifted again towards the coming battle at Monmouth.\nAlexander would be glad of the distraction of this celestial event to calm his nerves about the fight. There was something in the air that made him uneasy. He felt something was going to go wrong.\n*~*\nThe hours before the eclipse was just as busy as usual. Washington’s aides-de-camp were kept busy with their work, all the while tilting their heads out the window to keep an eye on the sky or their pocket watches.\n“I don’t think a few minutes break would go amiss.” Hamilton remarked, putting down his quill and capping his ink.\nLafayette grinned, “You read my mind, mon ami!”\nThe others chuckled while putting away their writing utensils and pushed back their chairs. Each of them stretched, grateful for the exercise after so many hours seated. They all stepped outside onto the small patch of dirt generously called a lawn and stared up, with their hands over their foreheads to shield them from sunlight.\nMeade pulled out his pocket watch and glanced at it. “It should be starting any time now. The newspaper said the eclipse should begin at 3:19 pm.”\nIt doesn’t look as though it has changed.” Alexander remarked squinting up at the sun.\n“Alex, don’t look directly at the sun, you idiot!” Laurens snapped.\nHamilton closed his eyes sharply then winced. He slowly opened them, squinting and shielding them with his hand. He stayed still for a few moments, adjusting to the brightness.\nFinally, at 3:30, as the sky began to dim, the soldiers began to gasp. Lafayette and Laurens leaped up from the stairs.\n\"It's beginning!\" Lafayette shouted, standing on his tiptoes as if trying to catch a glimpse of the sky. \"Look at that!\" Lafayette exclaimed, pointing up at the darkening sky.\nThe Moon slowly began to creep in front of the sun, the group watched in awe as the sky grew darker and a strange twilight settled over the land.\nSlowly, the sun became more and more obscured, the crescent becoming smaller and smaller as the smaller body of the Moon overtook it.  A sense of anticipation filled the air. Meade felt a shiver run down his spine, a mixture of excitement and wonder at the celestial event unfolding before their eyes.\nThe whole camp seemed to hold its breath as the moon completely covered the sun, casting a shadow over their little part of the world. The temperature dropped, and a hush fell over the group as they experienced the breathtaking beauty of the total solar eclipse.\n“\nC’est Incroyable\n!” Lafayette whispered in awe. \"Mon Dieu! But it’s like dawn!”\n“Look at that bright light at the right corner.” Alexander remarked, “I wonder if that is the sun re-appearing.” He turned, tilting his head while his eyebrows furrowed. “Do you hear that?” He pointed his finger upwards. “There are no birds chirping now. I think they are just as discombobulated!”\n“It’s quite a sight isn’t it, gentlemen?” A deep voice from behind them called, making them all whirl around to see the General striding towards them. The group all saluted, looking as though they were ready to take a reprimand.\n“You’re Excellency,” Hamilton started, “We did not mean to abandon our duties during such a critical period before a battle-”\nWashington raised his hand. \"No worries. I wouldn't want to miss out on witnessing such a rare celestial phenomenon; one that we might never get to see again.\" He gazed up at the solar eclipse. “It’s quite a sight to see, no?”\n“What do you think that ring around the sun is, sir?” Alexander wondered.\n“Perhaps,\" Washington replied, raising his chin up to the eclipse, \"it’s the atmosphere of the moon, or that of the sun.” Washington commented.\n“Well, whatever it is, it sure is a beautiful sight,” Laurens added.\n“It looks like light surrounding a void,” remarked Lafayette with wonder in his voice.\n“That’s not eerie or anything, Lafayette,” scoffed Meade.\nA few moments later, the moon began to move away from the sun, beginning to chase away the shadows. The ring of light around the sun grew brighter as the moon slowly moved out of its path. The sky gradually began to lighten.\n“Sunrise again.” Laughed Alexander, his breath catching as it indeed felt as though dawn was breaking for a second time that day. It wasn’t long before afternoon sunshine returned to the sky. The soldiers murmured but went back to their duties.\nThe group stood in awe as the eclipse passed.  Washington turned to his companions with a smile. \"Well, gentlemen, it seems we have witnessed to something truly extraordinary today. Now, shall we get back to work?”"
    },
    {
        "title": "The Hamilton Family's Easter Delight: 1786 Edition",
        "url": "https://archiveofourown.org/works/54800686",
        "fandoms": [
            "Hamilton - Miranda",
            "18th Century CE RPF"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "F/M",
        "status": "Complete Work",
        "published": "29 Mar 2024",
        "language": "English",
        "words": "1,124",
        "chapters": "1/1",
        "comments": "2",
        "kudos": "15",
        "bookmarks": "2",
        "hits": "189",
        "post_title": "Alexander and Eliza's family Easter celebration with Phillip and Angelica in 1786.",
        "comment": "Alexander popped one eye open as he heard the doorknob wriggle from the outside. Eliza heard it too; letting out an exasperated sigh.\n\"Darling, it seems we're on the verge of an invasion,\" Alexander remarked, a mischievous smile gracing his lips as he leaned in to give her a tender kiss.\nThey both sat up as the door flew open and Phillip charged in excitedly, followed by his two-year-old sister Angelica. Eliza picked up her daughter, while her son climbed up onto the bed so that he was between his parents.\n\"Guess what? It's Easter!\" Phillip exclaimed; his eyes gleaming with excitement.\nEliza ran a hand through her son’s dark hair, “Yes, sweetheart.” She kissed his cheek. “Happy Easter, Phillip.”\n“Happy Easter, Papa, Mama!” Phillip exclaimed, giving them each a hug.\nAngelica repeated in a high squeak, “Happy Easter!”\nAlexander squeezed his children, kissing each on the head with a chuckle. \"Happy Easter, my little lambs,\" he said, feeling grateful for the joy and love in his family.\n“Can we go look for Easter eggs, mama?” Phillip looked up to his mother eagerly.\nEliza frowned, “Now Phillip, you know we are going to church first.”\nPhillip’s face fell in disappointment for a moment. Then his eyes lit up. “Can we after church?”\nEliza sighed, “Yes dear, we can.” She kissed his forehead again. “Now, go get dressed so we can have breakfast.”\n“Yay!” Phillip yelled as he slid off the bed and tore out of the room before Eliza could admonish him.\nEliza shook her head, “That boy sometimes…”\n“Ah, he should enjoy this day, my dear.“ Alexander laughed a little.\nEliza smiled at her husband, “I know, I just want him to remember the real reason for Easter.”\n“I’m sure he will, Eliza. He’s a smart boy,” Alexander reassured her.\nShe smiled, “He gets that from his papa.” Eliza groaned and got up out of the bed with Angelica, who she set on the floor and took her hand. She was eight months pregnant with their third child. Eliza chuckled as the little girl tried to keep up with her waddling pace.\n\"You're going to be a big sister soon, Angelica. Are you excited to meet your new baby brother or sister?\"\nAngelica nodded eagerly, her young face lighting up with excitement. Eliza couldn't wait to see the bond that would form between her children, just like the one she shared with her sisters.\n“Sweetheart, do you want me to get Angie dressed?” Alexander offered, looking lovingly at his wife.\n“No, I’ll be fine, Alexander. Just go see that our son is, will you?” She instructed while padding out the door with their daughter.\nAlexander yawned, pushed the covers aside, and stretched, a smile spreading across his face as he gazed at the blossoming tree and clear blue sky outside the window. Today would be a good day indeed.\n~*~\nAt breakfast, the family were treated to Dutch pancakes that were thin versions of French crepes, eggs, and salmon. Coffee was prepared for the adults and orange juice for the children, the oranges being an Easter gift from the Schuyler's, as well as fruit preserves for the table. Philip eagerly shared his strategy for finding the most eggs, while little Angelica insisted on wearing her best bonnet for the occasion.\nAt its end, Alexander reclined in his chair and grinned. “That was the most delicious breakfast! We shall have to send a note to your father to thank him for the things he sent down for us.”\nShe nodded before looking up at the clock. “We had best hurry; we don’t want to be late for church.” Eliza glanced over to her son. “Phillip, you may get down. Go put on your coats and wait for us.”\nAfter ten minutes, the family of four strolled through the bustling streets of New York City on their way to Trinity Church, enjoying the fresh April breeze. They looked up at the blossoming trees and birds. Eliza held Angelica in one arm while holding Phillip’s hand with her left. Alexander held his son’s other one while Alexander pointed out the birds flying to various trees.\n“Look Phillip, there’s a blue jay,” Alexander exclaimed. \"That's a sure sign that spring is here if they are back from wintering in the south.\"\n“Wow, look at it fly!” Phillip responded; his eyes wide with wonder.\nAs they entered the church, Eliza and Alexander greeted their friends and neighbors with warm smiles and handshakes. They took their seats in the pew near the front, holding hands as they listened to the priest as they said hymns, prayers, and readings. The church was filled with the sound of hymns being sung by the congregation, creating a sense of peace and unity among those gathered.\nAfter the service, Eliza and Alexander stayed behind to chat with their friends, discussing the message of the sermon and sharing updates on their lives. Seeing her son getting antsy, Eliza smiled. “You’ll have to forgive us, it’s time for us to go home and search for Easter eggs.”\n~*~\nAlexander's face lit up with a smile as he observed his little ones exploring the backyard, clutching small baskets in their hands, eagerly hunting for Easter eggs. Eliza leaned against her husband, resting her head on his shoulder, a peaceful smile gracing her face as she watched their children. Her smile widened even further as she heard their delighted squeals of joy each time they discovered another hidden treasure. The previous night, after Phillip and Angelica had gone to sleep, Eliza and Alexander had spent time together, meticulously boiling and dyeing eggs using natural ingredients like onion skins, beet juice, madder root, dandelion greens, and coffee grounds.\nIt had been a labor of love, but the look of wonder on their children's faces made it all worth it. As the kids ran around the yard, their laughter filling the air, Alexander couldn't help but feel grateful for his family. He wrapped an arm around Eliza, pulling her close as they watched their children continue their Easter egg hunt. Eliza rubbed her large belly and turned to Alexander and whispered, \"This is such a beautiful day, isn't it? I'm so grateful for our family and for moments like these.\"\nAlexander nodded and kissed her forehead, his heart full of love. \"Yes, it truly is. I feel blessed every day to have you and our children by my side. I hope we can continue this tradition for many more years with them.\"\nThey sat in comfortable silence, watching their children laugh and play in the early spring sun. Surrounded by love and happiness, Alexander couldn't help but feel at peace, knowing that they were building memories that would last a lifetime."
    },
    {
        "title": "Stay alive ‘til this Horror Show is Past",
        "url": "https://archiveofourown.org/works/53952112",
        "fandoms": [
            "Hamilton - Miranda",
            "18th Century CE RPF",
            "American Revolution RPF"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "17 Feb 2024",
        "language": "English",
        "words": "1,168",
        "chapters": "1/1",
        "comments": "2",
        "kudos": "17",
        "bookmarks": "2",
        "hits": "189",
        "post_title": "Day 17: Captive Situation\nA prequel to Alexander being captured and sent to England (Prompt 2,3, and 4)",
        "comment": "Alexander Hamilton was wary around Benedict Arnold these days. He had respect for the man; he was a good soldier after all. And he was a brave one as he was shot in the leg during the battle of Quebec that caused a permanent limp, and again in the second battle of Saratoga that he recovered from with little difficulty. They had been cordial and professional during their meetings, but Alexander sensed a change in the man, he seemed cagey and on edge all the time. He had read the letter from Peggy Shippen to Arnold. Though not couched with overt undertones of treason, they had begun their suspicions of the pair, and Alexander was sent under false pretenses to Arnold’s house to gather surveillance.\nGeneral Washington sent Alexander to deliver a message to General Arnold.  Alexander calmly approached the entrance of the luxurious mansion that Arnold had recently acquired. Mrs. Peggy Arnold, formally Peggy Shippen answered the door herself, which surprised him. He however bowed and straightened up before asking, “Is General Arnold at home?”\nHer pretty expression turned confused. “And you are?”\n“Lt. Colonel Hamilton, ma’am.,” he answered, touching his cap. “I have a letter for your husband from General Washington.”\nHer expression was one of puzzlement as she stepped out of the door frame to let him step inside. “I’ll tell my husband that you’re here, Colonel Hamilton.”\nAlexander waited at parade rest as the woman disappeared and Arnold appeared, saluting him as he closed the distance between them. “Colonel Hamilton? What brings you here?”\nWith a respectful salute, he passed the letter to General Arnold. \"A message from General Washington, sir.\"\n“Yes, of course.” Arnold returned pleasantly. “I appreciate you making the trip to deliver this.\"\nAlexander merely nodded. “Just doing my duty, sir.”\nArnold gave him a tight-lipped smile. “Well, thank you, Hamilton. I-”\nAt that moment, another soldier entered the parlor who Alexander knew was Major Anderson. “Ah, Colonel Hamilton, good day.”\nHamilton nodded his head. “Good day, Major Anderson, I just came to deliver a letter to General Arnold. I shall take my leave now that my duty has been dispensed. Good day, gentleman.” He bowed shallowly, then exited the house.\nAlexander still felt something was off even as he mounted his horse. Better to stay out of sight and observe. He walked his horse onto a high cliff that was hidden by trees but had a good view of Arnold’s house. It wasn’t long before Arnold and Anderson appeared outside. His attention returned to the Redcoats galloping up to the house and got off their horses before saluting both. Why was Arnold meeting Redcoats...their enemy? With a sickening realization, Hamilton realized that Arnold and Anderson were turncoats.\nHe was about to turn tail and race back to General Washington’s headquarters when a rather large stone tumbled down the cliff face loud enough that it caused the soldiers to look up at Alexander’s position on the cliff, as he ducked behind a tree to hide himself. Both the turncoats and the British soldiers scrambled back onto their horses.\nAlexander ran towards where he had hidden his horse and took off with hope that they would not follow, taking a less traveled road to throw them off the scent. Silently he prayed that there would be a shelter or home he could duck into for shelter and safety.\nHe didn’t hear a horse’s cantor behind him and allowed his heart to slow. Alexander rode a while until he saw a small ramshackle wood home whose chimney smoked merrily. He sighed in relief as he slowed his horse until he reached it. Alexander went to the back of the house to the stables found no horses. Odd. Perhaps the men of the household were out for work. Leaving his horse there, Alexander went to the front door and knocked. There was no answer.\nHow curious Alexander thought. After a few knocks, Alexander tentatively jiggled the doorknob and twisted it, surprised to find that it was open. Cautiously stepping in, he called loudly enough to be heard in the small house, “Hello? Is anyone at home?” He was again met with silence. His senses heightened; Alexander could sense something was not right about this situation. He pulled out his pistol and held it out, just in case.\nHe went from the tiny parlor to the kitchen, finding that no one seemed to be here. Sweat began to trickle down his forehead to his neck. Alexander heard a thump from a far room and his heart raced again and he heard the sound again. His eyes went wide when he found a dark-haired peasant woman and her daughter tied up and gagged back-to-back, looking up at him with terrified eyes.  Holstering his weapon, Alexander rushed to their side to untie them, freeing them of their gags.\n“I’m Lt. Colonel Hamilton.” He said gently. “What happened, ma’am?”\nThe woman said between breathless sobs, “A-a Redcoat came in here, he said they were waiting for an enemy soldier to pass by!”\nFrom behind him, he heard the click of a gun. “Nice to meet you, Colonel Hamilton.” a high toneless man’s voice rang behind him.\nAlexander raised his hands and stood to face the man who was a rough looking British soldier. How did you know I’d be here?” He growled.\nThe soldier flashed a wide grin, revealing his teeth. \"We've been tailing you ever since you set foot in West Point. The Major predicted you'd start poking around once he showed up. It was only a matter of time before you made your move.\"\nAlexander's stomach churned with unease. It was all a trap. The letter from Washington was genuine, but encountering Arnold and Anderson with the British troops was a setup. The moment he attempted to slip away back to his camp, he was being shadowed.\n“General Arnold will reward me for capturing you.” The soldier sneered, disarming Hamilton of his pistol and saber. Wrenching Hamilton’s hands behind his back, he shouted to the woman. “Get me some rope, woman!”\nThe lady of the house nodded with fright and retrieved the ropes and offered them to the British Soldier who sneered.  “Tie him up!” At her hesitation, he yelled “NOW, WOMAN!”\n“There’s no need for that,” Alexander snapped. “You’re frightening the lady and her child.”\nThe British soldier laughed cruelly, not taking Alexander seriously. \"Oh, and who's going to stop me? You, the prisoner?\"\nShe jumped and did as she was told, tying the rope around him, all the while casting him an apologetic glance that met his gaze. His response was a mere nod, silently acknowledging that she was taking this action solely to protect herself and her daughter from harm.\nThe Redcoat pushed Alexander in front of him, then turned back his head to the woman. “Thank you for your hospitality, ma’am.”\nHe kicked Alexander in the back, making him stumble and the officer to laugh. \"We have plans for you, Hamilton.\""
    },
    {
        "title": "And the Hope That You Provide",
        "url": "https://archiveofourown.org/works/54005923",
        "fandoms": [
            "Hamilton - Miranda"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "18 Feb 2024",
        "language": "English",
        "words": "1,303",
        "chapters": "1/1",
        "kudos": "67",
        "bookmarks": "7",
        "hits": "631",
        "post_title": "18. Too weak to move.\nAlexander grows sick just as Martha Washington arrives at camp.\nA/N: Edited for mistakes 4/16!",
        "comment": "Alexander shivered uncontrollably as he lay in his tent at Morristown. The bitter cold seemed to seep into his bones, and his chest burned with each painful breath he took. He knew he was sick, but he had hoped that it was just a minor cough or cold. He had taken ill before the battle of Trenton but insisted on marching to the battlefield. He had also taken part of in the battle of Princeton, his health only slightly better. But in the days after the battles, his condition only worsened. Despite his illness, Alexander tried to remain stoic and soldier on. He continued to fulfill his duties as best as he could, but it was clear to his comrades that he was struggling.\nOne evening in mid-January, Hercules found Alexander stumbling slightly back to his tent and walked alongside him. “Hey Alex? You alright?” His eyebrows knitted with concern, “you look a little pale.”\nAlexander just waved a dismissive hand after a coughing fit. “I’m fine, Herc; it’s just cold.”\nHer\nHis friend gave him an unconvinced look, but soon changed the subject. “Did you hear who’s coming to Morristown?” At Alexander’s puzzled expression, Mulligan said, “The General’s lady.”\n“I see…” Alexander said distractedly.\n“Well, don’t sound enthusiastic or anything.” Hercules said, rolling his eyes.\n“It’s not as though she’s going to visit the men in the cabins, Herc.” He sighed, though I have orders for the men to freshen them up and clean up the camp.” He gave his friend a re-assuring smile. “I’m going to turn in for a while. We have to start work tomorrow.”\n~*~\nThe next day, Alexander oversaw the men as they worked to clean up the camp in preparation for Mrs. Washington's visit. He worked tirelessly, making sure that every detail was perfect, and every task was completed to his high standards.\nAs the day wore on, Alexander couldn’t help but feel a sense of pride as he saw the camp begin to transform into a more presentable and welcoming place. He knew that the General’s lady would be impressed with their efforts, and he was determined to make sure that everything went smoothly.\nWhen General’s Washington's wife finally arrived, Alexander stood off to the side, watching with a sense of satisfaction as she waved to the men from inside her carriage. When the carriage passed by, Alexander coughed harshly.\n“Alex?” Mulligan held his shoulder as he coughed.\n‘’'m alright.” Alexander said breathlessly.\nHercules held his shoulders and guiding him back to his tent.\n~*~\nOne night, as the wind howled outside and the snow fell heavily, Alexander's condition took a turn for the worse. He was wracked with violent coughing fits, and his breathing became labored.\n“Alex?” Laurens called after knocking on his private quarters. When there was no answer, Laurens entered the tent at his leave. He found the younger man doubled over trying to catch his breath.\nHe heard Laurens yell and his comrades rushed to his side, their faces grim with worry. \"We need to get him to the hospital tent,\" one of them said urgently. They carefully lifted Alexander and carried him through the freezing night to the medical tent.\nA doctor came into his view, peering down at him. To his friends, he asked, “What’s wrong?”\nA muffled voice called above him, “coughing…. can’t breathe…”\nAlexander's forehead was met with a cool touch. \"He's running a fever,\" someone exclaimed. His chest was exposed, with a hand pressed against it.\nIt was impossible for him to control the shiver that ran through his body. An illness was extremely dangerous. especially so when combined with the lack of proper food rations and the freezing temperatures. However, before he could dwell on these thoughts any further, Alexander succumbed to the overwhelming fatigue and drifted into a shallow slumber.\n*~*\nHe felt something soft being lifted to his shoulders, a quiet feminine voice gently hushing him. Was that his mother trying to comfort him while he was ill? Alexander felt so cold even as flushes of heat stole over his body.  He opened his eyes to find an old woman with a round face and a kind expression looking down at him. His foggy brain took a moment to realize that she was not one of the nurses that cared for patients, but Lady Washington herself.\n“Ma’am?” he croaked tiredly trying to nod his head slightly, though it made his headache.\nShe smiled sweetly. “Would you care for some water?” With a slight nod, the Lady lifted his head and pressed a tin cup to his lips. He took a few sips before shaking his head to signal that he didn’t want any more. Her expression became a little sad, “I’m sorry you’re so ill, Captain Hamilton.” Her look was one of concern. “My husband wrote me that you were to be promoted to Colonel and become his new aide-de-camp.” She swept a hand through his sweaty hair and half-smiled. “You are so young! Though, much could be said for that young Frenchman….  Monsieur Lafayette?”\nAlexander laughed a little which turned into a cough.\nLady Washington offered him more water.  We shall get you better, young man.”\nAlexander nodded weakly, grateful for her kindness. “Thank you, ma’am. I appreciate your care.”\nLady Washington patted his hand gently before standing up. “Rest, Captain Hamilton. I will check on you later.”\nAs she left the room, Alexander felt a sense of comfort wash over him as his tired eyelids began to fall. He was in good hands with Lady Washington looking out for him.\n*~*\nHis fever didn’t abate that night; in fact, it raged like a wildfire while he turned in its throes, a cold cloth pressed to his forehead while a feminine voice repeated quietly that he would be okay.\n“Come Brave Heart, you can beat this fever.” He heard Lady Washington’s voice; she whispered soothing words, her hand brushing back his damp hair. He groaned in pain, his body trembling with chills as the fever and pained coughs continued to torment him. But her presence brought a sense of comfort, a sliver of hope in the darkness of his sickness.\nDespite the passing days, his fever continued to rage, leaving him in a state of confusion. In those brief moments of wakefulness, he could only make out the faces of Lady Washington and the doctor. Alexander's delirium caused him to be trapped in the suffocating heat that reminded him of the nights he battled illness while his mother succumbed to it.\nClutching his blankets tightly, he whimpered, desperately pleading, \"Please... I don't want to die.\" His tormented mind remained on that island, in the same bed where his mother took her last breaths, unable to escape the haunting memories.\nLady Washington reached out, grasping Alexander's hand in comfort. \"You will not die, my dear. We will care for you and help you through this sickness.\"\nThe doctor worked tirelessly, administering medicines and cool cloths to bring down his fever and relieve his terrible coughing fits. Lady Washington's eyes were calm even as she continued to sit by his side, offering words of encouragement and prayers for his recovery.\nAs the days passed, Alexander's delirium began to lift, his fever broke, leaving him weak but alive.\nHe slowly regained his strength. He looked up one morning to find the Great Lady humming quietly while darning socks. Alexander glanced gratefully at Lady Washington, his voice hoarse as he whispered, \"Thank you.\"\nLady Washington smiled softly, brushing a strand of hair away from his flushed face. \"You are strong, Alexander. You have survived so much already, Brave Heart.”\nAlexander never forgot the kindness and compassion shown to him by Lady Washington. She had been his saving grace in his time of need, and he carried her memory with him."
    },
    {
        "title": "If You Can't Stand the Heat",
        "url": "https://archiveofourown.org/works/59484430",
        "fandoms": [
            "Hamilton - Miranda",
            "18th Century CE RPF"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "05 Oct 2024",
        "language": "English",
        "words": "1,344",
        "chapters": "1/1",
        "kudos": "12",
        "bookmarks": "2",
        "hits": "271",
        "post_title": "The march to Yorktown has a hiccup when Alexander and Lafayette fall ill on the road.",
        "comment": "August was proving to be worse than anything John Laurens had experienced in his home state of South Carolina, made worse by wool coats they wore. The march was long and arduous as the sun beat down on the Continental Army. Alexander shifted in his saddle, watching the men behind him trudging along, slumped and quiet. The army was advancing through Maryland now; the soldiers trudging along silently, their packs clacking and footfall heavy.\nHe turned to them in his seat and grinned. “Not much further men! Forward to victory!” Then began to sing ‘Yankee Doodle’, which made them perk up and join in. The final refrain resulted in a cheer and laughter from the soldiers.\nNext to John, Alexander grinned and turned back around to the road in front of them. Though the smile was short-lived, sweat barely visible on his skin from the heat,\n“Alex,” John Laurens galloped nearer to him with a concerned glance. “You alright?”\nAlexander waved a dismissive hand, “I’m fine, John...thank you.” His jaw set. “I wish we weren’t wearing these heavy things.” He plucked at the wool coat.\n“Merde!” The Marquis muttered so that their Commander would not hear their complaints, “This is worse than Monmouth.” He reached for a handkerchief and dabbed his forehead. His eyes fluttered downwards. “I am so weary, and my muscles ache.”\nJohn reached for his canteen and passed it over to Alexander and Lafayette, who both gave a nod of thanks before taking a few large swigs, then returned it to him.\nAlexander sighed shakily, “This march is taking longer than I expected, we’re going slower than I hoped we would.” He pressed his own handkerchief across his skin. “I didn’t think the heat in St. Croix was terrible. This is downright oppressive!”\nJohn gave him a discerning look. 'You look pale. Are you alright, Alex?' John asked again, \"'Laff?'\n“It will be better when we’ve stopped for the day.” Lafayette groaned.\nAlexander looked up to the direction of the sun, “That won’t be a few hours yet.”\nLafayette sighed discontentedly.\n“Colonel Laurens!” Washington’s deep timbre called him. He nodded to his friend to gallop up to their leader’s side. After a few words were exchange, John shot his friends an apologetic look. “Take care of yourselves until I get back, yeah?” Laurens galloped forward with Tilghman, out of sight in a matter of minutes.\n*~*\nAn hour later, Laurens rode back to his friends’ side. Alexander’s head was slumped down onto his chest as though he was asleep, but his breathing seemed fast. Alarmed, Laurens put a hand to his friend’s next and pulled his hand back. Alexander’s skin was hot, but not sweating. Wedging himself between Alexander and Lafayette, he checked the Frenchman’s skin as well, equally overheated and pale.\nLaurens felt panic rise within him. “Hammy!” He shouted, giving the smaller aide’s shoulder a shove. He remembered at Monmouth Alexander had succumbed to heat exhaustion after being thrown from his horse.\nTo his relief, the man roused, lifting his head to look at him, though his eyes were distant. “M-mother? M’ so hot. Sleepy.” His confused expression shot fear through him. “Who-? J-James?”\nLaurens recognized the signs of sunstroke evident in his friends' condition. He placed a hand on Alexander as his eyes fluttered shut, and he slid sideways off his horse, only saved from falling by Laurens’s quick reflexes.\n“Sir!” He called to Washington, “It’s Hamilton and Lafayette! They’re ill! Medic!”\nWashington gave the signal for the convoy to stop while he turned his horse to face his three aide-de-camps, his usually passive face turned concern at the sight of Alexander and Lafayette. He grabbed for the Marquis before he too could collapse off his mount.\nIt had taken a few calls before Doctor Cochran rode up; his face serious. “What’s wrong?”\n“I think they’re suffering from heat illness.” Laurens said quickly. He leapt off his horse and assisted getting both men off their own mounts. The doctor swiftly checked the men’s condition and confirmed Lauren’s fear.\" They both appeared flushed and disoriented, suffering from severe heat exhaustion.\n“It’s not as severe as it could be.” Cochran said, looking up at Laurens over his glasses. “They need to be cooled down immediately, however.”\nWashington assessed the situation then raised a hand to stop the convoy. “We’ll stop five miles down the road at a clearing found by Colonel Tilghman. Set up the medical tent and treat anyone else suffering from the heat. We’ll need a cart!” He directed Tilghman and McHenry to take their horses.\nThe men peeled away from the line and went about their directives, while the men shuffled past with looks of dismay and empathy, that neither Hamilton nor Lafayette would have warranted had they been awake.\nWashington turned back to Doctor Cochran. “What can we do to assist, doctor?” His voice was slightly strained as he looked over to the two boys he considered surrogate sons.\n“First of all, we need to rid them of these woolen things, then attempt to cool them down.”\n“There’s a stream not too far off from here, I saw it in passing.” Laurens remarked, glancing down at Hamilton’s knitted eyebrows.\n“You’ll have to carry him, sir.” Cochran remarked. “I'm afraid my strength isn’t what it used to be.”\nThey hurried towards the river, both cradling their ill companions gingerly in their arms, searching for a more secluded spot near the water. Laying the men on the riverbank, Washington worked to divest Lafayette of everything down to his smallclothes, Laurens doing the same for Hamilton before gathering the younger man in his arms.\n“Sorry about this, Alex.” He muttered, as he settled his friend into the shallow stream, head resting against the riverbank. Alexander's hair would be muddy, but that was a minor problem to be fixed later. John held him up under the arms; the chilly water enveloped both of them. He hoped that the river’s water would cool Alexander’s mounting fever. Alexander, in the meantime, shuddered and began to thrash about.\n\"No Alex! Stay still! You're safe! We're just trying to cool you down.\" Laurens called, putting a hand to Alexander's bare shoulder.\nHe glanced over to see Washington’s resolute expression as he held Lafayette aloft, the doctor taking sick Frenchman’s pulse.\nLaurens felt the water invading his boots but ignored it, the current sweeping around both immersed men. He checked Alexander’s forehead and found it slightly less heated.\nAlexander’s eyes fluttered open, clearer than before, his gaze fixating on Laurens. “J-John.”\n“Stay with me, Alex.” He said with a mixture of relief and lingering concern, scooping up a little water and pouring it over his ill friend's head.\n“M-mon General?” Laurens heard Lafayette croak.\n“Thank goodness, they’re beginning to come out of it.” Doctor Cochran said.\nLaurens saw General Washington let out a breath between his teeth and whisper, “Thank God.”\n“I don’t believe I will have to bleed either of them. They will need some time, water and rest to recover.” Doctor Cochran remarked.\n\"We can delay for a few days,\" Washington said between his breath, \"but no more than that.\"\nA cart appeared on the dirt path, pulled by a soldier and horse. Both he and General Washington took up the now sodden Major-General and trudged back up the hill to the awaiting cart, Laurens soon following with the limp form of Alexander. The cart was laden with straw, onto which they carefully loaded the men and covered them with a thin blanket to their midsections. Cochran scrambled up and perched between them, taking each man’s pulse again.\n\"I will ride ahead and see that the medical tent is ready,” Washington said as he mounted his horse. He nodded to Doctor Cochran and Laurens. “Take care of them.”\nLaurens mounted his own horse and trotted at the same speed of the horse and cart, keeping his gaze fixed on the prone figures of Lafayette and Alexander. As cooler evening air finally began to descend, Laurens hoped for an easy recovery for his friends."
    },
    {
        "title": "Ask Anybody Why We Livin' Fast and We Laugh",
        "url": "https://archiveofourown.org/works/53666455",
        "fandoms": [
            "Hamilton - Miranda"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "09 Feb 2024",
        "language": "English",
        "words": "1,355",
        "chapters": "1/1",
        "comments": "1",
        "kudos": "17",
        "bookmarks": "1",
        "hits": "195",
        "post_title": "Day 9: Bees\nA day off, bees, and drunken shenanigans. What could go wrong?",
        "comment": "On a beautiful April day, four officers from the Continental Army made their way through the lush forests of New Jersey, their horses trotting gracefully. It was a rare day off, no more letters needed to be written, no more battle plans to draw up. Washington's aides gathered closely, sharing laughter that may have been a touch too boisterous, all thanks to the influence of a bottle of wine thoughtfully provided by Lafayette.\n“N’ah, bu- ya know what would be nice? Sumzin’ I’ve not had in a loooong while?” Lafayette commented rather drunkenly, accidentally veering his horse off the road a bit.\nAlexander hiccupped feeling only slightly less drunk compared to the other three. “What, Gilly?”\nLafayette frowned, “Don’t call me ‘Gilly’, Mon Deui!” He seemed to lose his train of though for a moment, his eyebrows knitting. “I’ve not had honey in a long time.”\nNow it was Laurens turn to look a bit baffled. “You’re spoiled….mon ami. We haven’t had honey for...four years!” And he put up four fingers to illustrate his point.\n‘America surely has bees, do they not?” Lafayette whined, “They occur naturally as well in these woods, perhaps!” He puffed out his chest. “I know how to get it too! When I was a child in my hometown, I was able to bring home a whole honeycomb for my maman!”\n“My friend, you’re stories range from the fantastical to the ridiculous. “ Hercules muttered, his horse accidentally steering into Lafayette’s before whinnying and returning to the road.\n“I bet you a shilling that I can find some honey and bring it back to camp with us! Lafayette announced.\n“That’s not even worth betting on, Laff,” Laurens huffed. “Plus, shouldn’t you be using Continental Dollars for money?”\n“Ah very well! I bet a whole Continental Dollar then.” Lafayette waved a hand dismissively.\n“Still not much to bet on,” Groused Hercules.\nLafayette stopped his horse suddenly, giving a grunt of frustration as he sloppily jumped off his horse, then staggered into the woods.\n“Gilly!” Alexander cried, also jumping off his horse to follow, which the others soon did as well. They hiked through the underbrush not far behind the Frenchmen.\nThey heard buzzing and Lafayette pointed up to a tree. “There, what did I tell you! It was easy to find them, no?”\nSaid bees were swarming madly around the hive several feet above their heads as if they anticipated someone would attack them.\n‘Uh Laff, are you sure this is a good idea?” Alexander asked warily, glancing from his friend to the beehive.\nLafayette waved a hand dismissively, “Of course, of course! Now first, we have to get the bees to leave the nest. Alexandre, go get some leaves, Mulligan go get some rocks.”\nWithin a few minutes, Hercules had made a circle with the rocks, while Hamilton piled leaves in the middle. Lafayette clapped his hands, “We must set fire to the leaves. The smoke will drive away the bees.”\nAlexander looked slightly perplexed. “Uh….” he padded his pocket’s trying to find flint and steel. His eyes lit up as he called out, “Got it!” He sparked the leaves, the smoke rising and the bees' movements slowing, some even abandoning the hive.\n“Now we must get it down.” Lafayette instructed. “Alexandre, you’re the smallest of us, climb up and cut it down, will you?”\nAlexander stared at his friend with wide, frantic eyes.\n\"\nGilbert\n, have you lost your mind?!\"\nHe glanced up at the high branches.\nLafayette pouted his lips. “Please? For me, Mon Ami?” He put his hands together in a pleading gesture.\nAlexander rolled his eyes. “Alright Gilbert. But if I break my arm….”\nGilbert laughed. “Don't worry, I won't let that happen. We’ll help you up.”\nHercules and Lafayette folded their hands and helped Alexander' grab onto the lowest branch. The West Indian climbed until he reached the beehive, leaning against the tree. “Throw me up a branch or something I can hit it with!”\nLaurens tossed a stick into the air, and Alexander swiftly snatched it, playfully swatting at the beehive in hopes that it would fall. The bees, however, were far from amused and swiftly swarmed towards him in a chaotic frenzy. Hamilton let out a startled yelp as he hurriedly descended, clumsily tumbling from the final branch and landing unceremoniously on his backside. The buzzing grew louder as the men got to their feet and ran as fast as they could. In no time, the bees swarmed closer, unleashing their fury by inflicting painful stings upon the men's faces, necks, and hands.\nStartled by the sight of a pond, it was Lafayette who screamed, \"Quickly, my friends, let's dive into the water!\" Without hesitation, all four men submerged themselves, keeping their heads underwater and holding their breaths until the bees dispersed.\nLafayette was the first out of the water. He was met with three drenched figures emerging from the pond, their uniforms clinging to their bodies. Their eyes were fixed on him, filled with a mixture of annoyance and disbelief.\n\"Next time, I won't trust your claims of being a nature enthusiast when you were younger, Laff,\" Hercules grumbled.\nThe four officers scrambled back to the horses, mounting them and racing back to camp with all due speed.\n~*~\nLaurens opened to the door cautiously, poking his head around it and motioned for the others to follow. The three other aides kept watch, hoping not to be seen by the General.\n“Hopefully the General is in his study, or out on a ride-” Alexander began. “Perhaps we can get upstairs and remove our wet clothes to dry before-”\n“Gentlemen?” The deep timbre of George Washington called from the stairwell, and the men froze in the spot. “Which one of you would you like to tell me why you all are sopping wet?”\n“Em…. Your Excellency…” Laurens started, glancing at his friends and flummoxing for an explanation.\n“Mon General….” Lafayette jumped in next trying to come up with an explanation that didn’t include them being drunk for the whole of the afternoon.\n“I accidentally struck a fallen beehive when we were trotting. We angered a bunch of bees enough that we had to take evasive action and dive into a pond, sir.” Alexander remarked calmly.\nThe General's face was a mixture of bemusement and chagrin at his officers. “Are you injured?”\n“Just some bee stings sir.” Alexander acknowledged, wincing at the one on his hand.\n“Very well, have McHenry see to them and then report back to me. There are some new missives to see to.” Washington ordered.\n“Yes, sir!” the four men said in unison while saluting. When they heard the door to Washington’s quarters close, they looked at each other with more than a little disbelief that they’d gotten away with the lie.\n“Thanks, Hammie.” Laurens patted him on the shoulder. “Quick thinking on your part.”\nThe four men went upstairs to have their stings seen to, fervently wishing that the only ones who would know of the day's events would stay between them.\n*~*\n“Ow!” Alexander winced in pain as Doctor McHenry carefully applied alcohol to his bee-stung hand.\n“Are you going to tell me what really happened, Hammie?” the doctor asked, looking up at him with raised eyebrows as he wiped an alcohol-sodden piece of gauze on his forehead. “Considering that I can smell the liquor on your breath….’ McHenry remarked with a raised eyebrow.\nAlexander remained calm while saying, “We had to have something to drink to relieve some of the pain of being stung so badly.”\n“Mmhmm.” McHenry replied. The doctor continued to clean and treat Alexander's bee stings, all the while shooting him a skeptical look. \"I don't recommend self-medicating with alcohol for bee stings, before or after the matter.\" McHenry said with a mischievous smile. \"Next time, come to me right away so I can treat you properly.\"\nAlexander nodded sheepishly, knowing he had been caught in a lie. Dr. McHenry was the one person he could rely on, without a doubt, to look after them and safeguard their silly escapades from the prying eyes of the General."
    },
    {
        "title": "We Dream of a Brand New Start",
        "url": "https://archiveofourown.org/works/54265633",
        "fandoms": [
            "Hamilton - Miranda"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "05 Mar 2024",
        "language": "English",
        "words": "1,358",
        "chapters": "1/1",
        "comments": "4",
        "kudos": "10",
        "hits": "222",
        "post_title": "Day 29: \"You're not allowed to die\"\nThomas and Alexander worry over Jemmy's condition after the lightning strike (prompt 11)",
        "comment": "Thomas had contemplated the idea of sending a note to Congress to tell them he was ill but decided against it. Jemmy was right, The Assumption Bill debate was too important to skip. He didn’t feel much like debating (or rather arguing) with Hamilton today.\nBy the time he arrived at Federal Hall, Hamilton was sitting only a few seats away from his own chair. The Treasury Secretary sat with a pensive and melancholic expression. His head rested in his hand as he gazed into a fixed spot in the corner of the room, lost in his own contemplation.\nThomas coughed lightly, avoiding direct eye contact as he greeted, \"Secretary Hamilton, good morning.\" He settled into his regular chair, purposefully averting his gaze from the vacant seat next to him that belonged to Jemmy.\nHe clasped his hands and furrowed his eyebrows at Hamilton’s distant expression. No doubt the Treasury Secretary had also considered skipping today’s session.\n“Secretary Hamilton?” Jefferson called to Hamilton before sitting.\nAlexander started and glanced over to him slightly surprised. “Secretary Jefferson.”  he said politely acknowledging him.\nThe silence was telling as they both couldn’t come to grips with the empty seat between them.\nAlexander folded his hands on his own desk and stared ahead. “H-have you seen Jemmy today?”\nThomas nodded silently, “Last night. He was still unconscious.”\n“Oh….” Alexander said quietly, looking everywhere but at Thomas.\nNow Thomas furrowed his eyebrows at the Treasury Secretary. “Haven’t you gone to see him?”\nAlexander sadly shook his head, \"Unfortunately, Jemmy...James and I drifted apart as friends a while back, mainly because of our differing views on the South.\"\nThomas looked at Alexander with concern. “But he’s still your friend, isn’t he?”\nAlexander sighed heavily.\n“He was, but I fear it may be too late to mend our friendship now. And seeing him in that state, it just brings back memories of what we used to be.” He looked away. “There were days when he was sick, but he still wanted to work.”\n“Then if you can’t be friends, at least be there for him.” Thomas said, echoing the words Alexander had said to him on that terrible day. “Maybe it’s not too late for you to patch up your friendship.”\nAlexander nodded. “Yeah. I-I’ll do that. Thanks...Thomas.”\nI’ll come with you to see Jemmy...if you’d like.” Jefferson remarked.\nAlexander looked grateful for the offer and nodded. “I’d appreciate that.”\nHad he really taken advice from Thomas Jefferson?\n*~*\nThey walked together in silence for a while, Thomas' cane tapping on the pavement as they journeyed to the Madison's residence. The sky above was cloudy and reflected the mood of the two men.\nThomas broke the silence by asking, \"How long have you known James?\"\nAlexander nonchalantly shrugged his shoulders, a wistful smile playing on his lips. \"Back in the early days of the republic, we were united by our shared vision at the first Continental Congress. Together, we penned the Federalist Papers along with John Jay. However, when I proposed the Assumption Bill, our paths diverged, and our friendship dissolved.”\nThomas nodded, understanding the weight of their shared history and the complexities that had since pulled them apart. Alexander's words painted a picture of a friendship once strong and unbreakable, now marred by differences in ideology and politics.\nAlexander hesitated as they reached the door of the Madison’s residence. They were greeted by Dolley Madison, who wore a sad smile. “Good day, Mr. Jefferson.” Confusion clouded her expression as she glanced over at Alexander. \"Mr. Hamilton?\"  She ushered them into the foyer.  “I’m glad you’re here. I think Jemmy could do with some company.”\nAs they followed Dolley into the parlor, Alexander couldn't help but feel a pang of nostalgia. The room was filled with memories of the time spent here with James, debating ideas, and crafting their arguments for the Federalist Papers.\nThomas glanced over to his fellow secretary and cleared his throat. “Hamilton, why don’t you go see James first? Go...talk to him, so to speak.”\nAlexander hesitated, then with a kind nod agree quietly. “Thank you, Mrs. Madison...Mr. Jefferson.”\nHe glided quietly into the room where James Madison lay in his sickbed. Alexander's mouth was dry, he wondered what to say to his former friend. Would Jemmy even hear him as he was unconscious?\n“Hello, James. It’s Alexander.” He sat heavily in the armchair near the bed. Looking to the bedside table, he saw a book and read its spine. It was James' favorite book on Philosophy by John Locke. Alexander’s mouth gaped slightly. Had Jefferson been reading this to James these last two weeks?\nReluctantly, he reached out and gently grasped his friend's wrist, noticing the faint scars left behind by the lightning strike. He took a deep breath and spoke. “James, you’re not allowed to die, do you hear me? You’re- you were my friend. Politics tore our friendship apart and I regret it every day. Even when you side with Jefferson and taunt me. Just-” his words were shaky now. “You have to wake up, Jemmy. Your poor wife is worried, Jefferson is worried. I’m...I’m worried. I don’t want to lose you as a colleague and a f-friend. You’re too brilliant to lose.”\nTears welled up in Alexander’s eyes as he poured out his heart to his unconscious friend. He sat there for what seemed like hours, lost in his thoughts and memories of their happier past meetings. Eventually, he gently squeezed James’ hand and stood up, wiping away his tears.\nHis words spent, he picked up the book and flipped through the pages. “Shall I read to you?” He took a breath and began to read. “...t\nhus we may conceive how words, which were by nature so well adapted to that purpose, came to be made use of by men, as the signs of their ideas.\n”\n~*~\nFour days had passed since he'd seen Jemmy. He had made a point of going over to see him every day to either talk or read to him. On a sunny day, a sudden, urgent knock echoed through the door. Eliza's brow knitted in confusion, for it was a rare occurrence to have Alexander's undivided attention on his day off. Instead of his usual writing, he found solace in watching their children gleefully playing on the floor.\nGlancing away from the book in his hands, he let out a small sigh before placing it on the table. \"I'll go check who it is, my love. It seems quite urgent.\"\nEliza frowned. “If it’s a political matter…” she began with a hand on her hip.\nAlexander raised a hand as if to shoo away the worry as he went to the door. Opening it, he found Thomas Jefferson, standing on the stoop, who looked in unusual disarray. His hair was even wilder than normal, and the Virginian’s eyes were puffy and bloodshot. Yet, as he glanced at Alexander, a smile spread across his face.  “Alexander, it’s Jemmy. He’s awake.”\nAlexander's heart skipped a beat as his eyes widened. \"He's awake? Jemmy's alive?\" He hesitated for a moment, resisting the urge to embrace his rival.  He called over his shoulder, “Eliza!” Then he returned his attention to the Secretary of State. “How is he? I mean, is he-?”\nThomas’ shoulders rose. “He seems fine? The lightning doesn’t seem to have had any permanent effects.  The doctors are baffled. He’s still going to need some time to recover though.”\nInstantly, Eliza appeared with a puzzled expression. ‘What is it Alexander? Why on earth are you yelling so?”\nHe turned and took her shoulders. “Jemmy’s awake, Eliza! He pulled through!” He exclaimed, kissing her on the cheek. “Honey, I should go see him. I’ll be home later, alright?”\nEliza’s face was one of love. “Of course, sweetheart. Please give my best wishes to Dolley and wish Mr. Madison a speedy recovery for me?” She pecked him on the cheek.\nAlexander gave a firm nod and swiftly exited the house, brimming with anticipation to mend his friendship and extend his unwavering support while Jemmy was on the mend.\nTHE END"
    },
    {
        "title": "Eyes Up",
        "url": "https://archiveofourown.org/works/54215806",
        "fandoms": [
            "Hamilton - Miranda",
            "18th Century CE RPF",
            "American Revolution RPF"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "02 Mar 2024",
        "language": "English",
        "words": "1,479",
        "chapters": "1/1",
        "comments": "7",
        "kudos": "47",
        "bookmarks": "5",
        "hits": "462",
        "post_title": "Day 25: Alternate Prompt-immortality.\nAlexander Hamilton is dead....and is reunited with those whom he cared for in Heaven.",
        "comment": "“Alexander Hamilton?” A voice echoed through the mist, calling out his name.\nStartled, Alexander blinked his eyes open, only to discover that he was completely enveloped in a thick fog.\n“H-hello?” Alexander said nervously. Hadn’t it been a clear morning in New Jersey when-?\nHe gasped, feeling his side for a wound that no longer seemed to be there. He remembered the tear-stained faces of Eliza and Angelica and the innocent oneks of his children in his last moments, then darkness.\nThe fog lifted, and an ancient looking man stood before a white marble podium. If Alexander’s heart was still beating, it surely would have been beating loudly in his chest. “A-are you...Saint Peter?” The last part of his question was asked with awed reverence.\nThe old man nodded. “I am, Alexander; son of Rachel Faucette and James Hamilton senior.”\nAlexander gulped. “I’m-I’m dead, aren’t I?”\nSaint Peter's solemn voice confirmed his fears. \"Yes, Alexander, I'm afraid so. However, there is solace in knowing that you have arrived in the realm of Paradise.\"\nAlexander looked behind him perplexed, then back to St. Peter. “But...” He seemed to hesitate. “I’m allowed here after…..” He didn’t finish the sentence as there was no doubt any of his indiscretions on Earth were known here in Heaven.\nSt. Peter nodded knowingly. \"Yes, Alexander, we are aware of your past mistakes. But here in Heaven, all are forgiven. Your sins have been washed away, and you are now welcomed with open arms into the kingdom of God.\"\nAlexander was taken aback by the sheer grace and forgiveness being offered to him. He felt a weight lifted off his shoulders and tears welled up in his eyes. “I was foolish…” he sniffled and tried to wipe away the tears. “But….I didn’t think Aaron would have shot me.”\nSt. Peter placed a comforting hand on Alexander's shoulder. \"We understand, Alexander. Earthly conflicts and misunderstandings often lead us astray. Aaron, too, will find his peace and redemption in God's loving embrace.\"\nAlexander's tears began to subside as he listened to St. Peter's reassuring words. A sense of peace washed over him, and he felt a newfound sense of gratitude for the forgiveness and love that surrounded him in Heaven.\n“Now,” Saint Peter put a hand onto his shoulder and walked to a set of gilded gold gates that towered high above both their heads that opened soundlessly. “There are some people who are awaiting you.”\nAlexander found himself floating slightly off the clouds underneath his feet as he moved without feeling it. A familiar place came into view as the mist cleared; a house on a bluff overlooking the sea. In the garden, he saw a woman kneeling over a bed of flowers, wearing a bonnet that he remembered from all those years ago.\n“Mother.…” He whispered, tears nearly coming to his eyes again as they set on the woman who had raised him and died after so many hardships she suffered in her life.\nThe soft exclamation seemed to garner her attention enough for her to look up. Now, she looked as she did when he was young; beautiful and free of the sadness that sapped it away.\nHis mother stood and ran to him, embracing him fondly with tears streaming down his face. “Alexander!” When she stepped out of his arms, she regarded him with fondness. “Look at you, all grown up.” she pushed a tendril of hair from his forehead. She smiled, “I’m so proud of you, Alex. You’ve done so much I could never dream of.” She kissed his cheek. \"Your wife Eliza is lovely.”\nThere was a dart in his heart at the mention of Eliza since his arrival in Heaven. “I was foolish mother, I engaged in a duel and lost everything.”\nShe stroked his cheek. “You haven’t, Alexander. God willing, you family will arrive in time, and you’ll be re-united.”\nHis shoulders sank as he nodded. “I suppose so.” The pain of missing Eliza and his family was still raw, even in the afterlife. But he took comfort in his mother's words, knowing that there was still hope for a reunion.\n“Pa!” Phillip Hamilton appeared from what seemed to be nowhere, looking nothing like he had as he died, cold, pale and frightened. Alexander embraced his firstborn son tightly, gazing into those familiar brown eyes that mirrored his own in his youth. \"Why are you here already, Pa? Is everything okay with Mom?\" his expression filled with worry as he peered past his father's shoulder.\n“She’s fine, Phillip.” He held his son’s shoulder. He shifted, “I-I was in a duel.”\nPhillip Hamilton’s face was a mixture of disbelief and disappointment that Alexander never thought he would want to see on his son's face. “Why? After my death and what the family went through…..”\nAlexander couldn't bear to meet his son's gaze. \"I understand, I truly do. I realize now that I should have been more careful and had you refuse the duel...and mine. I've disappointed you and our family. My foolish pride led to your death, and I...\"\n“No, Pa, you didn’t!” Phillip said. “Ma, she’s-she strong, she and our family can get through anything.” Now tears were falling from his son’s face even as he tried to smile. “When I arrived, Grandmother Rachel met me. She’s been showing me around.”\nRachel elbowed the younger Hamilton. “Here now, I’m not old enough to be called Grandmother!” she laughed, and it was like a remembered melody in his ears.\n“Your Maman has been telling me stories about when you were young.” Phillip grinned.\n“Not the embarrassing ones, surely?” Alexander said with some mock horror.\nRachel burst into laughter, her cheeks turning rosy with warmth as the sound of mirth filled the air.\nDuring a lull in the conversation, Phillip piped up, “Oh! You should go find your friends! Mr. Laurens couldn’t stop talking about you!”\nThe idea of not just seeing Laurens, but perhaps even Washington, brought a fresh wave of happiness over him. He nodded, “I’ll see you both later?”\nAs Alexander ventured forward, a tavern materialized from the ethereal mist. As he stepped inside, a lively scene unfolded before his eyes. American and British soldiers mingled together, their laughter and songs filling the air, as if they had momentarily (permanently) escaped the harsh realities of war. Alexander’s eyes widened as he saw Laurens sitting at the bar with a mug of beer, talking voraciously to the soldier next to him. Lauren's eyes went wide at the sight of his friend.\nJohn Laurens hurried over to Alexander's side, embracing him tightly. \"Alex!\" he exclaimed with excitement. \"Just look at you! A distinguished old gentleman now!\"\nAlexander chuckled and playfully rolled his eyes. \"Appreciate that, John!\"\n“Have a drink with me, Alex. You’re here earlier than I expected.”\nHe was about to start to tell his story, when he felt a firm hand on his shoulder, while John’s face took on a reverent look.\n“Hello son.” As the familiar deep voice resonated in his ears, he swiftly hopped off the bar stool and stood tall, d to face General-no-President Washington.\n“Sir!” Alexander gasped, instantly saluting Washington as though he were back in the army.\nWashington's lips curled into a slight grin. \"No need for formalities anymore, Alexander. Just call me George.\"\n“George, I-” He flubbed, trying to find the right words. What to say? Alexander decided on something that he would not have done when the man was alive as Washing-George abhorred close contact; Alex gave him a hug and was surprised to find that the General returned it.\nWashington clapped a hand on his shoulder, a gesture that was both reassuring and comforting. \"It's good to see you, my boy. I've been following your journey from afar, and I must say, you've done me proud.\"\nAlexander's eyes welled up with tears at the praise from his mentor. \"Thank you, George. None of it would have been possible without your guidance and wisdom.\"\nWashington chuckled, the sound warm and familiar. \"You were always a bright young man, Alexander. And now, here you are, in the company of angels.\"\nGeorge smiled. \"Join us for a drink. There's plenty to discuss.\" Before long, the heartbreaking news of his departure came to light, leading to tears being shed.\nTears quickly transformed into laughter as he initiated a spirited drinking anthem from the Revolutionary era, which he was well acquainted with. It wasn't long before the entire tavern enthusiastically joined in, creating a joyous and lively atmosphere.\nWith his mother and son’s hand in his, the promise of a reunion with Eliza on the horizon, Alexander Hamilton knew that he was finally where he belonged.\nAmid the lively atmosphere of the tavern, he raised his voice and exclaimed, “To a happy immortality!” The entire crowd erupted in cheers, sharing in his sentiment."
    },
    {
        "title": "I Imagine Death So Much It Feels Like a Memory",
        "url": "https://archiveofourown.org/works/53727532",
        "fandoms": [
            "Hamilton - Miranda"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "11 Feb 2024",
        "language": "English",
        "words": "1,945",
        "chapters": "1/1",
        "comments": "2",
        "kudos": "27",
        "bookmarks": "5",
        "hits": "299",
        "post_title": "Day 11: (Alternate prompt) Lightning Strike\nThey thought the storm was over....they were wrong and someone gets hurt.",
        "comment": "The rain poured relentlessly throughout the entire afternoon on that fateful June day. Inside the Philadelphia congress room, the atmosphere was charged with tension, mirroring the rumbling thunder outside. Even as the congressional session drew to a close for the day, the rain continued to fall steadily. Exiting the building, the men paused briefly to gauge the intensity of the rain before venturing out.\nJames Madison had finished a coughing fit near the doors when Thomas Jefferson stood next to him. “You alright, Jemmy?”\nMadison put a hand up to signal that he was fine.\nThomas gazed out at the rain-soaked streets. \"Are you absolutely certain you want to brave this downpour and walk home?\"\nJames nonchalantly shrugged his shoulders. \"Walking in the rain is nothing new to me, Thomas,\" he retorted, his tone tinged with a hint of irritation towards his friend's over-protectiveness. “Besides, I need to think on the matter of Hamilton’s Assumption Bill.”\nThomas snorted derisively, “You’re really going to consider it?  What about the South?”\nMadison shook his head. \"I won't cast my vote on it, that's for sure. However, Hamilton did manage to present some compelling arguments. Perhaps I can turn the other delegates of the North to it.\"  He popped open his umbrella, taking a few steps down the stairs before turning back with a wave, “Have a good day, Thomas.”\nThomas opted to wait for the rain to stop before making his own way home, in case he accidentally encountered any puddles along the way. Even if that meant that he bumped into Hamilton if the Treasury Secretary deigned to go home at a decent time. He glanced down the street to see Jemmy, who had paused to place a hand on a lantern post to cough into his handkerchief.\nThomas glanced towards the stairwell and caught sight of Hamilton making his way down the steps. Hamilton seemed lost in thought, his gaze fixed on the rain outside, completely oblivious to Thomas's presence.\nThomas was taken aback when he noticed Hamilton flinching at the sudden boom of thunder that echoed through the air. Both of them had heard it, and it seemed to have caught Hamilton off guard.\nThey heard a chilling scream from a short distance that Thomas could feel in his bones, the fear heightening within him. He looked out to see James thrown several feet backwards from the post he had been leaning against and now lay prone on the pavement.\n“Oh, god, Jemmy!” Thomas shouted, abandoning his corner of the building, no longer caring about anything but James. He knelt next to his friend. “Jemmy!” Thomas shouted, eyes wide with shock. He slapped his fellow Virginian lightly on the cheek in hopes of waking him.\n“What happened?” the voice of Hamilton cried, kneeling on the other side of the stricken Virginian. He looked from Madison to the lantern post. “I think he got hit by lightning.’ He placed to fingers to the man’s neck, then under his nose. “Shit, he’s not breathing!”\n“What?!” Thomas exclaimed and looked up wild-eyed at the Treasury Secretary, his eyes racing back to Jemmy.\n“Help me get him back inside the building.” Alexander commanded. Thomas was still looking horrified down at his friend.\n“Hamilton lost his temper. \"Jefferson, pull yourself together! For God's sake, help me!” They heard a clap of thunder that cracked in the sky and winced, Hamilton more so than him. \"Do you want to be struck by lightning as well?!\"\nThomas suddenly snapped out of his daze, his eyes focusing on Madison. Without hesitation, he firmly grasped his shoulders, while Hamilton swiftly took hold of his legs. Together, they hurriedly made their way back into Federal Hall, gently placing him on a nearby bench.\nHamilton quickly peeled away James’ coat and waistcoat, interlocking his fingers and pressing on Madison’s chest in short intervals.\n“What are you doing?’ Jefferson shouted while watching the Treasury Secretary push on Madison’s chest.\n“Reviving his heart is crucial. Once his heart starts beating, the other organs will naturally follow suit.\"  Alexander said breathlessly as he continued to pump Madison’s chest. “I’ve read about it in medical books when I briefly studied medicine. And I’ve seen it done on the islands.”\nJefferson stood in silence, his hand hanging by his side, his fists clenched tightly as he helplessly observed Hamilton's desperate attempts to revive his friend.\nHamilton shouted over his shoulder, “Jefferson, get over here and keep checking for a pulse!”\nThomas rushed over to his friend's side, avoiding eye contact with Jemmy's ashen complexion as he gently pressed two fingers against his pulse point. In that moment, he fervently whispered a silent prayer, hoping to sense the reassuring rhythm of a heartbeat.  He shut his eyes tightly, taking his friend’s limp hand, silently urging\nCome on, Jemmy!\nIt was reminiscent of when he had experienced the loss of Martha, her complexion drained and her vitality fading. The last moments they shared were etched in his memory. He had locked himself away after her passing, fully embracing grief like a blanket pulled over himself to shield him from the light.\nHe waited, his heart pounding in his chest, as he felt warmth in Jemmy’s trembling hand. He heard a gasp and felt a pulse at his friend’s neck. Jefferson watched with untold relief and eyes wide at his friend’s chest rising and falling again.\nHamilton's breaths were ragged as he desperately attempted to push his disheveled hair away from his face and watched his former friend breathe. “Thank God.” Alexander whispered. He turned to Jefferson, “We need to get him to a hospital. I got his heart going, but he still needs medical attention.”\n“I think he’d prefer to be taken home. Dolley can care for him, and we can summon a doctor from there.” Thomas replied, looking down at his friend.\nAlexander seemed to contemplate this for a moment, then nodded. “I’ll go hail a cab. See if we can’t get the driver to help us carry him.” He rushed out onto the pavement without an umbrella, calling for a cab with a wave of his hand. After speaking with the driver for a moment, both men returned to the entryway to carry Jemmy to the awaiting carriage, putting him on the opposite bench while Hamilton and Jefferson sat on the other side. As the coach began to move, the two men stared ahead, not speaking for a while.\n“Hamilton, I...I didn’t thank you for saving his life. That was quick thinking on your part.” Thomas finally said. “If you hadn’t been there…. I don’t think he would have made it.”\nThe Treasury Secretary shrugged. “It was just luck I had seen the procedure before.” He stared out of the window and said with a quieter tone. “I've witnessed countless lives lost in the past, and I’ll do everything I can to save others.”\nThomas nodded dumbly, not really sure what to say to that.\nIt was not far from Federal Hall that they stopped in front of a red-brick two story townhouse, and Thomas sprang out. He turned to Hamilton, “I’d better go tell Mrs. Madison about the situation to prepare her.”\nThomas did so, and Alexander could see the plump, middle aged woman who answered the door when he knocked. The woman’s face became pale, and she placed her hands to her lips in shock. Thomas signaled for them to bring James inside the house. Both Alexander and the driver worked to bring the ailing Virginian up the stairs. Dolley directed them to a guest room on the first floor while she hustled out the door to get a doctor who lived two doors down.\nHamilton and Jefferson waited at James’ bedside in silence. Thomas picked up Jemmy’s hand to squeeze it as a signal to the man that he was there but gasped. “My God!”\nAlexander sprang out of his seat as he hurriedly made his way towards Madison. “What is it?”\nThomas pushed up James’ shirt sleeve to reveal fern like patterns on the skin where the lightning must have traveled up the arm.\n“Hamilton,” Jefferson’s voice shook, “What if James is permanently damaged? What if the lightning strike affected his brain?”\n“You’re still his friend, Thomas.” Hamilton replied quietly. “\"Just make sure you're there for him.\"\nNot long after, a tall, stately looking man with a receding hairline holding a doctor’s bag entered. “Mr. Jefferson?” He glanced over to Alexander.\n“I’m Mr. Hamilton.” Hamilton added quickly, shaking hands briefly.\n“Mrs. Madison tells me that James has been struck by lightning?” He said, removing bottles of medicine and a spring lancet from his black bag.\n“He-” Jefferson began hoarsely before clearing his throat and trying again. “He was. Mr. Hamilton did chest compressions to restart his heart.”\nThe older man’s eyebrows rose. “I’ve heard of that technique before. Someday I must see it in action. Now gentleman, I need to examine my patient, so I’d appreciate it if you would both wait outside. You as well, Mrs. Madison.”\nThey cleared the sickroom, waiting instead in the sitting room. Mrs. Madison paced, then in want of something to do, went to make them tea.\nAn even greater silence ensued before he spoke up again. “You said you studied medicine briefly?”\nHamilton raised his shoulders. “I did. I had every intention to become a doctor but…. I struggled with chemistry.” *\nJefferson’s eyebrows rose at that. “I assumed you never struggled with anything, Hamilton.”\nHamilton smiled sadly. “You assumed incorrectly. But I'm glad I decided to pursue law instead. It's been the right path for me.\" He sneezed, which prompted a ‘bless you’ from Jefferson and Mrs. Madison.\nAn hour later, the doctor emerged once again, his face filled with concern as he cast a quick glance at the trio anxiously waiting for any news on Jemmy’s condition. “I’m afraid Mr. Madison is in a coma.”\nThe shock was evident on the faces of all three of them. Mrs. Madison quickly reached for a handkerchief, using it to conceal her overwhelming sorrow.  “Will...will he….?” Mrs. Madison began but couldn’t seem to allow herself to fully ask the question that was on everyone’s mind.\n“I will tell you, it may be some time before he wakes, if at all. I do not know if there was damage to his brain, we will not know until he awakens.  But I have bled him and hopefully his humors will balance out enough to mitigate the damage.” The doctor continued.\nAt that moment, Alexander sneezed into his elbow, which prompted another ‘bless you’ from the other three occupants in the room. “Mr. Hamilton, Mr. Jefferson, you’ve been in those wet clothes for over an hour. You need to go home and change before you both catch a chill. I will return tomorrow to check in on him.”\nWith a solemn understanding, both men exchanged meaningful looks, silently acknowledging the shared sorrow that weighed heavily upon them. Their message was clear; they understood and respected each other's pain.\n“I...I should return home.” Hamilton said quietly, not meeting Jefferson’s eyes, “I’m sure Eliza is waiting for me. If you’ll excuse me?” He nodded to them before departing from the Madison’s residence. Jefferson soon did the same, sinking into the carriage to spirit him back to his own house.\nThomas wearily ascended the stairs to his townhouse, his steps faltering as he reached his destination. With a sense of familiarity, he entered his library, shutting the door behind him to embrace the solace it offered. Overwhelmed by the deafening silence, he surrendered to despair, burying his face in his hands and weeping uncontrollably."
    },
    {
        "title": "Alexander Hamilton's No Good Very Bad Week",
        "url": "https://archiveofourown.org/works/59415655",
        "fandoms": [
            "Hamilton - Miranda"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "F/M, Gen",
        "status": "Complete Work",
        "published": "03 Oct 2024",
        "language": "English",
        "words": "2,222",
        "chapters": "1/1",
        "kudos": "11",
        "bookmarks": "2",
        "hits": "193",
        "post_title": "There's nothing like summer in the city...unless it's raining and you're Alexander Hamilton.",
        "comment": "Alexander Hamilton’s day began badly and only went downhill from there.\n“Alexander! Are you awake?” Eliza called from the bottom of the stairs. “You’re going to be late!”\nHe sat up groggily, rubbing his hand over his face. Turning, he glanced out of the window, and met a gloomy sky. Yawning, he reached for his pocket watch to check the time. Alexander gasped; it was already ten minutes after eight am.\n‘Damn!” Alexander muttered while throwing aside his bed covers and hastily made his way into the washroom where he quickly made himself ready for the day. He grabbed his coat from a chair and hurriedly made his way downstairs. Unfortunately, his foot slipped out from under him in his hurry, and he fell rear first down several steps.\n“Alexander?” Eliza appeared, trying not to smile as she watched him rubbing his now sore backside, “Are you alright?”\n“Mmmm, I’m fine, Eliza.” Alexander’s voice was strained in attempt to not sound cross as he stood. “I won’t be able to have breakfast this morning; I’m late as it is.” He kissed her goodbye, followed by his children who had appeared from all corners of the house and were giggling at their father’s minor misfortune.\n“I’ll see you all tonight!” He called, waving goodbye as he stepped out onto the townhouse’s steps into the gloomy day. Soon enough, the gray clouds gave way to rain falling over the city. Alexander sighed, glad he had the foresight to bring his umbrella, which he popped open and headed towards his office.\n*~*\nAt noon, Alexander stood from his office chair and glanced out the window to see rain still falling outside. He groaned, reminded that he had business in the city today. Patting his pocket to ensure that he had his check book was still there, Alexander stepped to the outer office and briefly spoke to his secretary that he’d be going out for a while. He stepped out onto the pavement and enjoyed the bustle of people. He walked down the street, nodding at people who acknowledged him on the opposite side of the sidewalk.\n“Alexander!” A familiar voice called from behind him. He turned to find Aaron Burr taking long strides to catch up with him.\nAlexander took on a neutral expression, hoping that is was just a passing greeting. But by the other man's rush to catch up, he knew it was more than that.\n“Aaron Burr, sir, ” He answered with a pleasant mask.\n“May I speak with you a moment? It’s a business matter.” Aaron asked with a professional air.\nAlexander nodded to the coffee shop next door. They entered, taking in the smell of freshly roasted coffee and baked pastries. The pair sat at the bar, both awaiting their drinks in silence for a few moments. When the coffee arrived, Alexander spoke up. “What is it that you needed to speak with me about, Burr?”\n“I have taken on so many case litigation referrals that I cannot handle any more. I was wondering if you were willing to take a few on?”\nAlexander blew out a breath. He didn’t want to do any favors for his rival, but they were both professionals as lawyers and to refuse may reflect badly on him.\n“Very well,” Alexander reached into his pocket and withdrew a few of his business cards to hand to Aaron.\n“Thank you.” Aaron said quietly, taking them. He stood after draining the last dregs of his coffee. “Well, I best go. I’ve some things to do. Have a good day, Alexander.”\nAlexander soon followed, glad that the impromptu meeting was over; five minutes with him was like an hour.\nRain had begun to splatter the pavement again, his shoes soaked through with it. He stepped into the quiet space of the bank,  thinking to fish out his slightly soggy checkbook, then his heart skipped a beat. Where his checkbook had been was now an empty space. Alexander’s cheeks warmed as the bank teller stood there waiting, looking somewhat exasperated with every passing moment. Hamilton flummoxed and said, “Would you excuse me?”\nHe hastily made his way outside, padding every pocket he had. Did Aaron….? No, but that wasn’t possible. He wasn’t a scoundrel in that way. Alexander groaned; would have to retrace his steps. He had to find that checkbook.\nAlexander was so preoccupied with his thoughts that he didn’t see (or perhaps remembered) the small dip in the pavement. His foot twisted awkwardly. He let out a small cry as he felt his ankle twist and he fell to the ground, tearing the fabric of his knees.\nA few passersby came to a startled stop at the scene of his fall. A man took his shoulders and helped him stand, though the pain made it difficult to remain so. “Are you alright, sir?”\nAlexander winced, trying to smile through the pain that was shooting up from his ankle. “I’m…. fine.”\nThe look on the other man said otherwise. The man was tall and burly, wearing a brown coat, his salt and pepper hair was tied back in a queue. He looked about for a moment. “Let me help you sit, sir. Your breeches will get damp with the rain, but they’re already ruined by the look of it.”\nAlexander was guided to a stoop of an apartment building, wincing in pain with each step before he was sat heavily down.\nThe man’s face was sympathetic. “I think you’ve twisted your ankle rather badly, sir.” So, saying he placed his hand gingerly on Hamilton’s ankle, causing his to wince with pain and recoil from the man. “Definitely twisted, if not sprained, sir.”\n“Damn,” Alexander groused. This day was not turning out well for him at all. He should have just stayed in bed.\n“Indeed,” the taller man agreed with a sympathetic smile. I’ll call for a carriage to take you home.”\nHe rushed to the street to do just that. Soon, a cab driver and the other man had his arms slung over their shoulders so to take the weight off his injured leg. When he was safely ensconced in the carriage, he leaned out of the carriage to his rescuer, fishing in his pocket for a coin which he attempted to hand to him. “Might I have your name, sir?”\nThe man raised a hand to stop him. “No sir, I don’t want your money. My name is James Wagoner, at your service, sir.”\n“Alexander nodded. “Alexander Hamilton, at yours, sir. My thanks for your assistance. With a final nod, the carriage jolted into motion.\n~*~\nEliza gently lifted the pillow to readjust it under Alexander’s bandaged foot over a covered piece of ice, smiling lovingly at him.\nAlexander sighed with slight annoyance. “I tire of this. My foot feels better, Eliza.”\nHis wife sent him a warning glare. “You are not to move until your ankle is healed, Alexander. Doctor’s orders.” She sent him a sweet smile. “You’ll just have to put up with being spoiled for a week or so.”\nHe sighed, “I’ve been testing my ankle, it doesn’t hurt as much; I can walk.”\nEliza’s lips pursed. “You’re still limping, Alexander. That doesn’t mean it is healed by any means. You’re not going anywhere and aggravating that injury; do you understand me?”\nAlexander’s shoulder’s slumped in defeat. Eliza’s nurturing nature had always been hard to escape when he was injured or ill. His ankle still had a lingering ache and hurt when moved a certain way but felt better from days before.\n“Alright, Alright.” Alexander put his hands up in defeat, sending her a winning grin, “I suppose I can put up with your pampering for a few days more, my darling.”\n“Good.” She kissed his cheek. “Now, I’m going to get dinner started.” She said, moving away from the bed. “Is there anything you want before I go?”\nAlexander seemed to think for a moment, Honey, do we have any cherries about the kitchen?”\nEliza contemplated for a moment and gave him a speculative look. “You ate the last of them yesterday, Alexander.”\nAlexander gave her a loving glance, “Darling, you spoil me so being wounded like this. My dear, would you fetch me some more to make some cherry tarts for me?” He asked in a feigned timid voice.\nAt her questioning glance, he added, “Anna can look after the children.” He brought his bottom lip up in a gesture his children often employed for an extra treat or bedtime story.\nShe gave him a loving, but frustrated sigh. That made her laugh lightly and bend to kiss him again. “Very well, Alexander. Do me a favor and stay in bed?”\nEliza departed from the room and readied herself. Alexander occupied himself by pretending to be absorbed in a book. When he heard the door downstairs creak shut, he sat bolt upright. He threw aside his covers and limped to his wardrobe to retrieve his clothes. He sat heavily on his bed to tug on his stocking and britches. After he was dressed, he gently slid into his shoes, wincing while he tugged his injured right foot into the leather. He cursed under his breath but would not turn back now.\nIt had taken longer for him than he’d like to find his briefcase, which Eliza had no doubt hidden for this reason. But he soon found it and made his way downstairs, praying that he would not twist his ankle again. The effort made the bone ache, but he ignored it.\nHe was just about to steal out the door when he heard a small voice behind him. “Papa?”\nWheeling around and wincing, he saw Jamie behind him. “Are you going to work, today? I thought you were hurt.”\n“I am not going to work, my little lamb.” He hated lying to his children, but didn’t have a choice. “Merely down the street. I won’t be long, I promise.” He ran a hand through his son’s hair. He waved cheerily at Jamie and stepped cautiously out to hail a cab.\n*~*\n“Alexander?” Aaron Burr blurted as he peeked his head out of his office door. “I thought you were supposed to to be home nursing your ankle.”\nAlexander pressed his lips together, but waved a hand in dismissal. “I’m fine, mister Burr, sir.” But in truth, he wasn’t. The two flights of stairs to reach the offices had set his ankle on fire and made the bones ache.\nBurr looked disconcerted nonetheless. He glanced at the docket in his hand, then back at him. “We don’t have any cases for you today, Alexander. We weren’t expecting you for court.” He looked behind him and then back at Alexander. “What if your wife discovers that you’re here?”\n“It’s fine. I need to catch up on my casework.” Hamilton nodded, “Have a good day, Mr. Burr, sir.”\nHe limped down the hall to his own office and after shutting the door, weakly made his way to his office chair that he sat arduously down in with relief. Sighing, he looked over to the huge pile of cases that were stacked on his desk. He had to get back to work, he had bills to pay and his children to feed.\nTwenty minutes later, Alexander felt his energy flagging. He supposed it was because of the strain his body had endured trying to get here. Feeling sleepy, he thought he’d take a short nap in his chair, then start again. He shut his eyes, feeling sleep come for him.\nThe door burst open and a fuming Eliza Hamilton entered, her face glowing with afternoon light from the window. “Alexander Hamilton!”\nAlexander jumped, the papers in his hand flying out from it and scattering to the floor.\nBurr stepped behind her, a look of both dismay and apology to his fellow lawyer. His look said\n, I warned you, my friend.\nEliza charged over to Alexander and yanked him by the ear, “What are you doing at your office? You’re\nsupposed\nto be staying off your ankle!”\nHe looked sheepishly, “I know, I know. But I had to get some work done or I’ll get farther behind.”\nEliza’s eyes narrowed and she grew quiet. Alexander closed his mouth at the infuriated expression and he was forced to look away at her.\n“You are not indispensable, Alexander.” She said softly, with a glare. “You need to rest your foot and let it heal.” Her look was almost neutral except for the flash of anger in her eyes. “And you lied to me to get me out of the house so you can come to the office.”\nAlexander averted his eyes from his wife, shamefaced. “I am sorry, Eliza. I really thought my ankle had improved.”\n“When will you learn, Alexander, that your health is more important than your work?” Eliza huffed.\nHe stood and pushed out his office chair to reach her side, smiling apologetically. “I’m sorry my dear Eliza. Please forgive me for being so foolish.”\nHis wife crossed her arms over her chest, but her expression softened at Alexander’s obvious discomfort at standing on his injured foot. “Sweetheart, I just want to you to get better. And you won’t do that gallivanting all over the city.”\n“You’re right, Eliza.” He stood and winced, kissing her cheek. “Let’s go home.”"
    }
]