[
    {
        "title": "My Darling, My Dear",
        "url": "https://archiveofourown.org/works/55354723",
        "fandoms": [
            "Percy Jackson and the Olympians - Rick Riordan",
            "Percy Jackson and the Olympians & Related Fandoms - All Media Types"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "21 Apr 2024",
        "language": "English",
        "words": "503",
        "chapters": "1/1",
        "collections": "1",
        "kudos": "35",
        "hits": "320",
        "post_title": "My darling, my dear, my sweet",
        "comment": "After a long day at work, Nico was glad to be home. He unlocked the door and flopped onto the sofa, fully intending to fall fast asleep. He loved his job but you can only love something so much after doing it for ten hours straight (or gay in his case).\nJust as he was drifting off, he caught the faint sound of Will in his music room playing his guitar. Now, Nico might have been tired but he had always had energy for a kiss and a snuggle with his husband so he forced himself up, wrapping a blanket around him that trailer behind him as he trudged down the hallway.\nWill was singing, he soon realised with a smile. He loved Will’s voice. It was calm and deep like the rumble before the rain and passionate and unqiue like the lightning that came after. Nico gently pushed the door open and leaned against the doorway. Will sat on a stool in the middle of the room with his eyes were closed and he was drowning in the music in a way that was stunning to behold.\nMy darling, my dear, my sweet\nIf you cry, don't cry for me\nBut if you want you need only\nTo release your whispers on the breeze\nMy darling, my dear, for me.\nMy darling, my dear, my sweet\nIf you smile then smile for me\nLet your sweet laughter\nCarry beyond rivers and trees\nMy darling, my dear, to me.\nAnd you find our dreams aren't reality\nAnd if you try and you hope\nBut you know the problem is me\nI'll leave\nYou be.\nMy darling, my dear, my sweet\nYou know I'd sail across the mighty sea\nI'd brave tundra and mountain\nBut it wasn't meant to be\nMy darling, my dear, be free.\nMy darling, my dear, my sweet\nOne day you'll find somebody to love endlessly\nAnd if you're drowning in sorrow\nMake sure they know to remind you how to breathe\nMy darling, my dear, my sweet.\nWill's fingers stilled but his eyes remained closed to hold onto the moment. Only when the blues of his irises came into view did Nico start to clap. Will jumped and set his guitar down as Nico walked behind him, slipping his arms around Will’s shoulders and kissing his curls. Will looked up at him with a lopsided smile.\n\"My dad wrote that for my mum,\" he said. Nico nearly choked.\n\"Apollo wrote that?\"\n\"It's been known to happen.\" Will shrugged. \"He also wrote her some terrible haïkus so it isn't entirely out of character.\"\n\"He must of really loved her.\"\nWill stood and turned to encircle his arms around Nico’s waist.\n\"He probably sang the same thing to all his lovers. He's melodramatic like that.\"\nNico chuckled, leaning forward to hug Will to him.\n\"Would you sing that for anyone but me?\" he asked mischievously. Will’s arms tightened and he kissed Nico’s forehead with a smile.\n\"Only for you, my sweet.\""
    },
    {
        "title": "Movies, Marshmallows and Making Out",
        "url": "https://archiveofourown.org/works/55355191",
        "fandoms": [
            "Percy Jackson and the Olympians - Rick Riordan",
            "Percy Jackson and the Olympians & Related Fandoms - All Media Types"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "21 Apr 2024",
        "language": "English",
        "words": "513",
        "chapters": "1/1",
        "collections": "1",
        "comments": "1",
        "kudos": "43",
        "hits": "413",
        "post_title": "Nico and Will have an anniversary in the snow",
        "comment": "Outside the snow fell steadily, softly blanketing the ground with crystals. The cold nipped at Will’s skin, the snowflakes dancing around him and settling in his hair. His cheeks were flushes and his eyes sparkled with excitement.\nNico stood (with one of Will’s jumpers on under a large coat, his ears hidden by a beanie and enormous boots leaving patterned footprints) observing his snowmen and adding the finishing touches whilst Will adored from behind him. The snowman was about an inch taller than Nico with onions for eyes, celery for a nose, pebble buttons and a crooked, pebble smile. Two arms sticking in different directions were buried in the snowman's sides and a red scarf hung around its neck.\nNico turned to Will, eyes bright and a grin on his pinkened face.\n\"What shall we call it?\" he asked, taking a step back and leaning into Will’s side. It was a natural action by now after seven years of bliss and three years building snowmen in a backgarden they actually owned. Will thought for a moment.\n\"Edgar.\"\n\"Edgar?\" Nico snorted. Will jabbed his side playfully.\n\"Hey, don't be rude to Edgar!\"\nNico rolled his eyes with a quiet chuckle. \"Edgar it is now shall we go inside? It's freezing.\"\nWill nodded and they hurried into the warmth, leaving Edgar to enjoy his newfound life. They took off their coats and boots and Will sent Nico to set a film up whilst he made hot chocolate with marshmallows and whipped cream.\nWhilst he made the drinks, Will thought of his mother. They were going to see her on Christmas Eve and sleep over. They'd spend half of Christmas Day with her and the other half visiting Hazel, Frank and Reyna. On Boxing Day was the annual Camp Halfblood feast that all demigods were invited to so they'd get to see their friends. Nico and Will hadn't seen them for a while and of course they were looking forward to seeing Chiron and Mr. D too.\nWill set the mugs on a tray and carried it through. Nico sat curled up on the sofa drowning in several frayed blankets and flicking through the options on TV. Will smiled and set down the drinks on the coffee table, kissing Nico’s head and sitting beside him whilst taking some of the blankets for his own. Nico automatically turned to curl into Will and Will’s arms automatically wrapped around his shoulders to bring him closer. They merged close enough to almost become one.\n\"Which cheesy movie today?\" Nico pondered. \"A Christmas Carol?\"\nWill perked up in interest. \"Can we watched the Muppet version?\"\nNico rolled his eyes affectionately and kissed Will’s collarbone chastely.\n\"Sure, tesoro.\"\nAs the movie started playing, Will kissed Nico’s head again and used a finger to guide Nico’s jaw up so that their eyes could meet.\n\"Happy seven year anniversary, darlin',\" he said.\n\"And to you, Doc.\" Nico grinned, leaning up for a kiss.\nThe rest of the night was filled with movies, marshmallows and making out. It couldn't have been a better anniversary."
    },
    {
        "title": "Stop",
        "url": "https://archiveofourown.org/works/55350499",
        "fandoms": [
            "Percy Jackson and the Olympians - Rick Riordan",
            "Percy Jackson and the Olympians & Related Fandoms - All Media Types"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "20 Apr 2024",
        "language": "English",
        "words": "524",
        "chapters": "1/1",
        "collections": "1",
        "kudos": "18",
        "hits": "260",
        "post_title": "I’m not sure when it started.",
        "comment": "I'm not sure when it started.\nIt's the text I think. It's when he texts me that he's coming home and he doesn't put the heart after the goodbye and I think to myself that he's tired and I need to give him a break but my heart is breaking just a little bit.\nThen it's an evening when I turn over to cuddle him like usual and he shoves me off and mumbles something about being too warm and that would be fine but it never mattered for him. We'd cuddle with the covers off and sticky and sweaty but just giggle and shower together in the morning.\nThere’s an evening when our favourite show is on and we usually cuddle and make out a little but this time he says he's going out with some friends from work. I'm too scared of coming off as overbearing, which I know I can be, so I tell him I hope he has a good time and he leaves.\nHe starts spending all our time together on his phone. It's work stuff he says and that’s why he's been spending so much time at the office recently. He goes in early and works late and I wake up early and stay up late. I miss him.\nThere aren't any cheek or forehead kisses anymore. There's only ones on the lips and they're becoming shorter and shorter as if he views them as mandatory.\nI can't remember the last time he said that he loves me properly. He'll say a quick 'love you' if I say it first but he never initiates and never says the 'I'. I remember when he used to tell me a hundred times a day just so I would never forget. I'm not so sure he loves me anymore.\nGoodbye kisses are a thing of the past. I cling to the cinnamon taste of his lips and the way he smiled when I kissed him and caught him off guard. He hasn't kissed me in at least a week. He turns away when I try to kiss him and he laughs it off without looking at me.\nWhen I confront him, he laughs nervously and avoids my eyes. He blurts out a well-practiced spiel that doesn't actually answer any of my questions so I ask him directly if he loves me and he just says my name in such a devastating voice that that's the moment I break.\nI tell him not to stay because he feels like he has to. I tell him to get out and go to his sister's because I can't be with someone who doesn't love me. It isn't fair. He understands. He looks so broken and that’s infuriating because it shouldn't be him who gets to feel like that.\nHe leaves and locks the door behind him and I fall to the ground sobbing.\nI'm sobbing because it's all wrong. I'm sobbing because he doesn't love me but he did once and I don't know where I went wrong. I don't know what I did to make him stop.\nAnd that made it all stop."
    },
    {
        "title": "Soup and Stickers",
        "url": "https://archiveofourown.org/works/55354864",
        "fandoms": [
            "Percy Jackson and the Olympians - Rick Riordan",
            "Percy Jackson and the Olympians & Related Fandoms - All Media Types"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "21 Apr 2024",
        "language": "English",
        "words": "534",
        "chapters": "1/1",
        "collections": "1",
        "comments": "1",
        "kudos": "109",
        "bookmarks": "4",
        "hits": "1,101",
        "post_title": "Nico di Angelo is whipped\noh and his leg is broken but that’s not important",
        "comment": "\"Are you done yet?\" Nico complained.\n\"Nearly,\" Will promised. His eyes were narrowed and his tongue poked out of the corner of his mouth in concentration.\nNico had spent the last two weeks in hell.\nOkay, maybe he was exaggerating a little bit but he spent far longer than two weeks in literal hell so he was allowed to. Either way, it was not fun being stuck with a cast on your leg and the worst part was that he still had weeks left to go.\nWill came around every day to entertain him and forcefeed him soup and ambrosia. Having your boyfriend as your doctor does have some benifits. He got kisses at every checkup and left with at least six stickers and it was actually kind of nice just having someone to cared for him. He'd never admit that, of course.\n\"How long is this going to take?\" Nico grumbled. Will didn't look up.\n\"It's masterpiece, darlin'. I've got to take my time.\"\nNico rolled his eyes. This was the downside. For the last fifteen minutes, Will had stopped entertaining Nico in favour of making him sit still with his leg on a cushion whilst Will decorated his cast with several glitter pens. Every time Nico tried to lean forward to see what was happening, Will pushed him back.\nHe'd regretted it the instant he told Will he could sign his cast. So far, Nico had managed to avoid letting anyone near the thing but he couldn’t resist his boyfriend and the promise of as many games of mythomagic he wanted for the rest of the evening. Will was looking far too serious about his work for Nico not to be suspicious. When he said sign, he meant a name or a doodle not an entire art exhibit.\n\"It's going to be amazing, babe,\" Will assured him. \"I just have to finish.\"\nNico leaned back into his pillows and regretted his life decisions, which was becoming a common occurrence for him.\n\"Look, tesoro, not that I don't appreciate whatever this is but I'm really bored and-\"\n\"Done!\" Will interrupted him with one last line drawn. He sat up with a wide grin looking all too pleased with himself. \"Wanna see?\"\nHesitantly, Nico nodded. Will lit up and helped him up and to his crutches so he could look in the full length mirror in the bathroom.\n\"It's a little sloppy,\" Will told him. \"I did my best.\"\nNico lost his breath when he saw what was in the mirror.\nSmall doodles of hearts, suns and stars were spread across alongside some mini rainbows. What Nico was most focused on was the writing.\nGorgeous, brave, talented, loving, daring, helpful, sweet, stubborn, bold, kind, perfect.\nOn the rim of the top of the cast was written If lost, return to Will Solace.\n\"Will,\" Nico whispered. He could see Will’s anxious face in the mirror as the boy rocked back and forth on his heels with his hands clasped together.\n\"Do you like it?\" he asked, a twinge of fear in his voice. Nico let out a breathy laugh and turned to pull Will down by his collar for a kiss.\n\"You're something else, Solace.\""
    },
    {
        "title": "People are Dead, William",
        "url": "https://archiveofourown.org/works/55395715",
        "fandoms": [
            "Percy Jackson and the Olympians - Rick Riordan",
            "Percy Jackson and the Olympians & Related Fandoms - All Media Types"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "22 Apr 2024",
        "language": "English",
        "words": "543",
        "chapters": "1/1",
        "collections": "1",
        "kudos": "32",
        "hits": "331",
        "post_title": "",
        "comment": "Beach days: the sun shining down, the beauty of the waves, the gentle breeze and the feeling of sand beneath your feet.\nAll things Nico hated.\nPercy and Annabeth were playing chicken fight against Piper and Jason in the water, Reyna was reading a book, Frank and Hazel were chatting away whilst relaxing on a large float, Leo was trying to set the water on fire and Nico was being pestered by his boyfriend.\nWill rubbed the sunscreen on Nico's back as he talked about how fun beaches were. Incessantly. Loudly. Persistantly.\n\"Look, I just don't like them,\" Nico tried to reason.\n\"But they're so much fun!\" Will objected. \"Splashing people, sandcastles, picnics.\"\n\"Shark attacks, jellyfish, drowning.\"\n\"Okay, there's only about nine shark attacks that are fatal per year.\"\nNico raised an eyebrow and twisted around to face his boyfriend. \"People are dead, William.\"\nWill rolled his eyes and tackled Nico onto the blanket, positing himself so that Nico was trapped under his arms. He kissed Nico’s nose and grinned.\n\"We are at the beach with our friends,\" he said slowly. \"And you will have a good time.\"\nNico shook his head.\n\"You will!\" Will encouraged. \"I'm sending good vibes your way and there's  nothing you can do to stop them.\"\nNico scoffed but in the end he couldn't deny the adorable look on Will’s face.\n\"Fine,\" he said. \"But only because you're here.\"\nWill’s grin widened. \"Wouldn't expect anything else. Now come in the water!\"\nNico’s eyes widened. \"Hang on, I didn't say I would do that!\"\nWill dragged him to his feet. \"Too late, you shall.\"\nAs he was pulled towards the beach, Nico half heartedly tried to pull back, part of him already accepting his fate. So this is how he would die. He wondered whether the shark attack fatality rating would go up after this. He wondered if his dad would grow back his leg for him when he was a ghost.\n\"But I have a doctor's note!\" he yelled as Will scooped him up in his arms and chucked him far into the water. Nico spluttered, treading water as elegantly as possible, which is to say not at all. Will laughed and swam towards him.\nAnnoyingly, Will was still tall enough that he could stand where Nico couldn't.\n\"Cheer up, darlin'. Relax!\"\n\"You say that after being yeeted into a watery grave.\"\nWill pulled Nico to him, kissing his head. \"You're so dramatic. I love it.\"\n\"Hey!\" Percy waved enthusiastically from a short while away. \"You guys wanna chicken fight?\"\nWill glanced at Nico. Before he could even open his mouth to object, Nico was sitting on a pair of shoulders advancing towards a cheerful Percy and a smug Annabeth who had just sent Piper to the bottom of the ocean.\n\"This is it,\" Nico said to himself. \"I am dead.\"\nHe was not dead but his dignity was.\nHe lost, although he blamed it on Percy cheating, and found himself wrapped in a towel on one of the blankets scowling at Will.\n\"I hate beach days,\" he said but, as he looked around at his friends laughing and messing around for the first time in a long time, he smiled to himself.\nThey would still pay, though."
    },
    {
        "title": "Banana Pancakes",
        "url": "https://archiveofourown.org/works/55350391",
        "fandoms": [
            "Percy Jackson and the Olympians - Rick Riordan",
            "Percy Jackson and the Olympians & Related Fandoms - All Media Types"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "20 Apr 2024",
        "language": "English",
        "words": "548",
        "chapters": "1/1",
        "collections": "1",
        "kudos": "27",
        "hits": "456",
        "post_title": "The storm raged outside, streaks of lighting illuminating the inky black sky.\nZeus was clearly having one hell of a day.",
        "comment": "The storm raged outside, streaks of lighting illuminating the inky black sky.\nZeus was clearly having one hell of a day.\nShivering, Maria crept into her dads' room, crawling under the sheets in the small gap between her father's arm, which were wrapped around each other. Will shifted and blearily opened one eye.\n\"Oh, hey darlin'. Couldn't sleep?\"\nShe nodded and he smiled, kissing her cheek and squeezing her as she jumped at a rumble of thunder.\n\"Poor thing,\" he murmured. At this, Nico started to stir. He propped himself up on the pillow and raised a hand to stroke through Maria's thick, black curls.\n\"Would a song help?\" Will asked with a bright smile. Nico rolled his eyes playfully as the corners of his mouth raised and Maria nodded, curling into Nico’s side as her other father went to pick his guitar up from its home at the end of the bed specifically for instances just as this. Music calmed Will through his nightmares and they calmed Nico and Maria too.\nWill sat cross legged on the bed facing them and stated to play.\n\"Can't you see that it's just raining\nAin't no need to go outside\n\"But baby, you hardly even notice\nWhen I try to show you this\nSong is meant to keep ya\nFrom doing what you're supposed to\nLike waking up too earlu\nMaybe we can sleep in\nI'll make you banana panckes\nPretend like it's the weekend now\n\"And we could pretend it all the time\nCan't you see that it's just raining\nAin't no need to go outside\n\"But just maybe, lala ukulele\nMama made a baby\nReally don't mind the practice\n'Cause you're my little lady\nLady, lady, love me\nCause I love to lay here lazy\nWe could close the curtians\nPretend like there's no world putaide\n\"And we could pretend it all the time\nCan't you see that it's just raining\nAin't no need to go outside\n\"Ain't no need, ain't no need, mmmm mmmmm\n\"Can't you see, can't you see\nRain all day\nI don't mind\n\"But the telephone is singing\nRingng it's too early\nDon't pick it up\nWe don't need to we got everything\nWe need right here\nAnd everything we need is enough\nJust so east\nWhen the whole world fits inside of your arms\nDon't really need to pay attention to the alarm\nWake up slow, mm mm, wake up slow\n\"But baby, you hardly even notice\nWhen I try to show you this\nSong is meant to keep ya\nFrom doing what you're supposesnt\nLike waking up too early\nMaybe we can sleep in\nI'll make you banana pancakes\nPretend like it's the weekend now\n\"And we can pretend it all the time\nCan't you see that it's just raining\nAin't no news to go outside\n\"Ain't no need, ain't no need\nRain all day and I really, really, really don't mind\nCan't you see, can't you see?\nYou gotta wake up slow.\"\n\"Caro?\" Nico whispered. Maria was breathing heavier, her eyes closed. Nico smiled and kissed her head. Will carefully set his guitar down and joined them, pulling the covers over his family. He pecked Nico’s lips and kissed his daughter's head before closing his eyes. They really were lucky.\n\"Goodnight.\""
    },
    {
        "title": "My Little Hell Spawns",
        "url": "https://archiveofourown.org/works/55554148",
        "fandoms": [
            "Percy Jackson and the Olympians - Rick Riordan",
            "Percy Jackson and the Olympians & Related Fandoms - All Media Types"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "29 Apr 2024",
        "language": "English",
        "words": "559",
        "chapters": "1/1",
        "collections": "1",
        "comments": "2",
        "kudos": "119",
        "bookmarks": "3",
        "hits": "1,047",
        "post_title": "\"Hello, my little hell spawns! Today is a very special day because I finally persuaded my boyfriend to be in a video with me!\"",
        "comment": "\"Hello, my little hell spawns! Today is a very special day because I finally persuaded my boyfriend to be in a video with me!\"\n\"You forced me to, more like,\" Will interjected. Nico turned away from the camera to stick his tongue out.\n\"This is my Will and he has graced us with his presence today for a makeup challenge where I get to put whatever makeup on him I like and he isn't allowed to see.\"\n\"I'm very nervous.\"\n\"You should be.\" Nico kissed Will’s cheek. Will rolled his eyes fondly and rubbed their noses together, forgetting momentarily that they were on camera. Never mind. They could edit that bit out.\nNico kissed Will briefly on the lips, unable to contain his mischievous grin.\n\"Close your eyes,\" he whispered. Will pulled the sleeves of his jumper down and sighed but dutifully closed them. Nico was wearing one of Will’s jumpers, which was far too big for him, so he rolled up the sleeves to the elbow and got out a makeup pallet.\n\"I want it to be known,\" he said. \"That I do my own makeup every day so whatever I create here will be deliberately bad. Now, whilst we do this challenge, I have printed a list of questions I get to ask Will to make this even worse for him. And they're all about me. Thank you for the suggestions by the way!\"\n\"Hang on, this wasn't agreed on!\"\n\"Do you love me?\"\n\"Yes.\"\n\"Do you trust me?\"\n\"No.\"\n\"Well, you'll have to trust me on this.\"\nNico got a brush and got to work.\n\"Question one is when is my birthday?\"\n\"January 28th,\" Will replied.\n\"What's my favourite movie?\"\n\"The Grinch. It's all we watch during Christmas.\" Will snorted. \"I like to think he embodies you. A grumpy old man who's really a big softie.\"\n\"Be aware that I'm doing your makeup right now and could do anything to that pretty face of yours.\"\nWill grinned. \"You think I'm pretty?\"\nNico rolled his eyes, picked up a different brush and started on a new colour. The video was meant to be jokey but he was actually taking this quite seriously. The corner of his  tongue stuck out of his mouth in concentration and his eyes were narrowed and focused.\n\"What would be my three wishes if I had a genie?\"\nWill thought for a moment. \"For all the queerphobes in the world to be sent to live on Mars, to bring back life and to own McDonald's.\"\n\"All except the bringing back life.\"\n\"Really?\"\n\"Let the dead stay dead. Alright, next question. Do I want kids?\"\nWill choked on his own spit. Nico patted him on the back, amused.\n\"You okay, tesoro?\"\n\"Yep.\" Will nodded. \"That just caught me by surprise. I don't know. Do you?\"\n\"Maybe.\" Nico shrugged. \"But at the same time I have more than enough right now.\"\n\"That's sweet.\"\n\"Alright, I'm done. Ready to see?\"\nWill shuddered. \"No.\"\n\"Three, two, one, open your eyes!\"\nWhen Will caught sight of himself, his jaw dropped. Brightly coloured face, round ears, button nose.\n\"You did not. Nico, you did not turn me into a carebear!\"\nNico burst out laughing.\n\"Don't bother tuning in for the next video,\" Will advised. \"There might not be a Nico left to run it.\"\n\"And on that note, bye!\""
    },
    {
        "title": "Kissing Lessons",
        "url": "https://archiveofourown.org/works/55396204",
        "fandoms": [
            "Percy Jackson and the Olympians - Rick Riordan",
            "Percy Jackson and the Olympians & Related Fandoms - All Media Types"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "22 Apr 2024",
        "language": "English",
        "words": "563",
        "chapters": "1/1",
        "collections": "1",
        "comments": "4",
        "kudos": "90",
        "bookmarks": "5",
        "hits": "952",
        "post_title": "“Will, have you ever kissed someone?”",
        "comment": "Nico and Will were in the Hades Cabin playing Mythomagic when the question arose.\n“Will, have you ever kissed someone?”\nThere was silence. Will could feel his cheeks turning bright red.\n“Yes,” he answered somewhat hesitantly. Looking deep in thought, Nico nodded.\n“Can you teach me?”\nDespite how unfazed Nico looked by all this, Will was rivalling a tomato. Teach?\n“I’ve always been curious as to like... how you do it,” Nico continued. “And you’re my best friend so obviously you are my go to.”\nBest friend, Will repeated in his head. Just friends helping out friends. Buddies being buddies. His heart sank just a little but he smiled and went to sit on Nico’s bed with his legs crossed. Nico did the same and sat opposite him.\n“Okay, well,” Will fumbled around for the words. “Let’s start with the basics. Pouting lips. You know about that, right?”\nNico’s head tilted to one side like an adorably confused animal.\n“It’s where you go like this.” Will made a kissing face as best he could. Nico snorted.\n“You look like a duck.”\n“Well then I know better to help you out in the future.”\nNico grabbed Will’s arms. “Wait, I’m sorry. You’re a very handsome duck.”\nHe dropped Will’s arms and mimicked the face.\n“Like this?” his muffled voice asked. Will couldn’t help but start laughing.\n“It does look like a duck!”\nNico burst out laughing with him.\nIt took a few minutes but eventually they calmed down.\n“Okay, we got the basics.” Will caught his breath.\n“Wait but there’s more right?” Nico said. “When people make out and stuff. They lick each other.”\n“Oh my gods!” Will was both cracking up and blushing hard enough he glowed.\n“What? They lick each others’ mouths and stuff.”\n“Yeah I guess they lick each other.” Will gasped for air.\n“And don’t they bite each other too? Eat each other?”\nWill howled with laughter, rolling onto his side and clutching his stomach. Nico couldn’t help but smile at the sight.\n“What? What did I say?”\nWill sat back up, a hand over his mouth to cover his laughter.\n“One last question, I promise,” Nico implored. “What do you do with your eyes?”\n“You shut them,” Will said. He closed his eyes for demonstration. When he opened them, Nico nodded thoughtfully.\nBefore Will could process it, Nico had shut his eyes, leaned forward and given him a brief but sweet kiss.\n“Like that?” Nico questioned nervously.\nWill’s brain had stopped working. His mouth opened and closed aimlessly and his eyes were as wide as saucers.\n“Did I get it wrong?”\nWill shook his head. “No... You know, these things take practice.”\nNico raised an eyebrow. “Really? It’s just mushing faces together. I think I did pretty good.”\n“You did amazing,” Will confirmed. “But there’s other stuff too.”\nHe shuffled closer, gazing into Nico’s wide eyes. He raised his hands to cup Nico’s face and tuck that bit of loose hair behind his ear.\n“Like this?” Nico lifted his hands to do the same to Will’s face, brown eyes looking over every inch of it.\n“Yeah,” Will said quietly. “Then you lean in.”\nHe leaned in as he spoke until their lips were a breath away. He couldn’t stop looking at how close they were.\n“You’re supposed to close your eyes,” Nico whispered. Will nodded.\n“Yeah.”\nAnd he did."
    },
    {
        "title": "The Constable’s Love is Conditional",
        "url": "https://archiveofourown.org/works/55395883",
        "fandoms": [
            "Percy Jackson and the Olympians - Rick Riordan",
            "Percy Jackson and the Olympians & Related Fandoms - All Media Types"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "22 Apr 2024",
        "language": "English",
        "words": "582",
        "chapters": "1/1",
        "collections": "1",
        "kudos": "53",
        "bookmarks": "3",
        "hits": "483",
        "post_title": "\"I made you breakfast in bed.\"\n\"That's very sweet but I don't forgive you for waking me up.\"",
        "comment": "The best feeling in the world was waking up next to Nico Di Angelo. Will had been living for five years experiencing this every morning. Beside Will, curled up with his tangled hair spread around his head like a dark halo, lay the Son of Hades. His dark lashes cast shadows over his angled face with the lightest of freckles barely noticeable against his olive skin. His lips were slightly parted and a pale pink that looked so kissable. He was thoroughly snuggled under the blankets, warm and cozy and safe.\nWill carefully got out of bed and went to go make breakfast. He made toast with fruit and yogurt and brought it back into the bedroom to set on their bedside table. Then he leaned down and started peppering Nico’s face with kisses.\n\"Wake up, my love,\" he whispered with a kiss to Nico’s adorably scrunched up nose. \"We're going to Hazel's this afternoon.\"\nNico groaned and rolled over, holding a pillow over his head. Will smiled wryly and waited for a few seconds before he pounced and started tickling his husband. Nico yelped in indignation and turned bright red and breathless from laughing so much.\n\"Will!\" he protested. \"Will! Stop!\"\n\"You gettin' out of bed?\"\n\"Fine!\"\nWill’s hands ceased tickling and wrapped around Nico’s waist instead as he sat up, moving to sit between Will’s legs. Will rested his chin on Nico’s shoulder and chastely kissed his neck.\n\"I made you breakfast in bed.\"\n\"That's very sweet but I don't forgive you for waking me up.\"\n\"I'm sorry, darlin', but it's eleven and we said we'd be there at two!\"\nNico leaned back into Will’s warm, welcoming embrace.\n\"That's ages away.\"\n\"Not for two people with no perception of time.\"\n\"Fair point. How's my wonderful husband today?\"\nWill grinned. He didn't think he would ever get sick of hearing that. Nico asked every morning. What started off as \"my wonderful doctor\" turned into \"my wonderful best friend\" which in turn led to \"my wonderful boyfriend\" and not too long after but plenty long enough it was \"my wonderful fiancé\". Two years ago it changed into \"my wonderful husband\". Will’s grin grew wider with every progression. It was his favourite part of the morning.\n\"Better for seeing you,\" he responded like he always did. He saw Nico smiling and gentle took Nico’s jaw to turn his head and kiss the smile on his lips. It was even brighter when they parted.\n\"I love you,\" Nico said.\n\"I love you too.\"\n\"I love you even more for the breakfast in bed.\"\n\"Oh, is your love conditional?\"\n\"Would the constable love us if we didn't feed her?\"\n\"Good point.\"\nTheir cat, Connie, was lying at the foot of the bed fast asleep. In actual fact Connie was short for Constellation but Nico and Will always called her Constable. She was ginger and black with green eyes and a lazy attitude. The Constable's love was very much conditional but she was their baby so they didn't mind.\nWhen Nico finished eating, he turned on his side to curl into Will with a satisfied sigh. Will’s arms wrapped loosely around him. He kissed Nico’s head and gave him a squeeze.\n\"We gotta get up, Nico.\"\n\"No,\" Nico whined. \"I'm so comfy. Please, Doc.\"\n\"It's your sister.\"\nNico frowned and leaned up to kiss Will shortly before dragging himself out of bed.\n\"Fine. I'll go shower.\"\nHe turned back with a mischievous smile.\n\"Wanna join me?\""
    },
    {
        "title": "Their World",
        "url": "https://archiveofourown.org/works/55396012",
        "fandoms": [
            "Percy Jackson and the Olympians - Rick Riordan",
            "Percy Jackson and the Olympians & Related Fandoms - All Media Types"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "22 Apr 2024",
        "language": "English",
        "words": "586",
        "chapters": "1/1",
        "collections": "1",
        "comments": "2",
        "kudos": "84",
        "bookmarks": "1",
        "hits": "576",
        "post_title": "Nico takes lots of photos of Will and it’s adorable.",
        "comment": "“How was your day, honey?” Will asked as Nico came through the door carrying two bags of groceries and dumping them ceremoniously on the kitchen counter. Will out the kettle on.\n“Tense,” Nico admitted. “Maeve and Lucy split up so that was awkward.”\n“They did?” Will frowned. “Why?”\n“Lucy thought Maeve was cheating on her and asked to see her phone and the answer was no.”\n“Was she cheating?”\n“I don’t know but they had a big blowout over it.”\nWill poured the coffee and handed it to Nico, who kissed his cheek on gratitude.\n“I see where Maeve’s coming from. Everyone has private conversations. It doesn’t mean you’re cheating.\"\n“If you can’t trust each other then I don’t think you should be together.” Nico shrugged. “You know you could go through my phone anytime, right?”\nWill hesitated. “What?”\nNico placed his coffee on the counter and moved to slide his hands up Will’s chest with a teasing smile contradicted by the innocent tilt of his head.\n“You can check my phone. I mean, obviously I’d prefer you not to be reading through all my private messages because that wouldn’t be healthy but if I ask you to respond to a text for me or something and you glance at some stuff that’s okay.”\nHe kissed Will shortly.\n“Besides, I’ve hit the jackpot anyway,” he continued. “Intense jealousy and controlling behaviour is abusive. Looking through cute photos of us on my phone is cool. Anything as long as you don’t look at my search history.”\nWill chuckled and kissed Nico again.\n“Could you use some sleep?” Will asked once they parted.\n“I could stay up for a little longer,” Nico suggested with a glint in his eyes.\n-\nWill wasn’t a particularly jealous guy. When Nico received a text from a friend and told Will to answer it for him, he did end up looking through some other apps but it was mostly so he could tease Nico about all the games he was playing and Nico was right over his shoulder the whole time.\nHe ended up in the photos app out of curiosity. Nico had a look on his face that suggested he was up to no good.\n“What photos have you been taking?” Will asked. Nico wrapped his arms around Will’s stomach and snuggled into his side.\n“Important ones.”\nWill started scrolling through. There was one of Hazel with a milkshake, one of Jason pulling a funny face, one of Kayla and Austin jumping into a river.\nThen there was one of Nico kissing Will’s cheek, one of Nico and Will on their date, one of Will laughing, one of Will building a fort in the woods, one of Will and Nico dancing, one of Will reading, one of him watching a sunset, one of him sitting on a rock, one of him eating ice cream, one of him chatting happily with his siblings.\nWill kept scrolling and there were so many of just him in these small moments he hadn’t even realised Nico had thought to capture.\n“Why so many of me?” Will asked. Nico smiled.\n“I’m a photographer, Will. My job is to take pictures of the world so I’ve taken lots of mine.”\nWill put the phone down to hold Nico close, kissing him in a way that tried to convey just how much this meant, how much Nico meant. Here in their apartment with loved ones and each other was more than enough. He could live in their world forever."
    },
    {
        "title": "Eggs",
        "url": "https://archiveofourown.org/works/55348657",
        "fandoms": [
            "Percy Jackson and the Olympians - Rick Riordan",
            "Percy Jackson and the Olympians & Related Fandoms - All Media Types"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "20 Apr 2024",
        "language": "English",
        "words": "589",
        "chapters": "1/1",
        "collections": "1",
        "comments": "1",
        "kudos": "89",
        "bookmarks": "4",
        "hits": "614",
        "post_title": "He was perfectly happy with the way his life was turning out up until sixteen minutes past ten on a Monday morning when he realised he was six eggs short for the lesson. He groaned and banged his head on the desk. Originally, he'd only been three eggs short but it turned out that teenagers and fragile things are not a good combination so now there was no use delaying the inevitable. He would have to call Nico.",
        "comment": "Dr. Will Solace was now twenty five, living with his twenty four year old fiancé, Nico Di Angelo, and teaching Biology at Goode High. He was perfectly happy with the way his life was turning out up until sixteen minutes past ten on a Monday morning when he realised he was six eggs short for the lesson. He groaned and banged his head on the desk. Originally, he'd only been three eggs short but it turned out that teenagers and fragile things are not a good combination so now there was no use delaying the inevitable. He would have to call Nico.\nWill motioned for the class to be silent and dialled the number. Nico was currently taking a sick day for the after affects of a particularly nasty cold he'd had for a couple of days and, whilst Will thought he would be okay to drive to Good High by now, Will knew that the son of Hades would not be pleased that Will was bothering him and especially not for eggs.\n\"Hey, babe,\" Will stood up and turned away from the class, putting on a falsely cheery accent.\n\"What do you want, Solace?\" Nico groaned. \"Aren't you supposed to be teaching?\"\nWill eyed his students. \"Yes, that's the problem. I'm going to need you to bring a carton of eggs to my lesson.\"\n\"Eggs?\" Nico repeated. \"What the Hades do you need eggs for? I thought you taught Biology not Cooking class.\"\n\"Please, darlin'. I'll do the dishes for a month.\"\n\"Three.\"\n\"Two.\"\n\"Done!\" Will could practically hear Nico shooting out of bed. \"I'll be there in ten minutes. Love you!\"\n\"Love you too,\" Will replied but Nico had already hung up. The class was staring at him, some curious and some bearing scary resemblance to Leo Valdez. Will slid into his chair again and blushed, clearing his throat and telling them to amuse themselves for a bit.\nExactly ten minutes later, the door was flung open and slammed shut as in burst Nico Di Angelo. He didn't even look particularly angry. He was just a fan of dramatic entrances. His eyes swept over the class, who were all staring gobsmacked at him, and stopped on Will, who stood up and headed over.\n\"Got your eggs, Doc,\" Nico announced louder than necessary with a smirk. Will took them and set them down on his desk.\n\"Thanks, hon. You're the best.\"\n\"I know that.\"\nWill raised an eyebrow and Nico sighed, crossing his arms. \"Fine. You're welcome.\"\nThe class was starting to mutter among themselves and the boy closest to them spoke up.\n\"This is your fiancé?!\" he exclaimed. Nico nodded.\n\"He's lucky, isn't he? So, you're the little shits that have to put up with him? I would pity you but I'm the one who has to live with him.\"\n\"Neeks! You can't swear at high school students!\" Will spluttered. Nico frowned, scrunching up his nose.\n\"Why not? They're all, like, sixteen. Except that one over there. He looks about twelve.\"\n\"Nico!\"\nNico rolled his eyes and huffed. He pecked Will's cheek and spun on his heels, stuffing a hand in his pocket and grabbing the door handle with the other. He turned around and winked.\n\"Love you, baby,\" he cooed, deliberately turning Will bright red. Nico laughed and blew him a kiss before leaving. A hundred curse words ran through Will's head but he composed himself and ignored his giggling class.\n\"Ahem,\" he clapped his hands together. \"Sorry about that. Where were we? Ah, yes. Eggs.\""
    },
    {
        "title": "Mother Jason",
        "url": "https://archiveofourown.org/works/55355071",
        "fandoms": [
            "Percy Jackson and the Olympians - Rick Riordan",
            "Percy Jackson and the Olympians & Related Fandoms - All Media Types"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "21 Apr 2024",
        "language": "English",
        "words": "591",
        "chapters": "1/1",
        "collections": "1",
        "comments": "1",
        "kudos": "73",
        "bookmarks": "4",
        "hits": "512",
        "post_title": "In which I project my Asian family onto a bunch of teenage boys",
        "comment": "Nico bolted towards his cabin, not caring who saw. He flung open the door to where he'd been expecting Jason and Percy to be waiting whilst trying to wrap their heads around mythomagic since that was the only way they could get Nico to agree to do their family games night.\nHe leaned against the door, chest heaving up and down. Jason jumped to his feet immediately and started fussing over him, checking his temperature and asking him a million questions a minute. Percy had a deep frown as he studied one of the cards, not looking up.\nNico swatted Jason away. \"I'm fine. I'm fine.\"\n\"Don't you lie to me, young man.\" Jason put his hands on his hips. \"Now where have you been? You’re five minutes late.\"\n\"Sorry, I was caught up in a conversation,\" Nico said. \"Wait, why am I apologising?\"\n\"This is family game night,\" Jason scolded. \"For once we can actually sit down and spend time together. It's good for all of us, right Percy?\"\nPercy was still shuffling through the cards and didn't glance up as he said, \"Listen to Jason, Nico.\"\nNico rolled his eyes and folded his arms. Jason raised an eyebrow.\n\"I know I didn't just see that,\" he said. \"Who were you talking to? One of your responsibile friends, I hope.\"\n\"Gods, it was just Will!\" Nico couldn't stop the flicker of a smile on his face. \"We're going on a date this weekend.\"\nAt this, Percy did look up. He walked over and slapped Nico on the back in congratulations. Jason's eyebrows shot up his hairline.\n\"A date?\" he repeated.\n\"I'm here now.\" Nico sighed. \"Let's play.\"\nHe sat cross-legged on the floor and started to set the game up. Jason sat opposite him, glaring at him.\n\"I'd like to know more about this date of yours,\" he demanded.\n\"You guys know Will.\"\n\"I knew Friend Will. I don't know Boyfriend Will,\" Jason countered. Nico blushed tomato red.\n\"We haven't even been on the first date yet. He's not my boyfriend.\"\nPercy jabbed his side with a wink. \"Not yet. My boy's got game.\"\nNico buried his head in his hands. This was the most embarrassing day of his life.\n\"He's very tall,\" Jason noted. \"I don't trust tall people.\"\n\"You and Percy are tall,\" Nico objected. Jason wagged a finger.\n\"Exactly and look at us. What are his plans for the future? How old is he? What's his criminal record?\"\nNico shot him a look of exasperation. \"He's going to medical school, he's my age and he has no criminal record unlike the rest of the camp.\"\n\"He's around drugs all day,\" Jason pointed out. \"Ever sneak some for himself?\"\n\"He doesn't get high.\" Nico groaned. \"You're being ridiculous.\"\n\"I'm being careful. Now I have a list of rules that I created for any future boyfriends you might have and-\"\n\"Stop!\" Nico held up a hand. \"I'll invite him over for tea if it becomes official and you can threaten him then. Can we please just do this stupid family game night.\"\nJason fell quiet. Nico handed out the cards and started talking about the rules, ignoring the Percy's wiggling eyebrows. They played a few rounds that evening and Nico won every time but he had to adit that it was quite fun. They were having a sleepover in Nico’s cabin that night so they all went to bed and just as the lights were turned out Jason spoke.\n\"At least he's a doctor.\"\n\"Oh my gods, shut up!\""
    },
    {
        "title": "Heart Like Yours",
        "url": "https://archiveofourown.org/works/58768867",
        "fandoms": [
            "Percy Jackson and the Olympians - Rick Riordan",
            "Percy Jackson and the Olympians & Related Fandoms - All Media Types"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "07 Sep 2024",
        "language": "English",
        "words": "603",
        "chapters": "1/1",
        "collections": "1",
        "comments": "2",
        "kudos": "48",
        "bookmarks": "3",
        "hits": "544",
        "post_title": "Will felt his heart rate slow down, fear giving way to exhaustion.\n\"You good, honey?\" he murmured.\n\"Yeah.\" Nico inhaled sharply, clutching tighter. \"Are you?\"",
        "comment": "Will awoke to an empty bed.\nHe frowned, rubbing his eyes with his forearm. It was dark and the room was lit by a red night light that Nico had bought for them both after Tartarus.\nTartarus. Gods, that was a long time ago but it felt torturously raw.\nWill could still feel Nico's warmth on the other side of the bed. He tried to focus on it and steady his breathing.\nNico's okay. He's safe.\nWincing, Will pushed himself to sitting. The dark blobs of the cocoa puffs sat scattered around the room. Some lay at the foot of the bed, others in the corners of the room and some nestled in the closet.\nWill pulled on a tank top, rubbing the material with his thumb to ground himself. He stood up and padded along the corridor to the kitchen.\nHe felt every bit of tension being harshly expelled from his body, replaced with knee-weakening relief, when he saw Nico making themself a cup of coffee.\nNico glanced up, stiffening and then forcing himself to relax. They were twitchy in the way they only were after a nightmare.\n\"Hey, baby.\" Will breathed steadier.\nNico said nothing, abandoning his coffee and moving to wrap themself tightly around Will. Will responded with equal ferocity, nosing against Nico's temple then burying his face in dark curls. He pulled Nico closer, melding them together as close as was physically possible.\nHe could feel Nico's hands grasping at the thin material between his shoulder blades. They swayed slightly, matching each other's breathing.\nThey'd started the habit of regulating themselves like this since returning from Tarturus.\nWill felt his heart rate slow down, fear giving way to exhaustion.\n\"You good, honey?\" he murmured.\n\"Yeah.\" Nico inhaled sharply, clutching tighter. \"Are you?\"\n\"Yeah.\"\nNico moved his head back to scan Will's face. They liked to check for injuries after nightmares.\nWill tried to smile reassuringly. He raised a hand to cup Nico's cheek.\n\"I'm alright,\" he said. Nico nodded jerkily.\n\"I know that in here.\" He pointed to their head, grimacing. \"But not in here.\" They layed their hand on their heart.\nWill nodded, firmly kissing Nico's forehead.\n\"I can relate to that,\" he said. \"I love you very much.\"\nNico hummed. \"You too.\"\nWrapping a hand around Will's neck, they brought him down for a short kiss.\nWill smiled, nudging their noses together. \"Pretty baby.\"\nNico scowled. \"I think you mean fearsome warrior.\"\n\"That too,\" Will agreed. \"Got me someone who can do both.\"\nNico laughed quietly. \"You're ridiculous.\"\n\"Thank you.\"\nNico rested his head on Will's chest.\n\"It's still nighttime,\" Will reminded them.\n\"Stay up for a little longer,\" Nico muttered sleepily. They shifted to grab their phone off the counter and put on a playlist before settling back in his place, shrouded in comfort.\nWill moved them from side to side until they were semi-dancing.\nNico smiled, allowing himself to be spun and swayed. He hummed along to the music٫ tugging Will into a twirl.\n\"How could a heart like yours ever love a heart like mine?\" they sang softly. \"How could I live before? How could I have been so blind? You opened up my eyes. You opened up my eyes.\"\nEventually, their dancing dissolved into simply holding each other close.\nNico stifled a yawn. Will handed him their phone and gently guided them back to bed.\nThey curled up together, Will resting his head on Nico's chest to listen to his heartbeat.\n\"Pretty baby,\" he said again as he traced the outline of Nico's collarbone.\nHe smiled when Nico didn't respond, already fast asleep."
    },
    {
        "title": "It’s Legal",
        "url": "https://archiveofourown.org/works/55349017",
        "fandoms": [
            "Percy Jackson and the Olympians - Rick Riordan",
            "Percy Jackson and the Olympians & Related Fandoms - All Media Types"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "20 Apr 2024",
        "language": "English",
        "words": "639",
        "chapters": "1/1",
        "collections": "1",
        "comments": "1",
        "kudos": "55",
        "bookmarks": "1",
        "hits": "572",
        "post_title": "\"We were just sitting around the campfire singing songs,\" she started, \"when Chiron said he had an announcement and, oh gods, it's great news-\"",
        "comment": "Nico rubbed his eyes, groaning. He hadn't meant to have a nap but he'd been in his cabin cuddling with his boyfriend of two years and he'd drifted off. He felt Will's arm around his torso tighten when he moved and smiled to himself. His back was held against a warm body, nose pressing into the back of his neck. He turned around and burrowed into Will's chest, sighing contentedly. Unfortunately, the peace wasn't to last.\n\"Neeks! Will!\" Jason burst through the door that Nico was sure he had locked, grinning like an idiot as he plopped himself down at the end of Nico's bed.\n\"Don't call me Neeks.\" The son of Hades scowled. He pushed himself up on his elbows as Will started to stir, loosening his grip, blinking and greeting the intruder. Nico smiled fondly at Will as he yawned and sat up, stretching like a cat.\n\"Okay, okay.\" Jason held up his hands but didn't appear sincere. \"Just come with me.\"\nHe grabbed the hand of Nico, who in turn grabbed Will's hoodie, and dragged the pair out of the cabin. Nico glanced at his boyfriend, who shrugged and entwined their hands as they followed Jason to the campfire. Nico was about to protest about being taken from a warm bed and a warm body to go to the campfire that was held every night but then he spotted his friends among the crowd and they were all wearing suspicious beams. As Jason, Nico and Will approached, they exchanged excited looks. Jason stood by his girlfriend, his grin almost maniacal now. Nico raised his eyebrows.\n\"What did you do this time?\" Will asked, obviously thinking the same thing.\n\"Nothing!\" Annabeth exclaimed. Nico's eyebrows shot further up his forehead. If Annabeth was in on it then gods know what was going on. She locked eyes with Piper, who nodded as her smile grew. Piper turned to Nico and Will and let out a giddy giggle.\n\"We were just sitting around the campfire singing songs,\" she started, \"when Chiron said he had an announcement and, oh gods, it's great news-\"\n\"And long overdue,\" Percy added. Leo nodded fervently. Nico frowned and noticed a similar expression on Will's face. He squeezed his hand.\n\"Anyway,\" Piper continued, \"he told us about the mortal world and about how-\"\n\"They legalised gay marriage!\" Jason interrupted.\n\"It should never have been invalid in the first place,\" Annabeth said in her tone that always led to a lecture about how unfair and messed up the mortal world was. Neither Will nor Nico were laying her much attention. They met each other's gaze with matching shocked expressions.\n\"Sunshine, you know what this means,\" Will said quietly. Nico nodded, tears pricking the corners of his eyes.\n\"I can marry you,\" he whispered, a smile forming on his face.\n\"It's legal!\" Will grinned.\n\"You can marry me,\" Nico said louder now. He didn't know if who he was telling but he had to say it. Will laughed and ran a hand through his hair in disbelief. Nico grabbed Will's face and pulled him down for a kiss. They pulled away and he let out a breathless chuckle.\n\"In ten years time, we'll have a house together.\" He sighed happily. \"We'll have a dog and a cat and a kid and we can be husbands, tesoro. We'll have a big ceremony and invite all our friends and family and you're going to look so handsome in your suit and we can get married!\"\nHe kissed Will again, looping his arms around Will's neck and feeling arms around his waist, pulling him close in return. Neither cared that the rest of the camp was probably staring at them. They broke apart and hugged so tightly that they struggled to breathe.\n\"I love you, Nico.\"\n\"I love you too, Will.\""
    },
    {
        "title": "Labyrinth",
        "url": "https://archiveofourown.org/works/58358251",
        "fandoms": [
            "Percy Jackson and the Olympians - Rick Riordan",
            "Percy Jackson and the Olympians & Related Fandoms - All Media Types"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "M/M",
        "status": "Complete Work",
        "published": "21 Aug 2024",
        "language": "English",
        "words": "709",
        "chapters": "1/1",
        "collections": "1",
        "comments": "1",
        "kudos": "117",
        "bookmarks": "3",
        "hits": "1,369",
        "post_title": "\"Who are you?\" Nico demanded. \"Are you a god?\"\n\"You're not going to believe this but I'm your boyfriend.\"",
        "comment": "A loud thud made Nico jolt awake. He scrambled to his feet, eyes darting around the room. He rubbed his eyes, grabbing his sword and holding it out stiffly in front of him.\n\"Who's there?\"\nThere's a groan and Nico spins around to find a body-shaped heap on the floor. Nico took a step back. Where was King Minos when you needed him?\nThe heap started to rise.\n\"Who are you?\" Nico demanded. \"Are you a god?\"\nA head lifted to reveal a freckled, gangly guy with blue eyes and curly hair. He looked kind of like a god. Or at least he looked pretty godly. Nico tried to steady his shaking hands. The possibly-a-god's eyes widened, scanning Nico from head to toe. Nico flinched, taking another step back. He was powerful. He was the Ghost King. He could take this guy on.\n\"Woah!\" The guy held up his hands, sensing Nico’s anxiety. \"I'm not a god. Or a monster. You're not going to believe this but I'm your boyfriend.\"\nNico nearly dropped his sword.\n\"Obviously I'm not your boyfriend yet,\" the guy started to ramble. \"Maybe not for a few years. By the way, what year is it? How old are you? Where are we? Also, I hope time isn't still going because you're going to be super annoyed if I miss our date. Not you you. You like my you. But not mine because you're your you. But not this you because that would be wildly inappropriate. I'm not a pedophile. I promise. You're, like, twenty. Where I come from. Completely age appropriate. I feel like I'm digging myself into a hole. I should shut up.\"\nNico's mouth opened and closed a few times. \"What kind of weird monster are you?\"\n\"Not a monster!\" The guy interjected. \"My name is Will. I'm just a guy. Not on any mythomagic cards. You're a mythomagic guy at this age, right?\"\n\"Mythomagic is for kids.\" Nico scowled.\n\"Take that as a no then.\" Will winced. \"Look, I just want to get back to my home. In the future. So, um, sorry to bother you. Do you happen to know where the exit is?\"\nNico stared at him. \"It's a Labyrinth. No one knows where the exit is.\"\nWill blinked. Then he took a deep breath, tilted his head to the air and let out a silent scream.\n\"Of course it's a Labyrinth!\" He threw his hands in the air. \"Why would anything ever be simple? I wanted pizza and Shrek. Was that too much to ask?\"\nNico kept his sword firmly in between them. \"Sorry about your pizza. I'm going to go now.\"\n\"Wait, wait!\" Will said. \"You're smart. You know your way around a Labyrinth. Any chance you could help a guy out?\"\n\"If I say no, will you follow me?\"\nWill hesitated. \"Probably.\"\nNico sighed. \"Come on, then. There's a ghost around here somewhere, by the way.\"\nWill nodded. \"Good to know.\"\nNico made Will go first, sword lightly prodding Will’s back. They walked for a while, narrowly avoiding getting caught in some traps. Will got snatched up by a net and Nico nearly got hit by an arrow but mostly they were unscathed.\nNico made a point not to talk as they walked. He still wasn't sure if Will was a demigod or if he was messing with him and it was better safe than sorry.\nEventually, they rounded to a dead end. Nico turned to try another path but Will stopped.\n\"Something's off,\" he said, pulling a rock from his pocket.\n\"Why do you have rocks in your pocket?\" Nico wrinkled his nose.\nWill frowned. \"It's a cool rock.\"\nHe threw it and it rolled right through the supposed wall.\n\"Huh,\" Will said. He took a tentative step forward. Then another. He stood right in front of the wall and was about to walk through when...\nHe vanished.\nNico jumped back in alarm, poking his sword at the air where Will had just been. He was about to start calling for Will when he heard King Minos' voice.\n\"My lord?\" Minos asked. \"Are you alright?\"\nNico hesitated. \"Yeah, I... I thought I saw something.\"\nHe turned away. He didn't have time for this. Bianca needed him."
    }
]