[
    {
        "title": "I Must Leave",
        "url": "https://archiveofourown.org/works/53667718",
        "fandoms": [
            "Stranger Things (TV 2016)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "10 Feb 2024",
        "language": "English",
        "words": "532",
        "chapters": "1/1",
        "kudos": "2",
        "hits": "43",
        "post_title": "After facing the Demogorgon and ending up in the Upside Down, Eleven stayed in the woods near Hawkins after she escaped. At least in one reality. Now freed but realising she could not endanger Mike, Nancy, and her friends, Eleven leaves Hawkins. Part 1 of Eleven.",
        "comment": "-8-\n\"I must leave.\"\nEleven watched with a broken heart as the Bad Men swarmed and crowded around Mike's home. She felt tears trickle down her face as she realised, no matter what she did, she could never stay here. Eleven had hoped that with Papa now gone and so many other the Bad Men, she could stay with Mike and his sister, Nancy.\nShe liked Nancy. Nancy, like Mike, was good.\nEleven had hoped to stay with Mike and his family. She had wanted to go to school after discovering it was a learning place and to learn more about the world. Ever since she had woken up in that bed and was put in the bath, Eleven had been so sure, especially with how Papa spoke around her, that she had forgotten something, something important.\nShe was not sure if she could or ever would regain her memories, but she had nowhere to go; she was intimidated by everything around her, and it was only around Mike and his friends she felt safe (while she was still upset about how Lucas had lashed out at her when she had led them away from the Lab, from the Gate, it wasn't because she hadn't wanted to help Will and Barb; it was because she was scared they'd reject her when they learnt of her part in opening the Gate and causing all of this in the first place).\nThat was not quite true; Eleven had felt safe with the woman Joyce and her son, Jonathan. She could look for them, right? She knew where the Byers lived, after all. She could easily walk to the house. Could she? Could she stay with them?\nThe thought was tempting in Eleven's young, confused mind. But would they reject her? What if the Bad Men were nearby, and stopped her from getting inside their house? Worse, what if Joyce rejected her? The thought hurt her since she had liked the woman, who'd been ever so nice to her.\nAnd then the truth settled into Eleven's poor, battered mind. She had no place here in Hawkins. She could never be with Mike. She could never be normal, do normal things, like go to school, and go out without fear of being killed or snatched. The Bad People would stop her, and as the thought settled she knew she could never put Mike in danger, or anyone else.\nEleven could only make out some of what the Bad Men were saying.\nThey were saying she was Russian. What was Russian? What did it all mean?\nWhat was spy? Eleven did not understand anything about what they were saying, but she knew they were lying, and she knew friends did not lie, and she instantly knew these people were not her friends.\nEleven focused on Mike and Nancy.\n\"Goodbye, Mike, Nancy,\" she whispered, tears now trickling down her face as she thought about what she was destined to become now, and she turned and walked away, sticking to the shadows. Eleven had a good idea of where to go. She didn't know what she'd find, and she was scared, but she genuinely did not have a choice."
    },
    {
        "title": "I must protect Molly",
        "url": "https://archiveofourown.org/works/52691746",
        "fandoms": [
            "Chicken Run (2000)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "31 Dec 2023",
        "language": "English",
        "words": "634",
        "chapters": "1/1",
        "kudos": "29",
        "hits": "298",
        "post_title": "Shortly after Molly was born, Ginger had her reasons for doting too much.",
        "comment": "When she had found out she was pregnant and laid her egg, the first egg she had laid knowing there was a little one growing within its protective shell, Ginger had not been able to get away from the egg; one of the reasons she had been desperate to escape Tweedy's farm was to build a colony where their children would never have to live in fear of having their heads cut off if they couldn't lay any more eggs. Fowler had been too old, and even if the Tweedy's brought in a rooster to breed them, Ginger doubted she would have gone along with it. She wouldn't have wanted any of her children to live the same way she had grown up; frightened of the next day, scared of the future and what could happen.\nWhen she'd met Rocky and she'd assumed he could fly, Ginger had begun dreaming of the future she had once hoped for but had suppressed so it could never bother her while she focused on the present.\nTruthfully she had never imagined she could become a mother, but she had kept those thoughts to herself. But somehow, Ginger had a feeling Rocky knew; she had caught a few looks thrown her way from the American rooster, saying that he knew and understood what was in her mind. For all of Rocky's quirks and attitude problems, he was perceptive at times.\nWhen Molly hatched out of the egg, and Ginger was glad to name her daughter after her mother, Ginger was hit with a strong maternal desire to make sure her daughter, even if she was too much like her mother; she wanted to make sure Molly grew up happy, healthy, without a fear of what would happen today, tomorrow, and a week from now like Ginger had.\nGinger still remembered her mother; like herself, Ginger's mother had wanted to flee from Tweedy's farm, but when Ginger hatched, she became her mother's focus, but she did not want her daughter to suffer the way she had. Ginger would never know for sure if her mother had done it deliberately or if it was just bad luck, but her mother Molly had been taken to the barn because she had missed one too many egg collections. Ginger didn't know what was happening, but one of Molly's friends had told her the truth about Tweedy's farm. How it was a death camp, where the chickens were forced to lay eggs all the time, and if one chicken missed one too many collections, then they would be killed, plucked of their feathers and eaten.\nMolly, tragically, only had time for one last SQUARRRRK- before she died. Ginger had no idea if her mother had let out that one last defiant squawk to tell her daughter to never give up, and she hadn't. That day had played into her mind, bringing up nightmare after nightmare ever since. The desire to get everyone out of the farm came from that moment, that desire. And it was one of the reasons why Ginger had never stopped fighting as a result.\nAnd with every loss, every friend who died because of the Tweedy's, her desire to escape came. She was just relieved it had only taken a few years before they escaped, and she was just relieved that no other chicken had died after Edwina - she would never forget the way her heart almost stopped when they all thought Babs would die.\nWatching Molly sleeping, Ginger hoped that her desire to keep her young daughter, who was already showing herself to be so much like her it was scary, didn't come back to bite her.\nBut she did not want Molly to know or even experience the kind of horrors they all had.\nShe wouldn't, right?"
    },
    {
        "title": "Oil on Water.",
        "url": "https://archiveofourown.org/works/54764029",
        "fandoms": [
            "Free Willy (Movies)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "27 Mar 2024",
        "language": "English",
        "words": "635",
        "chapters": "1/1",
        "kudos": "1",
        "hits": "22",
        "post_title": "After helping heal Luna from the oil, Randolph and Jesse talk while they wait.",
        "comment": "Jesse glanced at Randolph, seeing that his older friend and mentor (was he going too far thinking that way?) staring at the oil-covered water and rocks with disgust and horror.\n\"I love my van, but I wish we didn't have to use gas,\" Randolph muttered.\nJesse knew how he felt; after seeing the way Willy's sister Luna was covered with oil, and she was very sick. While the orca was not in the best of condition, Jesse could tell she was a lot like her brother. Jesse only hoped that he and Luna spent more time together, just to see what she was like, and to see how similar she was to her brother.\nBut right now, he and Randolph were taking a break from helping Luna. The pair of them had spent a lot of time scavenging for the ingredients for an old Indian remedy Randolph had learnt as a child before giving the mixture to the sick orca. The poor thing had gratefully taken it, sensing the sincere desire to help.\nNow it was just a waiting game.\n\"I know,\" Jesse was quiet, but his voice carried; Randolph turned in the corner of his eye. \"It's weird, you see things like this, spills like this, and you think they're so far away. But here, I can smell it. And I hate it. It's worse than a gas station.\"\n\"It is. Do you know what oil is?\"\nJesse turned.\n\"It's old plants, animals that have been compressed, mixed with other chemicals. It's the same with coal. The people who harvest it refuse to look for anything better, and places like this cove, which are havens for nature, they suffer for it whenever a spillage happens.\"\nJesse bit his lip, remembering Nadine's tearful reaction. \"What's going to happen?\" He asked quietly. \"With the whales and the cove?\"\nRandolph looked tired.\n\"I don't know,\" he sighed. \"I don't trust that oil bastard. I hated working in the aquarium; Dial was a nasty piece of work, more concerned with money than anything else. Animals are going to be scrubbed and given antibiotics to help them recover from the effects of the oil. Many are dying, and some of them are barely holding on by threads. Luna is lucky, Jesse,\" Randolph said seriously, turning to face his younger friend, \"and I hope she recovers, but even an old Indian remedy is not a guarantee of success.\"\n\"I know,\" Jesse replied, although he was a little worried now.\nRandolph sagged a little, and sighed, \"It's not the reunion you would have wanted with Willy, and a chance to meet his pod, is it?\" He asked wryly.\n\"No. I mean, I did see them when I saw those guys putting a leak into his tank, and I realised one of the reasons why he refused to perform at the park; he wanted to be with his family and he knew of the threat against him, and I realised I could see them when I was on the boat and saw a few of the orcas in the sea. When I accidentally dropped my harmonica into the water, Willy actually dove down and got it,\" Jesse smiled an awed smile at his friend, who returned it with one of his own, \"but when I saw Luna on the beach…,\" he shook his head. \"I only hope we can help them this time.\"\n\"Yeah, and not depend on the oil company; don't depend on their promises, Jesse. They mean nothing. All these bozos care about is profit; they'll be more likely to capture the pod survivors, and put them into captivity.\"\nJesse glanced sharply at him, but he conceded the argument. He was too tired to fight, and if he had to admit it to himself, he could actually see it happening."
    },
    {
        "title": "Meeting in the Dark, and the Cold",
        "url": "https://archiveofourown.org/works/53130928",
        "fandoms": [
            "Stranger Things (TV 2016)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "18 Jan 2024",
        "language": "English",
        "words": "664",
        "chapters": "1/1",
        "kudos": "1",
        "hits": "39",
        "post_title": "11's thoughts as she meets the gang, in the rain, and in the dark forest.",
        "comment": "-8-\n\"Will!\"\n\"Will!\"\n0-11 heard the shouts nearby, seeing the three lights. She had been hiding in this strange place for a long time now ever since the death of that kind man who was killed by the Bad people who were after her, but this place was not like the place she was used to; she had never been in the outside world before.\nShe was cold.\nShe was wet.\nShe was tired.\nWorse, she was lost.\nShe had been walking through this place for hours after hiding as quickly as she had left the kind man's home after he'd fed her, although she hadn't been able to answer any of his questions. She didn't know the answers herself; there was a blank place in her mind following her escape, and she didn't remember anything about anything, even how to say complicated words even if she knew she had the capacity.\nBut she had to keep moving; she had to escape from the Bad Men before they killed her like she had seen that woman murder the kind man; two of the bad people had tried to stop her, pointing guns at her before she used her gift to kill them instead and get away.\nShe had been wandering around for a long time, and then she had begun to get wet; the shirt the kind man had loaned her was soaked, and she was cold, soaked to the skin.\nShe did not know where she was. This place was not like the bright, warm place she had grown up in, and it was not long before she became lost. And then she found she was no longer alone.\n\"Byers! I've got your X-Men 134!\"\n0-11 crinkled her face into a frown, wondering what that meant as she edged closer. To her surprise, she saw three lights. Instinctively, she kept away, trembling with both cold and terror that these were the Bad people out to kill her.\n\"Guys, I really think we should turn back,\" one of them said.\n\"Seriously, Dustin?\" Another scoffed. \"You wanna be a baby, then go home already!\"\n0-11 frowned.\nHome?\nHow many times had Papa said the place she grew up in was 'home' when she knew it was not?\n\"I'm just being realistic, Lucas!\"\n\"No, you're just being a big sissy!\" The voice, this Lucas, said back.\n\"Did you ever think Will went missing because he ran into something bad?\" Dustin argued. \"And we're going to the exact same spot where he was last seen? - And we have no weapons or anything?\"\n0-11 quickly worked out these were not the Bad People, they were someone else's, and they were looking for someone, but who she didn't know, but she would have to be careful around them. She instinctively wanted to stay away from them, but her stomach growled. She took a step closer to get a better look, deciding to see if she could get a closer look and make her decision from there.\nUnfortunately, her unfamiliarity with the place she was, meant she didn't know how to keep quiet.\nSomething SNAPPED underneath her feet, and she froze in fear.\n\"Dustin, shut up,\" one of the voices said, leaving 0-11 frozen, wondering if they'd heard.\n\"I'm just saying, does that seem smart to you?\" This Dustin didn't seem to have heard her, but now she was closer she could see there were three of them and they were not bad people.\n\"Shut up. Shut up. Did you guys hear that?\"\n0-11 slowly made her way closer to them, seeing them shine their lights one way before another snapping noise had them swing around, and suddenly she was blinded by harsh light similar to the light she'd seen earlier, but what scared her the most about this light was it was just as unnatural as the light in Papa's home, and she blinked rapidly in the glare.\nShe hoped they were not bad people, and they helped her."
    },
    {
        "title": "Peter's cyber technology",
        "url": "https://archiveofourown.org/works/54296185",
        "fandoms": [
            "Spider-Man (Comicverse)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "06 Mar 2024",
        "language": "English",
        "words": "690",
        "chapters": "1/1",
        "kudos": "3",
        "bookmarks": "1",
        "hits": "105",
        "post_title": "Peter is forever designing and coming up with new pieces of cyber technology, be they prosthetics and devices to help astronauts...but all the time, the days draw closer to something big.",
        "comment": "-8-\nA few days later, Peter was scrawling over his blueprint papers, fuming. He was still embarrassed by what Ned had done, trying to take his work and make it into his, but he was just relieved that Doctor Octavius found out and put a stop to it. To cover up his hurt, since Ned had been a lot like him, he had thrown himself into his work, listening to Octavius and following his own projects.\nAs for everyone else, well they were just stunned; Gwen Stacy had been openly spiteful towards Ned when Doctor Octavius proved what he had done, making him wonder if there was history between the two, but he didn't pry.\n\"Hey, Peter.\"\nPeter looked up - he had been looking over the design for Doctor Octavius's cybernetic tentacles, a sort of consolation prize and an apology the doctor had come up with, but truthfully he had never blamed Octavius for Ned's actions - and he saw Gwen standing with a few of the other kids.\n\"Yeah?\"\n\"D'you want to come out with us, spend some time at the cinema and out and about the city somewhere?\" Gwen asked, absently nudging her glasses on her nose.\nPeter had not planned on doing anything beyond doing some work to block out the pain he was feeling. He had thought he and Ned had been friends, and he was left reeling by the betrayal. Why had he done that?\nBut at the same time, he had been thinking about his future, and he was left wondering if Gwen was the future and not Mary Jane.\n\"Sure,\" he decided not to miss the opportunity.\nGwen smiled back at him and they both went out with the others together. They went to a cinema and then to a Domino's for some lunch. Along the way they stopped off in a few stores for DVDs and comics; ever since Doctor Octavius had gotten him more interested in cybernetics, Peter had been collecting books and comics depicting them in action, and he had been mining them for ideas.\nBut while he was out, he enjoyed his time with his friends and gradually loosened up. Peter had never really had any friends before. Oh, he'd had a few in High School. They were geeks like him, nerds who were bullied and sometimes humiliated daily by jocks and other bastards who had made their lives a misery. But as they chatted, laughed and ate and drank, Peter realised he had made a big mistake. He had spent years trying hard to get into the It Crowd, and he had failed miserably.\nNow he realised he shouldn't have bothered.\nBut while he did laugh and chat and ate and drank, Peter's mind was half on the cybernetics ideas he had.\nHe had been inspired by Darth Vader and the Borg to design prosthetics and an exoskeleton for divers and astronauts, but he was also thinking up ways of going further.\nHe pictured prosthetic organs replacing damaged lungs, hearts, and maybe even organs and muscles too complicated for modern-day replacements. What if he could create artificial organs for people with chronic heart disease, lung cancer, or a host of other fatal or near-fatal illnesses? It was certainly compelling enough as it was. Hell, at this moment in time, he was inspired to go further and design and create prosthetic eyes.\nBut what fascinated Peter the most was the fact the possibilities were virtually limitless where cybernetics was concerned. Dr Octavius himself was designing a harness with four tentacles which would allow him to multitask extremely efficiently and protect himself from harmful chemicals and radioactive elements.\nWhat if he could add more?\nWhy use four tentacles for technology and scientific experiments when he could go further, and send robots out with the same tentacle design and use them to crack open asteroids or explore the seabed?\nOne way or another, Peter decided, he would take cybernetics to a whole new level. Such technology had seen many boons since Iron Man appeared, but he had a feeling even Tony Stark would be hard-pressed to come up with many other ideas."
    },
    {
        "title": "PTSD",
        "url": "https://archiveofourown.org/works/54293266",
        "fandoms": [
            "Death in Paradise"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "06 Mar 2024",
        "language": "English",
        "words": "729",
        "chapters": "1/1",
        "hits": "29",
        "post_title": "Discharged from hospital after getting shot, Selwyn still has a ways to go.",
        "comment": "-8-\nSelwyn Patterson was relieved to be home, and he was relieved when Catherine finally left; while he adored the woman and saw her as one of his best friends, the last thing he wanted right now was to be patronised and fussed upon. He had spent what seemed like an eternity in hospital after he was shot by Marlon Collins who was manipulating Alton Garvey into shooting him out of bitterness for his bad luck in life. Alton, like Selwyn, had studied long and hard for a place in Police college, and they'd attended the same exam. Alton had been there early, and Selwyn had arrived late after his bicycle was ruined because he had helped someone.\nBoth young men had gone through their exam, only for Selwyn to be accepted and Alton was not. For the next 50 years, Alton had been forced to live a less privileged life, tending to his sick mother before her recent death, and he lost himself in the bottle. He had tracked Selwyn down to the Yacht club commemorating him, and he had taken a gun, but he hadn't planned on harming him. But Marlon Collins had, all to cover up how he had murdered somebody else. That disgusting little bastard.\nSelwyn had been lying in a hospital bed in pain, the bullet had pierced his thigh, and he had been relegated to walking with a cane and being rolled about in a wheelchair. But he didn't care, now he was home; here, he could get on with some paperwork he had taken with him to work on in the privacy and comfort of his home, and he could also enjoy different surroundings without time dragging on as it had when he'd been in the hospital bed.\nWhile the visits from his friends both at work and in his personal life had taken the edge off of the boredom, Selwyn had wanted nothing more than to leave. He hated being helpless.\nSlowly wheeling his chair inside the house, Selwyn looked around, thanking his luck that it was the same as it was when he had left it, finding it hard to believe a few days had passed rather than a few hours. He had not liked the idea of the award, but if there was one thing he had learnt during his time as Commissioner, there were moments where he had to smile, even if he hadn't wanted to.\nAs a DI and DS, Selwyn had been quietly contemptuous of many councillors and mayors over the years. But when he had become Commissioner of the Saint Marie Police force, he had needed to learn a whole new mindset, and he was pleased that he had. As he looked around his house, spotting his possessions, souvenirs and gifts from friends and family alike, his heart almost leapt as he spotted the photos of the various police teams he had worked with over the years, from the time when he had been part of the investigation into the disappearance of Marvin's brother, Linus, all the way to DI Humes' team (whenever he laid eyes on that, wishing Dwayne and Fidel well with their lives, he always felt ill just looking at Lily's picture; he could understand her point of view, of course, but he wished she had chosen a different path and now she was regretting it), through to the time of DI Goodman and DI Mooney, and now to DI Parker.\nThinking of his newest DI made him shake his head, wishing that DI Parker would just calm down, and not put his foot in it. Just as he was thinking that, a bang went off.\nSelwyn would forever swear blind he never leapt out of his wheelchair if anyone asked him, but he did. His heart pounding, he rushed to identify the source of the sound, and he realised that it was the sound of a car backfiring. When he realised that, only then did he calm down, he took several big breaths and filled his lungs with air, telling himself to just calm down. He went to the kitchen, grabbed a glass and some fruit juice from the fridge, and drank.\nAs the fruity orange juice trickled down his throat, only then did Selwyn calm down but he struggled not to react, as he thought about the last few days."
    },
    {
        "title": "Vision of the Future",
        "url": "https://archiveofourown.org/works/54471856",
        "fandoms": [
            "Stranger Things (TV 2016)",
            "V for Vendetta (2005)",
            "V for Vendetta (Comic)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "14 Mar 2024",
        "language": "English",
        "words": "734",
        "chapters": "1/1",
        "comments": "2",
        "kudos": "5",
        "hits": "82",
        "post_title": "What if Eleven didn't find a gate, a hole, leading out of the Upside Down back into the school of the real world? What if she went further, and saw history repeating itself?",
        "comment": "-8-\nShe was cold, she was just so cold; she had been in the Upside Down for only a few minutes since she had beaten the Demogorgon by ripping it to very, very small pieces, and yet she had found a way out. Eleven stood in front of it, and she studied it. She saw it was small, far too small.\nTaking a deep breath, Eleven held out a hand, and she pictured the crack in front of her widening, becoming larger and larger…opening it to give her the room to crawl out.\nShe flinched a little in pain, feeling the sensations in her mind before she finally succeeded in widening the hole. Eleven forced her way through and looked around curiously.\nShe had expected to find herself still at the school, at the same time she had left, but instead, she was in broad daylight and there was a brick wall in front of her, and the hole leading into the Upside Down was another brick wall.\nHearing the sounds of cheering, she walked down the sides of the two brick walls, and she came to a street, her view of it blocked by lines of cheering people, who were laughing and yelling so incoherently that Eleven wondered if they were speaking differently. Eleven found a small gap in the crowd and found a moving line of men wearing dark uniforms with red shirts. She stiffened when she saw they were carrying guns, but Eleven relaxed when she realised they were not looking for her, she still studied them closely while making sure she wasn't swept away from the gate.\nShe looked around, realising this wasn't Hawkins; the buildings were too close together, and nothing like the wider spaces she was accustomed to. Dark banners lined with a strange red symbol were flying everywhere, but while Eleven was confused and worried she continued watching.\nA loud voice boomed over the crowd, startling her and making her scream, but it was drowned out by the crowd's cheers.\n\"Every day brings us closer to the future, and for so long it has been neglected. Our country has been sick. Our country needs healing,\" the voice boomed loudly, \"Norsefire will heal this country. Norsefire will ensure everyone gets work, live fairly, no longer will you be living on a pittance while undesirables get your money, and take the food out of your mouths. ENGLAND PREVAILS!\"\nWhile the puzzled Eleven was left wondering what Norsefire and England were, she winced and jumped, and nearly exploded with her powers at the amount of cheering, it was so loud. But she found herself increasingly nervous and not liking this, and she turned and walked back to the gate she had opened up. To her relief, nobody stopped her.\n-8-\nIt wouldn't be until much later, when Eleven had joined the Byers family in California, and she began studying history that she discovered the history of Nazi Germany.\nOne day, she brokered the subject to her family.\n\"Wait, you found another way out of the Upside Down, and it led to England, of all places?\" Jonathan said.\nEleven nodded. \"Yes. But it wasn't until recently I realised what that meant.\"\n\"And, you think you saw what looked like a Nazi demonstration there?\" Will asked.\n\"The way those men with guns were walking down the street reminded me of the history tapes in class, that and the banners, and the way someone boomed over a radio that something called Norsefire would ensure everyone would work, live fairly, and deal with undesirables was very similar,\" Eleven said, \"but from what I know, that sort of thing hasn't happened in England.\"\n\"No, it hasn't,\" Joyce glanced at her sons, making a mental note to try to speak to Murray if the paranoid idiot would pick up the phone. \"So what do you think happened?\"\n\"I think I travelled in time, although I don't know if what I saw is what's going to happen.\"\n\"What?\" Joyce blinked in confusion.\nBut Will got her meaning. \"Oh, you mean it might be an alternative timeline that you saw, like that evil Hill Valley in Back to the Future 2.\"\nEl smiled fondly as she remembered that movie. She had been introduced to dozens of them recently since her arrival in California. \"It's possible, but what could make such a future?\"\nNobody could answer her question."
    },
    {
        "title": "Ninth and Young",
        "url": "https://archiveofourown.org/works/52466671",
        "fandoms": [
            "Doctor Who (2005)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "23 Dec 2023",
        "language": "English",
        "words": "765",
        "chapters": "1/1",
        "kudos": "4",
        "hits": "201",
        "post_title": "What if the War Doctor's regeneration went differently?",
        "comment": "The War Doctor smiled, hiding his inner mischief which had barely survived through the duration of the Last Great Time War. \"And if I grow to be half the man that you are,\" he smirked when he saw his future incarnations turn smugly at each other, \"Clara Oswald,\" in his peripheral vision the War Doctor mentally danced a mental jig when he caught the reactions of his future selves, \"I shall be happy indeed.\" Clara chuckled as she stood up, putting away her cup, \"That's right,\" the young woman smiled. \"Aim high.\"\nIt had been a long time since he had gotten a kiss, especially from a beautiful young human; the Doctor had gotten over the prejudices of the Time Lords long ago, but he felt himself blushing as she kissed him. But his thoughts turned grim, \"I won't remember this, will I?\" He asked his future selves. The Eleventh Doctor sighed, and shook his head. \"The time streams are out of sync. You can't retain it, no.\" The War Doctor sagged and he saw the grim expression on the Tenth Doctor's face. To that version of him, he travelled the universe so sure he'd destroyed the Time Lords, and he'd buried all memories of his war time self away. The War Doctor had not expected anything less. Hell, he'd even stopped counting their ages and went back to the beginning, for heavens' sake because he believed he had killed the Doctor by becoming a Warrior instead.\n\"So I won't remember that I tried to save Gallifrey rather than burn it,\" he mused sadly, cursing the fact the Time Lords were gone so their ability to control the synch of the timelines was gone; while future Time Lords meeting their previous lives tended to lose their memories so they wouldn't recall anything until they became that incarnation so they were not forewarned, it was different for him as he was now, but the Tenth Doctor would not remember this either.\n\"I'll have to live with that,\" the War Doctor whispered before he realised what that meant. \"But for now, for this moment, I am the Doctor again. Thank you.\" The War Doctor smiled gratefully at his successors before he turned to the TARDISes; he felt a bit odd, and he wanted to leave now and go on his way before the timelines shifted. \"Which one is mine?\" He asked, seeing the expressions on his future selves was worth it when he walked to the shabbiest TARDIS there was. \"Ha!\" Slipping the key into the lock, the War Doctor walked inside the TARDIS, and his hands danced over the console and the TARDIS dematerialised. He closed his eyes and smiled at the sound; he was about to set the controls for anywhere in the universe when he felt a telltale burn in his chest, and a warm golden glow appeared.\nRather than be surprised or horrified, the War Doctor just smiled in acceptance; he had been exposed to time winds, shot at, electrocuted, subjected to bioweapons, and the effects of time destructors since entering the Time War; he'd been nearing the end of his current life anyway, but he had pushed himself on and on so he could keep fighting and making a difference in the War, but now the end of the war had come, Gallifrey was saved…or had it been destroyed? He felt his memory going.\nHe had no more reason to be in this body anymore. It was time for a regeneration, for renewal.\n\"Oh yes, of course. I suppose it makes sense,\" he muttered, \"Wearing a bit thin,\" he said thoughtfully as he thought about his next life; he had never been good at controlling his regenerations, and he'd wanted to be ginger for centuries but the War Doctor merely made an offhand comment and a thought about his next life. \"I hope the ears are a bit less conspicuous this time, and I wish I was young….and maybe female,\" he added, wondering if it would be great if he began his new life with a fresh perspective…..\nXxxxx\nThe Doctor breathed in through fresh lungs, looking down at their hands. They were smaller, younger. The skin was smooth, like an egg shell or a flower petal.\nSlowly, the Doctor ran a hand over their body, feeling their curves and longer, silkier hair, and the curves of their body.\n\"Oh, my,\" the Doctor whispered, \"I'm a woman now….I'm a woman…and the last of the Time Lords,\" she whispered quietly and with pain. \"I'll never forgive myself for this….\""
    },
    {
        "title": "I'm a police officer, undercover, the dangers of being undercover.",
        "url": "https://archiveofourown.org/works/54764224",
        "fandoms": [
            "Death in Paradise"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "No category",
        "status": "Complete Work",
        "published": "27 Mar 2024",
        "language": "English",
        "words": "786",
        "chapters": "1/1",
        "kudos": "1",
        "hits": "57",
        "post_title": "Florence is going undercover, and its dangerous.",
        "comment": "-8-\nI'm a police officer, undercover, the dangers of being undercover.\nUndercover work was nothing glamorous, and nothing like what you saw in the movies; there were no secret meetings, well there were, but they were carefully planned out and conducted so as not to arouse suspicion. And working to get into Miranda Priestly's inner circle and not make the drug trafficker suspicious was not an easy task. Miranda had not reached the top of the food chain by being sloppy or careless; no, the woman was dangerously smart, vicious, and paranoid. She liked being two or three steps ahead of everyone else.\nIt was little wonder she had managed to beat the odds, and she had lasted this long. You only had to look into Miranda's face, see the hard, cold cast of it, and see she was not one to cross.\nFlorence had been aware of Miranda Priestly's reputation for a long time; before she worked with DI Goodman, she had some friends in Jamaica, who had struggled to arrest her. As the Commissioner had claimed, witnesses who came forward vanished, but what she didn't understand until she arrived in Jamaica was how Ottis Benjamin had gotten caught up with her in the first place, and more research for her role had yielded some details about that.\nOttis had been seen near Miranda's business and then her home, but why? Surely Ottis had learnt enough about Miranda's reputation to know she wasn't someone to play games with?\nWhen she had briefly met Ottis during the Gabriel Taylor murder case, Florence hadn't been impressed; to her, Ottis was a thug, and the mindless way he had threatened Gabriel proved that.\nOh, the knife might have intimidated people and would have worked out in his favour, but Ottis hadn't known that Gabriel was just as violent, except in a different way. Ottis was the kind of criminal who lacked the subtle approach most used, but Florence was surprised Miranda would go so far as to kill him.\nWhy?\nWhat was happening?\nWhat was going on?\nAt first, the Jamaican police had struggled to find the answers to their questions, but as she had discovered Ottis had been seen near Miranda before his death. There was evidence Miranda and her organisation were cleaning up the mess, but the undercover unit wanted to get to the bottom of it all, not just Ottis Benjamin's murder, but they wanted to close down Miranda's network and any other criminal organisation she controlled or had vested interests in. Florence could understand that, given how brutal and violent Miranda was, from what she had learnt about the woman's reputation.\nBut if you looked at her past, you could well understand and even sympathise with it. Miranda and her family had grown up in poverty, raised by a loving mother before Miranda had turned to crime, and then rose through the ranks and gained power through it, gradually building up her drug empire over the years.\nThanks to her intellect, Miranda had stopped dozens of police investigations, and been behind the disappearances of so many people who threatened to bring her down. That was one of the reasons why everyone was so surprised when they did more digging until they finally discovered the connection between Miranda Priestly and Ottis Benjamin. When witnesses vanished, they vanished, they were never seen again. Ever. They weren't left behind on public beaches.\nWhen Florence had learnt about the undercover job, where she would serve as a nanny to Miranda's adoptive daughter, Dolores, she had been excited, but she had been worried as well; she knew if she went for the job, her life would be in danger for a long time. If everything went well, then Florence's involvement in her arrest would go unnoticed. But sadly real life rarely worked that way; there was not a shred of doubt Miranda had corrupt police officers in her payroll, they would have the means to discover the operation and who had betrayed her suddenly, even if Florence didn't appear in court.\nNo matter what, someone was bound to talk, and when they did she would be looking over her shoulder in witness protection.\nThat scared her.\nShe didn't like the idea of being locked away from friends, and loved ones, for god knew how long, but she knew what the Commissioner was saying, especially after he drove her to where Patrice was murdered. This wasn't a decision to be taken lightly. Florence had done a lot of soul-searching before she decided to say yes.\nNow, all she had to do was make sure she could keep up the facade long enough so then Miranda wouldn't try to kill her."
    },
    {
        "title": "Octavius and Peter Parker",
        "url": "https://archiveofourown.org/works/54296086",
        "fandoms": [
            "Spider-Man (Comicverse)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "06 Mar 2024",
        "language": "English",
        "words": "826",
        "chapters": "1/1",
        "kudos": "5",
        "bookmarks": "1",
        "hits": "69",
        "post_title": "Peter continues to thrive under Octavius's tutelage but someone else is envious.",
        "comment": "-8-\nPeter took a deep breath as he took the remote control he'd built and he entered a program into the robot's computer. Slowly, as if the robot was just waking up from a deep sleep, it moved forward. It was one of the most beautiful things he had ever seen. Shaped like an ultra-thin baby, coloured silver and blue, the robot walked slowly around the lab Dr Octavius had gifted to Peter, one of many he had given to the others.\nSomeone clapped, and Peter jumped.\nDr Octavius was standing in the doorway, smiling at him. \"Well, done,\" he complimented.\nPeter struggled to contain his blushes. \"Oh, Dr Octavius,\" he stammered, \"is everything alright?\"\nOctavius waved the question off. \"It's okay, Peter. I just wanted to see how you were getting on, and I'm pleased with the results. Is that your first robot?\"\nPeter shook his head. \"No,\" he said and he took the scientist to the back of the room, where there was a strange collection of metal lines.\n\"Your gyroscopic rollercoaster? Have you actually finished it?\" Octavius asked, interested.\n\"Almost, Doctor,\" Peter replied.\nPeter had come up with the gyroscopic rollercoaster not long after he had become a part of Octavius's team of apprentices. It was just a small side project, something to wow his mind while he worked with Octavius's resources. It was just a collection of rails and a gyroscopic capsule, which would ride across the lines without falling.\n\"But this is what I wanted to show you,\" Peter took some design plans and showed them to Octavius, who took them interestedly. Octavius studied them closely for a few minutes before he looked into Peter's face.\n\"You've got the designs of a cybernetic spacesuit and a diving suit, and plans for a robot for use in space here, Peter,\" Octavius smiled, \"this is extraordinary.\"\nPeter, while pleased with the scientists's praise, hadn't included everything but the basics of his work; while he doubted Octavius would ever steal any of his work, you never knew.\n\"Thank you, Doctor,\" Peter replied gratefully.\n\"Mmm, I have designed some robots for NASA in the past, but I like these thruster exhausts which would make working for the International Space Station to be more efficient, and I like the fact you have made it spider-like, by providing many limbs which contain a variety of tools and appendages,\" Octavius looked at him impressed. \"Do you think you can design a computer model for this?\"\n\"I will soon, but I want to iron out the kinks in the design.\"\n\"You'd better do it. Keep it up, Peter.\"\n-8-\nThe next day, Peter was searching the locked desk he'd been given for the design plans for the space robot. But he couldn't find it. He was sure he had placed it in there.\n\"Can all students please attend the main laboratory!\"\nIt was Doctor Octavius, and he didn't sound happy. Peter was tempted to ignore the summons, but he had learnt early on that Octavius valued punctuality to a T; miss a meeting and then he would throw you out. Quickly he left the lab, and he joined the others in the main laboratory.\n\"What's this about?\" He asked, looking around and noticing Ned Leeds wasn't there. Ned and he had become friends, even if even in his occasional obliviousness, he noticed that Ned was sometimes extremely jealous of the attention Peter received. It wasn't exactly his fault, but Ned focused more on computer technology than cybernetics.\n\"Beats me,\" Gwen glanced at him, blushing when she caught the look in his eyes.\nOctavius came in, stormed in, more like, and in his hands was a DVD. He put it on a computer and showed everyone. Peter watched in horror as Ned Leeds walked into Peter's laboratory, and managed to pick the lock on the desk. Everyone gasped as they saw him rooting through the files until he found some he was looking for, carefully putting everything back and then leaving the lab.\nOctavius turned off the computer and glared around the lab, furious, not with them but with Ned. \"Ned Leeds has been kicked out of this unit. He will not be coming back. Plagiarism and theft in this laboratory is not tolerated.\"\nPeter idly wondered if Octavius had suffered from it in the past, and he felt that would explain many of his stances.\n\"In all of the labs there are CCTV cameras, and I watch them closely not to spy on anyone, but to make sure this doesn't happen. Earlier on, I saw Ned shamelessly create a computer model of a piece of work I had seen Peter come up with, and I checked it out.\"\nWith that, Octavius picked up a file crossed the room and handed it over to Peter. \"Peter, please accept my apologies, I assure you this will not be happening again,\" he promised.\nBut something in his voice sounded like a threat."
    },
    {
        "title": "The Jedi or Sith Temple",
        "url": "https://archiveofourown.org/works/54130600",
        "fandoms": [
            "Star Wars - All Media Types",
            "Star Wars: The Clone Wars (2008) - All Media Types"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "28 Feb 2024",
        "language": "English",
        "words": "880",
        "chapters": "1/1",
        "kudos": "10",
        "bookmarks": "3",
        "hits": "345",
        "post_title": "Third in my What if Anakin Skywalker time travelled into the future and met Darth Vader? series. Anakin has arrived on Coruscant, but while the planet is a nightmarish parody of the world he's known, it's the sight of the Jedi Temple, which once stood as a monument of the Light that horrifies him.",
        "comment": "-8-\nThe Jedi or Sith Temple.\nIt had taken Anakin longer than he had hoped to reach Coruscant. After killing that darksider he had learnt was called an Inquisitor, Anakin had been aware if he had stayed on Naboo too long, it would only be a short time before he was caught. He had stowed away on the first cargo ship he could find, and while it had taken him on a long journey around the mid-rim, it had fortunately been just after the alarm had gone up for him.\nAfter a few stopovers, Anakin had learnt a lot about the galaxy. Finding out 10 years had passed since the end of the Clone Wars, had been a shock, but after learning the Jedi had tried to take over before Palpatine issued some kind of order for the Clones to attack the Jedi Temple and the Jedi out fighting in the war, Anakin was shocked.\nThere was even footage showing Jedi Masters including Master Windu and Master Fisto attacking Palpatine in the Chancellor's office with lightsabers, but the moment Anakin had seen it, outraged as he was after learning that instead of the Republic, there was now an Empire, and learning Palpatine was the Emperor before catching a glimpse of his hideously deformed face which was the result, it was said, of the attack which Anakin knew was not true as lightsabers could not cause such injuries, but when he had seen Palpatine's eyes, he had to accept the truth.\nEmperor Palpatine, the man who had been a friend, was a Sith Lord.\nAnd when he saw the footage of Windu's attack, Anakin sensed through the Force it was doctored; non-Force sensitives might feel something was wrong, but Anakin, being highly trained, knew much of it had been faked and by experts. But it had done its job perfectly, and it had helped ignite the anti-Jedi sentiments travelling through the galaxy like a disease.\nIt had not been long since Anakin had been on Coruscant, but as he walked through the streets away from the space docks, it was like Naboo, a totally different place. As on his wife's homeworld, stormtroopers marched in formation through the streets, but Anakin shielded himself using the Force as he moved through the streets to the Jedi Temple, trying to stop himself from feeling sick as he felt the Dark side become stronger and stronger.\nWhen he came to the Jedi Temple, Anakin had to stop himself from feeling sick.\nThe Jedi Temple had been his home ever since he had arrived here at the age of 9. It had long since been a beacon of comfort and warmth, and yet as Anakin laid eyes on the Temple, he thought he had stepped into some terrible world where the Dark Side had long since dominated the galaxy, and the Jedi had never been in a strong enough position to oppose the Sith. If buildings could scream or talk, this one was shrieking and sobbing. The Dark Side was swirling around the Temple, and through the Force, Anakin received terribly vivid visions.\nJedi screaming in panic.\nClone Troopers shooting at Jedi struggling to block and meet their blasts…\nYounglings crying in panic…\nAnger, fear, pain, grief, and suffering, all blasted at Anakin and staggered him. He felt physically sick just being here, and he almost missed the presence in the Force. If Anakin needed any more proof Palpatine was a Sith Lord, he thought he just had it. During his Jedi Training, Anakin had learnt that powerful Sith Masters and Sith Emperors were like a supernova of rage in the Force.\nBut if that were so, then Darth Sidious was like a black hole.\nAnakin was so deeply shaken by what he was sensing through the Force that he almost forgot to notice that the Jedi Temple was black, covered with large banners of the Imperial emblem. There were laser cannon blisters covering the Temple as well.\nGET OUT!\nGET OUT!\nAnakin was shaken out of his thoughts when he received a warning in the Force, and as he took notice, he became increasingly aware of a dark presence paying attention to him. Palpatine must have sensed his presence. The Dark Lord was actively seeking him out.\nHorrified, Anakin slowly and gently peeled back his probes, and backed away like an animal slowly backing off from a dangerous predator nearby. Shielding himself, Anakin raced into the Coruscanti night, putting his trust in the Force to help him get away from the evil in the Temple. As he ran, Anakin gave himself to the Light, feeling the comforting warmth which was like a warm blanket, which he needed after that experience, only he didn't know where he was running to.\nFinally, the Force told him to stop, and he looked around, panting for breath; quickly looking around, Anakin struggled to relax, but since he knew how dangerous it was to go unshielded from the Sith, Anakin needed a moment to calm down and reset his barriers. As he shielded himself, Anakin saw two people that he recognised, and he knew the Force had brought him here for a reason; he focused on Senator Bail Organa, knowing he was the one whom the Force was directing him."
    },
    {
        "title": "Master and Apprentice",
        "url": "https://archiveofourown.org/works/54295936",
        "fandoms": [
            "Spider-Man - All Media Types",
            "Spider-Man (Movies - Raimi)",
            "Spider-Man (Comicverse)"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "06 Mar 2024",
        "language": "English",
        "words": "907",
        "chapters": "1/1",
        "kudos": "6",
        "bookmarks": "1",
        "hits": "91",
        "post_title": "Peter Parker becomes an assistant of Dr Otto Octavius, who starts him on a path of metal, plastic, and machinery.",
        "comment": "-8-\nPeter Parker was both in awe and yet despair. Thanks to a friend, Dr Curtis Connor, whom he had met because he was connected to his father, Richard Parker, Peter had recently gotten a job under Dr Otto Octavius, one of the greatest scientific minds of the 21st century. The man was a genius in what seemed every single field of science.\nIt was not long before Peter was overawed; he had always prided himself on his own knowledge, but that mostly came because he wasn't entirely sure why his parents had left him years ago, but he was positive that they had left because he was not good enough, and so he had worked hard, studied hard, and sacrificed so much just to be the best.\nOctavius had surprised him; when Peter had gotten the job, in his less enthusiastic moments he had wondered what it would be like working for the man, and he had pessimistically wondered if Octavius would simply have him clean up and get him and the other assistants coffees or something mundane like that, but it hadn't happened like that. Octavius had instead taken Peter and the others under his wing, and when Peter had met them, he knew they would not get along with the likes of Flash Thompson. All of them were like him in so many ways; socially inept and awkward, preferring books and computers to socialising, loved sci-fi movies, and found it hard to meet others to understand them.\nThanks to various science journals and articles, and documentaries on the internet, Peter had seen clips showing particle accelerators, labs aimed at piercing the mysteries of the universe and NASA's laboratories, but Octavius's laboratory was filled, seemingly, with computers and technology he had never dreamt of.\nBut he was despairing because he had yet to try to make a move towards Mary Jane Watson, and to be honest he doubted he could ever make the beautiful redhead girl like him. But the miracle was there were other girls here, and he had found he had more in common with them than he ever did with Mary Jane.\nOne of the girls was a blonde girl called Gwen Stacy; she was beautiful and despite being socially awkward, she had a sense of fashion that was both simple and elegant.\nIn the meantime, he was focusing on his job. Octavius was both a boss and a teacher, and he set tasks for advancing human science for all of the apprentices he had gathered.\nBut while he was awed by the technologies and the fact he was making his own future while kids like Harry had it handed over to him on a plate, and Flash and others like him were given scholarships for things as mundane as sports, Peter was left wondering if his personal life would be better, this job was helping pay many of the bills which was a relief.\n\"Be careful there, Peter,\" a soft voice spoke, and Peter nearly jumped when he realised Dr Octavius was right behind him, he turned on his seat and saw him there. \"I want that formula to be stable, not too explosive.\"\nPeter turned and to his horror and embarrassment he realised Octavius was right, he had been concentrating so hard on worrying about his woes that he had half forgotten what he was meant to be doing. \"I'm sorry, Doctor,\" he hastily corrected the formula, double-checking it to make sure it wasn't too dangerous.\nOctavius frowned as if Peter was a complex puzzle. \"Come with me, Peter, I want to talk to you,\" he said and while Peter hid his embarrassment and trepidation, he dutifully followed. When they were in Octavius's office, the scientist came out with it.\n\"I'm not angry with you, Peter, nor Curt. You're a damn good scientist with an impressive scientific mind. But you remind me of myself, do you know why?\"\nRealising it wasn't a rhetorical question, Peter quickly shook his head, \"No.\"\n\"I was abused as a child, Peter. My father was a hard man who didn't care about me, my education, or my interests unlike my mother,\" Octavius made a face as he thought about his father, \"and more than once I would get distracted in my work until someone shook me out of it. And before you say a word, I know you're not abused, but I think you are being bullied, yes?\"\nPeter was stunned that this genius, this titan of science, was able to read him so well when so many failed.\nFortunately, Octavius didn't expect an answer to such a sensitive question. He leaned forward, \"Peter, you have something special within yourself. You have a brain, and I want to see it well used and I want to see you do well. Forget the people who tormented you. I forgot my father, and yet he has not even changed. I haven't looked back on him once, but I make sure my mother and sisters receive a good income. Focus on what's important to you, don't worry about anything else. Do you understand what I mean?\"\nPeter replayed the other man's advice, and he had to admit he liked what he was hearing.\nDr Octavius was right, why should he care what happened to Flash and the others? Okay, so he wanted to date Mary Jane, but was she truly attainable, or was he wasting his time there?"
    },
    {
        "title": "Love and Money",
        "url": "https://archiveofourown.org/works/54292186",
        "fandoms": [
            "Death in Paradise"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "06 Mar 2024",
        "language": "English",
        "words": "956",
        "chapters": "1/1",
        "hits": "23",
        "post_title": "Naomi reassures Darlene after how she believed in a suspect, who was proven to be a murderer.",
        "comment": "-8-\nLove or Money.\n-8-\nNaomi was studying Darlene sympathetically as they walked towards the police station. \"Are you okay, Darlene? You're very quiet.\"\nDarlene spared her a smile, but it didn't reach her eyes. Something the DS noted instantly. \"No,\" she sighed, \"I was just thinking about the case yesterday.\"\nNaomi sighed herself. The last case they'd worked on involving Ellis Baxter and his cryptocurrency mining rig had been a complicated one. Ellis's body had been found without the insulating gloves to protect himself outside an electrical substation that Baxter had tapped to collect the power needed to make the rig, basically, a super-computer, mine the cryptocurrency, a get-rich-quick scheme organised by Ellis and Ivan McQuillan (Naomi was a smart girl, but finance and things to do with cryptocurrency were beyond her comprehension), make a fortune out of thin air, had blown after the girl he had seen behind his girlfriend's - Petra McQuillan, Ivan's daughter - back.\nLaurette Duschamps was the murderer, a girl Darlene had known years ago. Laurette had tried to use her past relationship with Darlene to her advantage, and it had nearly succeeded - but the Inspector had reviewed the hard drive that Ellis had stored the cryptocurrency on, and found out Laurette had stupidly transferred the money to an account in her name from the wallet. Even more stupidly, she had given it to the police to throw them off.\n\"Darlene, it wasn't your fault. You've done nothing wrong,\" Naomi said quietly.\n\"That's what Inspector Parker says,\" Darlene looked down sadly, \"he says my empathy is my greatest strength.\"\n\"He's right. Listen if you are talking about misjudging someone, look at me,\" Naomi said, and Darlene looked into her friend's face, surprised by this sudden turn, \"I spent years believing my best friend back home on St. Barnabus had been burnt by her stupid, drunk mother…only to discover her father had set the whole thing up, without bothering to look for another way of getting rid of her, and nearly burning Monique to death.\"\nDarlene remembered the case well. A part of her believed Mr Hayes had gotten what he deserved, even if she didn't like thinking that way.\n\"How did you cope with it?\"\n\"Not a lot of choice; it was worse for Sammy than it was for me, he had to apologise to Odette and Monique, and that hurt him a lot,\" Naomi sighed, thinking about her old friend and mentor, who had taught her and helped her so much, but there had been times when he had condescended her, treated her like a kid.\nSammy had left St. Barnabas and was now travelling the world. But he would never forget how the community had pushed him, pressured him to get rid of Odette, for writing that report and clear Rex Hayes even if he wasn't under suspicion.\n\"I was only a kid at the time. I just went along with the flow when I knew full well he had gone home and got Monique away from the fire. But I had spent 15 years of my life remembering her bitterly, hating her for nearly burning her child to death. But my memories of her, despite something being out of it with the booze, showed a kind-hearted, loving woman. Looking back, I should have asked questions, but I never thought about it.\"\n\"You were just being human, honey,\" Darlene told her friend gently, \"you were not to blame; you were becoming a police officer, and you were focusing on your career; there's no doubt in my head if Odette had shown up, you would have asked questions.\"\nNaomi smiled and nodded, but she was remembering the last time she had spoken to her best friend. Monique and her mother were taking it easy, especially since Odette's own sister had murdered the man who had grown closer to her, and had been a replacement mother to Monique.\nSeeing the scale of Hayes' lies which had torn the family apart…it had broken her heart because she had seen the way it had hurt Monique.\n\"Darlene, while it's similar, you didn't know Laurette had murdered someone.\"\n\"But I should have been more objective,\" Darlene looked away. \"You didn't know her parents; they were self-serving criminals, they only cared for themselves. Marlon only stole to put food on the table and support his little sister and give his mother some help, but what they did took it too far.\"\n\"Then she was worse than they were; she acted like a con artist, Darlene; she showed a side to her that said she was better than her parents, but she was worse than they were. Okay, maybe she hated her parents for what they'd done over the years, but she clearly took after them because she had grown up thinking it was normal. Who knows what she was planning to do at the Hub before she learnt about the cryptocurrency rig? Maybe she planned to use the Hub for something else; we'd need to find that out for ourselves soon. But, anyway, I don't think anybody else who believed in her would be in the quagmire you're in now, Darlene. You're one of the kindest people I know, it wasn't your fault. You were a massive help during the investigation; if you were protesting about her involvement in the case, then you would have slowed us down, but it never happened.\"\nNaomi sighed, knowing Darlene would be like this for a while, so she hugged the older woman gently. \"Just…learn from this. That's all you can do; we all make mistakes, and make misjudgements.\"\nDarlene smiled back, \"Thanks, Naomi,\" Darlene said gratefully.\n\"Of course, you're my friend, it's my job,\" Naomi smiled."
    },
    {
        "title": "He got burned",
        "url": "https://archiveofourown.org/works/54291859",
        "fandoms": [
            "Death in Paradise"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "06 Mar 2024",
        "language": "English",
        "words": "982",
        "chapters": "1/1",
        "kudos": "2",
        "hits": "58",
        "post_title": "Marlon tells J.P about Sophie after Zoe, the girl behind the mysterious Sunset Chaser arrives.",
        "comment": "-8-\nHe got burned.\n-8-\n\"Why was everyone surprised by the Inspector's ex?\" J.P. asked Marlon while he watched as his younger friend sorted out his belongings, deciding what to keep and take with him to his new posting in Jamaica while he went to look after his little sister, Jocelyn. Marlon's mother had been upset both of her children were going, but she had become proud of the man her son had become, and she promised to send him some cash to see him through, ignoring Marlon's protests and promises everything would be okay.\nMothers were like that.\nMarlon had been wondering when his old friend would ask a question about that. He and J.P had been chatting about little things, like how things had been going with Rosie and the twins, his hopes for a relationship with Naomi at some point, and what it was like in Jamaica in general but Marlon had expected a question about the Inspector's personal life, especially since Naomi and Darlene were both shocked.\n\"Okay, so get this, recently the Inspector started a blog; DS Bordey suggested he write on during a recent call. I wasn't sure it would take off, but he started writing short stories about the various cases he's worked on, and what he pieced together from the case files of the past cases after he'd asked the Commissioner's permission, but he filled the blog with product reviews about the various things he uses. You know the Inspector, J.P.,\" Marlon said as he sorted through some shirts.\n\"I think I've got a general idea, Marlon,\" J.P nodded, remembering how Inspector Parker had driven him, DS Dumont, Ruby, and DS Cassell crazy with his mosquito sprays. \"Anyway what happened?\"\n\"Well, recently the Inspector's blog got liked by this fan, called Sunset Chaser.\"\n\"And Sunset Chaser turned out to be an old flame?\" J.P shook his head. \"Why did he look startled and looked like his world had exploded inward, then?\"\nMarlon looked down for a second, choosing his words as carefully as he could. \"He got burned, J.P. During the Christmas before last, he was already reeling from DS Cassell just left.. leaving after having a crush on her,\" he said.\nJ.P had known about the crush, and he could well understand how the Inspector felt. \"Go on.\"\nMarlon turned to face him, \"Okay, so, listen, he met an English girl called Sophie, she was here posing as a tourist.\"\n\"What do you mean, posing?\" J.P asked, worriedly.\n\"Sophie was the sister of a woman the Inspector locked up, and committed suicide in prison,\" Marlon replied grimly as he remembered those shocking days when the Inspector's own DC and girlfriend showed they were liars. \"Her real name was Rebecca Walmslow, and she came to Saint Marie to get revenge. She murdered someone in a case we considered a suspect, but we didn't have the evidence to arrest him. Anyway, we and the Inspector worked it out at roughly the same time, without the help of the Internal Affairs inspector who came out here. She'd only come out here to arrest the Inspector, and she didn't care about at least trying to do more. There were so many red flags springing up during the case, but she ignored them, all she was interested in was arresting DI Parker, but she gave us some time to at least try to clear his name; you should have seen the Commissioner himself putting her down after she'd read the Inspector his rights. But anyway, we arrested Sophie, and cleared the Inspector's name, but it shattered him, and it's taken him a while to get back on his feet; we were even wondering if he would decide to leave Saint Marie.\"\nJ.P had been silently listening to the story for the last few minutes in growing horror, picturing some of it in his mind. \"What happened afterwards?\" He whispered.\nMarlon sighed, \"What do you think? The Inspector was never really the same afterwards; whenever he saw or heard someone having a successful date, or talking about a relationship, he would go silent, and he would be upset. He stayed, of course, but he's been worried about relationships since, and I can't blame him. A few of us have tried to encourage him to move on, and find someone, but he's been reluctant. But with this Zoe girl, I dunno… when he got a fan on his blog, he was suspicious of her when she showed a lot of interest, and I only hope it doesn't lead to another disappointment. He barely managed to get out of the last one okay. But like I said, me, Darlene, and Naomi, we all wondered if the Inspector would leave Saint Marie, but luckily he hasn't.\"\nJ.P thought he was being a bit pessimistic, but he hadn't been on Saint Marie for a couple of years, and he had only had sporadic contact with Marlon since he'd left to take up his opportunity in Jamaica. \"How badly was he suspicious?\" he asked quietly.\n\"He thought it might have been Rebecca Walmslow; he asked the Commissioner to check to make sure she wasn't taunting him from prison, even if she wasn't supposed to have unsupervised internet access,\" Marlon said as he went back to packing.\nWhile J.P could well understand DI Parker's point of view he thought it was a little paranoid.\n\"And only a couple of days ago, Darlene scolded him for being demanding about her giving him some pictures of herself,\" Marlon went on.\nJ.P flinched. \"Wow, that does sound paranoid.\"\n\"I know, but you can't blame him, I guess. I only hope this goes well for him, J.P,\" Marlon said.\nJ.P nodded slowly in agreement, knowing from his own experiences that romance was a tricky thing."
    },
    {
        "title": "How can I ever go back?",
        "url": "https://archiveofourown.org/works/52098832",
        "fandoms": [
            "The Hobbit - All Media Types",
            "The Hobbit (Jackson Movies)",
            "The Hobbit - J. R. R. Tolkien"
        ],
        "rating": "General Audiences",
        "warnings": "No Archive Warnings Apply",
        "relationships": "Gen",
        "status": "Complete Work",
        "published": "07 Dec 2023",
        "language": "English",
        "words": "998",
        "chapters": "1/1",
        "kudos": "4",
        "bookmarks": "1",
        "hits": "39",
        "post_title": "All Bilbo had wanted at first was to return to the mundane life of the Shire, but after all he's seen and done, how can he ever go back?",
        "comment": "Bilbo Baggins had started to get used to the cold; sleeping on cold, soaking wet grass, with wind blowing biting and bitter, cutting into his flesh as though dozens of knives or swords were so small you couldn't see them - when he had first left the Shire after Gandalf and Thorin had both tricked him and then roped him into it despite his misgivings about an adventure of all things, although much of it was down to the Hobbit's desire to have a quiet life, Bilbo had wondered how he was going to cope - but now the whole adventure was done, the tired Hobbit was trying to work out how he could adjust to his bed again!\nHe had only gone because the dwarves had ridiculed him, and then there was that little voice in the back of his mind, urging him to do something every other Hobbit found to be anathema.\nGoing on an adventure.\nAnd it wasn't only the bed he had problems with; there was the fact he had a fire again, a supply of food that was plentiful which meant he didn't need to forage or hunt anymore. He had returned to the Shire only a week ago, and despite his earlier beliefs that everything would go back to the way things had been as if Thorin and Gandalf and the other dwarves hadn't roped him into what he'd believed was nothing more than a foolish quest before he had found himself in the heart of Erebor and was looking over the enormous piles of gold, silver, jewels…treasures the dwarves had taken over the decades before they had uncovered the Arkenstone before Smaug had arrived - Bilbo, not for the first time, wondered if dragons had some higher sense that allowed them to find treasures like gold and jewels, the sheer brutality of Smaug's attack on Erebor had been enough to drive the dwarves away would have been worth it for the dragon, who showed he was as greedy as Thror, Thorin's father.\nBut now….\nNow, after everything he had seen, the adventures he'd had - the trolls and tricking them, meeting the creature Gollum in the caves of the misty mountains (when he had met Gollum, Bilbo had wondered more about the strange creature, so twisted, malformed, with rotting teeth, wrinkly skin, with a terrible cough; there was no doubt in Bilbo's head the creature had suffered underneath without the sun for years, but there was something about the gnarled thing in the caves that was familiar), the whole mess with the spiders in Mirkwood before they were caught by the wood-elves, inlaid with the large adventure where he found himself confronted by Smaug, and twisting the dragons' mind with riddles while the Wood-elves and the Lake-Men demanded compensation for the troubles, especially after Smaug, enraged by the intrusion, wrongly believed the people of the lake had helped the dwarves get in.\nBilbo closed his eyes as he thought about the whole mess, shaking his head in sorrow as he thought about how many people had died just because a small group of them had helped him and the dwarves, but it had all been a mistake. Smaug had been paranoid, and he'd jumped to the wrong conclusions before he'd flown off to destroy Lake-town; fortunately for the town, Bilbo's news of what Smaug's weak point was and was able to kill the dragon before he could cause any more senseless destruction.\nWhen Thorin had refused to help pay the people and the wood elves, Bilbo had wondered what was wrong with the noble dwarf he had quickly come to admire and like, it was just a relief his original personality had reasserted itself and Bilbo hoped, in the dwarf's final moments, he was finally at peace.\nNews of the dragons' passing and the Battle of the Five-Armies had reached the Shire shortly after Bilbo had returned; passing merchants and travellers coming to the Shire either for business or to stock on their supplies as they passed through, talked about the whole thing from second-hand accounts about the destruction of Lake-Town, Smaug's death, eager to spread their gossip.\nBilbo hadn't bothered boasting about the adventures as he'd been more focused on getting his breath back. And even though everyone knew he had committed the ultimate sin for 'Hobbit-Kind' was he had gone out on an adventure, nobody was curious, although they would listen with polite and vapid disinterest to the accounts of the battle and the dragons' death.\nThat was the trouble with Hobbits; they were just so uninterested in the goings on beyond the Shires' borders that they gave any passers-by only uninterested looks and listened to them only out of politeness while counting down the seconds before they actually left.\nThe only Hobbits to show any kind of interest were the younglings; Bilbo had not boasted to the adults, knowing they would just dismiss him, but the children were another matter entirely.\nThey were blessed with dreams.\nHe constantly related to them about the existence of beings outside the Shire - the Trolls, the Wood-elves, the majesty of the dwarf civilisation that was at Erebor despite the decades the city had been abandoned, and the wonder of the Lake-Town, and the terrifying encounter with Smaug, Bilbo often wondered about the dwarves and Gandalf.\nWould he ever see or hear from them again?\nWould they desire his services as a 'burglar' once more?\nIf he had reflected on this before he'd gone with them indignantly, then Bilbo would have gladly washed his hands of them. But now, he genuinely hoped he could see them again. Sure, he knew he could go off on his own, but truthfully Bilbo wasn't sure he could muster the courage right now. Maybe in another few years?\nBut as he thought about the friends he'd made, Bilbo again had questions on his mind. Why did Gandalf specifically turn to him when there were other Hobbits?\nHe may never know."
    }
]