[
    "<thinking>\nThe writing prompt presents a scenario where a retired super villain, who was enjoying a peaceful retirement, is forced to return to their old ways after their family is threatened. This prompt suggests themes of revenge, family loyalty, and a return to a past life. The tone can be dramatic with potential for dark humor, given the super villain context.\n\nThe user profile indicates a storytelling style that blends humor with whimsical or dramatic elements, clear and cohesive narrative structures, and vivid character and setting development. The user also enjoys subverting common tropes and using varied sentence structures and rich vocabulary to enhance the narrative.\n\nTo align with the user's style, the story should start with a humorous or whimsical scene that sets the tone, develop a clear narrative structure with a satisfying resolution, and include unique elements and vivid imagery. The main character should be well-developed with clear motivations, and the setting should be immersive. Supporting characters should add emotional depth, and the language should be varied and rich, maintaining a balance of humor and tension.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a humorous or whimsical scene that sets the tone of the story. For example, describe the protagonist's peaceful retirement activities in a light-hearted manner before the inciting incident disrupts their tranquility.\n\n#### Story Ending\n- Conclude with a sense of resolution and a touch of humor or heartfelt moments. Ensure the protagonist's return to their old ways is justified and leaves the reader with a satisfying final impact.\n\n#### Narrative Structure\n- Create a clear and cohesive structure with a well-defined beginning, middle, and end. Ensure the progression from the protagonist's peaceful retirement to their return to villainy is smooth and logical, with meaningful character interactions and events.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements that expand on the prompt, such as quirky gadgets or humorous aspects of the protagonist's past villainy. Ensure these elements add originality and align with the user's preference for imaginative details.\n\n#### Engaging Themes and Imagery\n- Use vivid imagery and thematic depth to capture the mood of the prompt. Themes of family loyalty, revenge, and the clash between past and present should resonate with the story's tone. Include detailed descriptions of the protagonist's lair, their old costume, and the setting of their peaceful retirement.\n\n#### Use of Tropes or Clichés\n- Subvert common tropes related to super villains and revenge. For example, show the protagonist's reluctance to return to their old ways or highlight the humorous aspects of their villainous past. Ensure originality while incorporating humor or irony.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist with clear motivations and a connection to the prompt’s scenario. Show their internal conflict between enjoying retirement and the need to protect their family. Ensure their arc is well-established and aligned with the user’s detailed character-building approach.\n\n#### Setting Establishment\n- Build immersive settings with descriptive details that bring the protagonist's retirement and their return to villainy to life. Describe the peaceful environment they were enjoying and contrast it with the darker, more dramatic settings of their past.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters that complement the protagonist and contribute meaningfully to the plot. Use interactions with family members, old allies, or new enemies to add emotional depth and advance the story.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person perspective to provide depth and balance between action and introspection. Ensure the tone aligns with the user’s preferred narrative techniques, blending humor with dramatic elements.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Include rhetorical devices, such as humor, irony, or vivid descriptions, to create impact. Use playful and witty language to reflect the protagonist's personality and the story's tone.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the prompt’s themes while adhering to the user’s balance of humor, tension, or heartfelt moments. Ensure the word choices and recurring phrases reinforce this alignment, creating a cohesive and engaging narrative.\n</story_rules>",
    "<thinking>\nThe writing prompt presents a scenario where the protagonist, an engineer from Earth, finds themselves in a fantasy world (isekai) and decides to use their engineering skills to create unconventional tools to defeat the Dark Lord. This setup suggests a blend of fantasy and science fiction elements, with a focus on innovation and humor.\n\nThe user profile indicates a storytelling style that blends humor with whimsical or dramatic elements, clear and cohesive narrative structures, and well-developed characters and settings. The user also incorporates unique elements, engaging themes, and vivid imagery, often subverting common tropes for originality.\n\nTo align the story with the user's style, the rules should emphasize a humorous and whimsical tone, a clear narrative structure, and detailed character and setting development. The protagonist's engineering background should be highlighted through creative and unconventional inventions, and the story should subvert typical fantasy tropes in a humorous way.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Start with a humorous and whimsical scene where the protagonist, recently isekai'd, is adjusting to their new surroundings. For example, they could be tinkering with a bizarre contraption in a medieval workshop, immediately setting a tone of innovation and humor.\n\n#### Story Ending\n- Conclude with a resolution that combines humor and a sense of accomplishment. The protagonist's unconventional inventions should play a key role in defeating the Dark Lord, and the ending should reflect the positive impact of their unique approach, leaving readers with a satisfying and humorous final note.\n\n#### Narrative Structure\n- Ensure a clear and cohesive structure with a well-defined beginning, middle, and end. The story should progress smoothly through a series of inventive challenges and humorous interactions, leading to the final confrontation with the Dark Lord.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce imaginative and unconventional inventions that the protagonist creates using their engineering skills. These should be inspired by the fantasy setting but reflect modern engineering principles, such as a steam-powered dragon or a magical energy cannon.\n\n#### Engaging Themes and Imagery\n- Use vivid imagery to describe the protagonist's inventions and the fantasy world. Themes of innovation, creativity, and the clash between modern science and ancient magic should be central to the story, enhancing the whimsical and humorous tone.\n\n#### Use of Tropes or Clichés\n- Subvert common fantasy tropes in a humorous way. For example, instead of a traditional sword, the protagonist could wield a gadget that combines multiple functions in a comically over-engineered manner. Highlight the absurdity of typical fantasy conventions through the protagonist's modern perspective.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist as a resourceful and inventive engineer who is both bewildered and excited by the fantasy world. Their motivations should be clear: to use their skills to make a difference in this new world, while also finding joy in the creative process.\n\n#### Setting Establishment\n- Create an immersive fantasy setting with detailed descriptions of the medieval workshop, the Dark Lord's lair, and other key locations. Incorporate elements that blend fantasy and modern engineering, such as enchanted machinery or magical blueprints.\n\n#### Supporting Characters and Interactions\n- Introduce supporting characters that complement the protagonist and add depth to the story. These could include a skeptical local blacksmith, a curious apprentice, or a rival inventor. Use their interactions to highlight the protagonist's ingenuity and the humorous clash of cultures.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person perspective to provide depth to the narrative, allowing for both external descriptions and internal monologues that reflect the protagonist's thoughts and reactions to the fantasy world.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Use humor, irony, and playful language to create a whimsical and engaging tone. Descriptions of the protagonist's inventions should be detailed and imaginative, reflecting their engineering background.\n\n#### Tone and Mood Alignment\n- Maintain a tone that balances humor and whimsy with moments of tension and excitement. Ensure that the mood aligns with the protagonist's journey, from their initial bewilderment to their triumphant and humorous victory over the Dark Lord.\n\n</story_rules>",
    "<thinking>\nThe writing prompt presents a scenario where a retired super weapon designer, now living on a peaceful colony planet, faces the disruption of space pirates who have stolen their garden robot. The prompt suggests themes of retirement, unexpected conflict, and a quest for retrieval, with potential for humor and action.\n\nThe user profile indicates a storytelling style that blends humor with whimsical or dramatic elements, clear and cohesive narrative structures, and vivid, immersive settings. The user’s stories often start with engaging scenes, end with a sense of resolution and humor, and feature well-developed characters and unique elements. The language use is varied, with a balance of humor, tension, and heartfelt moments.\n\nTo align the story with the user’s style, the rules should ensure a humorous and engaging opening, a clear narrative structure, vivid descriptions of the colony planet and space pirates, and a satisfying, humorous resolution. The main character should be well-developed, with clear motivations and interactions with supporting characters that add depth to the story.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a humorous and whimsical scene that sets the tone of the retired designer’s peaceful life being disrupted by the space pirates. For example, describe the protagonist’s quirky morning routine on the colony planet before discovering the theft.\n\n#### Story Ending\n- Conclude with a humorous and satisfying resolution where the protagonist retrieves the garden robot, possibly outsmarting the space pirates in a clever and unexpected way. Ensure the ending leaves readers with a sense of closure and a smile.\n\n#### Narrative Structure\n- Create a clear and cohesive structure with a well-defined beginning, middle, and end. Start with the peaceful life, introduce the conflict with the space pirates, and follow the protagonist’s journey to retrieve the robot, leading to a humorous and satisfying conclusion.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements that expand on the prompt, such as quirky technologies on the colony planet, the protagonist’s inventive gadgets, and the eccentric personalities of the space pirates. Ensure these elements add originality and humor to the story.\n\n#### Engaging Themes and Imagery\n- Use vivid imagery to describe the peaceful colony planet, the protagonist’s home, and the space pirates’ ship. Themes of retirement, unexpected adventure, and clever problem-solving should resonate throughout the story, enhanced by engaging and whimsical descriptions.\n\n#### Use of Tropes or Clichés\n- Subvert common tropes related to space adventures and retired heroes by adding humorous twists. For example, the protagonist’s past as a super weapon designer could be played for laughs, with their skills being used in unexpected and non-lethal ways to outsmart the pirates.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist with clear motivations and a relatable personality. Highlight their transition from a peaceful retiree to an inventive problem-solver determined to retrieve their garden robot. Use humor and internal monologue to add depth to their character.\n\n#### Setting Establishment\n- Build an immersive setting with detailed descriptions of the colony planet, the protagonist’s home, and the space pirates’ ship. Ensure the settings feel vivid and relevant, enhancing the reader’s experience and drawing them into the story.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters that complement the protagonist and contribute meaningfully to the plot. Use interactions with neighbors, fellow colonists, and the space pirates to add emotional depth and advance the story. Ensure these characters are well-developed and add to the humor and whimsy of the narrative.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person perspective to provide depth and balance between action and introspection. Ensure the tone aligns with the user’s preferred narrative techniques, blending humor with whimsical or dramatic elements.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Include rhetorical devices such as humor, irony, and vivid descriptions to create impact. Use playful and witty language to maintain the story’s engaging and whimsical tone.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the prompt’s themes of unexpected adventure and humor. Ensure the narrative balances humor, tension, and heartfelt moments, aligning with the user’s storytelling style. Use word choices and recurring phrases to reinforce this alignment throughout the story.\n</story_rules>",
    "<thinking>\nThe writing prompt presents a dramatic and emotional scenario where a renowned hero faces the terminal illness of their son due to unexpected genetic outcomes. This sets a serious and poignant tone, with potential for deep emotional exploration and character development. The user profile indicates a preference for blending humor with dramatic elements, clear narrative structures, and vivid, engaging settings. The user also enjoys subverting tropes and adding unique, imaginative details to their stories.\n\nTo align with the user's style, the story should start with a dramatic yet engaging scene, possibly incorporating a touch of irony or humor to balance the heavy theme. The narrative should be clear and cohesive, with a well-defined beginning, middle, and end. Characters, especially the protagonist and their son, should be well-developed, with clear motivations and emotional depth. The setting should be immersive, with vivid descriptions that enhance the reader's experience. Language use should include varied sentence structures, rich vocabulary, and rhetorical devices like irony and humor to maintain the user's distinctive style.\n\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a dramatic scene where the hero is in the hospital, cradling their son. Introduce a touch of irony or dark humor to balance the heavy theme, such as the hero's internal monologue reflecting on the absurdity of their situation.\n\n#### Story Ending\n- Conclude with a sense of resolution that provides a heartfelt moment or a touch of humor. Perhaps the hero finds a way to honor their son's memory or discovers an unexpected positive outcome from the tragic event.\n\n#### Narrative Structure\n- Ensure a clear and cohesive structure with a well-defined beginning, middle, and end. Connect these elements through a series of events and character interactions that smoothly progress the story.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements that expand on the prompt, such as the hero's superpowers and how they impact their daily life and interactions with their son. Consider adding imaginative details about the hero's world and the genetic anomaly.\n\n#### Engaging Themes and Imagery\n- Use vivid imagery to describe the hospital setting, the hero's powers, and the emotional moments between the hero and their son. Themes of love, loss, and the unexpected consequences of power should resonate throughout the story.\n\n#### Use of Tropes or Clichés\n- Subvert common tropes related to superheroes and terminal illness. For example, instead of a typical heroic sacrifice, explore the hero's vulnerability and the irony of their powers being useless in saving their son.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist with clear motivations and emotional depth. Show their struggle between their public persona as a hero and their private pain as a parent. Highlight their internal conflict and growth throughout the story.\n\n#### Setting Establishment\n- Build an immersive setting with detailed descriptions of the hospital, the hero's home, and any other relevant locations. Ensure these settings feel vivid and relevant to the story's emotional tone.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters, such as doctors, nurses, and other patients, who contribute meaningfully to the plot. Use their interactions with the hero to add emotional depth and advance the story.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person perspective to provide depth and balance between action and introspection. This allows for a broader view of the hero's world and their internal struggles.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Include rhetorical devices like irony, humor, and vivid descriptions to create impact and maintain the user's distinctive style.\n\n#### Tone and Mood Alignment\n- Maintain a tone that balances the dramatic and emotional elements of the prompt with the user's preference for humor and irony. Ensure the mood aligns with the themes of love, loss, and the unexpected consequences of power.\n\n</story_rules>",
    "<thinking>\nThe writing prompt, \"I run a soap kitchen.\" \"You mean soup?\" \"SOAP!\" suggests a humorous and potentially whimsical scenario. The misunderstanding between \"soap\" and \"soup\" sets the stage for a story that could explore quirky characters, a unique business, and the comedic potential of such a mix-up. The user profile indicates a preference for starting stories with a blend of humor and whimsy, developing well-rounded characters, and creating immersive settings. The user also enjoys subverting common tropes and using vivid imagery and engaging themes. The narrative should be clear and cohesive, with a satisfying and humorous resolution.\n\nBased on the prompt and the user profile, the story should begin with a humorous misunderstanding, develop a unique and immersive setting (a soap kitchen), and feature well-developed characters with clear motivations. The narrative should be structured to maintain engagement, with a clear beginning, middle, and end, and should conclude with a humorous or heartfelt resolution. The language should be rich and varied, with a tone that balances humor and whimsy.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Start with the humorous misunderstanding about the soap kitchen. Use dialogue to immediately set a whimsical and comedic tone, drawing readers into the unique scenario.\n\n#### Story Ending\n- Conclude with a resolution that ties back to the initial misunderstanding, providing a humorous or heartfelt twist. Ensure the ending leaves readers with a satisfying and memorable final impact.\n\n#### Narrative Structure\n- Maintain a clear and cohesive structure with a well-defined beginning, middle, and end. Ensure smooth progression through a series of events and character interactions, keeping the narrative engaging and logical.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements related to the soap kitchen, such as quirky soap recipes, unusual customers, or magical properties of the soap. Ensure these elements are original and enhance the whimsical tone of the story.\n\n#### Engaging Themes and Imagery\n- Use vivid imagery to describe the soap kitchen and its products. Engage readers with themes of creativity, entrepreneurship, and the humorous challenges of running such a unique business.\n\n#### Use of Tropes or Clichés\n- Subvert common tropes related to business or misunderstandings to add originality. For example, play with the trope of a struggling business owner by showing unexpected benefits or humorous outcomes of the soap kitchen's uniqueness.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist as a quirky and determined individual with a clear motivation for running the soap kitchen. Use their interactions and internal monologue to establish their personality and relatability.\n\n#### Setting Establishment\n- Create an immersive setting for the soap kitchen with detailed descriptions of the shop, its products, and the atmosphere. Ensure the setting feels vivid and relevant, enhancing the whimsical and humorous tone.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters, such as customers, friends, or competitors, who contribute meaningfully to the plot. Use their interactions with the protagonist to add emotional depth and advance the story.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person perspective to provide depth and balance between action and introspection. Ensure the tone aligns with the whimsical and humorous nature of the story.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Use rhetorical devices such as humor, irony, and vivid descriptions to create impact and maintain engagement.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the humorous and whimsical nature of the prompt. Ensure word choices and recurring phrases reinforce this alignment, creating a cohesive and engaging narrative.\n\n</story_rules>"
]