[
    "<thinking>\nThe writing prompt presents a dramatic and intense scenario involving a gruesome murder with over 100 stab wounds from multiple weapons. This sets a tone of urgency, mystery, and potential danger. The narrative possibilities include a detailed investigation, uncovering the motives behind the murder, and exploring the characters involved in the case. The prompt suggests a dark, suspenseful atmosphere with elements of crime and possibly psychological thriller.\n\nThe user profile indicates a preference for starting stories with dramatic events or direct dialogue, maintaining a clear narrative structure, and ending with a mix of resolution and lingering elements. The user enjoys incorporating unique elements, engaging themes, and vivid imagery, often subverting common tropes. Characters are developed through interactions and dialogue, with immersive settings and meaningful supporting characters. The language is straightforward and conversational, with varied sentence structures and a balanced tone.\n\nCombining these insights, the Story Rules will guide the creation of a story that begins with a dramatic scene, follows a clear narrative structure, and ends with a mix of resolution and lingering intrigue. The story will incorporate unique elements and vivid imagery, develop characters through interactions, and use straightforward, engaging language.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Start with the direct dialogue from the prompt to immediately engage the reader and set a tone of urgency and disruption.\n- Introduce the main characters, such as the detective or investigator, through their reactions to the autopsy report, establishing their roles and relationships.\n\n#### Story Ending\n- Conclude with a mix of resolution and lingering elements, such as uncovering the main perpetrator but leaving some questions unanswered or hinting at further complications.\n- Consider adding a humorous twist or an open-ended conclusion to maintain the story's tone and keep the reader thinking about the narrative.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end. Introduce the conflict early through the autopsy report, explore the investigation and character interactions, and resolve the main plot while leaving some elements open for future exploration.\n- Ensure smooth and cohesive transitions between scenes, maintaining a logical progression of events.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements that build upon the prompt, such as a mysterious organization behind the murder or supernatural aspects influencing the investigation.\n- Add depth and originality to the story by incorporating unexpected twists or morally ambiguous characters.\n\n#### Engaging Themes and Imagery\n- Use themes of survival, moral ambiguity, and unexpected alliances to engage the reader. Explore the psychological impact of the gruesome murder on the characters.\n- Employ striking imagery to enhance the story's tone, such as detailed descriptions of the crime scene, the autopsy, and the investigation process.\n\n#### Use of Tropes or Clichés\n- Subvert common crime and thriller tropes by giving the characters unique motivations or backgrounds. For example, the detective could have a personal connection to the case or a hidden agenda.\n- Avoid clichéd resolutions by adding depth and complexity to the plot and characters.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist, such as the detective or investigator, through their interactions and dialogue. Show their motivations, strengths, and vulnerabilities.\n- Ensure the main character has a clear arc, evolving through the investigation and their experiences.\n\n#### Setting Establishment\n- Establish immersive settings with specific details that enhance the story's relevance and impact. Describe the crime scene, the autopsy room, and other key locations vividly.\n- Use the setting to create a tense and suspenseful atmosphere, reflecting the dark and mysterious tone of the prompt.\n\n#### Supporting Characters and Interactions\n- Introduce supporting characters that play crucial roles in advancing the plot and adding depth to the story. These could include colleagues, witnesses, or suspects.\n- Use interactions between characters to reveal important information, build tension, and develop relationships.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person perspective to provide a balanced view of the characters' reactions and interactions. This allows for a comprehensive exploration of the investigation and the characters' inner thoughts.\n- Incorporate dialogue and monologue to add depth and humor, making the narrative engaging and dynamic.\n\n#### Stylistic Elements\n- Employ varied sentence structures, mixing short and longer sentences to enhance readability and maintain the reader's interest.\n- Use simple but effective vocabulary, incorporating rhetorical devices such as irony, vivid descriptions, and suspenseful language to create impact.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the prompt's themes of urgency, mystery, and danger. Shift the mood as the story progresses, balancing tension with moments of introspection or humor.\n- Use word choices and recurring phrases to reinforce the story's theme, creating a cohesive and engaging reading experience.\n\n</story_rules>",
    "<thinking>\nThe writing prompt suggests a story about Wood Elves who are misunderstood as peaceful and harmless due to their harmony with Nature. However, the prompt hints at a deeper, possibly darker truth about the nature of these elves and their relationship with Nature. This sets up a narrative that can explore themes of misunderstanding, hidden dangers, and the true essence of Nature.\n\nThe user profile indicates a storytelling style that begins with dramatic and engaging events, often starting in medias res or with direct dialogue. The user prefers clear narrative structures with a mix of resolution and lingering elements in the endings. They introduce unique elements that build upon the prompt, employ striking imagery, and subvert common tropes. Characters are developed through interactions and dialogue, with immersive settings and well-incorporated supporting characters. The user employs a third-person perspective, varied sentence structures, and a mix of casual and tense tones.\n\nCombining these insights, the Story Rules will guide the creation of a narrative that starts dramatically, explores the hidden dangers of the Wood Elves, and concludes with a mix of resolution and lingering mystery. The story will include unique elements, vivid imagery, and subverted tropes, with well-developed characters and immersive settings. The language will be engaging, with varied sentence structures and a balanced tone.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a dramatic scene that immediately challenges the misconception about Wood Elves. Use direct dialogue or an intense action sequence to set a tone of urgency and disruption.\n\n#### Story Ending\n- Conclude with a mix of resolution and lingering elements. Leave some aspects open-ended to suggest ongoing mysteries or future adventures, possibly with a humorous twist.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end. Introduce the conflict early, explore it through character interactions, and resolve it in a satisfying manner. Ensure smooth transitions between these elements.\n\n---\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements that build upon the prompt, such as the Wood Elves' hidden abilities or the true nature of their relationship with Nature. These elements should add originality and depth to the story.\n\n#### Engaging Themes and Imagery\n- Use themes of misunderstanding, hidden dangers, and the true essence of Nature. Employ striking imagery to enhance the story's tone and draw the reader into the narrative.\n\n#### Use of Tropes or Clichés\n- Subvert common tropes related to elves and nature. For example, portray the Wood Elves as having a complex and potentially dangerous relationship with Nature, avoiding clichés and adding depth to the narrative.\n\n---\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist through their interactions and dialogue. Ensure they have clear motivations and a connection to the prompt’s scenario. Their arc should be well-established and align with the story’s themes.\n\n#### Setting Establishment\n- Build immersive settings with descriptive details that bring the Wood Elves' environment to life. Ensure the settings feel relevant and vivid, enhancing the impact of the narrative.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters that complement the protagonist and contribute meaningfully to the plot. Use their interactions to add emotional depth or advance the story.\n\n---\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person perspective to provide depth and balance between action and introspection. Ensure the tone aligns with the story’s themes and the user’s preferred narrative techniques.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Include rhetorical devices, such as vivid descriptions and irony, to create impact.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the prompt’s themes. Balance casual and tense moments to match the story’s progression, maintaining tension and intrigue throughout.\n\n</story_rules>"
]