[
    "<thinking>\nThe writing prompt presents a scenario involving a council that sets strict criteria for immortality and rebirth of a universe. The protagonist is accused of cheating by ending their universe without allowing it to be reborn. This prompt suggests themes of immortality, cosmic rebirth, and judgment, with potential for dramatic conflict and introspection.\n\nThe user profile indicates a preference for vivid descriptions, immediate conflict, and tension in the story beginning. The endings are typically dramatic and open-ended, leaving readers curious. The narrative structure can be either chronological or non-linear but always maintains clear progression. The user introduces unique elements, subverts common tropes, and employs engaging themes and imagery. Characters are developed through actions, dialogue, and internal struggles, with immersive settings that reflect the protagonist's state of mind. The first-person narrative perspective is used to provide depth, with varied sentence structures, descriptive language, and occasional humor and irony. The tone and mood are consistently aligned with the prompt.\n\nCombining these insights, the Story Rules will guide the creation of a story that begins with immediate conflict, develops through vivid descriptions and unique elements, and concludes with a dramatic, open-ended resolution. The narrative will be immersive, with well-developed characters and settings, and will use a first-person perspective to convey the protagonist's internal experiences.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Start with a vivid description of the council chamber, immediately introducing the conflict as the protagonist stands accused. Use sensory details to create a tense atmosphere, such as the echoing voices of the council members and the protagonist's racing thoughts.\n\n#### Story Ending\n- Conclude with a dramatic and open-ended scene where the protagonist reflects on the council's judgment and their own actions. Leave the reader curious about the protagonist's future and the potential for redemption or further conflict.\n\n#### Narrative Structure\n- Use a non-linear structure to reflect the protagonist's disorientation and the cosmic nature of the story. Include flashbacks to the protagonist's actions that led to the council's judgment, interspersed with the present confrontation.\n\n---\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements such as the concept of cosmic rebirth and the mechanics of how universes are reborn. Add depth by exploring the protagonist's unique experiences and the consequences of their actions.\n\n#### Engaging Themes and Imagery\n- Use themes of immortality, judgment, and cosmic rebirth to create a rich narrative. Employ vivid imagery to describe the council chamber, the protagonist's memories of their universe, and the cosmic events they witnessed.\n\n#### Use of Tropes or Clichés\n- Subvert common tropes related to immortality and cosmic judgment by presenting the protagonist's actions and motivations in a unique light. Highlight their internal struggles and the moral ambiguity of their choices.\n\n---\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist through their actions, dialogue, and internal monologue. Reveal their complex personality, motivations, and the internal conflict they face regarding their actions and the council's judgment.\n\n#### Setting Establishment\n- Create an immersive setting for the council chamber with detailed descriptions that reflect the protagonist's state of mind. Use sensory details to enhance the atmosphere and make the environment feel vivid and relevant.\n\n#### Supporting Characters and Interactions\n- Introduce council members as supporting characters who play significant roles in advancing the plot. Use their interactions with the protagonist to add depth to the narrative and provide additional context about the protagonist's situation.\n\n---\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a first-person narrative perspective to provide an intimate view of the protagonist's thoughts and feelings. This perspective will enhance the storytelling by conveying the protagonist's internal experiences and reflections.\n\n#### Stylistic Elements\n- Employ varied sentence structures, a mix of straightforward and descriptive language, and occasional humor and irony to enhance the narrative. Use descriptive and evocative language to reinforce the tone and mood.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the prompt's themes of immortality, judgment, and cosmic rebirth. Use specific word choices and recurring themes to reinforce the narrative's atmosphere and enhance the reader's experience and immersion.\n</story_rules>",
    "<thinking>\nThe writing prompt presents a scenario where the protagonist is determined to prevent an unworthy man, supposedly chosen by the stars, from taking over something they have built. The key thematic elements include leadership, destiny, ambition, and resistance. The tone is serious and determined, with a sense of urgency and conflict.\n\nThe user profile indicates a preference for vivid descriptions, immediate conflict, and dynamic openings. The user often concludes stories with dramatic, open-ended endings, leaving readers curious. Their narrative structure can be both chronological and non-linear, maintaining clear progression. The user introduces unique elements, subverts common tropes, and employs engaging themes and imagery. Characters are developed through actions, dialogue, and internal struggles, with immersive settings that reflect the protagonist's state of mind. The first-person narrative perspective is commonly used, with varied sentence structures, descriptive language, and occasional humor and irony.\n\nCombining these insights, the Story Rules will guide the creation of a story that begins with immediate conflict, develops a complex protagonist and immersive setting, and concludes with a dramatic, open-ended resolution. The narrative will include unique elements and subverted tropes, maintaining a serious and determined tone throughout.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Start with a vivid description of the protagonist witnessing the man being chosen by the stars, immediately establishing the conflict and tension. Use sensory details to draw the reader in and set a dynamic tone.\n\n#### Story Ending\n- Conclude with a dramatic and open-ended scene where the protagonist's actions have significant consequences, leaving the reader curious about future developments. Use reflective thoughts and vivid imagery to enhance the final impact.\n\n#### Narrative Structure\n- Use a chronological structure with clear progression, but incorporate flashbacks or reflections to provide context and depth to the protagonist's motivations and past experiences. Ensure a cohesive connection between events.\n\n---\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements such as a mystical artifact or a hidden prophecy that the protagonist discovers, adding depth and originality to the narrative. Ensure these elements are integral to the plot and enhance the story's themes.\n\n#### Engaging Themes and Imagery\n- Explore themes of destiny versus free will, ambition, and resistance. Use vivid imagery to depict the protagonist's internal and external struggles, such as the oppressive atmosphere of the setting and the protagonist's determined expressions.\n\n#### Use of Tropes or Clichés\n- Subvert common tropes related to chosen ones and leadership by revealing the chosen man’s flaws and the protagonist’s unique perspective on destiny. Add originality by incorporating unexpected twists and the protagonist's personal insights.\n\n---\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist through their actions, dialogue, and internal monologue, revealing their complex personality and strong motivations. Show their determination and resilience in the face of the chosen man's ambition.\n\n#### Setting Establishment\n- Create an immersive setting with detailed descriptions that reflect the protagonist's state of mind and the story's themes. Use sensory details to depict the environment, such as the celestial phenomena and the protagonist's surroundings.\n\n#### Supporting Characters and Interactions\n- Introduce supporting characters that play significant roles in advancing the plot and adding depth to the narrative. Use their interactions with the protagonist to highlight the protagonist's struggles and motivations, and to provide additional context about the chosen man and the prophecy.\n\n---\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a first-person narrative perspective to provide an intimate view of the protagonist's thoughts and feelings. This perspective will enhance the storytelling by conveying the protagonist's emotions and reflections effectively.\n\n#### Stylistic Elements\n- Employ varied sentence structures, a mix of straightforward and descriptive language, and occasional humor and irony to enhance the storytelling. Use descriptive and evocative language, along with rhetorical questions and exclamations, to reinforce the tone and mood.\n\n#### Tone and Mood Alignment\n- Maintain a serious and determined tone throughout the story, using specific word choices and recurring themes to reinforce the narrative's atmosphere. Ensure the mood is consistent, enhancing the reader's experience and immersion.\n\n</story_rules>"
]