[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should focus on a pivotal moment or confrontation that drives the narrative.\n   - It should include a backstory or reveal that adds depth to the characters and their relationship.\n   - The narrative should build towards a climax that significantly impacts the characters' bond.\n   - Conclude with a resolution that reflects the changes in the characters' relationship and their personal growth.\n\n2. **Creativity**:\n   - Use emotional and dramatic elements to enhance the narrative.\n   - Incorporate internal monologues and reflective moments to provide insight into the characters' thoughts and feelings.\n   - Blend tension and vulnerability to create a compelling and immersive story.\n\n3. **Development (Character and Setting)**:\n   - Develop the characters by exploring their emotions, motivations, and the dynamics of their relationship.\n   - Provide detailed descriptions of the setting to enhance the atmosphere and mood of the story.\n   - Show the characters' growth and the evolution of their bond through their interactions and decisions.\n\n4. **Language Use**:\n   - Employ vivid and descriptive language to create a strong emotional impact.\n   - Use a close third-person perspective to provide depth to the characters' internal experiences.\n   - Craft natural and meaningful dialogue that reveals character traits and advances the plot.\n   - Maintain a consistent tone that reflects the emotional weight and intensity of the narrative.\n\n<story_rules>\n- **Plot**:\n  - Begin the story with Arthur discovering Merlin's scars, setting the stage for the confrontation.\n  - Include a backstory or flashbacks that reveal the origins of the scars and Merlin's reasons for hiding them.\n  - Build the narrative towards a climactic moment where the truth is fully revealed, impacting both characters deeply.\n  - Conclude with a resolution that shows the changes in Arthur and Merlin's relationship, highlighting their personal growth and the new dynamics of their bond.\n\n- **Creativity**:\n  - Use emotional and dramatic elements to enhance the narrative, focusing on the tension and vulnerability of the characters.\n  - Incorporate internal monologues and reflective moments to provide insight into Arthur and Merlin's thoughts and feelings.\n  - Blend tension and vulnerability to create a compelling and immersive story, using descriptive language to evoke strong emotions.\n\n- **Development (Character and Setting)**:\n  - Develop Arthur and Merlin by exploring their emotions, motivations, and the dynamics of their relationship.\n  - Provide detailed descriptions of the setting, such as the room where the confrontation takes place, to enhance the atmosphere and mood of the story.\n  - Show the characters' growth and the evolution of their bond through their interactions and decisions, highlighting the impact of the revealed truth.\n\n- **Language Use**:\n  - Employ vivid and descriptive language to create a strong emotional impact, using metaphors and similes to enhance the narrative.\n  - Use a close third-person perspective to provide depth to Arthur and Merlin's internal experiences, revealing their thoughts and emotions.\n  - Craft natural and meaningful dialogue that reveals character traits and advances the plot, ensuring it feels true to the characters' voices.\n  - Maintain a consistent tone that reflects the emotional weight and intensity of the narrative, balancing tension with moments of vulnerability and reflection.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided follow a structured approach, categorizing the rules into **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contains detailed, actionable instructions that guide the narrative development process. The rules are tailored to the specific themes and tones of the writing prompts, ensuring comprehensive coverage of narrative aspects such as pacing, character dynamics, and emotional depth.\n\nFor the new writing prompt about the scruffy young raven, the rules should focus on the evolving relationship between the protagonist and the raven, the court's reaction, and the eventual realization of the raven's significance. The tone should balance elements of whimsy and emotional warmth, reflecting the transformation of the raven from an outcast to a cherished family member.\n\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story by introducing the protagonist and the initial reaction of the court to the scruffy young raven taking up residence in the chambers.\n  - Highlight the protagonist's initial curiosity and the court's dismay, setting up the central conflict.\n  - Show the gradual development of the bond between the protagonist and the raven through a series of interactions and shared experiences.\n  - Include moments of mischief and humor as the raven grows, showcasing her personality and the challenges she brings.\n  - Conclude with a heartfelt realization by the protagonist that the raven is more than just a pet, but a member of the family, and depict the court's eventual acceptance.\n\n- **Creativity**:\n  - Use imaginative descriptions to bring the raven's antics and personality to life, emphasizing her transformation from scruffy outcast to striking companion.\n  - Incorporate elements of whimsy and magic, such as the raven's unexpected talents or mysterious origins, to add depth and intrigue to the story.\n  - Create vivid scenes that highlight the contrast between the raven's mischievous behavior and the court's formal atmosphere.\n  - Use symbolic elements, such as the raven's feathers or her interactions with the protagonist, to represent themes of acceptance and family.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a compassionate and open-minded character, showing their growth through their relationship with the raven.\n  - Portray the raven as a multifaceted character with a distinct personality, emphasizing her journey from outcast to beloved companion.\n  - Include secondary characters from the court, each with their own reactions and eventual acceptance of the raven, to enrich the narrative.\n  - Create an immersive setting that reflects the grandeur of the court and the unique presence of the raven, using detailed descriptions to bring the environment to life.\n\n- **Language Use**:\n  - Use descriptive and emotive language to convey the protagonist's evolving feelings towards the raven and the court's reactions.\n  - Employ a tone that balances whimsy and warmth, capturing the playful and heartfelt moments of the story.\n  - Incorporate dialogue that reveals character dynamics and advances the plot, maintaining a consistent and engaging narrative voice.\n  - Use sensory details to create vivid and immersive scenes, drawing the reader into the world of the story and the bond between the protagonist and the raven.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should focus on a single, significant event or interaction.\n   - It should include a clear beginning, middle, and end, with a resolution that ties back to the central theme.\n   - The narrative should transition smoothly between different emotional beats, from tension to tenderness.\n\n2. **Creativity**:\n   - Incorporate elements of humor and irony, especially in character interactions.\n   - Blend the harshness of the cold night with the warmth of the fire, using these contrasts to enhance the emotional impact.\n   - Use imaginative descriptions and unique details to bring the setting and characters to life.\n\n3. **Development (Character and Setting)**:\n   - Develop multidimensional characters by showcasing their personalities, emotions, and relationships.\n   - Create an immersive setting with rich, sensory descriptions of the cold night and the warmth of Arthur's chambers.\n   - Highlight the emotional arcs of the characters, focusing on their vulnerabilities and moments of connection.\n\n4. **Language Use**:\n   - Employ descriptive language to create vivid imagery and engage the reader's senses.\n   - Vary the pacing to match the story's events, using slower, detailed passages for reflective moments and quicker, concise sentences for action or tension.\n   - Craft engaging dialogue that reflects the characters' personalities and relationships.\n   - Maintain a consistent tone that balances humor with the emotional depth of the characters' interactions.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with Merlin braving the cold night to gather a rare herb, setting the stage with detailed descriptions of the harsh weather.\n  - Transition to Merlin being summoned to Arthur's chambers, creating a shift from the external cold to the internal warmth.\n  - Develop the interaction between Merlin and Arthur, starting with a scolding over Merlin's lack of winter gear.\n  - Gradually shift the tone from tension to tenderness, using the warmth of the fire as a backdrop for their conversation.\n  - Conclude with a reflective moment that highlights the deepening bond between Merlin and Arthur, tying back to the themes of friendship and care.\n\n- **Creativity**:\n  - Incorporate humor and irony in the dialogue, especially in Arthur's initial scolding of Merlin.\n  - Use the contrast between the cold night and the warmth of the fire to enhance the emotional impact of the scene.\n  - Include imaginative descriptions of the rare herb and the setting, adding unique details to bring the story to life.\n  - Blend the mundane aspects of Merlin's duties with the unexpected tenderness of the moment, highlighting the contrast and interplay between the two.\n\n- **Development (Character and Setting)**:\n  - Develop Merlin and Arthur as multidimensional characters by showcasing their personalities, emotions, and the dynamics of their relationship.\n  - Create an immersive setting with rich, sensory descriptions of the cold night and the warmth of Arthur's chambers.\n  - Highlight the emotional arcs of Merlin and Arthur, focusing on their vulnerabilities and moments of connection.\n  - Use detailed interactions and dialogue to reveal character traits and advance the plot.\n\n- **Language Use**:\n  - Employ descriptive language to create vivid imagery and engage the reader's senses, using metaphors, similes, and detailed descriptions.\n  - Vary the pacing to match the story's events, using slower, detailed passages for reflective moments and quicker, concise sentences for action or tension.\n  - Craft engaging dialogue that reflects the characters' personalities and relationships, ensuring it feels natural and true to their voices.\n  - Maintain a consistent tone that balances humor with the emotional depth of the characters' interactions, creating a balanced and engaging narrative.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should be structured around the central conflict introduced in the prompt.\n   - It should include a clear beginning, middle, and end, with specific events that drive the narrative forward.\n   - The plot should incorporate elements of surprise, tension, and resolution.\n\n2. **Creativity**:\n   - The story should include imaginative elements that enhance the narrative.\n   - It should use symbolic elements and rich descriptions to add depth and meaning.\n   - The creativity should align with the themes and tone of the prompt.\n\n3. **Development (Character and Setting)**:\n   - Characters should be developed through their actions, dialogue, and interactions with others.\n   - The setting should be vividly described, creating a strong sense of place and atmosphere.\n   - The development should reflect the emotional and psychological growth of the characters.\n\n4. **Language Use**:\n   - The language should be rich and descriptive, creating a vivid and immersive reading experience.\n   - Dialogue should be used effectively to reveal character emotions and advance the plot.\n   - The tone should be consistent and engaging, reflecting the themes of the story.\n\nUsing these inferred patterns, craft the **Story Rules** for the new writing prompt.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story by establishing Lobelia Sackville-Baggins' ambition to claim Bag End and her initial actions to achieve this goal.\n  - Introduce the news of Bilbo's unexpected fate and its immediate impact on Lobelia and the community of Hobbiton.\n  - Develop a series of events that showcase Lobelia's attempts to navigate the chaos and salvage her plans, highlighting her internal and external conflicts.\n  - Include moments of tension and surprise, such as unexpected reactions from other characters or unforeseen complications in Lobelia's schemes.\n  - Conclude with a resolution that reflects the themes of pride, ambition, and the consequences of one's actions, providing a satisfying emotional arc for Lobelia.\n\n- **Creativity**:\n  - Use imaginative descriptions to bring the setting of Hobbiton to life, emphasizing its quaint charm and the contrast with Lobelia's ambitious nature.\n  - Incorporate symbolic elements, such as objects or events that represent Lobelia's pride and the shifting fortunes of Bag End.\n  - Include humorous or ironic moments that highlight the absurdity of Lobelia's schemes and the unexpected twists in her plans.\n  - Use rich, evocative language to create a vivid and immersive narrative, drawing the reader into the world of the story.\n\n- **Development (Character and Setting)**:\n  - Develop Lobelia Sackville-Baggins as a complex character, exploring her motivations, ambitions, and the impact of her actions on herself and others.\n  - Provide nuanced portrayals of other characters in Hobbiton, showing their reactions to Bilbo's fate and Lobelia's schemes.\n  - Vividly describe the setting of Hobbiton and Bag End, creating a strong sense of place and atmosphere that enhances the narrative.\n  - Show the emotional and psychological growth of Lobelia throughout the story, reflecting the themes of pride, ambition, and the consequences of one's actions.\n\n- **Language Use**:\n  - Use detailed and sensory descriptions to bring the setting and characters to life, creating a vivid and immersive reading experience.\n  - Employ dialogue effectively to reveal character emotions and advance the plot, maintaining a consistent and engaging tone throughout the story.\n  - Use a mix of humorous and reflective language to capture the tone of the story, balancing the absurdity of Lobelia's schemes with the deeper themes of pride and ambition.\n  - Maintain a consistent and engaging tone throughout the story, using language that reflects the themes and emotional arcs of the characters.\n</story_rules>"
]