[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as the focus on character dynamics, the use of introspection, and the integration of symbolic elements. The rules will need to emphasize the emotional depth and transformation of the characters, particularly focusing on the revelation of secrets and the impact on relationships. The examples will illustrate how to convey these themes through specific narrative techniques, ensuring the rules are actionable and aligned with the prompt's objectives.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with Arthur's accidental discovery of Merlin's scars, using this moment as the inciting incident that propels the narrative forward. For example, describe Arthur noticing the scars during a routine task, such as helping Merlin with his cloak.\n  - Develop the plot through a series of revelations and emotional confrontations, focusing on the gradual unveiling of the truth behind the scars. Ensure that each revelation deepens the characters' understanding of each other and their shared history.\n  - Conclude the narrative with a scene that encapsulates the transformation in Arthur and Merlin's relationship, highlighting how the truth has altered their bond. For instance, depict a moment of silent understanding or a gesture of solidarity that signifies their renewed connection.\n\n- **Creativity**:\n  - Use the scars as a symbolic element to explore themes of vulnerability, trust, and the hidden burdens each character carries. Describe the scars in a way that reflects Merlin's past struggles and the weight of his secrets.\n  - Incorporate imaginative elements, such as magical or historical references, to enrich the narrative and provide context for the scars' origins. For example, link the scars to a past magical battle or a significant event in Camelot's history.\n  - Explore unconventional interpretations of the prompt by delving into the emotional and psychological impact of the scars on both characters, using metaphors and symbolism to convey their internal states.\n\n- **Development (Character and Setting)**:\n  - Develop Arthur and Merlin as multidimensional characters by exploring their emotional responses to the discovery and the ensuing revelations. Highlight Arthur's initial shock and confusion, followed by a growing empathy and understanding.\n  - Create an immersive setting that reflects the tension and intimacy of the narrative. Use specific locations, such as a secluded part of the castle or a quiet forest clearing, to enhance the emotional impact of the characters' interactions.\n  - Use dialogue and internal monologue to reveal character emotions and motivations, ensuring that conversations are rich with subtext and contribute to the characters' development. For example, depict Arthur's struggle to reconcile his perception of Merlin with the new information he learns.\n\n- **Language Use**:\n  - Employ evocative and introspective language to convey the emotional depth of the narrative. Use vivid imagery and metaphors to enhance the story's themes, such as describing the scars as \"etched lines of history\" that tell a story of their own.\n  - Use dialogue to reveal character emotions and relationships, ensuring that conversations are nuanced and reflective of the characters' internal journeys. Capture the tension and vulnerability in their exchanges, such as Arthur's demanding questions and Merlin's hesitant responses.\n  - Maintain a reflective and poignant tone throughout the narrative, capturing the themes of revelation and transformation. Use an intimate narrative perspective to connect readers with the characters' internal journeys and emotional growth.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves themes of transformation, acceptance, and the bond between humans and animals, which should be reflected in the rules. The narrative should focus on the evolving relationship between the protagonist and the raven, highlighting the bird's growth and the protagonist's realization of her significance. The rules will incorporate examples that illustrate these themes and provide actionable guidance for storytelling. The tone should be warm and introspective, with a focus on character dynamics and emotional depth.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the initial conflict of the raven's arrival and the court's disapproval. Use this tension to set the stage for the raven's integration into the protagonist's life. For example, describe the court's reaction as \"a flurry of disapproving whispers and raised eyebrows.\"\n  - Develop the plot through the raven's growth and the protagonist's changing perception of her. Highlight key moments that showcase the raven's intelligence and charm, leading to the protagonist's realization of her importance. For instance, depict a scene where the raven cleverly retrieves a lost item, earning the protagonist's admiration.\n  - Conclude the narrative with a scene that symbolizes the raven's acceptance as family, such as a formal acknowledgment of her place in the protagonist's life, despite the court's initial resistance.\n\n- **Creativity**:\n  - Use imaginative descriptions to bring the raven's personality to life, portraying her as both mischievous and endearing. For example, describe her antics as \"a dance of feathers and mischief, leaving a trail of laughter in her wake.\"\n  - Incorporate symbolic elements, such as the raven's transformation from scruffy to striking, to reflect themes of growth and acceptance. Use these symbols to deepen the narrative's emotional impact.\n  - Explore unconventional interpretations of the prompt, such as the idea that the raven's presence challenges the court's perceptions and brings about positive change.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a compassionate and open-minded character, whose relationship with the raven reveals their capacity for acceptance and love. Use internal monologue to explore their evolving feelings towards the raven.\n  - Create a vivid setting that reflects the court's initial resistance and eventual acceptance of the raven. Use detailed descriptions to convey the atmosphere of the chambers and the court's dynamics.\n  - Use interactions between the protagonist and the raven to reveal character traits and emotional growth. For example, depict a moment where the protagonist defends the raven against criticism, showcasing their growing bond.\n\n- **Language Use**:\n  - Employ warm and evocative language to convey the emotional depth of the narrative. Use rich imagery and metaphors to enhance the story's themes, such as describing the raven's transformation as \"a metamorphosis of midnight feathers into a tapestry of elegance.\"\n  - Use dialogue to reveal character emotions and relationships, ensuring that conversations are nuanced and reflective of the characters' internal journeys.\n  - Maintain a reflective and intimate tone throughout the narrative, capturing the themes of acceptance and family. Use an engaging narrative perspective to connect readers with the protagonist's internal journey and emotional growth.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize the importance of character dynamics, emotional depth, and the use of vivid imagery and symbolism. They also highlight the significance of internal conflict and transformation, often using a single event or setting as a focal point for character interaction and growth. \n\nFor the new prompt, the rules will need to focus on the intimate and transformative nature of the interaction between Merlin and Arthur, using the cold setting as a backdrop for warmth and connection. The rules will guide the narrative to explore themes of friendship, vulnerability, and unexpected tenderness, while maintaining a balance between humor and introspection. The language should be evocative and reflective, capturing the nuances of the characters' relationship and the atmospheric setting.\n\nI will ensure that each category of the Story Rules includes detailed, actionable instructions with examples that align with the new writing prompt, reflecting the style and depth demonstrated in the few-shot examples.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the narrative with Merlin's determination to gather the rare herb despite the harsh winter conditions, establishing his sense of duty and resilience. For example, describe Merlin's careful steps through the snow, his breath visible in the frigid air as he searches for the elusive plant.\n  - Transition the plot to Arthur's chambers, using the setting change to shift the tone from cold and solitary to warm and intimate. Highlight the contrast between the icy outdoors and the cozy firelit room.\n  - Develop the plot through a gradual shift from a scolding to a tender moment, using dialogue and body language to reveal the characters' evolving emotions. Conclude with a scene that encapsulates the warmth of their friendship, such as Arthur offering Merlin a blanket and a shared moment of laughter.\n\n- **Creativity**:\n  - Use the cold winter night as a metaphor for isolation and the warmth of the fire as a symbol of friendship and connection. For instance, describe the fire's glow as a beacon of comfort in the otherwise harsh and unforgiving night.\n  - Incorporate humor and light-hearted banter to balance the narrative's emotional depth, reflecting the characters' camaraderie. For example, have Arthur tease Merlin about his lack of winter gear, only to soften his tone as the conversation progresses.\n  - Explore the theme of vulnerability, using the setting and circumstances to reveal the characters' hidden depths and mutual reliance.\n\n- **Development (Character and Setting)**:\n  - Develop Merlin as a character driven by duty and loyalty, showcasing his willingness to brave the elements for the sake of his responsibilities. Use his internal monologue to reveal his thoughts and motivations as he gathers the herb.\n  - Portray Arthur as both authoritative and compassionate, using his initial scolding as a means to express concern for Merlin's well-being. Highlight his protective nature through his actions and words.\n  - Create an immersive setting by vividly describing the contrast between the cold, desolate outdoors and the warm, inviting atmosphere of Arthur's chambers. Use sensory details to enhance the reader's experience, such as the crackling of the fire and the chill of the night air.\n\n- **Language Use**:\n  - Employ evocative and descriptive language to capture the atmospheric setting and the characters' emotions. Use metaphors and similes to enhance the narrative's depth, such as comparing the fire's warmth to a gentle embrace.\n  - Use dialogue to reveal character dynamics and emotional shifts, ensuring that conversations are rich with subtext and reflect the characters' personalities. For example, Arthur's teasing can gradually give way to genuine concern and warmth.\n  - Maintain a reflective and intimate tone throughout the narrative, allowing readers to connect with the characters' internal journeys and the evolving nature of their relationship.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize the importance of internal conflict, character transformation, and the use of symbolic elements to enrich the narrative. They also highlight the need for vivid language and a focus on emotional depth. For the new prompt, I will ensure the rules reflect Lobelia Sackville-Baggins' internal journey, the impact of Bilbo's fate on her plans, and the resulting chaos in Hobbiton. The rules will include specific examples to illustrate how to capture the tone and themes of the prompt, such as Lobelia's scheming nature and the societal dynamics of Hobbiton.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with Lobelia Sackville-Baggins' initial scheming to claim Bag End, establishing her motivations and the stakes involved. For example, describe her meticulous plans to redecorate Bag End and her anticipation of finally owning it.\n  - Develop the plot through the unexpected news of Bilbo's fate, which disrupts Lobelia's plans and forces her to confront her pride and ambitions. Highlight her internal conflict as she grapples with the chaos this news brings to her life.\n  - Conclude the narrative with Lobelia's realization of the true value of community and belonging, rather than material possessions. Use a scene where she reluctantly helps a neighbor, symbolizing her growth and acceptance of her place in Hobbiton.\n\n- **Creativity**:\n  - Use symbolic elements, such as the key to Bag End, to represent Lobelia's desires and the shifting power dynamics in Hobbiton. For instance, describe her clutching the key tightly as a symbol of her fleeting control.\n  - Incorporate humor and irony to reflect the absurdity of Lobelia's situation and her exaggerated sense of self-importance. Use witty dialogue and situations to highlight her character flaws and eventual growth.\n  - Explore the theme of unexpected change by portraying Hobbiton as a living, breathing community that reacts to Bilbo's fate and Lobelia's antics. Use creative descriptions to capture the bustling life of the Shire.\n\n- **Development (Character and Setting)**:\n  - Develop Lobelia as a complex character with both flaws and redeeming qualities. Show her initial arrogance and entitlement, followed by moments of vulnerability and introspection as her plans unravel.\n  - Create a vivid setting by detailing the idyllic yet gossipy nature of Hobbiton. Use descriptions of the Shire's landscapes and the close-knit community to enhance the narrative's themes of belonging and change.\n  - Use interactions with other hobbits to reveal Lobelia's character and her evolving relationships. For example, depict a scene where she reluctantly engages in a conversation with a neighbor, revealing her internal struggle and gradual acceptance.\n\n- **Language Use**:\n  - Employ a lighthearted and whimsical tone, using vivid imagery and playful language to capture the essence of the Shire and its inhabitants. For example, describe the Shire's rolling hills as \"a patchwork quilt of greens and golds, stitched together by winding paths and babbling brooks.\"\n  - Use dialogue to convey character traits and dynamics, ensuring that conversations are rich with subtext and humor. Capture Lobelia's sharp tongue and the community's reactions to her antics through lively exchanges.\n  - Maintain a narrative perspective that allows for introspection and humor, providing insight into Lobelia's thoughts and feelings while keeping the tone engaging and accessible.\n</story_rules>"
]