[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided show a clear structure with categories: **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contains detailed, actionable rules that guide the narrative process. The rules are specific, avoiding comparative or relative terms, and are tailored to the themes and tone of the writing prompt.\n\nFor the new writing prompt, the rules should focus on the emotional journey of the two girls, their interactions, and the setting that brings them together. The tone should be sensitive and empathetic, reflecting the themes of grief, bonding, and healing.\n\n<story_rules>\n- **Plot**:\n  - Start the story with a scene that establishes the recent loss each girl has experienced, providing context for their grief.\n  - Introduce the girls to each other in a setting that forces them to interact, such as a shared living space or a support group.\n  - Develop the narrative through a series of interactions and shared experiences that gradually build their bond.\n  - Include moments of conflict and misunderstanding that test their budding relationship, highlighting their individual struggles with grief.\n  - Conclude with a scene that shows a glimmer of hope or a step towards healing, emphasizing the strength of their newfound bond.\n\n- **Creativity**:\n  - Use symbolism and metaphors to represent the girls' emotional states and their journey towards healing.\n  - Incorporate elements of their past lives and memories to deepen the narrative and provide insight into their characters.\n  - Explore the theme of healing through creative activities or rituals that the girls engage in together, such as art, music, or nature walks.\n  - Balance the heavy themes of grief with moments of lightness and hope, using humor and warmth to create a nuanced narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the girls as complex, multidimensional characters with distinct personalities, backgrounds, and coping mechanisms.\n  - Create a supportive but realistic setting that reflects their emotional journey, such as a cozy home, a therapeutic retreat, or a community center.\n  - Use secondary characters, such as family members, friends, or counselors, to provide additional perspectives and support for the girls' journey.\n  - Show the evolution of the girls' relationship through their interactions, highlighting their growth and the impact they have on each other.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to convey the girls' emotions and the atmosphere of the setting.\n  - Use dialogue to reveal the girls' inner thoughts, fears, and hopes, making their conversations authentic and heartfelt.\n  - Maintain a sensitive and empathetic tone throughout the narrative, respecting the gravity of their grief while highlighting their resilience.\n  - Include moments of introspection and reflection, allowing the girls to process their emotions and experiences in a meaningful way.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should be structured to gradually build up to the revelation, with a focus on the evolving relationship between Harry and Snape.\n   - Include moments of tension and conflict as Harry processes the painful truth and its implications.\n   - Conclude with a resolution that leaves room for future development, showing Harry's initial steps towards reconciliation.\n\n2. **Creativity**:\n   - Use emotional depth and complexity to explore the characters' inner struggles and growth.\n   - Incorporate flashbacks or memories to provide context and deepen the narrative.\n   - Employ symbolism and motifs to enhance the emotional impact and thematic resonance.\n\n3. **Development (Character and Setting)**:\n   - Develop Harry and Snape's characters through their interactions, showing their vulnerabilities and strengths.\n   - Provide detailed descriptions of settings that reflect the mood and tone of the scenes, such as somber or reflective environments.\n   - Highlight the emotional journey of both characters, emphasizing their growth and the evolution of their relationship.\n\n4. **Language Use**:\n   - Use evocative and descriptive language to convey the emotional weight of the revelation and its impact on the characters.\n   - Employ varied pacing to reflect the tension and introspection, with moments of intense dialogue and quieter reflection.\n   - Use dialogue to reveal character traits and advance the plot, ensuring it is meaningful and impactful.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Structure the story to gradually build up to Snape's revelation, focusing on the evolving relationship between Harry and Snape.\n  - Include moments of tension and conflict as Harry processes the painful truth and its implications for their bond.\n  - Conclude with a resolution that leaves room for future development, showing Harry's initial steps towards reconciliation and understanding.\n\n- **Creativity**:\n  - Use emotional depth and complexity to explore the characters' inner struggles and growth, making the narrative engaging and relatable.\n  - Incorporate flashbacks or memories to provide context and deepen the narrative, revealing key moments from the past that influence the present.\n  - Employ symbolism and motifs to enhance the emotional impact and thematic resonance, such as recurring objects or phrases that hold significance.\n\n- **Development (Character and Setting)**:\n  - Develop Harry and Snape's characters through their interactions, showing their vulnerabilities, strengths, and the evolution of their relationship.\n  - Provide detailed descriptions of settings that reflect the mood and tone of the scenes, such as somber or reflective environments that mirror the characters' emotions.\n  - Highlight the emotional journey of both characters, emphasizing their growth and the challenges they face in reconciling the past with the present.\n\n- **Language Use**:\n  - Use evocative and descriptive language to convey the emotional weight of the revelation and its impact on the characters, creating a vivid and immersive experience for the reader.\n  - Employ varied pacing to reflect the tension and introspection, with moments of intense dialogue and quieter reflection to balance the narrative.\n  - Use dialogue to reveal character traits and advance the plot, ensuring it is meaningful, impactful, and true to the characters' voices.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed and structured rules under the categories of Plot, Creativity, Development (Character and Setting), and Language Use. Each category contained specific, actionable instructions that guided the narrative development, character arcs, setting descriptions, and language style. The rules were tailored to the themes and tone of the writing prompts, ensuring a comprehensive and immersive storytelling experience.\n\nFor the new writing prompt, the rules should focus on the chaotic and suspenseful nature of the interrogation and escape, the complex relationships and rivalries among the goblins, and the underlying mystery of the break-in. The rules should guide the narrative to explore themes of trust, deception, and the hidden motives of the characters involved.\n\n<story_rules>\n- **Plot**:\n  - Start the story with a high-tension scene of the chaotic interrogation at Gringotts, setting the stage for the conflict and mystery.\n  - Develop a sequence of events where Harry and Hagrid navigate the chaos, uncovering clues about the goblin rivalries and the true motives behind the break-in.\n  - Include a subplot where Harry and Hagrid must decide whom to trust among the goblins, adding layers of intrigue and suspense.\n  - Conclude with a resolution that reveals Griphook's motives and the mastermind behind the break-in, tying together the various plot threads.\n\n- **Creativity**:\n  - Use imaginative descriptions of the Gringotts setting, emphasizing its labyrinthine structure and the unique characteristics of goblin architecture.\n  - Incorporate elements of goblin culture and politics, creating a rich and detailed backdrop for the story.\n  - Introduce unexpected twists and turns, keeping the reader engaged and adding depth to the mystery.\n  - Blend moments of humor and tension, reflecting the dynamic between Harry and Hagrid and the chaotic nature of their predicament.\n\n- **Development (Character and Setting)**:\n  - Develop Harry and Hagrid's characters through their reactions to the interrogation and their interactions with the goblins, showing their resourcefulness and determination.\n  - Create multidimensional goblin characters, each with their own motives and personalities, enhancing the complexity of the rivalries.\n  - Use detailed descriptions to bring the Gringotts setting to life, highlighting its grandeur and the dangers lurking within.\n  - Explore the relationships and power dynamics among the goblins, providing insight into their society and the reasons behind the conflict.\n\n- **Language Use**:\n  - Employ vivid and dynamic language to convey the chaos and urgency of the interrogation and escape.\n  - Use dialogue to reveal character traits and advance the plot, ensuring that conversations are meaningful and impactful.\n  - Maintain a balance between fast-paced action scenes and moments of introspection, allowing for character development and plot progression.\n  - Craft a tone that reflects the suspense and mystery of the story, drawing the reader into the unfolding drama.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should start with a scene that establishes the emotional state of the protagonist and the context of the loss.\n   - The narrative should focus on the protagonist's internal struggle and the supportive role of a key secondary character.\n   - Include pivotal moments of dialogue that reveal character motivations and deepen their relationship.\n   - Conclude with a resolution that highlights personal growth, the strength of relationships, and a renewed sense of purpose.\n\n2. **Creativity**:\n   - Incorporate elements of emotional depth and introspection, using the characters' interactions to explore themes of loss, friendship, and resilience.\n   - Use symbolic elements or metaphors to enhance the emotional impact of the story.\n   - Blend moments of vulnerability with instances of unexpected strength and support, creating a balanced and nuanced narrative.\n\n3. **Development (Character and Setting)**:\n   - Develop multidimensional characters by exploring their emotions, motivations, and personal histories.\n   - Create an immersive setting that reflects the protagonist's emotional state and the tone of the story.\n   - Use the setting to enhance the narrative's themes, incorporating symbolic elements that resonate with the characters' experiences.\n   - Establish emotional arcs for key characters, showing their growth and the impact of their interactions on their relationship.\n\n4. **Language Use**:\n   - Employ descriptive and evocative language to convey the characters' emotions and the atmosphere of the setting.\n   - Maintain a deliberate pacing that allows for introspection and meaningful dialogue, balancing action with moments of quiet reflection.\n   - Use dialogue to reveal character traits and advance the plot, ensuring that each character's voice is distinct and true to their personality.\n   - Craft a tone that is introspective and emotionally resonant, drawing readers into the characters' internal worlds.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a scene that establishes Harry's emotional state and the context of the recent loss, setting the stage for his internal struggle.\n  - Focus on Harry's internal conflict and his struggle with the weight of the prophecy and his role in the fight against Voldemort.\n  - Introduce Neville as a supportive character who refuses to leave Harry's side, emphasizing their bond and shared burdens.\n  - Include pivotal moments of dialogue between Harry and Neville that reveal their motivations, fears, and the strength of their friendship.\n  - Conclude with a resolution that highlights Harry's personal growth, the strength of his relationship with Neville, and a renewed sense of purpose in the fight against Voldemort.\n\n- **Creativity**:\n  - Incorporate elements of emotional depth and introspection, using Harry and Neville's interactions to explore themes of loss, friendship, and resilience.\n  - Use symbolic elements or metaphors to enhance the emotional impact of the story, such as the setting or specific objects that hold significance.\n  - Blend moments of vulnerability with instances of unexpected strength and support, creating a balanced and nuanced narrative.\n  - Reinterpret the prompt by focusing on the emotional and psychological aspects of the characters' journey, adding layers of complexity to their relationship.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters by delving deeply into their emotions, motivations, and personal histories, especially for Harry and Neville.\n  - Create an immersive setting that reflects Harry's emotional state and the tone of the story, using detailed descriptions to mirror his internal journey.\n  - Use the setting to enhance the narrative's themes, incorporating symbolic elements that resonate with Harry and Neville's experiences.\n  - Establish emotional arcs for Harry and Neville, showing their growth and the impact of their interactions on their relationship and individual resilience.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to convey Harry and Neville's emotions and the atmosphere of the setting.\n  - Maintain a deliberate pacing that allows for introspection and meaningful dialogue, balancing action with moments of quiet reflection.\n  - Use dialogue to reveal character traits and advance the plot, ensuring that Harry and Neville's voices are distinct and true to their personalities.\n  - Craft a tone that is introspective and emotionally resonant, drawing readers into Harry and Neville's internal worlds and their shared journey.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided show a clear structure with categories: **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contains detailed, actionable rules that guide the narrative process. The rules are specific, avoiding comparative terms, and are tailored to the unique elements of the writing prompt.\n\nFor the new writing prompt, the rules will need to address the discovery of Harry's healing ability, the implications of this power, and the reactions of the magical world. The tone should balance wonder and tension, reflecting the miraculous nature of the ability and the potential dangers it brings.\n\n<story_rules>\n- **Plot**:\n  - Start the story with Harry visiting St. Mungo's, setting the scene for the accidental healing of Neville's parents.\n  - Introduce the discovery of Harry's healing ability through a dramatic and emotional moment, highlighting the miraculous nature of the event.\n  - Develop the plot by showing the immediate reactions of those present, including Neville, his grandmother, and the hospital staff.\n  - Explore the broader implications of Harry's ability, including the interest and potential threats from various factions within the magical world.\n  - Conclude with a resolution that addresses the immediate conflict and sets the stage for future developments, whether Harry decides to embrace or hide his new power.\n\n- **Creativity**:\n  - Use imaginative descriptions to convey the miraculous and mysterious nature of Harry's healing ability.\n  - Incorporate elements of magical lore and history to add depth to the story, such as references to ancient healing spells or legendary healers.\n  - Blend genres by combining elements of fantasy, mystery, and drama, creating a rich and engaging narrative.\n  - Introduce unique magical challenges and ethical dilemmas that Harry must navigate, adding complexity to the story.\n\n- **Development (Character and Setting)**:\n  - Develop Harry as a character who is both awed and burdened by his new ability, exploring his internal conflict and growth.\n  - Show Neville's emotional journey, from the joy of his parents' recovery to the realization of the implications of Harry's power.\n  - Create a detailed and immersive setting within St. Mungo's, using vivid descriptions to bring the hospital to life.\n  - Introduce secondary characters, such as healers, patients, and members of the magical community, who react to Harry's ability in diverse ways, adding depth to the narrative.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to create a vivid and immersive experience for the reader.\n  - Maintain a balanced pacing, with slower, reflective moments to explore the emotional and ethical implications of Harry's ability, and faster-paced scenes to build tension and drama.\n  - Use dialogue to reveal character traits and advance the plot, ensuring each character's voice is distinct and true to their personality.\n  - Maintain a tone that balances wonder and tension, reflecting the miraculous nature of Harry's ability and the potential dangers it brings.\n</story_rules>"
]