[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves themes of grief, healing, and unexpected friendship, requiring a sensitive and nuanced approach. The rules will need to guide the narrative through emotional depth, character dynamics, and the gradual development of hope and healing. I will ensure the rules are actionable, specific, and include examples that align with the prompt's themes and objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a poignant scene that captures the immediate aftermath of the girls' respective losses, using sensory details to convey the weight of their grief. For example, describe the silence in the house as \"a heavy blanket that smothers every sound.\"\n  - Structure the narrative around the gradual development of the girls' relationship, using small, meaningful interactions to build their bond. Highlight moments of shared understanding and empathy, such as a quiet conversation over tea or a shared memory that brings a fleeting smile.\n  - Conclude the story with a moment of tentative hope, where the girls take a small but significant step towards healing, such as planting a tree in memory of their loved ones or deciding to attend a support group together.\n\n- **Creativity**:\n  - Use symbolic elements to represent the girls' emotional journeys, such as a wilted garden that they slowly nurture back to life, mirroring their own healing process.\n  - Incorporate imaginative metaphors and similes to convey the depth of their emotions, such as describing their grief as \"an ocean they must learn to swim in, rather than drown.\"\n  - Introduce a unique setting element, like an attic filled with forgotten treasures, that serves as a catalyst for the girls' bonding and exploration of their shared pasts.\n\n- **Development (Character and Setting)**:\n  - Develop the girls as complex, multidimensional characters, each with their own coping mechanisms and emotional responses to grief. Use internal monologue and dialogue to reveal their vulnerabilities and strengths.\n  - Create a setting that reflects the themes of loss and healing, such as a cozy but cluttered home filled with memories. Use descriptive language to convey the atmosphere, like \"the faded photographs lining the walls, each a silent witness to happier times.\"\n  - Introduce secondary characters, such as a caring guardian or a supportive neighbor, who provide additional layers to the narrative and help facilitate the girls' healing journey.\n\n- **Language Use**:\n  - Employ a gentle and empathetic tone, using descriptive language to evoke the girls' emotional states and the story's themes. For example, describe a moment of shared laughter as \"a fragile thread of light in the darkness.\"\n  - Use dialogue to reveal character dynamics and emotional growth, ensuring that conversations are authentic and reflective of the girls' evolving relationship.\n  - Maintain a balanced pacing, allowing for moments of introspection and emotional connection. Use varied sentence structures to reflect the ebb and flow of the girls' healing process, such as short, impactful sentences during moments of tension and longer, flowing descriptions during scenes of reflection.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with a strong emotional or situational hook, using character interactions to drive the narrative, and concluding with a resolution that reflects the characters' growth or change. Creativity often involves blending humor with deeper themes or using symbolic elements to enhance the narrative. Character development focuses on internal conflicts and relationships, while language use employs vivid descriptions and dialogue to convey emotions and themes.\n\nFor the new prompt, the Story Rules will need to focus on the emotional complexity of Snape's revelation and Harry's internal struggle to reconcile his feelings. The plot should center around the revelation and its impact on their relationship. Creativity can be expressed through the use of symbolic elements or metaphors that reflect the characters' emotional states. Character development will be crucial, with a focus on Harry's internal conflict and Snape's vulnerability. Language use should emphasize emotional depth and clarity, using dialogue and introspection to convey the characters' journey.\n\nI will ensure that each rule is actionable, specific to the new prompt, and includes examples inspired by the few-shot demonstrations.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a moment of tension or unease, such as Harry sensing something is amiss with Snape. Use this to set the stage for the revelation. For example, describe Harry noticing Snape's uncharacteristic silence during their usual meeting.\n  - Structure the narrative around Snape's revelation, focusing on the emotional impact and the subsequent fallout. Ensure that the plot is driven by Harry's internal struggle to reconcile his feelings about Snape's past actions.\n  - Conclude with a moment of introspection for Harry, where he begins to understand the complexity of trust and forgiveness. Use this to show his growth and the potential for rebuilding their bond.\n\n- **Creativity**:\n  - Use symbolic elements to reflect the characters' emotional states, such as a stormy night mirroring Harry's turmoil or a broken object symbolizing their fractured trust.\n  - Incorporate metaphors and imagery that highlight the themes of trust and redemption. For example, describe Harry's emotions as a \"tangled web of confusion and betrayal.\"\n  - Blend moments of levity with the heavier themes to provide balance and depth. Use subtle humor in their interactions to show the bond they've built despite the tension.\n\n- **Development (Character and Setting)**:\n  - Develop Harry as a character torn between his growing trust in Snape and the weight of the revelation. Use internal monologue to explore his conflicting emotions and thoughts.\n  - Portray Snape with vulnerability, showing his struggle to reveal the truth and his fear of losing Harry's trust. Use dialogue to convey his sincerity and regret.\n  - Set the story in a familiar yet intimate location, such as Snape's office or a secluded part of Hogwarts, to emphasize the personal nature of the revelation. Use detailed descriptions to create an immersive atmosphere.\n\n- **Language Use**:\n  - Employ vivid and emotive language to convey the depth of Harry's internal conflict and Snape's vulnerability. Use descriptive imagery to enhance the emotional impact of key scenes.\n  - Use dialogue to reveal character dynamics and advance the plot. Ensure that Snape's revelation is delivered with a mix of directness and emotional weight, capturing the gravity of the moment.\n  - Maintain a reflective and introspective tone, allowing readers to engage with Harry's journey of understanding and forgiveness. Use varied sentence structures to reflect the characters' emotional states and the story's pacing.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with a strong hook, using imaginative elements, developing characters through interactions, and employing vivid language. For the new prompt, I will focus on creating a plot that revolves around mystery and action, incorporating creative elements like goblin culture and rivalries, developing characters through their responses to the chaos, and using dynamic language to convey tension and intrigue. Each rule will include specific examples to illustrate how to apply these elements effectively.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the immediate aftermath of the interrogation, focusing on the tension and confusion as Harry and Hagrid are accused of theft. Use a chaotic scene to capture the reader's attention, such as goblins shouting accusations and the clinking of chains.\n  - Develop the plot around the mystery of the break-in, using Harry and Hagrid's perspective to uncover clues and navigate the goblin rivalries. Include moments of action and suspense, such as a sudden goblin skirmish that provides an opportunity for escape.\n  - Conclude with a revelation that hints at the true mastermind behind the break-in, leaving room for further exploration. For example, have Harry discover a cryptic note or overhear a goblin conversation that suggests a deeper conspiracy.\n\n- **Creativity**:\n  - Incorporate elements of goblin culture and politics to enrich the narrative, such as unique goblin customs or rival factions within Gringotts. Use these elements to add depth and complexity to the story.\n  - Use imaginative details to enhance the setting, such as describing the opulent yet foreboding architecture of Gringotts or the intricate designs of goblin armor.\n  - Introduce unexpected twists, such as a goblin ally who secretly aids Harry and Hagrid, to keep the reader engaged and add layers to the plot.\n\n- **Development (Character and Setting)**:\n  - Develop Harry and Hagrid through their reactions to the chaos and their interactions with the goblins. Highlight Harry's determination and quick thinking, and Hagrid's strength and loyalty.\n  - Portray Griphook as a complex character with ambiguous motives, using his actions and dialogue to create intrigue and tension.\n  - Create a vivid setting by describing the bustling and tense atmosphere of Gringotts, using sensory details to immerse the reader in the scene. For example, describe the echoing footsteps in the marble halls and the flickering torchlight casting shadows on the walls.\n\n- **Language Use**:\n  - Employ dynamic and vivid language to convey the tension and urgency of the situation. Use short, impactful sentences to create a fast-paced narrative.\n  - Use dialogue to reveal character motivations and advance the plot, ensuring that each line contributes to the story's tension and intrigue.\n  - Incorporate descriptive language to create a rich and immersive setting, using metaphors and similes to enhance the narrative. For example, describe the goblins' voices as \"sharp as the clinking of gold coins\" to convey their hostility and suspicion.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt focuses on themes of loss, prophecy, friendship, and emotional resilience. The rules will need to guide the narrative towards exploring these themes through Harry and Neville's interaction, emphasizing emotional depth and character growth. I will ensure the rules are actionable, specific, and include examples that align with the prompt's objectives, reflecting the style and detail level of the few-shot demonstrations.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with Harry in a moment of solitude, reflecting on the recent loss and the overwhelming weight of the prophecy. Use this introspection to set the emotional tone and establish Harry's internal conflict.\n  - Develop the plot through a heartfelt conversation between Harry and Neville, focusing on their shared experiences and the revelation of inner strength. Use this dialogue to explore themes of friendship and resilience.\n  - Conclude the narrative with a moment of renewed determination for Harry, inspired by Neville's unwavering support. Ensure the ending highlights the power of love and friendship as a source of strength.\n\n- **Creativity**:\n  - Use symbolic elements, such as a shared object or memory, to represent the bond between Harry and Neville. For example, describe a plant from Herbology class that Neville gifts to Harry, symbolizing growth and resilience.\n  - Incorporate imaginative metaphors and imagery to convey the emotional weight of the prophecy and the loss. For instance, describe the prophecy as a \"shadow looming over his heart,\" to emphasize its burden.\n  - Explore the theme of unexpected strength by highlighting Neville's growth and courage, using creative scenarios that showcase his development.\n\n- **Development (Character and Setting)**:\n  - Develop Harry as a character grappling with grief and responsibility, using internal monologue to reveal his vulnerabilities and fears. Show his gradual acceptance of support from others.\n  - Portray Neville as a steadfast and compassionate friend, emphasizing his growth and newfound confidence. Use his dialogue to reveal his understanding and empathy towards Harry's struggles.\n  - Set the story in a quiet, intimate location, such as the Gryffindor common room or a secluded spot in the castle, to create a safe space for their conversation. Use descriptive language to enhance the setting's warmth and comfort.\n\n- **Language Use**:\n  - Employ emotive and introspective language to capture the depth of Harry's internal conflict and the comfort of Neville's presence. Use rhetorical devices such as similes and metaphors to enrich the narrative.\n  - Maintain a reflective and supportive tone throughout the story, focusing on the emotional connection between the characters. Use dialogue to convey sincerity and warmth.\n  - Include specific phrases that highlight the story's themes, such as \"Neville's words were like a balm to his wounded spirit,\" to illustrate the healing power of friendship.\n</story_rules>",
    "<thinking>\nTo create the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with a strong hook, developing characters through interactions and internal conflicts, and using vivid language to create an immersive experience. They also highlight the importance of creativity in exploring themes and using symbolic elements to enhance the narrative.\n\nFor the new prompt, the rules will need to focus on Harry's discovery of his healing ability, the implications of this power, and the reactions of the magical world. The plot should revolve around the tension between Harry's newfound ability and the world's response. Creativity will involve exploring the nature of Harry's power and its impact on his relationships and the magical community. Character development will focus on Harry's internal conflict and growth, as well as the reactions of key characters like Neville and the magical authorities. Language use will need to convey the emotional intensity and wonder of the situation, using vivid descriptions and engaging dialogue.\n\nI will ensure that each rule is actionable, specific, and includes examples inspired by the few-shot demonstrations to guide the storytelling process effectively.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a vivid and emotionally charged scene at St. Mungo's, where Harry accidentally heals Neville's parents. Use this event as the catalyst for the narrative, immediately establishing the stakes and Harry's confusion.\n  - Develop the plot around Harry's exploration of his newfound ability, focusing on the tension between his desire to help others and the magical world's interest in his power. Include moments of conflict with magical authorities who seek to control or exploit his ability.\n  - Conclude the story with a resolution that reflects Harry's growth and understanding of his power, leaving room for future exploration. For example, Harry might decide to use his ability discreetly, understanding the responsibility it entails.\n\n- **Creativity**:\n  - Explore the nature of Harry's healing ability through imaginative and symbolic elements, such as a unique aura or a connection to ancient magic. Use these elements to enhance the mystery and wonder of his power.\n  - Incorporate creative scenarios that challenge Harry's understanding of his ability, such as healing a creature or plant, to expand the narrative's scope and depth.\n  - Use symbolic imagery, like a glowing light or a gentle breeze, to represent the healing process and its effects on those around Harry.\n\n- **Development (Character and Setting)**:\n  - Develop Harry as a character grappling with the implications of his power, focusing on his internal conflict and growth. Use his interactions with Neville and other characters to reveal his evolving understanding of responsibility and empathy.\n  - Portray Neville as a supportive and grateful friend, whose relationship with Harry deepens through the healing event. Use their interactions to highlight themes of friendship and gratitude.\n  - Create a vivid setting at St. Mungo's and other magical locations, using detailed descriptions to convey the atmosphere and emotional tone. For example, describe the bustling corridors of the hospital and the serene aura surrounding healed patients.\n\n- **Language Use**:\n  - Employ evocative and descriptive language to capture the emotional intensity of Harry's healing ability. Use metaphors and similes to convey the wonder and mystery of his power.\n  - Use dialogue to reveal character dynamics and advance the plot, ensuring that conversations are natural and engaging. For example, include a heartfelt exchange between Harry and Neville about the impact of the healing.\n  - Maintain a reflective and introspective tone, allowing readers to connect with Harry's internal journey. Use varied sentence structures to create a dynamic and immersive narrative experience.\n</story_rules>"
]