[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should be introduced with a detailed setting and context, focusing on the grand feast and the significance of the alliance between Rohan and Gondor.\n   - The narrative should explore the initial interactions between Éomer and Lothíriel, highlighting their subtle glances and unspoken tensions.\n   - Include a pivotal moment involving the buttery apple turnover that serves as a catalyst for deeper interaction.\n   - Conclude with an open-ended resolution that leaves the balance between duty and desire ambiguous, reflecting the characters' internal conflicts.\n\n2. **Creativity**:\n   - Incorporate rich cultural and historical details to enhance the authenticity of the setting and characters.\n   - Use vivid imagery and sensory details to create an immersive experience, particularly focusing on the feast and the apple turnover.\n   - Employ irony and subtle humor to highlight the characters' personalities and the tension between duty and desire.\n\n3. **Development (Character and Setting)**:\n   - Develop multidimensional characters by exploring their backgrounds, motivations, and emotions in depth.\n   - Establish a detailed and immersive setting with elaborate descriptions of the feast, the hall, and the atmosphere.\n   - Highlight the cultural differences and similarities between Rohan and Gondor, and how these influence the characters' interactions.\n\n4. **Language Use**:\n   - Use rich, descriptive language to create an engaging and immersive narrative.\n   - Maintain a formal tone that reflects the historical and cultural context of the characters.\n   - Employ dialogue that is layered with subtext and emotional depth, revealing the characters' true feelings and motivations.\n   - Use pacing to build tension and emphasize key moments in the story, balancing introspective scenes with more dynamic interactions.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a detailed description of the grand feast, emphasizing the significance of the alliance between Rohan and Gondor.\n  - Introduce Éomer and Lothíriel through their initial interactions, focusing on their subtle glances and unspoken tensions.\n  - Include a pivotal moment involving the buttery apple turnover that serves as a catalyst for deeper interaction between the characters.\n  - Develop the narrative to explore the balance between duty and desire, reflecting the characters' internal conflicts.\n  - Conclude with an open-ended resolution that leaves the balance between duty and desire ambiguous.\n\n- **Creativity**:\n  - Incorporate rich cultural and historical details to enhance the authenticity of the setting and characters.\n  - Use vivid imagery and sensory details to create an immersive experience, particularly focusing on the feast and the apple turnover.\n  - Employ irony and subtle humor to highlight the characters' personalities and the tension between duty and desire.\n  - Integrate imaginative elements that reflect the historical and cultural context of the story.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters by exploring their backgrounds, motivations, and emotions in depth.\n  - Establish a detailed and immersive setting with elaborate descriptions of the feast, the hall, and the atmosphere.\n  - Highlight the cultural differences and similarities between Rohan and Gondor, and how these influence the characters' interactions.\n  - Create emotional arcs for the characters, showing their growth and development throughout the story.\n\n- **Language Use**:\n  - Use rich, descriptive language to create an engaging and immersive narrative.\n  - Maintain a formal tone that reflects the historical and cultural context of the characters.\n  - Employ dialogue that is layered with subtext and emotional depth, revealing the characters' true feelings and motivations.\n  - Use pacing to build tension and emphasize key moments in the story, balancing introspective scenes with more dynamic interactions.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should start with the King and Queen sneaking into the pantry, setting the scene for their mischievous adventure.\n   - Highlight the humorous and unexpected complications they encounter while trying to steal the cured venison.\n   - Include interactions and dialogues that reveal their playful and loving relationship.\n   - Conclude with a light-hearted resolution, possibly involving a humorous twist or discovery.\n\n2. **Creativity**:\n   - Use imaginative and humorous elements to enhance the narrative, focusing on the unexpected challenges of their midnight snack heist.\n   - Incorporate playful banter and witty dialogue to add depth to their relationship and the situation.\n   - Use the setting of the pantry creatively, turning mundane objects into obstacles or aids in their quest.\n\n3. **Development (Character and Setting)**:\n   - Develop the characters of the King and Queen through their actions, dialogue, and interactions, emphasizing their personalities and relationship dynamics.\n   - Provide detailed descriptions of the pantry and its contents, creating a vivid and immersive setting.\n   - Highlight the contrast between their royal status and the mischievous nature of their midnight adventure.\n\n4. **Language Use**:\n   - Use rich, descriptive language to create vivid imagery and convey the humor and playfulness of the situation.\n   - Ensure the dialogue is natural, witty, and reflective of the characters' personalities and relationship.\n   - Maintain a light-hearted and humorous tone throughout the story, using language that enhances the comedic elements.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with the King and Queen of Rohan sneaking into the pantry late at night, setting the scene for their mischievous adventure.\n  - Highlight the humorous and unexpected complications they encounter while trying to steal the cured venison, such as noisy objects, tricky locks, or unexpected interruptions.\n  - Include interactions and dialogues that reveal their playful and loving relationship, showcasing their camaraderie and teamwork.\n  - Conclude with a light-hearted resolution, possibly involving a humorous twist or discovery, such as being caught by a servant or realizing they took the wrong item.\n\n- **Creativity**:\n  - Use imaginative and humorous elements to enhance the narrative, focusing on the unexpected challenges of their midnight snack heist.\n  - Incorporate playful banter and witty dialogue to add depth to their relationship and the situation, making their interactions lively and entertaining.\n  - Use the setting of the pantry creatively, turning mundane objects into obstacles or aids in their quest, such as a squeaky floorboard or a precariously balanced stack of dishes.\n\n- **Development (Character and Setting)**:\n  - Develop the characters of the King and Queen through their actions, dialogue, and interactions, emphasizing their personalities and relationship dynamics.\n  - Provide detailed descriptions of the pantry and its contents, creating a vivid and immersive setting that feels authentic and lived-in.\n  - Highlight the contrast between their royal status and the mischievous nature of their midnight adventure, showcasing their more human and relatable side.\n\n- **Language Use**:\n  - Use rich, descriptive language to create vivid imagery and convey the humor and playfulness of the situation, making the reader feel as if they are part of the adventure.\n  - Ensure the dialogue is natural, witty, and reflective of the characters' personalities and relationship, enhancing the comedic elements of the story.\n  - Maintain a light-hearted and humorous tone throughout the story, using language that enhances the comedic elements and keeps the narrative engaging and entertaining.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed and structured rules under the categories of **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contained specific, actionable instructions that were tailored to the themes and tone of the writing prompt. The rules emphasized rich descriptions, character development, and immersive settings, while maintaining a consistent tone and style.\n\nFor the new writing prompt about a sea princess turned queen of a landlocked kingdom, the **Story Rules** should focus on the internal conflict between her past and present, the cultural and environmental contrasts, and the emotional journey of navigating her new life and love. The rules should guide the narrative to explore these themes deeply and vividly.\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a vivid description of the queen's new landlocked kingdom, contrasting it with her memories of the sea.\n  - Focus on the queen's internal conflict as she navigates her duties and her longing for the sea, using specific events and interactions to highlight this struggle.\n  - Include scenes that show her adapting to her new life, such as participating in local customs or dealing with political matters, while subtly weaving in her nostalgia for the sea.\n  - Conclude the narrative with a moment of resolution or acceptance, where the queen finds a way to honor both her past and her present.\n\n- **Creativity**:\n  - Use rich, sensory descriptions to create a vivid contrast between the sea and the landlocked kingdom, emphasizing the differences in environment, culture, and lifestyle.\n  - Incorporate elements of the sea into the queen's new life, such as symbols, artifacts, or traditions that remind her of her past.\n  - Explore the queen's emotional journey through imaginative and symbolic scenes, such as dreams, memories, or moments of introspection.\n\n- **Development (Character and Setting)**:\n  - Develop the queen's character by exploring her background, motivations, and emotions in depth, making her internal conflict relatable and compelling.\n  - Create a detailed and immersive setting for both the landlocked kingdom and the sea, using elaborate descriptions to highlight their unique features and the queen's connection to each.\n  - Introduce secondary characters who reflect different aspects of the queen's life, such as advisors, friends, or family members, and use their interactions to reveal her struggles and growth.\n\n- **Language Use**:\n  - Employ descriptive and poetic language to create a rich and immersive narrative, using elaborate sentences and vivid vocabulary.\n  - Use dialogue effectively to reveal character traits, advance the plot, and convey the queen's internal conflict.\n  - Maintain a reflective and emotional tone throughout the story, capturing the queen's longing, adaptation, and eventual acceptance.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - Focus on Éomer's determination and the challenges he faces in taming Firefoot.\n   - Highlight the initial failures and setbacks Éomer encounters, emphasizing his perseverance.\n   - Include moments of introspection where Éomer reflects on his motivations and the importance of earning Firefoot's trust.\n   - Conclude with a significant breakthrough or moment of connection between Éomer and Firefoot, showcasing their developing bond.\n\n2. **Creativity**:\n   - Use vivid descriptions to bring the stables and the horse to life, emphasizing Firefoot's wild nature and Éomer's determination.\n   - Incorporate imaginative elements that reflect the bond between horse and rider, such as symbolic gestures or shared experiences.\n   - Avoid clichéd resolutions; instead, focus on the gradual and realistic development of trust and mutual respect.\n\n3. **Development (Character and Setting)**:\n   - Develop Éomer as a determined and resourceful character, showing his growth through his interactions with Firefoot.\n   - Provide detailed descriptions of Firefoot's behavior and personality, making the horse a central character in the story.\n   - Create an immersive setting by describing the stables, the surrounding environment, and the atmosphere of the training sessions.\n\n4. **Language Use**:\n   - Use rich, descriptive language to convey the intensity of Éomer's efforts and the wildness of Firefoot.\n   - Employ dialogue and internal monologue to reveal Éomer's thoughts, emotions, and determination.\n   - Maintain a dynamic pacing that balances action with introspection, building tension and anticipation throughout the story.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Focus on Éomer's determination and the challenges he faces in taming Firefoot.\n  - Highlight the initial failures and setbacks Éomer encounters, emphasizing his perseverance.\n  - Include moments of introspection where Éomer reflects on his motivations and the importance of earning Firefoot's trust.\n  - Conclude with a significant breakthrough or moment of connection between Éomer and Firefoot, showcasing their developing bond.\n\n- **Creativity**:\n  - Use vivid descriptions to bring the stables and the horse to life, emphasizing Firefoot's wild nature and Éomer's determination.\n  - Incorporate imaginative elements that reflect the bond between horse and rider, such as symbolic gestures or shared experiences.\n  - Avoid clichéd resolutions; instead, focus on the gradual and realistic development of trust and mutual respect.\n\n- **Development (Character and Setting)**:\n  - Develop Éomer as a determined and resourceful character, showing his growth through his interactions with Firefoot.\n  - Provide detailed descriptions of Firefoot's behavior and personality, making the horse a central character in the story.\n  - Create an immersive setting by describing the stables, the surrounding environment, and the atmosphere of the training sessions.\n\n- **Language Use**:\n  - Use rich, descriptive language to convey the intensity of Éomer's efforts and the wildness of Firefoot.\n  - Employ dialogue and internal monologue to reveal Éomer's thoughts, emotions, and determination.\n  - Maintain a dynamic pacing that balances action with introspection, building tension and anticipation throughout the story.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should focus on a single, intimate scene that highlights the emotional and physical recovery of Éowyn with Faramir's support.\n   - The narrative should begin with a description of Éowyn's current state, both physically and emotionally, setting the stage for her vulnerability.\n   - Include specific actions and dialogues that showcase Faramir's devotion and care, emphasizing the small, tender moments that illustrate their bond.\n   - Conclude the scene with a moment of mutual understanding and strength, reflecting the healing power of their love.\n\n2. **Creativity**:\n   - Use rich, sensory descriptions to create an immersive and emotionally resonant scene.\n   - Incorporate elements of the setting that symbolize healing and renewal, such as nature or light.\n   - Highlight the contrast between Éowyn's past struggles and her current journey towards healing, using metaphors and imagery to deepen the narrative.\n\n3. **Development (Character and Setting)**:\n   - Develop Éowyn as a complex character, exploring her vulnerability, self-doubt, and gradual rediscovery of strength.\n   - Portray Faramir as a steadfast and compassionate partner, emphasizing his patience and understanding.\n   - Create a detailed and intimate setting that reflects the characters' emotional states and enhances the narrative's themes of healing and love.\n\n4. **Language Use**:\n   - Employ descriptive and poetic language to convey the depth of the characters' emotions and the beauty of their surroundings.\n   - Use dialogue to reveal the characters' inner thoughts and feelings, ensuring it feels natural and heartfelt.\n   - Maintain a gentle and reflective tone throughout the scene, allowing for a slow and deliberate pacing that mirrors the healing process.\n   - Balance the narrative with moments of silence and introspection, using them to underscore the intimacy and connection between the characters.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Focus on a single, intimate scene that highlights Éowyn's emotional and physical recovery with Faramir's support.\n  - Begin with a description of Éowyn's current state, both physically and emotionally, setting the stage for her vulnerability.\n  - Include specific actions and dialogues that showcase Faramir's devotion and care, emphasizing the small, tender moments that illustrate their bond.\n  - Conclude the scene with a moment of mutual understanding and strength, reflecting the healing power of their love.\n\n- **Creativity**:\n  - Use rich, sensory descriptions to create an immersive and emotionally resonant scene.\n  - Incorporate elements of the setting that symbolize healing and renewal, such as nature or light.\n  - Highlight the contrast between Éowyn's past struggles and her current journey towards healing, using metaphors and imagery to deepen the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop Éowyn as a complex character, exploring her vulnerability, self-doubt, and gradual rediscovery of strength.\n  - Portray Faramir as a steadfast and compassionate partner, emphasizing his patience and understanding.\n  - Create a detailed and intimate setting that reflects the characters' emotional states and enhances the narrative's themes of healing and love.\n\n- **Language Use**:\n  - Employ descriptive and poetic language to convey the depth of the characters' emotions and the beauty of their surroundings.\n  - Use dialogue to reveal the characters' inner thoughts and feelings, ensuring it feels natural and heartfelt.\n  - Maintain a gentle and reflective tone throughout the scene, allowing for a slow and deliberate pacing that mirrors the healing process.\n  - Balance the narrative with moments of silence and introspection, using them to underscore the intimacy and connection between the characters.\n</story_rules>"
]