[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should be structured to explore the protagonist's journey through a desolate, post-apocalyptic world, focusing on his search for lost loved ones.\n   - Introduce and develop conflicts that arise from the harsh environment, encounters with other survivors, and the protagonist's internal struggle with hope and despair.\n   - Include detailed scenes that highlight the protagonist's memories of his best friend, family, and Martha, contrasting them with the bleak present.\n   - Resolve the narrative with a moment of revelation or discovery that provides a sense of closure or a new direction for the protagonist.\n\n2. **Creativity**:\n   - Blend elements of suspense, emotional depth, and survival to create a vivid and immersive narrative.\n   - Use imaginative scenarios and rich details to enhance the story's engagement and thought-provoking nature.\n   - Incorporate a sense of irony and existential questioning to add layers of meaning and complexity to the narrative.\n   - Create a balance between introspective moments and action to maintain reader interest and narrative momentum.\n\n3. **Development (Character and Setting)**:\n   - Develop multidimensional characters with distinct personalities and emotional arcs, particularly focusing on the protagonist's relationships with his lost loved ones.\n   - Provide detailed and nuanced descriptions of the post-apocalyptic setting, creating a strong sense of place and atmosphere that enhances the overall narrative.\n   - Use dialogue effectively to reveal character traits, advance the plot, and deepen the emotional impact of the story.\n   - Explore the protagonist's internal thoughts and feelings, giving insight into his motivations and the emotional weight of his experiences.\n\n4. **Language Use**:\n   - Employ descriptive and evocative language to create a rich and immersive reading experience.\n   - Control the pacing carefully, balancing introspective moments with action to maintain reader engagement.\n   - Use a reflective and poignant tone consistently throughout the narrative to convey the protagonist's emotional journey.\n   - Craft dialogue that is natural and revealing, contributing to character development and plot advancement.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Structure the narrative around Jonas's journey through the post-apocalyptic world, focusing on his search for his best friend, family, and Martha.\n  - Introduce conflicts arising from the harsh environment, encounters with other survivors, and Jonas's internal struggle with hope and despair.\n  - Include detailed flashbacks that highlight Jonas's memories of his loved ones, contrasting them with the bleak present.\n  - Resolve the story with a moment of revelation or discovery that provides a sense of closure or a new direction for Jonas.\n\n- **Creativity**:\n  - Blend elements of suspense, emotional depth, and survival to create a vivid and immersive narrative.\n  - Use imaginative scenarios and rich details to enhance the story's engagement and thought-provoking nature.\n  - Incorporate a sense of irony and existential questioning to add layers of meaning and complexity to the narrative.\n  - Create a balance between introspective moments and action to maintain reader interest and narrative momentum.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters with distinct personalities and emotional arcs, particularly focusing on Jonas's relationships with his lost loved ones.\n  - Provide detailed and nuanced descriptions of the post-apocalyptic setting, creating a strong sense of place and atmosphere that enhances the overall narrative.\n  - Use dialogue effectively to reveal character traits, advance the plot, and deepen the emotional impact of the story.\n  - Explore Jonas's internal thoughts and feelings, giving insight into his motivations and the emotional weight of his experiences.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to create a rich and immersive reading experience.\n  - Control the pacing carefully, balancing introspective moments with action to maintain reader engagement.\n  - Use a reflective and poignant tone consistently throughout the narrative to convey Jonas's emotional journey.\n  - Craft dialogue that is natural and revealing, contributing to character development and plot advancement.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed, actionable rules under the categories of **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contained specific instructions that guided the narrative, character development, and thematic elements of the story. The rules were tailored to the unique aspects of each writing prompt, ensuring that the narrative potential was fully explored.\n\nFor the new writing prompt, the rules will need to address the themes of the afterlife, high school dynamics, and the emotional and psychological impact of being trapped and seeking escape. The rules should guide the creation of a compelling plot, imaginative and engaging elements, well-developed characters and settings, and effective use of language.\n\n<story_rules>\n- **Plot**:\n  - Structure the story around the central conflict of being trapped in the afterlife at an old high school and the quest to cross over.\n  - Introduce and develop the tension that arises when one ghost escapes, focusing on the impact this has on the remaining ghosts.\n  - Include specific events and interactions that highlight old resentments, impossible dreams, and the temptation to break the rules.\n  - Conclude with a resolution that addresses the emotional and psychological journey of the characters, whether they find peace or continue their struggle.\n\n- **Creativity**:\n  - Incorporate imaginative elements that bring the afterlife setting to life, such as unique ghostly abilities, supernatural occurrences, and the eerie atmosphere of the high school.\n  - Use symbolism and motifs, such as yearbooks, lockers, or school events, to add depth and layers of meaning to the narrative.\n  - Blend genres by integrating elements of mystery, drama, and supernatural fiction to create a rich and engaging story.\n  - Explore the emotional and psychological aspects of being trapped in the afterlife, using creative scenarios to delve into the characters' fears, hopes, and regrets.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters with distinct personalities, backstories, and emotional arcs. Focus on their relationships and interactions to reveal their complexities.\n  - Provide detailed descriptions of the high school setting, emphasizing its transformation in the afterlife and the impact of key events on the characters.\n  - Use dialogue and interactions to reveal character traits, advance the plot, and deepen the emotional impact of the story.\n  - Explore the dynamics among the ghosts, including friendships, rivalries, and alliances, to create a rich and engaging narrative.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to create a vivid and immersive reading experience. Focus on sensory details to bring the afterlife setting to life.\n  - Use a reflective and introspective tone, with a focus on the characters' internal thoughts and feelings. Use inner monologue to reveal their struggles and growth.\n  - Balance dialogue and narrative description to convey emotions and advance the plot. Ensure that dialogue is natural and contributes to character development and the overall narrative.\n  - Maintain a consistent tone that reflects the themes of the afterlife, high school dynamics, and the quest for escape, using language that is engaging and emotionally resonant.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided show a clear structure with categories: **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contains detailed, actionable rules that guide the narrative process. The rules are tailored to the specific themes and tones of the prompts, ensuring comprehensive and granular guidance.\n\nFor the new writing prompt, the rules should focus on the supernatural elements, the mystery of the decades-old tragedy, and the emotional journey of the protagonist. The tone should be suspenseful and eerie, with a focus on uncovering secrets and helping the ghost reclaim her body.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with Simon's initial disbelief and gradual realization that Maddie's ghost is real.\n  - Introduce the central conflict of uncovering the secrets behind the decades-old tragedy that led to Maddie's death.\n  - Develop a series of investigative steps Simon takes to uncover the truth, including interactions with other ghosts and discovering hidden clues.\n  - Build tension through encounters with other supernatural entities and obstacles that hinder Simon's progress.\n  - Conclude with a resolution where Simon helps Maddie reclaim her stolen body, bringing closure to the tragedy and freeing the spirits haunting the school.\n\n- **Creativity**:\n  - Use imaginative and eerie descriptions to create a haunting atmosphere that enhances the supernatural elements of the story.\n  - Incorporate unexpected twists and revelations that keep the reader engaged and heighten the sense of mystery.\n  - Blend elements of horror, suspense, and emotional depth to create a multifaceted narrative.\n  - Utilize flashbacks or visions to reveal key details about the decades-old tragedy and Maddie's past.\n\n- **Development (Character and Setting)**:\n  - Develop Simon's character through his emotional journey, highlighting his initial skepticism, growing determination, and eventual bravery.\n  - Flesh out Maddie's character, providing insights into her personality, her life before the tragedy, and her current state as a ghost.\n  - Create a vivid and eerie setting within the school, using detailed descriptions to convey the haunted atmosphere and the hidden secrets within its walls.\n  - Introduce supporting characters, such as other students, teachers, and ghosts, who contribute to the unfolding mystery and Simon's quest.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to create a suspenseful and eerie tone throughout the narrative.\n  - Use dialogue to reveal character traits, advance the plot, and convey the emotional stakes of the story.\n  - Balance pacing by alternating between tense, action-driven scenes and reflective, introspective moments.\n  - Maintain a consistent tone that reflects the supernatural and mysterious elements of the story, keeping the reader engaged and immersed in the narrative.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should revolve around the protagonist's internal and external conflicts, with a clear progression of events that highlight these struggles.\n   - Include specific events and interactions that drive the narrative forward and reveal key aspects of the protagonist's journey.\n   - Ensure the plot has a balance of tension and resolution, with moments of realization and change for the protagonist.\n\n2. **Creativity**:\n   - Incorporate imaginative and unique elements that enhance the narrative and engage the reader.\n   - Use motifs, symbols, and recurring themes to add depth and complexity to the story.\n   - Blend genres and integrate unconventional elements to create a rich and immersive narrative.\n\n3. **Development (Character and Setting)**:\n   - Develop the protagonist's character through their internal thoughts, emotions, and interactions with other characters.\n   - Provide detailed descriptions of the setting to create a strong sense of place and atmosphere.\n   - Develop secondary characters and their relationships with the protagonist to enrich the narrative and provide additional perspectives.\n\n4. **Language Use**:\n   - Use descriptive language to create vivid imagery and convey the protagonist's emotions and experiences.\n   - Employ a reflective and introspective tone, focusing on the protagonist's internal thoughts and feelings.\n   - Balance dialogue and narrative description to convey emotions and advance the plot, ensuring that dialogue is natural and contributes to character development.\n\nBased on these patterns, craft the **Story Rules** for the new writing prompt, ensuring they are detailed, actionable, and tailored to the prompt's themes and narrative potential.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Structure the story around the protagonist's internal conflict of lying to the other spirits and the fear of being left behind.\n  - Include key events where the protagonist interacts with other spirits, revealing their lies and the consequences of these actions.\n  - Develop a narrative arc that includes moments of tension, realization, and resolution, focusing on the protagonist's journey towards acceptance and truth.\n  - Incorporate scenes that highlight the protagonist's past life and the circumstances of their death, providing context for their current situation.\n\n- **Creativity**:\n  - Use imaginative elements to create a unique and engaging ghostly world within the high school setting.\n  - Incorporate motifs and symbols, such as specific locations within the school or objects tied to the protagonist's past, to add depth to the narrative.\n  - Blend elements of suspense, mystery, and emotional depth to enhance the story's engagement and complexity.\n  - Introduce unexpected twists and turns that challenge the protagonist and keep the reader invested in the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist's character through their internal thoughts, emotions, and interactions with other spirits, revealing their motivations and fears.\n  - Provide detailed descriptions of the high school setting, creating a strong sense of place and atmosphere that reflects the protagonist's emotional state.\n  - Develop secondary characters, particularly the other spirits, with distinct personalities and backstories that enrich the narrative and provide additional perspectives.\n  - Explore the relationships between the protagonist and the other spirits, highlighting the impact of the protagonist's lies and the journey towards truth and resolution.\n\n- **Language Use**:\n  - Use descriptive and evocative language to create vivid imagery and convey the protagonist's emotions and experiences.\n  - Employ a reflective and introspective tone, focusing on the protagonist's internal thoughts and feelings as they navigate their ghostly existence.\n  - Balance dialogue and narrative description to convey emotions and advance the plot, ensuring that dialogue is natural and contributes to character development.\n  - Maintain a tone that reflects the haunting and emotional nature of the story, with moments of tension and relief that mirror the protagonist's journey.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should focus on the protagonist's mission to bring Christmas back to the town, highlighting the challenges and conflicts he faces.\n   - Include key events that show the protagonist's interactions with the townsfolk and their varied reactions to his efforts.\n   - Develop a clear narrative arc with a beginning, middle, and end, ensuring the protagonist's journey is compelling and emotionally engaging.\n   - Incorporate moments of tension and resolution, emphasizing the protagonist's determination and the impact of his actions on the town.\n\n2. **Creativity**:\n   - Use imaginative and whimsical elements to create a unique and enchanting setting.\n   - Incorporate magical or fantastical aspects that enhance the story's charm and appeal.\n   - Blend elements of adventure, mystery, and heartwarming moments to create a rich and engaging narrative.\n   - Use symbolism and motifs related to winter and Christmas to add depth and meaning to the story.\n\n3. **Development (Character and Setting)**:\n   - Develop the protagonist as a relatable and determined character with a clear motivation and emotional depth.\n   - Explore the backstories and personalities of key townsfolk, highlighting their individual struggles and perspectives.\n   - Create a vivid and immersive setting with detailed descriptions of the town's winter landscape and unique characteristics.\n   - Highlight the contrast between the perpetual winter and the warmth of the protagonist's mission to bring Christmas back.\n\n4. **Language Use**:\n   - Employ descriptive and evocative language to create a vivid and enchanting atmosphere.\n   - Use a tone that balances whimsy and seriousness, reflecting the protagonist's determination and the story's magical elements.\n   - Craft dialogue that reveals character traits and advances the plot, ensuring it feels natural and engaging.\n   - Maintain a consistent pacing that keeps the reader engaged, balancing moments of action with introspective and emotional scenes.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Focus on the protagonist's mission to bring Christmas back to the town, highlighting the challenges and conflicts he faces.\n  - Include key events that show the protagonist's interactions with the townsfolk and their varied reactions to his efforts.\n  - Develop a clear narrative arc with a beginning, middle, and end, ensuring the protagonist's journey is compelling and emotionally engaging.\n  - Incorporate moments of tension and resolution, emphasizing the protagonist's determination and the impact of his actions on the town.\n\n- **Creativity**:\n  - Use imaginative and whimsical elements to create a unique and enchanting setting.\n  - Incorporate magical or fantastical aspects that enhance the story's charm and appeal.\n  - Blend elements of adventure, mystery, and heartwarming moments to create a rich and engaging narrative.\n  - Use symbolism and motifs related to winter and Christmas to add depth and meaning to the story.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a relatable and determined character with a clear motivation and emotional depth.\n  - Explore the backstories and personalities of key townsfolk, highlighting their individual struggles and perspectives.\n  - Create a vivid and immersive setting with detailed descriptions of the town's winter landscape and unique characteristics.\n  - Highlight the contrast between the perpetual winter and the warmth of the protagonist's mission to bring Christmas back.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to create a vivid and enchanting atmosphere.\n  - Use a tone that balances whimsy and seriousness, reflecting the protagonist's determination and the story's magical elements.\n  - Craft dialogue that reveals character traits and advances the plot, ensuring it feels natural and engaging.\n  - Maintain a consistent pacing that keeps the reader engaged, balancing moments of action with introspective and emotional scenes.\n</story_rules>"
]