[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a post-apocalyptic setting, a protagonist named Jonas, and themes of loss, hope, and survival. The rules will need to guide the narrative to explore these themes deeply, using the graveyard as a central symbol and incorporating elements of suspense and emotional depth. I will ensure the rules are actionable, specific, and include examples that align with the prompt's objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Structure the narrative around Jonas's journey through the graveyard, using it as a metaphor for his internal struggle with loss and hope. Begin with Jonas entering the graveyard, reflecting on the names he recognizes, and use this moment to introduce his backstory and the people he has lost.\n  - Develop a central conflict that revolves around Jonas's search for signs of life and his internal battle between despair and hope. For example, describe Jonas finding a fresh flower on a grave, sparking a moment of hope that someone he knows might still be alive.\n  - Conclude the story with an open-ended resolution, where Jonas finds a clue suggesting the possibility of survival, leaving the reader with a sense of hope and uncertainty.\n\n- **Creativity**:\n  - Use the graveyard as a symbolic and atmospheric setting, infusing it with elements of mystery and suspense. Describe the graveyard as a place where the past and present collide, with overgrown paths and weathered headstones telling stories of the world before the apocalypse.\n  - Incorporate elements of magical realism or subtle hints of the supernatural to enhance the theme of hope. For instance, describe Jonas hearing whispers in the wind that sound like the voices of his lost loved ones, blurring the line between reality and imagination.\n\n- **Development (Character and Setting)**:\n  - Develop Jonas as a complex character, focusing on his emotional journey and resilience. Use internal monologue to explore his thoughts and feelings about the people he has lost and his determination to find them.\n  - Create a vivid and immersive setting by describing the graveyard in detail, using sensory language to evoke the desolation and eeriness of the post-apocalyptic world. For example, describe the sound of rustling leaves and the sight of crumbling headstones to enhance the atmosphere.\n\n- **Language Use**:\n  - Employ a reflective and somber tone, using rich, descriptive language to convey Jonas's emotional state and the atmosphere of the graveyard. Use metaphor and symbolism to deepen the narrative, such as describing the graveyard as \"a sea of memories, each name a wave crashing against the shores of his mind.\"\n  - Use a close third-person perspective to allow the reader to experience Jonas's journey intimately, focusing on his internal thoughts and emotions. For example, describe Jonas's internal conflict as \"a battle between the shadows of despair and the flickering light of hope.\"\n  - Incorporate dialogue sparingly, using it to reveal Jonas's memories and connections to the people he has lost. When used, ensure dialogue serves to enhance the emotional depth and complexity of the narrative.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves themes of the afterlife, unresolved issues, and the tension between following rules and pursuing freedom. The rules will need to reflect these themes while providing actionable guidance for storytelling.\n\n1. **Plot**: The plot should focus on the dynamics among the ghosts, their attempts to cross over, and the impact of one ghost's escape. The narrative should explore the emotional and psychological effects of being trapped and the temptation to break the rules.\n\n2. **Creativity**: The story should incorporate imaginative elements related to the afterlife and the high school setting. The ghosts' unique abilities and limitations should be creatively explored, adding depth to the narrative.\n\n3. **Development (Character and Setting)**: Characters should be developed through their interactions and backstories, revealing their motivations and unresolved issues. The high school setting should be vividly described, emphasizing its significance as both a place of memories and a prison.\n\n4. **Language Use**: The language should convey a mix of nostalgia, tension, and introspection. Descriptive language should be used to create an immersive atmosphere, capturing the ghosts' emotional states and the eerie setting.\n\nI will now generate the **Story Rules** based on these insights, ensuring they are specific, actionable, and enriched with examples inspired by the few-shot demonstrations.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Focus the narrative on the emotional and psychological dynamics among the ghosts, emphasizing their shared history and individual desires to cross over. For example, depict a scene where the ghosts gather in the gymnasium, reminiscing about their high school days and debating the implications of one ghost's escape.\n  - Introduce a central conflict involving the temptation to break the rules of the afterlife, exploring the consequences of such actions. Illustrate this with a moment where a ghost considers using forbidden powers to follow the escaped ghost, highlighting the internal struggle between hope and fear.\n\n- **Creativity**:\n  - Use imaginative elements to explore the unique aspects of the afterlife and the high school setting. For instance, describe how the ghosts can manipulate certain objects or relive specific memories, adding depth to their existence and interactions.\n  - Incorporate supernatural phenomena that reflect the ghosts' emotional states, such as flickering lights or shifting shadows, to enhance the atmosphere and tension of the story.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their backstories and interactions, revealing their motivations and unresolved issues. For example, create a character who was the class valedictorian, now struggling with the unfulfilled potential and the desire to move on.\n  - Use the high school setting as both a nostalgic backdrop and a confining space, emphasizing its dual role in the ghosts' lives. Describe the familiar yet haunting hallways, where echoes of past laughter and footsteps linger, to create an immersive setting.\n\n- **Language Use**:\n  - Employ a tone that balances nostalgia with tension, using descriptive language to convey the ghosts' emotional states and the eerie atmosphere of the high school. For example, describe the cafeteria as \"a place once filled with chatter and clinking trays, now silent except for the whispers of forgotten dreams.\"\n  - Use introspective and reflective language to delve into the ghosts' thoughts and feelings, capturing their longing for closure and the fear of the unknown. Incorporate phrases that evoke the passage of time and the weight of unfinished business.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves themes of supernatural mystery, friendship, and uncovering hidden truths, which will guide the creation of specific and actionable rules. I will ensure the rules are comprehensive, providing detailed guidance on how to develop the narrative, characters, and setting, while maintaining a tone that balances suspense and emotional depth. Each rule will include examples to illustrate their application, inspired by the style and detail of the few-shot demonstrations.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Structure the narrative around Simon's journey from skepticism to belief, using his discovery of Maddie's ghost as a catalyst for the unfolding mystery. Begin with Simon's initial dismissal of Maddie's presence, followed by a pivotal moment where he encounters undeniable evidence of her reality, such as finding an object only Maddie could have known about.\n  - Develop a central mystery involving the school's haunted history and the tragedy that led to the presence of multiple ghosts. Use clues and revelations to build suspense, leading Simon to uncover the truth behind the tragedy. For example, have Simon find an old yearbook with photos of students who mysteriously disappeared, prompting further investigation.\n\n- **Creativity**:\n  - Incorporate elements of supernatural intrigue and suspense, using the ghosts' presence to create an atmosphere of mystery and tension. Introduce unique ghostly abilities or characteristics that differentiate Maddie from other spirits, such as her ability to communicate through specific objects or locations.\n  - Use imaginative storytelling techniques, such as flashbacks or dream sequences, to reveal the backstory of the tragedy and the ghosts' connection to the school. For instance, depict a scene where Simon experiences a vivid dream of the past, witnessing events leading up to the tragedy.\n\n- **Development (Character and Setting)**:\n  - Develop Simon as a relatable and determined protagonist, focusing on his emotional journey and evolving relationship with Maddie. Use internal monologue to explore his feelings of guilt, fear, and resolve as he delves deeper into the mystery.\n  - Create a rich setting by detailing the school's history and atmosphere, emphasizing its role in the narrative. Use descriptions of the school's architecture, hidden rooms, and eerie ambiance to enhance the story's mood. For example, describe a forgotten wing of the school where Simon feels an inexplicable chill, hinting at its connection to the ghosts.\n\n- **Language Use**:\n  - Employ a suspenseful and atmospheric tone, using vivid imagery and sensory details to convey the eerie and mysterious nature of the school and its ghosts. Use language that evokes a sense of unease and curiosity, such as describing the \"whispering shadows\" in the hallways.\n  - Use dialogue to reveal character dynamics and advance the plot, ensuring conversations between Simon and Maddie are emotionally charged and reveal key information. For example, have Maddie express frustration and urgency in her attempts to communicate with Simon, highlighting her desperation to reclaim her body.\n  - Maintain a balance between suspense and emotional depth, using language that captures both the tension of the mystery and the poignancy of Simon's friendship with Maddie. For instance, describe Simon's internal conflict as he grapples with the reality of Maddie's ghost and his determination to help her.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves themes of deception, fear of abandonment, and the supernatural, which should be reflected in the rules. The narrative should focus on the protagonist's internal conflict and the dynamics with other spirits. The rules will include examples that illustrate these themes and provide actionable guidance for storytelling.\n\n1. **Plot**: The plot should revolve around the protagonist's fear of being left behind and the unraveling of their deception. The narrative should build tension as the other spirits begin to uncover the truth.\n\n2. **Creativity**: The story should creatively explore the supernatural elements and the protagonist's manipulation of the other spirits. Imaginative elements should enhance the theme of being trapped and the fear of moving on.\n\n3. **Development (Character and Setting)**: Characters should be developed through their interactions and the protagonist's internal monologue. The high school setting should be vividly described to enhance the ghostly atmosphere and the protagonist's connection to it.\n\n4. **Language Use**: The language should convey a sense of haunting and introspection, using rich descriptions and internal monologue to explore the protagonist's emotions and fears.\n\nI will ensure the rules are specific, actionable, and include examples that align with the new writing prompt's themes and narrative potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Structure the narrative around the protagonist's internal conflict and the unraveling of their deception. Begin with the protagonist reflecting on their long-standing lie to the other spirits about how to move on. For example, \"You watch as the other spirits gather, whispering about the rumors of a way out, a way you’ve kept hidden for decades.\"\n  - Build tension as the other spirits start to question the protagonist's stories, leading to a climax where the truth is revealed. Use moments of confrontation and introspection to drive the plot forward, such as a scene where a spirit confronts the protagonist with evidence of their deceit.\n\n- **Creativity**:\n  - Explore the supernatural elements by detailing the protagonist's manipulation of the ghostly environment to maintain their lie. Use imaginative descriptions of how the protagonist alters the school's atmosphere to keep the spirits from discovering the truth.\n  - Incorporate elements of mystery and suspense, such as cryptic messages or hidden clues that the spirits begin to uncover, adding depth and intrigue to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a complex character, torn between their fear of being alone and the guilt of deceiving the other spirits. Use internal monologue to reveal their emotional turmoil and motivations.\n  - Describe the high school setting with vivid, ghostly details that reflect the protagonist's connection to the place. For example, \"The hallways echo with memories of laughter and footsteps, now replaced by the whispers of the forgotten.\"\n\n- **Language Use**:\n  - Employ a haunting and introspective tone, using rich, descriptive language to convey the protagonist's emotions and the eerie atmosphere of the high school. For instance, \"The air is thick with the weight of unspoken truths, each corner of the school holding a piece of the past you wish to forget.\"\n  - Use internal monologue and reflective statements to explore the protagonist's fear and guilt, creating a sense of tension and introspection. For example, \"Every lie you’ve told is a chain, binding you to this place, and you wonder if you’ll ever find the courage to let go.\"\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a young boy's quest to bring Christmas back to a perpetually wintry town, which suggests themes of hope, community, and transformation. The rules will need to guide the narrative towards exploring these themes while maintaining a whimsical and slightly mysterious tone. I will ensure the rules are actionable, specific, and include examples that align with the prompt's objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Structure the narrative around the young boy's mission to reintroduce Christmas to the town, using his journey as a catalyst for change. Begin with the boy's realization of the town's perpetual winter and his determination to bring back the holiday spirit. For example, describe how the boy notices the lack of festive decorations and decides to take action.\n  - Develop a series of challenges the boy faces, such as convincing skeptical townsfolk and overcoming mysterious obstacles that prevent the celebration of Christmas. Use these challenges to build tension and highlight the boy's perseverance.\n\n- **Creativity**:\n  - Infuse the story with imaginative elements that emphasize the town's unique setting, such as enchanted snowflakes that whisper forgotten carols or a mysterious figure who holds the key to the town's eternal winter. Use these elements to create a sense of wonder and mystery.\n  - Explore the theme of transformation by depicting how the boy's actions gradually change the town's atmosphere, bringing warmth and color to the otherwise bleak landscape. For instance, describe how the first Christmas tree he decorates begins to glow, attracting curious onlookers.\n\n- **Development (Character and Setting)**:\n  - Develop the young boy as a determined and hopeful character, using his interactions with the townsfolk to reveal his personality and motivations. Show his growth as he learns to inspire and unite the community.\n  - Create a vivid setting that captures the town's perpetual winter, using sensory details to convey the cold, quiet atmosphere. Contrast this with the warmth and vibrancy of the boy's Christmas preparations, highlighting the impact of his efforts.\n\n- **Language Use**:\n  - Employ a whimsical and slightly mysterious tone, using descriptive language to evoke the magical and melancholic aspects of the town. Use phrases like \"the snow whispered secrets of forgotten holidays\" to enhance the story's atmosphere.\n  - Use dialogue to reveal character dynamics and the townsfolk's initial resistance to change. Ensure the language reflects the boy's youthful optimism and the gradual shift in the community's attitude as they begin to embrace the holiday spirit.\n</story_rules>"
]