[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should focus on the protagonist's internal conflict and the pivotal decision he must make.\n   - The narrative should explore the tension between the protagonist's past and present, highlighting his struggle with identity and morality.\n   - The story should conclude with a significant decision that reflects the protagonist's growth, leaving room for ambiguity and future development.\n\n2. **Creativity**:\n   - The story should blend elements of psychological drama with the primary genre, using the prompt to explore deeper themes of identity and change.\n   - Incorporate subtle hints about the protagonist's past and his relationship with his old partner, adding layers to the narrative.\n   - Use a nuanced and introspective approach, avoiding straightforward or purely action-driven interpretations.\n\n3. **Development (Character and Setting)**:\n   - Provide a detailed exploration of the protagonist's character, focusing on his vulnerabilities, internal conflicts, and relationships.\n   - Develop secondary characters, particularly the old partner, in a way that highlights their influence on the protagonist's journey.\n   - Create an immersive setting by incorporating specific details about the art world and the protagonist's current life as an FBI consultant.\n\n4. **Language Use**:\n   - Employ descriptive and introspective language, focusing on internal monologue and emotional depth.\n   - Use a slower and more deliberate pacing to allow for a deeper exploration of themes and character dynamics.\n   - Balance dialogue with internal thoughts and reflections, ensuring that conversations reveal character insights and advance the narrative.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Focus on the protagonist's internal conflict when faced with the heist proposal, emphasizing his struggle with identity and morality.\n  - Highlight the tension between the protagonist's past as an art forger and his present role as an FBI consultant.\n  - Conclude the story with the protagonist making a significant decision that reflects his growth, leaving room for ambiguity and future development.\n\n- **Creativity**:\n  - Blend elements of psychological drama with the primary genre, using the prompt to explore deeper themes of identity and change.\n  - Incorporate subtle hints about the protagonist's past and his relationship with his old partner, adding layers to the narrative.\n  - Use a nuanced and introspective approach, avoiding straightforward or purely action-driven interpretations.\n\n- **Development (Character and Setting)**:\n  - Provide a detailed exploration of the protagonist's character, focusing on his vulnerabilities, internal conflicts, and relationships.\n  - Develop secondary characters, particularly the old partner, in a way that highlights their influence on the protagonist's journey.\n  - Create an immersive setting by incorporating specific details about the art world and the protagonist's current life as an FBI consultant.\n\n- **Language Use**:\n  - Employ descriptive and introspective language, focusing on internal monologue and emotional depth.\n  - Use a slower and more deliberate pacing to allow for a deeper exploration of themes and character dynamics.\n  - Balance dialogue with internal thoughts and reflections, ensuring that conversations reveal character insights and advance the narrative.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should start with an unexpected reunion between Crowley and Dean Winchester, setting the stage for their evolving relationship.\n   - Include key events such as late-night confessions, stolen kisses, and interactions with federal agents and family barbecues.\n   - Conclude with a resolution that shows the characters embracing their new, intertwined lives, highlighting the theme of rewriting plans for something worthwhile.\n\n2. **Creativity**:\n   - Incorporate elements of romance and suspense, balancing the emotional depth with the thrill of dealing with federal agents.\n   - Use humor and irony to highlight the unexpected nature of their relationship and the situations they find themselves in.\n   - Reinterpret the prompt by focusing on the characters' personal growth and the blending of their chaotic lives.\n\n3. **Development (Character and Setting)**:\n   - Develop Crowley and Dean as multidimensional characters, exploring their past, motivations, and the evolution of their relationship.\n   - Highlight the contrast between their supernatural backgrounds and the mundane aspects of family barbecues and federal agents.\n   - Create immersive settings that reflect the dual nature of their lives, from intimate late-night settings to high-stakes encounters with federal agents.\n\n4. **Language Use**:\n   - Use descriptive language to create vivid imagery and convey the emotional intensity of their interactions.\n   - Employ witty and engaging dialogue to develop characters and advance the plot.\n   - Maintain a balance between a romantic and suspenseful tone, ensuring the story remains engaging and dynamic.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with an unexpected reunion between Crowley and Dean Winchester, setting the stage for their evolving relationship.\n  - Include key events such as late-night confessions, stolen kisses, and interactions with federal agents and family barbecues.\n  - Develop the narrative to show the characters navigating the complexities of their intertwined lives, balancing romance and suspense.\n  - Conclude with a resolution that shows the characters embracing their new, intertwined lives, highlighting the theme of rewriting plans for something worthwhile.\n\n- **Creativity**:\n  - Incorporate elements of romance and suspense, balancing the emotional depth with the thrill of dealing with federal agents.\n  - Use humor and irony to highlight the unexpected nature of their relationship and the situations they find themselves in.\n  - Reinterpret the prompt by focusing on the characters' personal growth and the blending of their chaotic lives.\n\n- **Development (Character and Setting)**:\n  - Develop Crowley and Dean as multidimensional characters, exploring their past, motivations, and the evolution of their relationship.\n  - Highlight the contrast between their supernatural backgrounds and the mundane aspects of family barbecues and federal agents.\n  - Create immersive settings that reflect the dual nature of their lives, from intimate late-night settings to high-stakes encounters with federal agents.\n\n- **Language Use**:\n  - Use descriptive language to create vivid imagery and convey the emotional intensity of their interactions.\n  - Employ witty and engaging dialogue to develop characters and advance the plot.\n  - Maintain a balance between a romantic and suspenseful tone, ensuring the story remains engaging and dynamic.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should center around the con artist's unexpected defense of legal procedures, creating a humorous and ironic situation.\n   - Introduce the main conflict early, focusing on the case discussion and the con artist's surprising stance.\n   - Develop the narrative to show the evolving dynamic between the con artist and the handler, highlighting moments of tension and amusement.\n   - Conclude with a resolution that reinforces the characters' relationship and the con artist's unique role within the FBI.\n\n2. **Creativity**:\n   - Use humor and irony to enhance the narrative, especially through the interactions between the con artist and the handler.\n   - Incorporate clever and witty dialogue that reflects the con artist's background and the handler's by-the-book nature.\n   - Explore unconventional or imaginative elements that reveal deeper insights into the characters' personalities and motivations.\n   - Reinterpret the prompt by emphasizing the con artist's unexpected competence and the handler's reactions.\n\n3. **Development (Character and Setting)**:\n   - Develop multidimensional characters through their interactions and reflections, showing their complexities and growth.\n   - Focus on the evolving relationship between the con artist and the handler, highlighting their mutual respect and differences.\n   - Create an immersive setting that reflects the high-stakes environment of the FBI, using descriptive language to bring it to life.\n   - Use the setting to enhance the tension and humor of the narrative, making it an integral part of the story.\n\n4. **Language Use**:\n   - Employ witty and descriptive language to create vivid imagery and enhance the reader's immersion in the story.\n   - Use dialogue to reveal character development and the evolving relationship between the con artist and the handler.\n   - Maintain a consistent tone that reflects the humor and irony of the story, avoiding overly serious or detached language.\n   - Pace the story to allow for moments of humor and personal interaction, balancing action with character development.\n\n<story_rules>\n- **Plot**:\n  - Center the narrative around the con artist's unexpected defense of legal procedures, creating a humorous and ironic situation.\n  - Introduce the main conflict early, focusing on the case discussion and the con artist's surprising stance.\n  - Develop the narrative to show the evolving dynamic between the con artist and the handler, highlighting moments of tension and amusement.\n  - Conclude with a resolution that reinforces the characters' relationship and the con artist's unique role within the FBI.\n\n- **Creativity**:\n  - Use humor and irony to enhance the narrative, especially through the interactions between the con artist and the handler.\n  - Incorporate clever and witty dialogue that reflects the con artist's background and the handler's by-the-book nature.\n  - Explore unconventional or imaginative elements that reveal deeper insights into the characters' personalities and motivations.\n  - Reinterpret the prompt by emphasizing the con artist's unexpected competence and the handler's reactions.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters through their interactions and reflections, showing their complexities and growth.\n  - Focus on the evolving relationship between the con artist and the handler, highlighting their mutual respect and differences.\n  - Create an immersive setting that reflects the high-stakes environment of the FBI, using descriptive language to bring it to life.\n  - Use the setting to enhance the tension and humor of the narrative, making it an integral part of the story.\n\n- **Language Use**:\n  - Employ witty and descriptive language to create vivid imagery and enhance the reader's immersion in the story.\n  - Use dialogue to reveal character development and the evolving relationship between the con artist and the handler.\n  - Maintain a consistent tone that reflects the humor and irony of the story, avoiding overly serious or detached language.\n  - Pace the story to allow for moments of humor and personal interaction, balancing action with character development.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed, actionable rules under the categories of Plot, Creativity, Development (Character and Setting), and Language Use. Each category contained specific instructions that guided the narrative, character development, and language style. The rules were tailored to the themes and tone of the writing prompts, ensuring comprehensive and granular guidance.\n\nFor the new writing prompt about a starship stranded in space, the rules should focus on building suspense, developing the chief engineer's character, and creating a tense, immersive atmosphere. The narrative should explore the mystery of the ship's failure and the urgency of the situation, while also delving into the engineer's problem-solving process and interactions with the crew.\n\n<story_rules>\n- **Plot**:\n  - Start the story with the immediate crisis of the starship being stranded, establishing the urgency and stakes from the outset.\n  - Introduce the chief engineer early, highlighting their initial theories and the steps they take to diagnose the problem.\n  - Include a series of escalating challenges and setbacks that complicate the engineer's efforts, maintaining tension and suspense.\n  - Reveal clues and red herrings that lead the engineer closer to the truth, creating a sense of mystery and intrigue.\n  - Conclude with a resolution that uncovers the true cause of the failure, emphasizing the engineer's ingenuity and determination.\n\n- **Creativity**:\n  - Incorporate imaginative and technical details about the starship and its systems, enhancing the sci-fi setting.\n  - Use the engineer's problem-solving process to showcase creative and unconventional solutions to the challenges they face.\n  - Blend elements of mystery and thriller genres, creating a narrative that is both intellectually engaging and emotionally gripping.\n  - Reinterpret the prompt by exploring the psychological and emotional impact of the crisis on the crew and the engineer.\n\n- **Development (Character and Setting)**:\n  - Develop the chief engineer as a multidimensional character with a strong sense of duty, technical expertise, and personal stakes in the mission.\n  - Show the engineer's interactions with other crew members, highlighting their leadership skills and the crew's reliance on their expertise.\n  - Create a detailed and immersive setting aboard the starship, using descriptive language to convey the claustrophobic and high-stakes environment.\n  - Use the setting to enhance the tension and urgency of the narrative, making the starship's malfunction a central element of the story.\n\n- **Language Use**:\n  - Employ technical and descriptive language to create a realistic and immersive sci-fi atmosphere.\n  - Use dialogue to reveal character traits, advance the plot, and build tension between the crew members.\n  - Maintain a fast-paced and suspenseful tone, keeping the reader engaged and invested in the outcome.\n  - Balance technical explanations with emotional and psychological insights, creating a well-rounded and compelling narrative.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should be centered around a specific conflict or challenge that drives the narrative forward.\n   - Introduce the main conflict early in the story and use it as a backdrop to explore character dynamics and personal growth.\n   - Conclude the story with a resolution that addresses the main conflict and reinforces character development.\n\n2. **Creativity**:\n   - Blend elements of personal growth and professional duty, showing how characters evolve through their experiences.\n   - Use humor and irony sparingly, focusing more on the emotional and moral aspects of the story.\n   - Incorporate unconventional or imaginative elements that reveal deeper insights into the characters' personalities and motivations.\n\n3. **Development (Character and Setting)**:\n   - Develop characters through their interactions and reflections on their past and present relationships, showing how they have grown and changed over time.\n   - Use the setting to emphasize the characters' dedication and personal sacrifices, creating an immersive and emotionally charged atmosphere.\n   - Create multidimensional characters with complex emotional arcs, revealing their vulnerabilities and strengths through their actions and dialogue.\n\n4. **Language Use**:\n   - Employ introspective and descriptive language to convey the characters' thoughts and emotions, creating a deep and engaging narrative.\n   - Use dialogue to reveal character development and the evolving relationships, making it natural and reflective of their personalities.\n   - Maintain a consistent tone that reflects the emotional and moral weight of the story, avoiding overly procedural or detached language.\n   - Pace the story to allow for moments of reflection and personal interaction, balancing action with introspection to create a well-rounded narrative.\n\nUsing these inferred patterns, craft the **Story Rules** for the new writing prompt.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Center the narrative around Neal's efforts to clear his name and protect Peter, emphasizing the tension and stakes involved.\n  - Introduce the audit and the suspicion of forgery early in the story, using it as the main conflict that drives the plot.\n  - Develop a plan that Neal hatches to prove his innocence, highlighting the cleverness and potential recklessness of his actions.\n  - Conclude the story with a resolution that addresses the forgery accusation and reinforces the bond between Neal and Peter.\n\n- **Creativity**:\n  - Blend elements of suspense and personal loyalty, showing how Neal's actions are driven by his commitment to Peter and his own sense of justice.\n  - Use humor and irony to lighten the tension, but ensure it complements the overall serious tone of the story.\n  - Incorporate imaginative and unconventional elements in Neal's plan, revealing his resourcefulness and ingenuity.\n  - Emphasize the blurred line between cleverness and recklessness in Neal's actions, creating a sense of unpredictability and excitement.\n\n- **Development (Character and Setting)**:\n  - Develop Neal's character through his internal struggles and determination to clear his name, showing his growth and resilience.\n  - Highlight Peter's role as a supportive and trusting partner, emphasizing their strong bond and mutual respect.\n  - Use the setting of the audit and the investigation to create a tense and high-stakes atmosphere, reflecting the pressure on Neal and Peter.\n  - Create multidimensional characters with complex emotional arcs, revealing their vulnerabilities and strengths through their actions and dialogue.\n\n- **Language Use**:\n  - Employ introspective and descriptive language to convey Neal's thoughts and emotions, creating a deep and engaging narrative.\n  - Use dialogue to reveal character development and the evolving relationship between Neal and Peter, making it natural and reflective of their personalities.\n  - Maintain a consistent tone that reflects the tension and emotional weight of the story, avoiding overly procedural or detached language.\n  - Pace the story to allow for moments of reflection and personal interaction, balancing action with introspection to create a well-rounded narrative.\n</story_rules>"
]