[
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, structure, and narrative style. The demonstrations emphasize intimate character interactions, humor, and emotional depth, often blending mundane scenarios with unique twists. The rules should guide the LLM to create a narrative that captures the warmth and humor of a couple's morning routine, culminating in a significant change suggested by Nico. The examples should illustrate how to balance humor with emotional resonance, using vivid descriptions and engaging dialogue to bring the characters and setting to life. The rules must be actionable, specific, and tailored to the prompt's themes of love, routine, and change. \n\nI will ensure the rules cover all narrative aspects, including plot development, creativity, character and setting development, and language use, providing comprehensive guidance for crafting a story that aligns with the prompt's objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a vivid depiction of the couple's morning routine, emphasizing the warmth and humor of their interactions. Use specific actions, such as Will playfully trying to wake Nico with kisses, to set the scene.\n  - Introduce a turning point where Nico suggests a change to their routine. Ensure this suggestion is unexpected yet plausible, adding intrigue and depth to the narrative. For example, Nico might propose they start their mornings with a new hobby or adventure.\n  - Conclude the story with a reflection on how this change impacts their relationship, highlighting growth and deeper connection. Use a moment of shared laughter or a tender exchange to emphasize the enduring love between the characters.\n\n- **Creativity**:\n  - Infuse the narrative with humor and affection, using playful banter and light-hearted scenarios to capture the couple's dynamic. For instance, describe a mock battle over the covers or a playful argument about who makes the best breakfast.\n  - Incorporate imaginative elements that reflect the characters' personalities and relationship. Use Nico's suggestion as a catalyst for exploring new aspects of their lives together, such as trying a new activity or embracing a shared goal.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their interactions and emotional responses, focusing on their unique traits and the depth of their relationship. Highlight Will's optimism and Nico's wit through dialogue and actions.\n  - Create a cozy and intimate setting that enhances the narrative's emotional tone. Use sensory details, such as the warmth of the morning sun or the comfort of their shared bed, to immerse the reader in the scene.\n\n- **Language Use**:\n  - Employ a warm and engaging tone, using descriptive language to convey the characters' emotions and the atmosphere of their mornings. Use phrases like \"sunlight filtering through the curtains\" to create a vivid and inviting setting.\n  - Use dialogue to reveal character dynamics and drive the narrative. Incorporate playful and affectionate exchanges, such as Nico teasing Will about his morning hair or Will joking about Nico's reluctance to leave the bed.\n  - Maintain a balance between narrative and dialogue, ensuring the story flows naturally and keeps the reader engaged. Use internal monologue to provide insight into the characters' thoughts and feelings, enhancing the emotional depth of the story.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, narrative structure, and character dynamics. The new prompt involves themes of trust, intimacy, and unexpected discovery, which should be reflected in the rules. The rules will need to guide the narrative towards a heartfelt and introspective exploration of the relationship, using the discovery of candid photos as a central plot device. I will ensure the rules are comprehensive, actionable, and include detailed examples that align with the prompt's themes and objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a scene that establishes the trust and openness in the relationship, such as a casual conversation where your partner mentions their phone. Use this to set the tone of comfort and security.\n  - Develop the plot around the discovery of the candid photos, focusing on the protagonist's emotional journey as they view each image. Use the photos to reveal unexpected layers of the relationship, such as moments of joy or vulnerability that were unnoticed at the time.\n  - Conclude the story with a reflective moment where the protagonist gains a deeper appreciation for their partner's perspective and the relationship's depth. Use a final image or memory to encapsulate this newfound understanding.\n\n- **Creativity**:\n  - Use the candid photos as a creative device to explore the theme of unnoticed beauty in everyday life. Describe each photo with vivid detail, highlighting the emotions and context of the captured moments.\n  - Incorporate elements of surprise and introspection, allowing the protagonist to see themselves through their partner's eyes. Use this perspective shift to add depth and emotional resonance to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through their reactions to the photos, using internal monologue to convey their thoughts and emotions. Highlight their growth and self-awareness as they reflect on the images.\n  - Portray the partner as attentive and loving, using the photos as evidence of their care and appreciation. Use subtle actions and dialogue to reinforce their supportive role in the relationship.\n  - Set the story in a familiar and intimate environment, such as the protagonist's home, to enhance the personal and introspective nature of the narrative. Use sensory details to create a cozy and reflective atmosphere.\n\n- **Language Use**:\n  - Employ a warm and introspective tone, using descriptive language to evoke the emotions and significance of each photo. Focus on sensory details to immerse the reader in the protagonist's experience.\n  - Use a mix of dialogue and internal monologue to convey the protagonist's emotional journey. Allow the narrative to flow naturally between the protagonist's thoughts and interactions with their partner.\n  - Incorporate metaphors and similes to enhance the emotional depth of the narrative. For example, describe a photo as \"a snapshot of laughter frozen in time, like sunlight caught in a jar,\" to convey the beauty and spontaneity of the moment.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize humor, character dynamics, and a blend of the mundane with the extraordinary. They also focus on creating vivid settings and using language that reflects the characters' personalities and the story's tone. I will ensure the rules for the new prompt incorporate these elements, providing detailed and actionable guidance with examples that align with the mischievous and humorous nature of the prompt.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a playful and engaging setup where the makeup artist introduces the idea of the video. Use dialogue to establish the partner's reluctance and the artist's persuasive charm. For example, have the artist say, \"Come on, it'll be fun! Just one little video.\"\n  - Develop the plot through a series of humorous and unexpected events during the transformation process. Highlight the partner's reactions and the artist's mischievous delight. For instance, describe the partner's surprise as they see their reflection, \"I look like a disco ball!\"\n  - Conclude the story with a light-hearted resolution that emphasizes the fun and unexpected nature of the experience. Use a moment of shared laughter or a playful exchange to wrap up the narrative, such as the partner admitting, \"Okay, maybe this wasn't such a bad idea after all.\"\n\n- **Creativity**:\n  - Infuse the narrative with humor and creativity by incorporating exaggerated makeup transformations and playful scenarios. Use imaginative descriptions to enhance the comedic effect, such as \"a rainbow explosion of colors across their face.\"\n  - Incorporate elements of surprise and whimsy, ensuring the transformation is both unexpected and entertaining. Use creative dialogue and scenarios to highlight the artist's mischievous nature and the partner's evolving reactions.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their interactions and dialogue, focusing on their personalities and relationship dynamics. Portray the makeup artist as playful and persuasive, and the partner as initially reluctant but good-natured.\n  - Set the story in a vibrant and lively environment, such as a home studio filled with makeup supplies and props. Use the setting to enhance the narrative's tone and support the characters' interactions, describing details like \"a cluttered vanity overflowing with brushes and palettes.\"\n\n- **Language Use**:\n  - Use a lively and humorous tone, with witty dialogue and playful descriptions. Capture the characters' personalities and the lighthearted atmosphere through informal and conversational language.\n  - Employ vivid and imaginative language to describe the transformation process and the final result. Use phrases like \"a masterpiece of glitter and glam\" to convey the visual impact and humor of the transformation.\n  - Maintain a balance between dialogue and narrative to keep the pace engaging and dynamic. Use dialogue to drive the story forward and reveal character dynamics, while using narrative to provide context and humor.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a fantastical and mysterious encounter in the Labyrinth, which requires a blend of adventure, intrigue, and character dynamics. The rules must guide the narrative to explore themes of time travel, destiny, and personal connection, while maintaining a tone that balances mystery with emotional depth. I will ensure the rules are specific, actionable, and include examples that align with the prompt's unique elements.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with an immediate sense of mystery and tension as Nico navigates the Labyrinth. Use vivid descriptions to establish the disorienting and enigmatic nature of the setting, such as \"the walls seemed to shift and breathe, casting shadows that danced like phantoms.\"\n  - Introduce the strange, freckled boy with an unexpected and intriguing encounter. Use dialogue to reveal his claim of being from the future and Nico's future boyfriend, creating a sense of disbelief and curiosity. For example, have the boy say, \"I know this sounds crazy, but I'm from the future—and I'm your boyfriend.\"\n  - Develop the plot through a series of interactions that blend humor and tension, as Nico grapples with the boy's claims and the implications of their meeting. Use the Labyrinth's shifting paths to symbolize the uncertainty of their potential future together.\n  - Conclude the story with a moment of introspection for Nico, leaving the encounter open-ended but filled with possibilities. Use a reflective line like, \"Maybe the future wasn't as set in stone as he thought.\"\n\n- **Creativity**:\n  - Incorporate elements of time travel and destiny, using the boy's presence to explore themes of fate and choice. Create a unique twist by having the boy possess knowledge of Nico's future that challenges his current beliefs.\n  - Use imaginative descriptions and scenarios to enhance the fantastical elements of the Labyrinth. For example, describe a room filled with floating orbs that show glimpses of possible futures, adding to the story's intrigue.\n  - Blend humor with mystery by having the boy's future knowledge include quirky or unexpected details about Nico's life, such as his favorite snack or a future embarrassing moment.\n\n- **Development (Character and Setting)**:\n  - Develop Nico as a complex character, using his internal thoughts and reactions to the boy's claims to reveal his skepticism and curiosity. Highlight his growth as he considers the possibility of a different future.\n  - Portray the freckled boy as enigmatic yet endearing, using his knowledge of the future to create a sense of familiarity and connection with Nico. Use dialogue and actions to reveal his personality and intentions.\n  - Create a vivid and immersive setting by describing the Labyrinth's ever-changing environment. Use sensory details to convey its mysterious and unpredictable nature, such as \"the air was thick with the scent of ancient stone and magic.\"\n\n- **Language Use**:\n  - Employ a tone that balances mystery with emotional depth, using descriptive language to create an immersive and atmospheric narrative. Use phrases like \"the Labyrinth whispered secrets only the brave dared to uncover.\"\n  - Use dialogue to drive the story forward and reveal character dynamics. Ensure the boy's speech reflects his future knowledge and familiarity with Nico, while Nico's responses convey his skepticism and intrigue.\n  - Incorporate rhetorical questions and introspective language to highlight Nico's internal conflict and curiosity about the future. Use lines like, \"Could he really trust a stranger with such wild claims?\"\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as tone, narrative structure, and character dynamics. The prompt involves themes of healing, intimacy, and the contrast between past trauma and present comfort. The rules must guide the narrative to focus on the emotional journey of the characters, using their shared experiences to build a poignant and intimate scene. The examples should illustrate how to convey deep emotional resonance through subtle actions and interactions, maintaining a balance between the characters' internal struggles and their external expressions of love and support.\n\nThe rules will be organized into the specified categories: **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category will include detailed, actionable instructions with examples that align with the prompt's themes and objectives. The rules will emphasize the use of sensory details, emotional depth, and the creation of a comforting atmosphere to reflect the characters' journey from fear to solace.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a quiet, introspective moment that sets the tone for the characters' emotional state. Use a scene where Nico and Will are unable to sleep, perhaps due to lingering fears from their past experiences in Tartarus. For example, describe Nico staring at the ceiling, lost in thought, while Will quietly joins him in the kitchen.\n  - Develop the plot through a series of small, intimate actions that gradually build a sense of comfort and connection. Focus on the transition from tension to relaxation as they begin to dance. Illustrate this with a moment where Will gently takes Nico's hand, leading him into a slow dance as soft music plays in the background.\n  - Conclude the story with a sense of peace and emotional release, emphasizing the healing power of their shared rituals. Use a closing scene where they hold each other close, the rhythm of their dance symbolizing the harmony they've found together.\n\n- **Creativity**:\n  - Use the setting of the kitchen to symbolize warmth and safety, contrasting with the darkness of their past. Incorporate sensory details like the soft glow of the kitchen light and the gentle hum of the refrigerator to create a cozy atmosphere.\n  - Integrate music as a central motif, using it to evoke emotions and memories. Choose a song that holds personal significance for the characters, perhaps one that they listened to during their recovery. Describe how the melody wraps around them, providing comfort and grounding them in the present.\n  - Infuse the narrative with subtle references to their past experiences, using metaphors and imagery to convey the depth of their journey. For example, describe their dance as a \"silent conversation\" where each step speaks of resilience and love.\n\n- **Development (Character and Setting)**:\n  - Develop Nico and Will as complex characters with a deep emotional bond. Use their interactions to reveal their personalities and the strength of their relationship. For instance, show Nico's initial hesitation to dance, countered by Will's gentle encouragement and unwavering support.\n  - Create a vivid setting that enhances the emotional tone of the story. Use the kitchen as a backdrop for their dance, emphasizing its role as a sanctuary from their past fears. Describe the way the moonlight filters through the window, casting a serene glow over the scene.\n  - Highlight the characters' emotional arcs, focusing on their journey from fear to comfort. Use their body language and expressions to convey their internal struggles and the solace they find in each other's presence.\n\n- **Language Use**:\n  - Employ a lyrical and evocative tone, using descriptive language to create an immersive and emotionally resonant narrative. Focus on sensory details and emotional nuances to draw the reader into the characters' world.\n  - Use dialogue sparingly, allowing the characters' actions and the atmosphere to convey their emotions. When dialogue is used, ensure it is intimate and meaningful, reflecting the depth of their connection. For example, a whispered \"I'm here\" from Will can convey reassurance and love.\n  - Incorporate poetic devices such as metaphors and similes to enhance the emotional impact of the story. Use phrases like \"the music wove a tapestry of comfort around them\" to evoke vivid imagery and deepen the reader's emotional engagement.\n</story_rules>"
]