[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided follow a clear structure, categorizing the rules into **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contains detailed, actionable instructions that guide the narrative process. The rules are tailored to the specific themes and tones of the prompts, ensuring they are comprehensive and directly applicable.\n\nFor the new writing prompt, the rules should focus on the intimate and affectionate morning routine of the characters, the introduction of a significant change, and the emotional and relational impact of this change. The tone should be warm, playful, and heartfelt, reflecting the deep connection between the characters.\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a vivid and affectionate description of the characters' morning routine, emphasizing their love and playful interactions.\n  - Introduce a moment of change when Nico suggests something unexpected, creating a sense of anticipation and curiosity.\n  - Develop the narrative by exploring the characters' reactions to the suggestion, highlighting their emotional responses and the impact on their routine.\n  - Conclude with a resolution that reflects the characters' growth and the evolution of their relationship, leaving a lasting emotional impression.\n\n- **Creativity**:\n  - Use imaginative and heartfelt scenarios to depict the characters' morning routine, incorporating elements of humor and tenderness.\n  - Introduce a unique and meaningful suggestion from Nico that adds depth and intrigue to the story.\n  - Emphasize the playful and affectionate dynamics between the characters, using creative and engaging interactions.\n\n- **Development (Character and Setting)**:\n  - Develop the characters through their interactions and dialogue, showcasing their personalities and the depth of their relationship.\n  - Create a cozy and intimate setting that reflects the warmth and comfort of their shared mornings.\n  - Show the characters' emotional arcs through their responses to the change in their routine, highlighting their growth and connection.\n\n- **Language Use**:\n  - Employ a warm and affectionate tone, focusing on the characters' loving and playful interactions.\n  - Use descriptive and evocative language to create vivid imagery of the morning routine and the characters' expressions.\n  - Balance humor and tenderness in the dialogue, capturing the essence of the characters' relationship.\n  - Ensure the narrative flows smoothly, with a mix of descriptive passages and dynamic dialogue that keeps the reader engaged.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The examples start with a clear, engaging setup that introduces the main characters and their immediate situation.\n   - They progress through a series of events that build on the initial setup, often leading to a surprising or emotional climax.\n   - The conclusion ties back to the initial setup, providing resolution and emotional closure.\n\n2. **Creativity**:\n   - The examples incorporate unique and vivid descriptions that enhance the narrative.\n   - They blend humor, irony, and heartfelt moments to create a dynamic and engaging story.\n   - The narrative often includes imaginative elements that add depth and interest.\n\n3. **Development (Character and Setting)**:\n   - Characters are developed through their interactions, dialogue, and emotional responses.\n   - The setting is described in detail, creating an immersive and relatable environment.\n   - The characters' relationships and personal growth are central to the narrative.\n\n4. **Language Use**:\n   - The examples use descriptive and engaging language to create a vivid narrative.\n   - Dialogue is natural and reflects the characters' personalities and emotions.\n   - The tone is balanced, mixing humor, affection, and emotional depth.\n\nUsing these patterns, craft the **Story Rules** for the new writing prompt, ensuring they are detailed, actionable, and tailored to the prompt's themes and narrative potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a casual and intimate moment between the protagonist and their partner, setting a relaxed and trusting atmosphere.\n  - Introduce the partner's insistence on the protagonist looking through their phone, leading to the discovery of the candid photos.\n  - Develop the narrative by exploring the protagonist's reactions to each photo, revealing the significance of the captured moments.\n  - Conclude with a heartfelt conversation between the protagonist and their partner, emphasizing the love and appreciation in their relationship.\n\n- **Creativity**:\n  - Use vivid and unique descriptions to convey the beauty and emotional impact of the candid photos.\n  - Incorporate humor and irony in the protagonist's initial reluctance or surprise at the discovery.\n  - Create original and touching backstories for each photo, highlighting the unnoticed special moments.\n  - Blend everyday life with emotional depth, creating a narrative that feels both relatable and profound.\n\n- **Development (Character and Setting)**:\n  - Develop the characters through their interactions and emotional responses, emphasizing their relationship and personal growth.\n  - Establish a cozy and intimate setting, such as the characters' home, to enhance the emotional atmosphere of the story.\n  - Use the candid photos as a tool to reveal the characters' personalities, memories, and the depth of their relationship.\n  - Show the protagonist's emotional journey from curiosity to appreciation, highlighting their evolving perspective on the captured moments.\n\n- **Language Use**:\n  - Employ descriptive language to create a vivid and immersive narrative, painting a clear picture of the setting and characters.\n  - Write natural and engaging dialogue that reflects the characters' personalities and emotions, incorporating humor where appropriate.\n  - Craft emotionally resonant descriptions of the candid photos, enhancing the story's themes and emotional impact.\n  - Maintain a balance between descriptive passages and dialogue to ensure a smooth and engaging narrative flow.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided follow a clear structure with categories: **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contains detailed, actionable rules that guide the narrative process. The rules are specific, avoiding comparative or relative terms, and provide comprehensive guidance on various narrative aspects such as pacing, humor, character dynamics, and emotional depth.\n\nFor the new writing prompt, the rules should focus on the humorous and unexpected elements of the transformation, the dynamics between the mischievous makeup artist and their reluctant partner, and the reactions and interactions that follow the reveal. The setting should be intimate and relatable, such as a home or studio, and the language should be engaging and humorous to reflect the tone of the prompt.\n\n<story_rules>\n- **Plot**:\n  - Start the story with the makeup artist convincing their partner to participate in the video, highlighting the partner's reluctance and the artist's persuasive tactics.\n  - Develop the narrative around the preparation and anticipation of the transformation, building up to the reveal.\n  - Focus on the moment of the reveal, capturing the partner's reaction and the ensuing hilarity.\n  - Conclude with a resolution that emphasizes the playful and loving dynamic between the characters, possibly hinting at future mischievous endeavors.\n\n- **Creativity**:\n  - Use humor and irony to enhance the narrative, especially in the dialogue and descriptions of the transformation.\n  - Incorporate unique and unexpected elements in the transformation to surprise both the partner and the audience.\n  - Create a playful and light-hearted atmosphere, using the characters' interactions and reactions to drive the humor.\n  - Blend realistic and exaggerated elements to create a memorable and entertaining transformation.\n\n- **Development (Character and Setting)**:\n  - Develop the characters through their interactions and reactions, highlighting the makeup artist's mischievous nature and the partner's initial reluctance and eventual amusement.\n  - Establish a cozy and relatable setting, such as a home or studio, to enhance the intimacy and humor of the story.\n  - Use secondary characters or off-screen reactions to add depth and additional humor to the narrative.\n  - Explore the characters' relationship dynamics, showing their playful and loving bond.\n\n- **Language Use**:\n  - Employ a humorous and engaging tone, focusing on witty dialogue and amusing descriptions.\n  - Use descriptive language to vividly portray the transformation and the characters' reactions.\n  - Maintain a balance between dialogue and narrative to keep the story dynamic and entertaining.\n  - Incorporate playful and light-hearted language to reflect the tone of the story and enhance the humor.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should start with Nico navigating the Labyrinth, establishing the setting and his current mission or goal.\n   - Introduce the strange, freckled boy in a surprising and mysterious manner, creating immediate intrigue.\n   - Develop the interaction between Nico and the boy, focusing on the boy's claims and Nico's skepticism.\n   - Include moments of tension and uncertainty as Nico tries to determine the truth about the boy.\n   - Conclude with a revelation or a hint about the boy's true identity and the implications for Nico's future.\n\n2. **Creativity**:\n   - Use imaginative descriptions of the Labyrinth to create a sense of wonder and danger.\n   - Incorporate elements of time travel and future knowledge in the boy's dialogue and actions.\n   - Emphasize the contrast between Nico's present and the boy's future, creating a sense of mystery and anticipation.\n   - Include subtle hints and foreshadowing about the boy's identity and his connection to Nico.\n\n3. **Development (Character and Setting)**:\n   - Develop Nico's character through his reactions to the strange boy and the challenges of the Labyrinth.\n   - Create a vivid and immersive setting by describing the Labyrinth's twists, turns, and dangers in detail.\n   - Show the boy's personality and future knowledge through his interactions with Nico and his familiarity with the Labyrinth.\n   - Highlight the dynamic between Nico and the boy, focusing on their growing connection and the boy's attempts to prove his claims.\n\n4. **Language Use**:\n   - Employ descriptive and atmospheric language to convey the eerie and mysterious nature of the Labyrinth.\n   - Use dialogue to reveal character traits and advance the plot, with the boy's speech hinting at future events.\n   - Maintain a tone of suspense and curiosity, balancing moments of tension with hints of future romance.\n   - Ensure the narrative flows smoothly, with a mix of descriptive passages and dynamic dialogue to keep the reader engaged.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Start with Nico navigating the Labyrinth, establishing the setting and his current mission or goal.\n  - Introduce the strange, freckled boy in a surprising and mysterious manner, creating immediate intrigue.\n  - Develop the interaction between Nico and the boy, focusing on the boy's claims and Nico's skepticism.\n  - Include moments of tension and uncertainty as Nico tries to determine the truth about the boy.\n  - Conclude with a revelation or a hint about the boy's true identity and the implications for Nico's future.\n\n- **Creativity**:\n  - Use imaginative descriptions of the Labyrinth to create a sense of wonder and danger.\n  - Incorporate elements of time travel and future knowledge in the boy's dialogue and actions.\n  - Emphasize the contrast between Nico's present and the boy's future, creating a sense of mystery and anticipation.\n  - Include subtle hints and foreshadowing about the boy's identity and his connection to Nico.\n\n- **Development (Character and Setting)**:\n  - Develop Nico's character through his reactions to the strange boy and the challenges of the Labyrinth.\n  - Create a vivid and immersive setting by describing the Labyrinth's twists, turns, and dangers in detail.\n  - Show the boy's personality and future knowledge through his interactions with Nico and his familiarity with the Labyrinth.\n  - Highlight the dynamic between Nico and the boy, focusing on their growing connection and the boy's attempts to prove his claims.\n\n- **Language Use**:\n  - Employ descriptive and atmospheric language to convey the eerie and mysterious nature of the Labyrinth.\n  - Use dialogue to reveal character traits and advance the plot, with the boy's speech hinting at future events.\n  - Maintain a tone of suspense and curiosity, balancing moments of tension with hints of future romance.\n  - Ensure the narrative flows smoothly, with a mix of descriptive passages and dynamic dialogue to keep the reader engaged.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should be structured around a central emotional conflict or theme, with a clear beginning, middle, and end.\n   - The narrative should start with a vivid description of the setting and the characters' current state.\n   - The story should progress through specific actions and interactions that reveal the characters' emotions and relationships.\n   - The conclusion should provide a sense of resolution or emotional closure, emphasizing the characters' growth or acceptance.\n\n2. **Creativity**:\n   - The narrative should incorporate unique and imaginative elements that enhance the emotional impact.\n   - Specific actions or rituals should be detailed to create a sense of intimacy and depth.\n   - The story should balance realism with a touch of whimsy or poetic elements to enrich the narrative.\n\n3. **Development (Character and Setting)**:\n   - Characters should be developed through their actions, dialogue, and internal monologues.\n   - The setting should be described in a way that reflects the characters' emotional states and enhances the mood of the story.\n   - The narrative should focus on the characters' emotional journeys and their interactions with each other.\n\n4. **Language Use**:\n   - The language should be descriptive and evocative, creating a vivid and immersive atmosphere.\n   - Dialogue should be natural and reflective of the characters' personalities and emotions.\n   - The tone should be introspective and emotional, with a focus on the characters' internal experiences and relationships.\n\nUsing these inferred patterns, craft the **Story Rules** for the new writing prompt.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a vivid description of the quiet, late-night kitchen setting, establishing the mood and the characters' current state.\n  - Introduce the characters' shared history and the lingering fears from their time in Tartarus, setting up the emotional conflict.\n  - Progress the narrative through the characters' quiet rituals and interactions, focusing on their efforts to soothe each other.\n  - Include a pivotal moment where the characters find themselves dancing in the kitchen, using this as a metaphor for their healing process.\n  - Conclude the story with a sense of emotional resolution, emphasizing the comfort and connection they find in each other.\n\n- **Creativity**:\n  - Incorporate unique and intimate rituals that the characters have developed to cope with their fears, adding depth to their relationship.\n  - Use the act of dancing as a symbolic and poetic element to represent their healing and connection.\n  - Balance realistic depictions of their struggles with moments of whimsy and tenderness to enrich the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the characters through their actions, dialogue, and internal monologues, highlighting their emotional journeys and growth.\n  - Describe the kitchen setting in detail, using sensory language to create a vivid and immersive atmosphere that reflects the characters' emotional states.\n  - Focus on the characters' interactions and the quiet, intimate moments that reveal their deep bond and mutual support.\n\n- **Language Use**:\n  - Use descriptive and evocative language to create a vivid and immersive atmosphere, focusing on sensory details.\n  - Employ natural and reflective dialogue that captures the characters' personalities and emotions.\n  - Maintain an introspective and emotional tone, emphasizing the characters' internal experiences and the healing power of their connection.\n  - Use poetic and symbolic language to enhance the emotional impact of the narrative, particularly during the dancing scene.\n</story_rules>"
]