[
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with a strong, engaging scenario, using humor and irony, developing characters through dialogue and actions, and employing a tone that matches the narrative's whimsical or mysterious nature. \n\nFor the new prompt, which involves a haunted school setting with chaotic students and a curious supply teacher, the rules will need to focus on creating a humorous and slightly eerie atmosphere. The plot should revolve around the interactions between the staff, students, and the ghost, with a focus on the supply teacher's experiences. Creativity will be key in blending the supernatural with the everyday school environment. Character development will focus on the supply teacher's reactions and the ghost's influence on the school. Language use should be witty and engaging, capturing the chaos and humor of the situation.\n\nI will ensure each rule is actionable, specific, and includes examples that align with the new writing prompt, drawing inspiration from the style and structure of the few-shot demonstrations.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the supply teacher's arrival at Elsinore Junior Academy, setting the stage for the chaos and mystery. Use an opening line like, \"As the new supply teacher stepped into the staff room, a chill ran down their spine, and they wondered if the camel rumors were true.\"\n  - Structure the narrative around the supply teacher's attempts to navigate the chaotic environment, with the ghost's presence adding an element of mystery. Include scenes where the teacher encounters strange occurrences, such as books flying off shelves or mysterious messages on the chalkboard.\n  - Conclude with a humorous twist that ties together the ghostly happenings and the camel rumors, leaving the reader with a sense of amusement and curiosity. For example, reveal that the ghost was trying to warn about a real camel escape from a nearby zoo.\n\n- **Creativity**:\n  - Blend the supernatural with the mundane school setting to create a whimsical and slightly eerie atmosphere. Use the ghost's antics to highlight the absurdity of the situation, such as rearranging the staff room furniture or causing the intercom to play classical music unexpectedly.\n  - Incorporate humorous elements that play on school stereotypes and ghostly clichés, such as the ghost being a stickler for proper grammar or the students using the ghost as an excuse for unfinished homework.\n\n- **Development (Character and Setting)**:\n  - Develop the supply teacher as a curious and slightly overwhelmed character, using their internal monologue and reactions to convey their personality. Show their growing determination to uncover the truth behind the ghost and the camel rumors.\n  - Characterize the ghost as a former headmaster with unfinished business, using their interactions with the staff and students to reveal their personality and motivations. For example, have the ghost leave cryptic notes in the staff room that reflect their old-fashioned values.\n  - Use the school setting to enhance the story's atmosphere, focusing on specific locations like the eerie staff room, the chaotic playground, and the mysterious library. Describe these settings in a way that highlights their role in the unfolding mystery.\n\n- **Language Use**:\n  - Employ a witty and engaging tone, using humor and irony to capture the chaos and mystery of the school environment. Use dialogue to reveal character dynamics and advance the plot, with exchanges like, \"I swear, if one more book flies off the shelf, I'm calling an exorcist,\" to convey the teacher's exasperation.\n  - Use descriptive language to create vivid imagery and enhance the story's atmosphere. For example, describe the ghostly presence with phrases like \"a chill that lingered in the air, as if the past refused to let go.\"\n  - Maintain a brisk pacing, balancing dialogue and narrative exposition to keep the reader engaged and entertained. Ensure that the language reflects the whimsical and slightly eerie tone of the story.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with a unique or humorous scenario, focusing on character interactions, and resolving with a twist or unexpected resolution. They also highlight the use of humor, irony, and vivid settings to enhance the narrative. I will incorporate these elements into the Story Rules for the new prompt, ensuring they are specific, actionable, and include detailed examples.\n\nFor the new prompt, the rules will need to address the quirky and humorous nature of the seaside attraction, the mystery of the missing flags, and the dynamics between Holmes, Watson, and the other characters. The setting should be vividly described to capture the eccentric atmosphere, and the language should reflect the light-hearted yet mysterious tone of the story. Each rule will be accompanied by examples to illustrate their application in the context of the new prompt.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with Holmes and Watson arriving at the seaside attraction, immediately encountering the quirky elements such as sandcastles and donkeys. Use dialogue to introduce the missing flags as the central mystery, with a line like, \"It seems our flags have taken a holiday of their own.\"\n  - Develop the plot by focusing on the interactions between Holmes, Watson, and the eccentric characters, such as the grumpy Punch and Judy operator. Use these interactions to reveal clues and build tension.\n  - Conclude with a humorous twist that resolves the mystery in an unexpected way, such as discovering the flags were used by the donkeys for shade. Ensure the resolution ties back to the quirky elements introduced at the beginning.\n\n- **Creativity**:\n  - Embrace the whimsical setting by incorporating imaginative and humorous elements, such as a sandcastle competition or a donkey parade. Use these elements to enhance the story's charm and engage the reader.\n  - Introduce a playful twist to the mystery, such as the flags being part of a secretive art installation by the Punch and Judy operator, to add depth and intrigue to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop Holmes and Watson through their reactions to the bizarre setting and characters. Highlight Holmes's analytical nature and Watson's practicality through their dialogue and actions.\n  - Characterize the seaside attraction with vivid descriptions, focusing on the eccentricities of the setting, such as the colorful sandcastles and the grumpy operator. Use these details to create a lively and engaging backdrop for the story.\n\n- **Language Use**:\n  - Use a light-hearted and humorous tone throughout the narrative, employing witty dialogue and playful banter between Holmes and Watson. For example, have Watson quip, \"I never thought I'd see the day when a donkey outwitted us, Holmes.\"\n  - Employ descriptive language to vividly portray the seaside setting and its quirky elements. Use specific details to enhance the reader's immersion, such as the \"briny scent of the sea\" and the \"cacophony of seagulls.\"\n  - Maintain a brisk pacing with concise sentences and engaging dialogue, ensuring the story flows smoothly and keeps the reader entertained.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with a clear conflict or scenario, using humor and irony, developing characters through dialogue and interactions, and employing a tone that matches the narrative's theme. I will apply these elements to the new prompt, focusing on the comedic clash between the curate's ambitions and the choir's unconventional methods. The rules will include specific examples to illustrate how to implement these elements effectively.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the introduction of the new curate and his ambitious plans for the choir, setting the stage for the impending clash. For example, have the curate announce a grand performance goal, such as singing at a prestigious event.\n  - Structure the narrative around the humorous interactions and misunderstandings between the curate and the choir members during rehearsals. Highlight the contrast between the curate's expectations and the choir's laid-back approach.\n  - Conclude with a comedic resolution where the choir's unique style unexpectedly wins over the curate or the audience, emphasizing the theme of embracing individuality.\n\n- **Creativity**:\n  - Use humor and irony to highlight the differences between the curate's formal musical training and the choir's informal, quirky methods. For instance, depict a scene where the choir improvises with unconventional instruments or breaks into spontaneous dance.\n  - Incorporate playful and unexpected elements, such as a choir member's pet joining the rehearsal or a humorous mishap during practice, to enhance the comedic tone.\n\n- **Development (Character and Setting)**:\n  - Develop the curate as a character who is initially rigid and focused on perfection, using his dialogue and actions to reveal his personality. Show his gradual adaptation to the choir's style through humorous interactions.\n  - Characterize the choir members as a diverse group with distinct personalities, using their interactions to showcase their camaraderie and unique approach to music.\n  - Set the story in a quaint village hall or church, using descriptive language to create a cozy and familiar atmosphere that contrasts with the curate's grand ambitions.\n\n- **Language Use**:\n  - Employ a light-hearted and humorous tone throughout the narrative, using witty dialogue and playful banter to engage the reader. For example, include exchanges like, “I’m not sure Handel envisioned a kazoo solo,” to highlight the comedic clash.\n  - Use informal and conversational language to capture the choir's relaxed dynamic, allowing characters to express themselves naturally and humorously.\n  - Focus on dialogue as the primary driver of the narrative, using it to reveal character dynamics and advance the plot in a comedic manner. Incorporate humor and sarcasm effectively, with characters exchanging quips and retorts.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves a high-stakes protest, requiring a focus on tension, disguise, and strategic planning. The rules must guide the narrative to maintain suspense and realism while ensuring the characters' actions are believable and engaging. I will incorporate examples that reflect the urgency and complexity of the situation, ensuring the rules are actionable and specific to the prompt's themes and objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a briefing scene where the team receives their mission, emphasizing the urgency and stakes involved. Use dialogue to convey the high-pressure environment, such as a team leader stating, \"We have only hours to blend in and prevent chaos.\"\n  - Structure the narrative around the team's preparation and infiltration, focusing on the challenges they face in maintaining their cover. Include a pivotal moment where their disguise is nearly compromised, heightening tension.\n  - Conclude with a resolution that involves the team successfully diffusing the situation, using their construction worker guise to gain trust and control. Ensure the ending reflects the team's strategic planning and quick thinking.\n\n- **Creativity**:\n  - Use the construction worker disguise creatively to navigate the protest scene. For example, have the team use construction tools and jargon to blend in and communicate covertly.\n  - Introduce unexpected obstacles that require the team to adapt their plan on the fly, such as a sudden change in the protest's location or an unexpected encounter with a real construction crew.\n  - Incorporate elements of suspense and surprise, such as hidden agitators or unexpected allies within the crowd, to keep the narrative engaging and dynamic.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their roles within the team and their interactions during the mission. Highlight their skills and personalities, such as a tech-savvy member using gadgets to monitor the crowd.\n  - Create a vivid setting by describing the protest scene with sensory details, such as the sound of chanting, the sight of banners, and the tension in the air. Use the environment to reflect the characters' emotions and the stakes of the mission.\n  - Illustrate the team's dynamics and camaraderie through their coordinated actions and communication, emphasizing trust and teamwork.\n\n- **Language Use**:\n  - Employ a tense and urgent tone to reflect the high-stakes nature of the mission. Use concise and direct language to convey the characters' focus and determination.\n  - Use dialogue to reveal character traits and advance the plot, ensuring it is realistic and reflective of the situation. For example, include exchanges like, \"Keep your hard hats on and your heads down,\" to emphasize the need for caution.\n  - Incorporate technical jargon and construction-related terms to enhance the authenticity of the disguise and immerse the reader in the setting.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as humor, character dynamics, and the integration of absurdity within a structured narrative. The rules will need to reflect the comedic and chaotic nature of the scenario, focusing on character interactions and the humorous challenges they face. Each category will include specific examples to illustrate how to implement these elements effectively, ensuring the rules are actionable and aligned with the prompt's objectives.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with a humorous setup that introduces the Haunted House attraction and the characters' reluctance or skepticism. For example, depict Sherlock's initial disdain for the event with a line like, \"I fail to see the appeal of scaring people with costumes.\"\n  - Structure the narrative around escalating comedic mishaps, such as the dragon costume malfunctioning or candy floss getting everywhere. Use these events to drive the plot and create a sense of escalating chaos.\n  - Conclude with a resolution that ties back to the initial setup, such as Sherlock begrudgingly admitting the event's success despite the chaos, using a humorous twist to wrap up the story.\n\n- **Creativity**:\n  - Incorporate absurd and whimsical elements, such as a dragon costume that seems to have a mind of its own or candy floss that becomes a sticky obstacle. Use these elements to enhance the comedic tone and create unexpected challenges.\n  - Use humor and irony to highlight the characters' personalities and their reactions to the absurdity. For instance, have John make a sarcastic remark about Sherlock's jumper, saying, \"At least it matches the dragon's scales.\"\n\n- **Development (Character and Setting)**:\n  - Develop characters through their interactions and responses to the chaotic events. Highlight Sherlock's analytical nature clashing with the absurdity of the situation, and John's practicality as he tries to manage the chaos.\n  - Use the setting of the Haunted House to create a vivid and immersive backdrop for the story. Describe the spooky decorations and the bustling atmosphere to enhance the sense of place and the comedic potential of the setting.\n\n- **Language Use**:\n  - Employ witty and fast-paced dialogue to convey the humor and chaos of the situation. Use exchanges like, \"Sherlock, the dragon's biting again!\" to capture the frantic and comedic tone.\n  - Use descriptive language to vividly portray the chaotic scenes, such as the candy floss sticking to everything or the dragon costume causing trouble. Ensure the language reflects the absurdity and humor of the narrative.\n  - Maintain a light-hearted and playful tone throughout the story, using humor and irony to engage the reader and enhance the comedic elements of the plot.\n</story_rules>"
]