[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should focus on the chaotic environment of Elsinore Junior Academy, emphasizing the interactions between the staff, students, and the ghost.\n   - Introduce the supply teacher as the protagonist, who navigates the chaos and uncovers the truth behind the ghost and camel rumors.\n   - Develop a series of escalating events that highlight the absurdity and humor of the situation.\n   - Conclude with a resolution that ties together the ghostly hauntings, student chaos, and camel rumors in a surprising and humorous way.\n\n2. **Creativity**:\n   - Use humor and irony to highlight the absurdity of the situation and the characters' reactions.\n   - Incorporate imaginative and whimsical elements, such as the ghost's antics and the bizarre behavior of the students.\n   - Blend elements of the supernatural with everyday school life to create a unique and engaging narrative.\n\n3. **Development (Character and Setting)**:\n   - Develop characters through their dialogue and interactions, revealing their personalities, relationships, and reactions to the chaos.\n   - Establish the setting with specific details about the school, the haunted staff room, and the various locations where the chaos unfolds.\n   - Create emotional arcs for the characters, showing their frustration, humor, and eventual resolution of the chaotic situations.\n\n4. **Language Use**:\n   - Use descriptive language to create vivid scenes and convey the chaotic and humorous atmosphere.\n   - Employ witty and concise dialogue that reflects the characters' personalities and adds to the humor of the narrative.\n   - Maintain a quick pacing, ensuring each scene contributes to the overall conflict and resolution.\n   - Balance humor and tension to create an engaging and immersive narrative.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Focus on the chaotic environment of Elsinore Junior Academy, emphasizing the interactions between the staff, students, and the ghost.\n  - Introduce the supply teacher as the protagonist, who navigates the chaos and uncovers the truth behind the ghost and camel rumors.\n  - Develop a series of escalating events that highlight the absurdity and humor of the situation.\n  - Conclude with a resolution that ties together the ghostly hauntings, student chaos, and camel rumors in a surprising and humorous way.\n\n- **Creativity**:\n  - Use humor and irony to highlight the absurdity of the situation and the characters' reactions.\n  - Incorporate imaginative and whimsical elements, such as the ghost's antics and the bizarre behavior of the students.\n  - Blend elements of the supernatural with everyday school life to create a unique and engaging narrative.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their dialogue and interactions, revealing their personalities, relationships, and reactions to the chaos.\n  - Establish the setting with specific details about the school, the haunted staff room, and the various locations where the chaos unfolds.\n  - Create emotional arcs for the characters, showing their frustration, humor, and eventual resolution of the chaotic situations.\n\n- **Language Use**:\n  - Use descriptive language to create vivid scenes and convey the chaotic and humorous atmosphere.\n  - Employ witty and concise dialogue that reflects the characters' personalities and adds to the humor of the narrative.\n  - Maintain a quick pacing, ensuring each scene contributes to the overall conflict and resolution.\n  - Balance humor and tension to create an engaging and immersive narrative.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should begin with a clear introduction to the seaside attraction and the peculiarities of the setting.\n   - Introduce the central mystery of the missing flags early on, setting up the investigation.\n   - Develop a series of clues and red herrings that Holmes and Watson must navigate.\n   - Conclude with a surprising yet logical resolution that ties together the quirky elements of the setting.\n\n2. **Creativity**:\n   - Incorporate whimsical and humorous elements that reflect the quirky nature of the seaside attraction.\n   - Use irony and wit to highlight the contrast between Holmes' serious demeanor and the lighthearted setting.\n   - Introduce unique and memorable characters, such as the grumpy Punch and Judy operator, to add depth and humor.\n\n3. **Development (Character and Setting)**:\n   - Develop Holmes and Watson's characters through their interactions with the unusual setting and its inhabitants.\n   - Create a vivid and immersive seaside setting with detailed descriptions of the attractions and atmosphere.\n   - Use the setting to enhance the narrative, making it an integral part of the mystery and its resolution.\n\n4. **Language Use**:\n   - Employ descriptive and evocative language to bring the seaside setting to life.\n   - Use dialogue to convey the characters' personalities and the humor of the situation.\n   - Maintain a balance between formal language for Holmes and Watson and more colloquial speech for the seaside characters.\n   - Ensure the pacing allows for both the buildup of the mystery and the exploration of the quirky setting.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with Holmes and Watson arriving at the seaside attraction, providing a detailed introduction to the setting and its peculiarities.\n  - Introduce the central mystery of the missing flags early in the narrative, setting up the investigation.\n  - Develop a series of clues and red herrings that Holmes and Watson must navigate, incorporating interactions with various quirky characters.\n  - Conclude with a surprising yet logical resolution that ties together the quirky elements of the setting and reveals the true motive behind the missing flags.\n\n- **Creativity**:\n  - Incorporate whimsical and humorous elements that reflect the quirky nature of the seaside attraction, such as eccentric characters and unusual events.\n  - Use irony and wit to highlight the contrast between Holmes' serious demeanor and the lighthearted setting, creating humorous situations.\n  - Introduce unique and memorable characters, such as the grumpy Punch and Judy operator, to add depth and humor to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop Holmes and Watson's characters through their interactions with the unusual setting and its inhabitants, showcasing their personalities and investigative skills.\n  - Create a vivid and immersive seaside setting with detailed descriptions of the attractions, atmosphere, and quirky elements.\n  - Use the setting to enhance the narrative, making it an integral part of the mystery and its resolution, and highlighting the contrast between the seaside's lightheartedness and the seriousness of the investigation.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to bring the seaside setting to life, focusing on sensory details and vivid imagery.\n  - Use dialogue to convey the characters' personalities and the humor of the situation, balancing formal language for Holmes and Watson with more colloquial speech for the seaside characters.\n  - Ensure the pacing allows for both the buildup of the mystery and the exploration of the quirky setting, maintaining reader engagement throughout the narrative.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided show a clear structure with categories: **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contains detailed, actionable rules that guide the narrative process. The rules are specific, avoiding comparative or relative terms, and are tailored to the unique aspects of the writing prompt.\n\nFor the new writing prompt about a strict new curate and a small village choir, the rules should focus on the humorous clash between the curate's ambitions and the choir's unconventional methods. The narrative should highlight character interactions, the setting of the village choir, and the comedic elements arising from their differences.\n\n<story_rules>\n- **Plot**:\n  - Start the story with the introduction of the new curate, emphasizing his strict demeanor and high musical standards.\n  - Develop the plot through a series of choir rehearsals, showcasing the humorous and chaotic interactions between the curate and the choir members.\n  - Highlight specific incidents where the curate's lofty ambitions clash with the choir's unique and often unorthodox approach to music.\n  - Conclude the story with a resolution that finds a balance between the curate's ambitions and the choir's individuality, possibly through a successful but unconventional performance.\n\n- **Creativity**:\n  - Use humor and irony to emphasize the contrast between the curate's strictness and the choir's laid-back attitude.\n  - Incorporate creative and exaggerated scenarios during rehearsals that highlight the choir's unique approach to music.\n  - Employ witty dialogue and humorous descriptions to enhance the comedic elements of the story.\n\n- **Development (Character and Setting)**:\n  - Develop the curate as a character with high standards and a strict approach to music, but also show his gradual adaptation to the choir's methods.\n  - Create a diverse group of choir members, each with distinct personalities and quirks that contribute to the humor and chaos.\n  - Establish the setting of the small village and the choir's rehearsal space with detailed descriptions that reflect the quaint and charming atmosphere.\n\n- **Language Use**:\n  - Use descriptive language to create vivid and humorous scenes, focusing on the interactions and mishaps during rehearsals.\n  - Craft natural and character-specific dialogue that reflects the personalities and dynamics of the curate and choir members.\n  - Maintain a light-hearted and humorous tone throughout the narrative, balancing the curate's seriousness with the choir's playful nature.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed, actionable rules under the categories of **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contained specific instructions that guided the narrative development, character interactions, and overall tone of the story. The rules were comprehensive, covering various aspects such as pacing, humor, character dynamics, and descriptive language.\n\nFor the new writing prompt, the **Story Rules** should focus on the tension and urgency of the situation, the team's preparation and execution of their plan, and the interactions with agitators. The rules should ensure the narrative is engaging, with a balance of suspense and strategic thinking.\n\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Start the story with the team receiving the mission and the urgency of the situation being established.\n  - Detail the team's preparation process, including gathering disguises, planning their infiltration, and addressing potential risks.\n  - Develop the plot through the team's arrival at the protest scene, their interactions with both protesters and agitators, and the challenges they face in maintaining their cover.\n  - Ensure the narrative builds tension as the team navigates the chaotic environment, leading to a climactic moment where their cover is nearly blown.\n  - Conclude the story with the team successfully completing their mission and safely extracting from the scene, reflecting on the experience.\n\n- **Creativity**:\n  - Use a mix of suspense and strategic thinking to drive the narrative, highlighting the team's resourcefulness and quick decision-making.\n  - Integrate creative elements such as improvised tools, unexpected allies, and clever tactics to maintain their cover.\n  - Employ moments of humor or irony to provide relief from the tension, especially in interactions with unsuspecting characters.\n  - Explore the dynamics of the protest, including the motivations and actions of both sides, to add depth to the story.\n\n- **Development (Character and Setting)**:\n  - Develop multidimensional characters through their roles in the mission, showcasing their skills, personalities, and emotional responses to the high-stakes situation.\n  - Establish the setting as a chaotic protest scene, with detailed descriptions of the environment, the crowd, and the atmosphere.\n  - Focus on the team's interactions with each other and with the protesters, highlighting their teamwork and individual contributions.\n  - Include specific settings within the protest scene, such as construction sites, barricades, and makeshift stages, to create a vivid and immersive narrative.\n\n- **Language Use**:\n  - Use descriptive language to create vivid scenes and convey the tension and urgency of the situation.\n  - Employ sharp and realistic dialogue to enhance character interactions and advance the plot.\n  - Maintain a quick pacing, ensuring each scene contributes to the overall tension and resolution.\n  - Balance suspense and strategic thinking to create an engaging and immersive narrative, using language that evokes the chaotic and high-stakes nature of the protest.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should begin with a clear setup that introduces the main characters and the central conflict or situation.\n   - The narrative should focus on the escalating chaos and absurdity within the Haunted House attraction.\n   - Specific events or interactions should drive the plot forward, leading to a humorous and unexpected resolution.\n\n2. **Creativity**:\n   - The story should blend elements of humor, irony, and absurdity to create an engaging and entertaining narrative.\n   - Incorporate imaginative and whimsical scenarios that highlight the unique setting and characters.\n   - Use creative descriptions and interactions to enhance the overall tone and atmosphere of the story.\n\n3. **Development (Character and Setting)**:\n   - Develop characters through their actions, dialogue, and reactions to the chaotic events.\n   - Establish the setting with detailed descriptions of the Haunted House attraction and its various elements.\n   - Create emotional arcs for the characters, showing their growth and responses to the absurd situations.\n\n4. **Language Use**:\n   - Employ witty and concise dialogue that reflects the characters' personalities and adds to the humor of the narrative.\n   - Use vivid and detailed descriptions to create an immersive and engaging setting.\n   - Maintain a consistent tone that balances humor and absurdity, enhancing the overall narrative experience.\n\n<story_rules>\n- **Plot**:\n  - Begin the story with Sherlock and John being reluctantly roped into running the Haunted House attraction, setting the stage for the ensuing chaos.\n  - Introduce the biting dragon costume, candy floss chaos, and Sherlock’s disdain for unflattering jumpers as key elements that drive the plot.\n  - Focus on the escalating absurdity and humorous interactions between the characters and the Haunted House elements.\n  - Resolve the narrative with a surprising and humorous twist that addresses the chaos and provides a satisfying conclusion.\n\n- **Creativity**:\n  - Blend elements of humor, irony, and absurdity to create an engaging and entertaining narrative.\n  - Incorporate imaginative and whimsical scenarios that highlight the unique setting and characters, such as the biting dragon costume and candy floss chaos.\n  - Use creative descriptions and interactions to enhance the overall tone and atmosphere of the story.\n\n- **Development (Character and Setting)**:\n  - Develop Sherlock and John through their actions, dialogue, and reactions to the chaotic events, emphasizing their distinct personalities and dynamic.\n  - Establish the Haunted House setting with detailed descriptions of its various elements, such as the dragon costume and candy floss machines.\n  - Create emotional arcs for the characters, showing their growth and responses to the absurd situations, while maintaining a humorous tone.\n\n- **Language Use**:\n  - Employ witty and concise dialogue that reflects the characters' personalities and adds to the humor of the narrative.\n  - Use vivid and detailed descriptions to create an immersive and engaging setting, emphasizing the chaotic and whimsical nature of the Haunted House.\n  - Maintain a consistent tone that balances humor and absurdity, enhancing the overall narrative experience.\n</story_rules>"
]