[
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with an engaging inciting incident, focusing on character interactions and emotional depth, and using a mix of humor and tension. The rules should guide the narrative to explore themes of discovery, trust, and the supernatural, while maintaining a balance between humor and suspense. I will ensure the rules are specific, actionable, and include examples that align with the prompt's themes of uncovering secrets and dealing with unexpected revelations.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's discovery of the wooden stake and prom photo, creating an immediate sense of intrigue and tension. For example, describe the protagonist's surprise and curiosity as they pull out the stake and photo, setting the stage for the unfolding mystery.\n  - Develop the plot by having the protagonist confront their partner about the discovery, leading to a series of revelations about their partner's past. Use this confrontation to drive the narrative forward and explore themes of trust and hidden identities.\n  - Conclude the story with a resolution that addresses the protagonist's feelings about the revelations and their relationship with their partner. For instance, have the protagonist decide whether to accept their partner's past and the supernatural elements involved.\n\n- **Creativity**:\n  - Incorporate supernatural elements such as vampire slaying and werewolf relationships to add depth and intrigue to the narrative. Use these elements to create unexpected twists and enrich the backstory of the partner.\n  - Use humor to balance the tension of the revelations, such as the protagonist's humorous internal monologue or witty exchanges with their partner. For example, include a scene where the protagonist jokingly asks if they need to worry about garlic in the house.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist's character through their reactions to the discovery and their interactions with their partner. Highlight their emotional journey from shock to understanding, using dialogue and internal thoughts to reveal their personality.\n  - Describe the setting minimally, focusing on key details that enhance the narrative, such as the contents of the bag or the setting of the confrontation. Use these details to create a vivid picture of the protagonist's world and the secrets it holds.\n\n- **Language Use**:\n  - Use a mix of suspenseful and humorous language to capture the tone of the narrative. Employ short, punchy sentences to convey tension during the discovery and longer, more reflective passages during emotional moments.\n  - Incorporate dialogue that reflects the characters' personalities and the dynamics of their relationship. For example, use playful banter to show the couple's closeness, even amidst the tension of the revelations.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with an engaging inciting incident, focusing on character interactions and emotional depth, and using magical elements to enhance the narrative. The rules should reflect the themes of love, friendship, and the complexities of starting a family, while incorporating the magical aspects of the Harry Potter universe. I will ensure the rules are actionable, specific, and include examples that align with the new writing prompt's objectives.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a pivotal conversation or event that introduces the unconventional plan, such as a heartfelt discussion among Hermione, Ginny, and Luna about their desire to start a family. Use this moment to establish the central conflict and the group's commitment to navigating this journey together.\n  - Focus on the emotional and relational dynamics as the group discusses and plans their future. Highlight the complexities of their relationships and the challenges they face, such as societal expectations or personal insecurities.\n  - Conclude the story with a moment of unity and hope, such as the group coming together to perform a magical ritual or spell that symbolizes their commitment to creating a family. Ensure the resolution emphasizes love and the strength of their bonds.\n\n- **Creativity**:\n  - Incorporate magical elements that reflect the unique nature of their plan, such as a spell or potion that facilitates the creation of a family. Use these elements to explore themes of innovation and the blending of magic with personal desires.\n  - Introduce imaginative scenarios that challenge the characters and reveal their strengths, such as a magical obstacle they must overcome together or a vision of their future family that inspires them.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their interactions and emotional journeys, focusing on their individual motivations and the evolution of their relationships. Highlight Hermione's analytical nature, Ginny's determination, Luna's open-mindedness, Harry's loyalty, and Draco's growth.\n  - Use settings that enhance the narrative's emotional depth, such as a cozy living room for intimate discussions or a magical location for significant events. Describe these settings with sensory details that evoke warmth and connection.\n\n- **Language Use**:\n  - Employ a warm and inclusive tone, using dialogue to convey the characters' emotions and the depth of their relationships. Use phrases that reflect their commitment and love, such as \"We're in this together\" or \"Our family, our way.\"\n  - Use descriptive language to create vivid imagery of magical elements and emotional moments, ensuring the narrative is both engaging and heartfelt. Focus on the sensory experiences of the characters to enhance the reader's connection to the story.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot demonstrations emphasize starting with an engaging scene, focusing on character interactions, and using magical elements to enhance the narrative. They also highlight the importance of emotional depth and personal growth. For the new prompt, I will ensure the rules reflect the excitement and anticipation of a new student at Hogwarts, incorporating the magical setting and the significance of the Sorting Hat ceremony. The rules will guide the narrative to explore Lionel's emotions, his bond with Panther, and the magical atmosphere of the Hogwarts Express journey.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with Lionel boarding the Hogwarts Express, capturing his excitement and nervousness about the journey ahead. Use this moment to introduce his new companion, Panther, and set the stage for the adventure.\n    - Example: Describe Lionel's anticipation as he steps onto the train, feeling the weight of his new school robes and the comforting presence of Panther by his side.\n  - Focus on the journey to Hogwarts, highlighting Lionel's interactions with other students and his thoughts about the Sorting Hat ceremony. Build tension and curiosity about which house he will join.\n    - Example: Show Lionel engaging in conversations with fellow first-years, sharing hopes and fears about the Sorting Hat's decision.\n  - Conclude with Lionel's arrival at Hogwarts and the Sorting Hat ceremony, ensuring the resolution provides a sense of belonging and excitement for the future.\n    - Example: Detail the moment the Sorting Hat announces Lionel's house, capturing his relief and joy as he joins his new housemates.\n\n- **Creativity**:\n  - Incorporate magical elements that enhance the narrative, such as Panther's unique abilities or quirks that reflect the magical world.\n    - Example: Describe Panther's uncanny ability to sense Lionel's emotions, providing comfort and companionship during the journey.\n  - Use the setting of the Hogwarts Express to introduce whimsical and enchanting details, creating a vivid and immersive experience.\n    - Example: Illustrate the magical snacks and games shared among students, adding to the wonder and excitement of the train ride.\n\n- **Development (Character and Setting)**:\n  - Develop Lionel's character through his interactions with Panther and other students, showcasing his personality, hopes, and fears.\n    - Example: Highlight Lionel's thoughtful nature as he reassures a nervous classmate, demonstrating his empathy and kindness.\n  - Describe the setting of the Hogwarts Express and the anticipation of arriving at Hogwarts, using sensory details to create a rich atmosphere.\n    - Example: Capture the sound of the train's whistle, the chatter of students, and the sight of the rolling countryside as the train approaches Hogwarts.\n\n- **Language Use**:\n  - Use descriptive and emotive language to convey Lionel's emotions and the magical atmosphere of the journey.\n    - Example: Employ phrases that reflect Lionel's awe and excitement, such as \"heart racing with anticipation\" and \"eyes wide with wonder.\"\n  - Maintain a tone of wonder and discovery, using dialogue and internal monologue to reveal Lionel's thoughts and feelings.\n    - Example: Include Lionel's internal musings about the Sorting Hat and his hopes for the school year, providing insight into his character.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key elements such as plot structure, creativity, character and setting development, and language use. The few-shot examples emphasize starting with an engaging inciting incident, focusing on character interactions, and resolving with emotional closure. They also highlight the integration of magical elements and personal growth, using direct and emotive language. For the new prompt, I will ensure the rules reflect the themes of discovery, personal revelation, and the complex relationship between Snape and Hermione. I will incorporate examples that illustrate these elements, ensuring the rules are actionable and specific to the narrative potential of the prompt.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with Snape's unexpected discovery of the art exhibit, creating an immediate sense of intrigue and curiosity. For example, describe Snape's initial reaction as he enters the gallery and sees his likeness in various artworks.\n  - Develop the plot through a series of revelations, focusing on Snape's interactions with Hermione. Use these interactions to gradually unveil Hermione's secret, building tension and anticipation.\n  - Conclude the story with a moment of emotional resolution, where Snape and Hermione reach an understanding or reconciliation. For instance, have Hermione reveal the personal significance behind the art, leading to a moment of mutual respect or closure.\n\n- **Creativity**:\n  - Use the art exhibit as a creative narrative device to explore Snape's character and legacy. Incorporate diverse artistic styles and mediums to reflect different aspects of his personality and history.\n  - Introduce a unique twist or revelation that adds depth to the narrative, such as Hermione's secret being related to a personal connection or insight she gained from Snape's past actions.\n\n- **Development (Character and Setting)**:\n  - Develop Snape's character through his internal reflections and reactions to the art. Highlight his complexity and the impact of his past on his present self.\n  - Portray Hermione as both an artist and a former student, showcasing her growth and the reasons behind her artistic tribute. Use her dialogue and actions to reveal her motivations and the secret she holds.\n  - Describe the setting of the art exhibit in detail, using sensory language to create an immersive atmosphere. For example, mention the lighting, the arrangement of the artworks, and the ambiance of the gallery.\n\n- **Language Use**:\n  - Employ a reflective and introspective tone, using descriptive language to convey Snape's internal monologue and emotional journey. For example, use phrases that capture his surprise and introspection as he views the art.\n  - Use dialogue to reveal character dynamics and advance the plot, ensuring conversations between Snape and Hermione are charged with emotion and tension.\n  - Incorporate vivid imagery and metaphorical language to enhance the narrative's emotional depth, particularly when describing the artworks and their impact on Snape.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as plot structure, creativity, character and setting development, and language use. The new prompt involves Hermione Granger and Kara Danvers, suggesting a crossover between the Harry Potter universe and the Supergirl universe. The narrative should focus on the development of a connection between the two characters, starting with a chance encounter. The rules will need to guide the creation of a story that blends elements of both universes while focusing on character interactions and the potential for a deeper relationship. The examples will be inspired by the few-shot demonstrations, ensuring they are specific and actionable.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with an engaging and relatable incident, such as Hermione accidentally bumping into Kara, causing them to spill their drinks. Use this moment to establish the initial connection and set the tone for their interaction.\n  - Develop the plot through a series of interactions that highlight the characters' growing connection. Use shared activities, like a lunch meeting, to explore their personalities and interests.\n  - Conclude the story with a hint of future possibilities, such as an invitation to meet again, leaving the reader with a sense of anticipation and curiosity about their relationship.\n\n- **Creativity**:\n  - Blend elements from both the Harry Potter and Supergirl universes in a subtle and seamless manner. For example, incorporate Hermione's magical background in a way that complements Kara's superhero abilities, such as Hermione using a discreet spell to clean up the spilled drinks.\n  - Introduce imaginative scenarios that allow the characters to bond over their unique experiences, such as discussing their respective worlds or sharing insights about their roles in them.\n\n- **Development (Character and Setting)**:\n  - Develop Hermione and Kara's characters through their dialogue and interactions, focusing on their personalities, strengths, and vulnerabilities. Use their conversation to reveal their backgrounds and establish common ground.\n  - Describe the setting of LCorp with enough detail to create a vivid backdrop for the story. Highlight elements that reflect the corporate environment and the bustling energy of the workplace, such as the busy cafeteria where they meet.\n\n- **Language Use**:\n  - Use a conversational and engaging tone, employing dialogue to drive the narrative and reveal character dynamics. Ensure the language reflects the characters' distinct voices and backgrounds.\n  - Incorporate humor and warmth in the dialogue to enhance the connection between Hermione and Kara. Use playful banter or light-hearted exchanges to add depth to their relationship.\n  - Employ descriptive language to create a vivid sense of place and atmosphere, focusing on sensory details that bring the setting and characters to life.\n</story_rules>"
]