[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - Focus on the detectives' personal struggles and how these impact their professional relationship and the case.\n   - Include flashbacks to the detectives' pasts, revealing their connections to the criminal and the family betrayal.\n   - Develop a complex case that intertwines with the detectives' personal issues, creating a narrative that explores themes of trust, loyalty, and deception.\n   - Conclude with a resolution that addresses both the case and the detectives' personal arcs, leaving room for future development.\n\n2. **Creativity**:\n   - Use imaginative and unconventional elements to deepen the narrative, such as symbolic imagery and psychological tension.\n   - Blend elements of noir and psychological thriller to create a dark, atmospheric tone.\n   - Incorporate unexpected twists and turns in the case to keep the narrative engaging and unpredictable.\n\n3. **Development (Character and Setting)**:\n   - Provide a deep exploration of the detectives' characters, focusing on their internal conflicts and relationships.\n   - Develop multidimensional characters, including secondary characters who play significant roles in the case and the detectives' personal lives.\n   - Create immersive settings that reflect the story's tone and themes, using detailed descriptions to enhance the atmosphere.\n\n4. **Language Use**:\n   - Employ detailed and descriptive language to create a vivid and immersive experience.\n   - Use a reflective and introspective tone to convey the detectives' internal struggles.\n   - Incorporate natural dialogue that reveals character dynamics and advances the plot.\n   - Balance descriptive passages with dialogue to maintain narrative engagement and pacing.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Focus on the detectives' personal struggles and how these impact their professional relationship and the case.\n  - Include flashbacks to the detectives' pasts, revealing their connections to the criminal and the family betrayal.\n  - Develop a complex case that intertwines with the detectives' personal issues, creating a narrative that explores themes of trust, loyalty, and deception.\n  - Conclude with a resolution that addresses both the case and the detectives' personal arcs, leaving room for future development.\n\n- **Creativity**:\n  - Use imaginative and unconventional elements to deepen the narrative, such as symbolic imagery and psychological tension.\n  - Blend elements of noir and psychological thriller to create a dark, atmospheric tone.\n  - Incorporate unexpected twists and turns in the case to keep the narrative engaging and unpredictable.\n\n- **Development (Character and Setting)**:\n  - Provide a deep exploration of the detectives' characters, focusing on their internal conflicts and relationships.\n  - Develop multidimensional characters, including secondary characters who play significant roles in the case and the detectives' personal lives.\n  - Create immersive settings that reflect the story's tone and themes, using detailed descriptions to enhance the atmosphere.\n\n- **Language Use**:\n  - Employ detailed and descriptive language to create a vivid and immersive experience.\n  - Use a reflective and introspective tone to convey the detectives' internal struggles.\n  - Incorporate natural dialogue that reveals character dynamics and advances the plot.\n  - Balance descriptive passages with dialogue to maintain narrative engagement and pacing.\n</story_rules>",
    "<thinking>\nAnalyze the provided few-shot examples to identify the structure, tone, and level of detail used in the **Story Rules**. Each example includes comprehensive and actionable rules categorized under **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. The rules are tailored to the specific writing prompt, providing clear guidance on narrative development, character dynamics, and thematic elements.\n\nFor the new writing prompt involving a detective haunted by past betrayal and suspecting an online admirer, the **Story Rules** should focus on creating a suspenseful and emotionally charged narrative. The rules should guide the development of a plot that balances the detective's internal struggles with the unfolding mystery, encourage creative twists and red herrings, and ensure the characters and settings are vividly portrayed. Language use should enhance the tension and reflect the detective's paranoia and emotional state.\n\n<story_rules>\n- **Plot**:\n  - Begin with the detective's daily routine, subtly hinting at his past betrayal and its lingering effects on his psyche.\n  - Introduce the new online admirer early in the story, creating an initial sense of intrigue and cautious optimism for the detective.\n  - Develop a series of interactions between the detective and the admirer, gradually increasing the detective's suspicion and paranoia.\n  - Include flashbacks or references to the past betrayal, drawing parallels to the current situation and deepening the detective's internal conflict.\n  - Build towards a climax where the detective confronts the admirer, leading to a dramatic revelation that either confirms or dispels his fears.\n  - Conclude with the detective reflecting on the experience, contemplating his trust issues and the possibility of moving forward.\n\n- **Creativity**:\n  - Incorporate elements of modern technology and online communication to create a realistic and relatable setting for the detective's interactions with the admirer.\n  - Use creative plot twists and red herrings to keep the reader guessing about the admirer's true identity and intentions.\n  - Explore the detective's investigative skills, showcasing his methods and thought processes as he tries to uncover the truth.\n  - Blend elements of psychological thriller and mystery genres to enhance the story's suspense and emotional depth.\n\n- **Development (Character and Setting)**:\n  - Develop the detective as a complex character, haunted by his past but determined to protect himself from further harm.\n  - Create a detailed backstory for the detective, including the nature of the past betrayal and its impact on his personal and professional life.\n  - Introduce secondary characters, such as colleagues or friends, who provide support and perspective on the detective's situation.\n  - Establish a vivid and immersive setting, using detailed descriptions of the detective's environment and the online interactions to enhance the narrative.\n\n- **Language Use**:\n  - Use descriptive language to convey the detective's emotions and the tension in his interactions with the admirer.\n  - Employ a mix of formal and informal dialogue to reflect the detective's professional demeanor and his more vulnerable moments.\n  - Include internal monologues or reflections from the detective to provide insight into his thoughts and feelings, particularly his paranoia and trust issues.\n  - Maintain a tone that balances suspense and emotional depth, ensuring the narrative remains engaging and thought-provoking.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed, actionable rules under the categories of **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contained specific instructions that guided the narrative, character development, and overall tone of the story. The rules were comprehensive, covering various aspects such as emotional depth, setting descriptions, and pacing.\n\nFor the new writing prompt involving Eleven in a strange version of England ruled by Norsefire, the **Story Rules** should focus on:\n- The mystery and disorientation of Eleven's new environment.\n- The oppressive atmosphere of the Norsefire regime.\n- Eleven's internal struggle and determination to understand her situation.\n- The blending of sci-fi and dystopian elements to create a unique narrative.\n\n<story_rules>\n- **Plot**:\n  - Begin the story with Eleven's immediate reactions and confusion upon finding herself in this strange version of England.\n  - Emphasize the mystery of her new environment, gradually revealing clues about the Norsefire regime and its control over society.\n  - Focus on Eleven's quest to understand whether she is in the future, an alternate timeline, or something even stranger.\n  - Incorporate moments of tension and danger as Eleven navigates this oppressive world, encountering both allies and enemies.\n  - Build towards a climax where Eleven must confront the reality of her situation and decide on her next course of action.\n\n- **Creativity**:\n  - Use vivid and imaginative descriptions to create a sense of disorientation and otherworldliness in Eleven's new environment.\n  - Blend elements of sci-fi and dystopian genres, incorporating advanced technology and oppressive societal structures.\n  - Introduce unique and unexpected twists that challenge Eleven's understanding of reality and her own abilities.\n  - Create a sense of unease and suspense, keeping readers engaged with the unfolding mystery.\n\n- **Development (Character and Setting)**:\n  - Develop Eleven's character by exploring her internal thoughts and emotions, particularly her confusion, fear, and determination.\n  - Depict the Norsefire regime as a powerful and oppressive force, using detailed descriptions to convey its control over society.\n  - Create immersive settings that reflect the dystopian nature of this alternate England, using sensory details to enhance the atmosphere.\n  - Introduce secondary characters who either aid or hinder Eleven, highlighting the complexity of this new world and its inhabitants.\n\n- **Language Use**:\n  - Employ descriptive and evocative language to create a tense and immersive atmosphere.\n  - Use a slower pacing to allow for a deeper exploration of Eleven's thoughts and emotions, building suspense and emotional depth.\n  - Incorporate sensory details and vivid descriptions to bring the setting and characters to life.\n  - Use dialogue sparingly but effectively to reveal character and advance the plot, ensuring each line contributes to the development of the story.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\nThe examples provided detailed, actionable rules under the categories of **Plot**, **Creativity**, **Development (Character and Setting)**, and **Language Use**. Each category contained specific instructions that guided the narrative, character development, and overall tone of the story. The rules were comprehensive and tailored to the unique elements of each writing prompt.\n\nFor the new writing prompt about an oil spill and the fight to save wildlife, the **Story Rules** should focus on the environmental disaster, the emotional and physical challenges faced by the characters, and the uncovering of the oil company's motives. The rules should also emphasize the importance of teamwork and the bond between the characters and the wildlife they are trying to save.\n\n<story_rules>\n- **Plot**:\n  - Start the story with the immediate aftermath of the oil spill, highlighting the devastation and urgency of the situation.\n  - Focus on the protagonist's initial reaction to the disaster and their determination to take action.\n  - Introduce the small group of unlikely allies, detailing their backgrounds and motivations for joining the fight.\n  - Develop a subplot involving the sick orca named Luna, emphasizing the emotional connection between the characters and the wildlife.\n  - Uncover the true motives of the oil company through a series of discoveries and confrontations, building tension and suspense.\n  - Conclude with a resolution that addresses both the environmental crisis and the characters' personal growth and relationships.\n\n- **Creativity**:\n  - Use vivid and evocative descriptions to convey the environmental impact of the oil spill and the beauty of the cove before the disaster.\n  - Incorporate elements of mystery and intrigue as the characters uncover the oil company's true motives.\n  - Highlight the unique skills and perspectives of each ally, showing how their differences contribute to the group's success.\n  - Create emotional and heartwarming moments between the characters and the wildlife, particularly Luna the orca.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a passionate and determined individual with a deep connection to the cove and its wildlife.\n  - Flesh out the backgrounds and personalities of the unlikely allies, showing their growth and development throughout the story.\n  - Depict the cove as a once-pristine and beautiful place, now marred by the oil spill, using detailed descriptions to create a strong sense of place.\n  - Show the physical and emotional challenges faced by the characters as they work to save the wildlife and uncover the oil company's motives.\n\n- **Language Use**:\n  - Employ descriptive and sensory language to create a vivid and immersive atmosphere, emphasizing the contrast between the pristine cove and the devastation caused by the oil spill.\n  - Use a mix of dialogue and internal monologue to reveal the characters' thoughts, emotions, and motivations.\n  - Maintain a tone that reflects the urgency and gravity of the situation, while also allowing for moments of hope and determination.\n  - Incorporate technical and environmental terminology to add authenticity and depth to the narrative.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - The plot should start with the protagonist's initial infiltration into Miranda Priestly's household, establishing the stakes and the protagonist's mission.\n   - Develop a series of events where the protagonist gains Miranda's trust while simultaneously gathering intelligence.\n   - Introduce moments of tension and danger as the protagonist navigates the complexities of the drug lord's operations.\n   - Highlight the growing bond between the protagonist and Miranda's adoptive daughter, creating internal conflict.\n   - Conclude with a climactic decision where the protagonist must choose between completing the mission or protecting the child.\n\n2. **Creativity**:\n   - Incorporate elements of suspense and psychological tension, reflecting the high-stakes environment.\n   - Use creative scenarios that showcase the protagonist's resourcefulness and adaptability.\n   - Include subtle hints and foreshadowing to build suspense and keep readers engaged.\n   - Explore the duality of the protagonist's role as both a caregiver and an undercover agent.\n\n3. **Development (Character and Setting)**:\n   - Develop the protagonist's character through their interactions with Miranda and her daughter, revealing their motivations and internal struggles.\n   - Create a complex and multifaceted portrayal of Miranda Priestly, showing both her ruthlessness and her vulnerabilities.\n   - Establish a detailed and immersive setting within Miranda's luxurious yet dangerous household.\n   - Highlight the contrast between the opulence of Miranda's lifestyle and the underlying threat of her criminal activities.\n\n4. **Language Use**:\n   - Use descriptive and evocative language to create a tense and suspenseful atmosphere.\n   - Employ natural and realistic dialogue that reflects the characters' personalities and relationships.\n   - Balance action-oriented scenes with introspective moments to develop the protagonist's internal conflict.\n   - Maintain a consistent tone of suspense and urgency throughout the narrative.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with the protagonist's arrival at Miranda Priestly's household, establishing their undercover mission and the high stakes involved.\n  - Develop a series of events where the protagonist gains Miranda's trust while gathering intelligence on her operations.\n  - Introduce moments of tension and danger as the protagonist navigates the complexities of the drug lord's household and criminal activities.\n  - Highlight the growing bond between the protagonist and Miranda's adoptive daughter, creating internal conflict and emotional depth.\n  - Conclude with a climactic decision where the protagonist must choose between completing the mission or protecting the child, leading to a resolution that reflects their character growth.\n\n- **Creativity**:\n  - Incorporate elements of suspense and psychological tension, reflecting the high-stakes environment of the drug lord's household.\n  - Use creative scenarios that showcase the protagonist's resourcefulness and adaptability in various situations.\n  - Include subtle hints and foreshadowing to build suspense and keep readers engaged throughout the narrative.\n  - Explore the duality of the protagonist's role as both a caregiver and an undercover agent, highlighting the moral and ethical dilemmas they face.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist's character through their interactions with Miranda and her daughter, revealing their motivations, fears, and internal struggles.\n  - Create a complex and multifaceted portrayal of Miranda Priestly, showing both her ruthlessness as a drug lord and her vulnerabilities as a mother.\n  - Establish a detailed and immersive setting within Miranda's luxurious yet dangerous household, using descriptive language to bring it to life.\n  - Highlight the contrast between the opulence of Miranda's lifestyle and the underlying threat of her criminal activities, creating a sense of tension and unease.\n\n- **Language Use**:\n  - Use descriptive and evocative language to create a tense and suspenseful atmosphere, drawing readers into the story.\n  - Employ natural and realistic dialogue that reflects the characters' personalities, relationships, and the high-stakes environment they inhabit.\n  - Balance action-oriented scenes with introspective moments to develop the protagonist's internal conflict and emotional journey.\n  - Maintain a consistent tone of suspense and urgency throughout the narrative, keeping readers engaged and invested in the outcome.\n</story_rules>"
]