[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories. The author’s style is characterized by intertwining personal and cultural journeys, using non-linear narratives, and integrating cultural and social commentary. Characters are developed through socio-economic struggles and familial relationships, with language that is both colloquial and vivid. The Writing Prompt involves a chaotic family gathering, which provides an opportunity to explore themes of love, dysfunction, and unexpected revelations about connection and belonging. I will create Story Rules that incorporate these elements, ensuring they are actionable and detailed, with examples inspired by the Author Writing Sheet.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Structure the plot around a family gathering that serves as a journey through personal and cultural elements. Begin with a chaotic scene, such as a heated argument over a family tradition, and weave in cultural anecdotes that reveal deeper truths about the family’s heritage and dynamics. For example, a grandmother might recount a story about a past family reunion that ended in a ceremonial dance, highlighting cultural continuity amidst chaos.\n  - Use a non-linear narrative to unfold the story through personal and familial anecdotes. Introduce flashbacks during the gathering, such as a sibling recalling a childhood memory of a similar chaotic event, to reveal underlying tensions and connections within the family.\n\n- **Creativity**:  \n  - Integrate cultural and social commentary into the narrative by having characters reflect on the socio-economic challenges faced by the family. For instance, during a dinner conversation, a character might lament the lack of community support for local businesses, drawing parallels to the family’s struggles.\n  - Reinterpret the prompt by weaving in cultural elements and personal history. Use a family heirloom, like a traditional recipe or artifact, as a symbol of the family’s cultural identity and history, sparking discussions that reveal hidden truths and connections.\n\n- **Development (Character and Setting)**:  \n  - Develop characters through their socio-economic struggles and cultural identity. Portray a character who is trying to balance modern life with traditional values, such as a young adult who feels torn between pursuing a career in the city and staying to support the family business.\n  - Explore detailed familial relationships and cultural context. Highlight the dynamics between siblings, such as a rivalry that stems from differing views on cultural practices, and use these interactions to deepen the narrative’s emotional impact.\n\n- **Language Use**:  \n  - Employ colloquial and culturally specific language to enhance authenticity. Use dialogue that reflects the family’s cultural background, such as phrases unique to their community or region, to add depth and realism to conversations.\n  - Use vivid, sensory language to evoke emotional depth and cultural resonance. Describe the setting of the family gathering with rich details, such as the aroma of traditional dishes or the vibrant colors of cultural decorations, to immerse the reader in the scene and highlight the family’s cultural heritage.\n</story_rules>"
]