[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's writing style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves themes of tradition, modernity, tragedy, and societal judgment, which must be woven into the narrative using the author's style.\n\n**Plot**: The author focuses on internal conflict and emotional turmoil. For the Writing Prompt, the plot should center on Chichi's internal struggle with her decision and the resulting tragedy, rather than external events. The narrative should explore her emotional journey and the impact of societal judgment.\n\n**Creativity**: The author uses imaginative elements to reflect emotional states and integrates cultural beliefs. In the story, Chichi's emotional turmoil could be depicted through surreal imagery, such as envisioning traditional symbols reacting to her modern choices. Cultural elements, like village beliefs about childbirth, should be woven into the narrative to enrich the context.\n\n**Development (Character and Setting)**: Characters are developed through emotional responses and relationships. Chichi's relationship with her mother and the community should be explored through their emotional interactions, highlighting shared grief and societal pressure.\n\n**Language Use**: The author uses vivid, emotionally charged language. The story should employ similar language to convey Chichi's inner world, using phrases that capture her emotional state and the weight of societal judgment.\n\nWith these insights, I will create detailed Story Rules that guide the language model in crafting a narrative that aligns with both the Writing Prompt and the author's style.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:  \n  - Focus the plot on Chichi's internal conflict and emotional turmoil following her decision to use a modern childbirth method. Explore her feelings of guilt, shame, and defiance as she navigates the tragedy and societal judgment. For example, depict Chichi contemplating her decision in solitude, feeling the weight of her choice as she hears the whispers of the villagers outside her window.\n\n- **Creativity**:  \n  - Use imaginative elements to reflect Chichi's emotional state. For instance, describe how she envisions the traditional symbols in her home, like the family heirloom tapestry, unraveling or changing color as a metaphor for her internal conflict and the community's disapproval.  \n  - Integrate cultural beliefs and societal norms into the narrative. Illustrate the villagers' reactions with sayings or beliefs, such as, \"The modern ways have angered the spirits,\" to add depth and context to the story.\n\n- **Development (Character and Setting)**:  \n  - Develop Chichi and her mother's characters through their emotional responses and interactions. Highlight their shared grief and the tension between them as they face the community's judgment. For example, show a scene where Chichi and her mother sit in silence, their unspoken emotions filling the room, as they hear the village's whispers through the thin walls.  \n  - Use the setting of the village to reflect the traditional values and societal pressure. Describe the village's physical environment, such as the narrow, winding paths and the communal spaces where gossip thrives, to emphasize the close-knit and judgmental nature of the community.\n\n- **Language Use**:  \n  - Employ vivid and emotionally charged language to convey Chichi's inner world. Use phrases that capture her emotional state, such as \"Chichi's heart ached with the weight of a thousand unspoken words,\" or \"The whispers of the village clung to her like a shroud, suffocating and relentless.\"  \n  - Use language that reflects the tension between tradition and modernity, highlighting the contrast in Chichi's thoughts and the community's expectations.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories. The author emphasizes internal conflict and emotional turmoil in plot development, uses imaginative and cultural elements creatively, develops characters through emotional responses, and employs vivid, emotionally charged language. The Writing Prompt involves a young girl's struggle with her manipulative mother, exploring themes of loyalty, rebellion, and identity. The Story Rules will guide the narrative to focus on the protagonist's internal journey, using imaginative elements to reflect her emotional state, and developing her character through relationships and emotional responses. Language will be vivid and emotionally charged to convey her inner world.  \n</thinking>  \n<story_rules>  \n- **Plot**:\n  - Structure the plot around the protagonist's internal conflict with her manipulative mother. Focus on her emotional turmoil as she navigates loyalty and rebellion. For example, depict her contemplating whether to confront her mother or continue to comply, highlighting her internal struggle rather than external events.\n  - Use pivotal moments of introspection where the protagonist questions her identity and the power dynamics in her life. Illustrate these moments with scenes where she reflects on past interactions with her mother, feeling torn between love and resentment.\n\n- **Creativity**:\n  - Employ imaginative elements to convey the protagonist's emotional state. For instance, describe her envisioning her mother's words as a web of threads tightening around her, symbolizing the manipulation and control she feels.\n  - Integrate cultural elements and societal beliefs to enrich the narrative. Include sayings or beliefs that the protagonist has internalized, such as a family mantra about obedience, which she begins to question as she seeks her own identity.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through her emotional responses and relationships. Highlight her interactions with a supportive friend or sibling who offers a contrasting perspective to her mother's influence, focusing on the emotional depth of these relationships.\n  - Set the story in a household that reflects the protagonist's internal conflict, such as a home filled with her mother's imposing presence, where every room holds memories of manipulation and control.\n\n- **Language Use**:\n  - Use vivid and emotionally charged language to convey the protagonist's inner world. Describe her feelings with phrases like \"a storm of rebellion brewing beneath my calm exterior\" or \"the weight of unspoken words pressing down on my chest.\"\n  - Capture the protagonist's moments of clarity and confusion with language that reflects her emotional state, such as \"the fog of doubt lifting momentarily, revealing a path I fear to tread.\"  \n</story_rules>"
]