[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves themes of grief, bonding, and healing, which will be integrated into the Story Rules.\n\n### Plot\nThe author often structures plots around internal conflict, emotional resolution, and character interactions. For this prompt, the plot should focus on the internal struggles of the two girls, their gradual emotional resolution, and the development of their bond through interactions. The narrative should unfold through a series of encounters that reveal their shared pain and eventual support for each other.\n\n### Creativity\nThe author blends psychological tension, introspection, and surreal elements. The story should creatively explore the girls' psychological states and their introspective journeys towards healing. Surreal elements can be used to symbolize their emotional landscapes and the process of overcoming grief.\n\n### Development (Character and Setting)\nCharacters are developed through nuanced dialogue, introspection, and emotional arcs. The two girls should be portrayed with depth, showing their growth through dialogue and introspective moments. The setting should reflect their emotional states, perhaps using a shared home as a metaphor for their journey towards healing.\n\n### Language Use\nThe author uses vivid, sensory language and internal monologue to convey emotions. The story should employ descriptive language to create an immersive atmosphere, capturing the girls' emotions and the tone of their interactions. Playful language can be used to highlight moments of unexpected joy or humor in their bond.\n\nWith these insights, I will create detailed Story Rules that guide the narrative to align with the Writing Prompt while reflecting the author's style.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:\n  - Structure the plot around the internal conflicts and emotional resolutions of the two girls. Begin with their individual experiences of grief, gradually revealing their shared pain through interactions. For example, depict a scene where one girl finds solace in the other's quiet presence, leading to a moment of mutual understanding.\n  - Develop the narrative through a series of encounters that build tension and deepen their bond. Use these encounters to reveal more about their backgrounds and the nature of their loss, culminating in a shared moment of hope or healing.\n  - Incorporate a surreal and introspective journey as the girls navigate their grief. Use dreamlike sequences or symbolic events to represent their emotional states and the process of coming to terms with their loss.\n\n- **Creativity**:\n  - Blend elements of psychological tension and introspection to explore the girls' fears and relationships. Use internal monologues to delve into their thoughts and emotions, highlighting their struggles and moments of clarity.\n  - Integrate surreal elements to symbolize the girls' emotional landscapes. For instance, describe a scene where they walk through a garden that changes with their moods, reflecting their journey towards healing.\n  - Use humor and whimsy to lighten the narrative and highlight the absurdity of certain situations. Include playful interactions or unexpected moments of joy that bring the girls closer together.\n\n- **Development (Character and Setting)**:\n  - Develop the girls' characters through nuanced dialogue and subtle shifts in behavior. Show their growth and complexity by revealing their vulnerabilities and strengths through conversations and introspective moments.\n  - Use the setting to reflect the girls' emotional states. Describe their shared home in detail, using sensory language to create an atmosphere that mirrors their journey from grief to healing.\n  - Highlight the girls' emotional arcs and motivations. Show how their interactions and shared experiences lead to personal growth and a deeper understanding of each other.\n\n- **Language Use**:\n  - Employ vivid and sensory language to create an immersive and atmospheric setting. Use descriptions that evoke the girls' emotions and the tone of their interactions, such as \"the air was thick with unspoken words\" or \"the silence between them was a comforting presence.\"\n  - Use internal monologue and dialogue to convey the girls' emotions and tensions effectively. Capture their confusion, hope, and moments of connection with phrases like \"her heart ached with a longing she couldn't name\" or \"in her eyes, she saw a reflection of her own pain.\"\n  - Incorporate playful and humorous language to enhance the narrative's tone. Use light-hearted exchanges or whimsical descriptions to highlight moments of unexpected joy in their bond, such as \"they laughed until their sides hurt, the sound echoing through the empty halls like a forgotten melody.\"  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a delicate emotional revelation between Snape and Harry, requiring a focus on internal conflict, emotional resolution, and character introspection. The author's style emphasizes internal conflict, surreal introspection, and character development through nuanced dialogue and introspection. The language is vivid, sensory, and sometimes playful, which can be adapted to the emotional and tense nature of the prompt. I will create Story Rules that guide the narrative to explore the emotional depth and complexity of Snape and Harry's relationship, using the author's techniques for plot structuring, creative blending of themes, character development, and language use.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:  \n  - Structure the plot around internal conflict and emotional resolution. Begin with Harry's growing trust in Snape, gradually revealing Snape's painful truth through a series of interactions. For example, depict Harry's initial confusion and emotional turmoil as he processes Snape's revelation, using scenes where Snape's actions subtly hint at his past mistakes before the full truth is disclosed.  \n  - Develop the narrative as a surreal and introspective journey. Use dreamlike sequences where Harry reflects on his relationship with Snape, perhaps in a setting like the Forbidden Forest at dusk, where time feels suspended, allowing Harry to explore his emotions and fears.  \n  - Incorporate a high-stakes confrontation driven by intense dialogue. Create a scene where Harry confronts Snape about the truth, using sharp, emotionally charged dialogue to highlight the tension, such as Harry demanding, \"Why didn't you tell me sooner?\" and Snape responding with a mix of regret and defensiveness.  \n  - Use multiple encounters to build tension and develop the narrative. Show Harry having several conversations with Snape, each revealing more about Snape's past and their evolving relationship, culminating in a pivotal moment of understanding or forgiveness.  \n\n- **Creativity**:  \n  - Blend elements of psychological tension and character introspection. Focus on Harry's internal monologue as he grapples with Snape's revelation, exploring his conflicting emotions and the impact on their bond.  \n  - Integrate surrealism and emotional realism to explore Harry's fears and relationships. Use a setting like the Room of Requirement, where Harry can confront his fears in a surreal, ever-changing environment that reflects his inner turmoil.  \n  - Explore the theme of redemption through character reflection. Highlight Snape's internal struggle with his past actions and his desire for redemption, using reflective moments where Snape considers his motivations and the possibility of forgiveness.  \n\n- **Development (Character and Setting)**:  \n  - Develop characters through nuanced dialogue and subtle shifts in behavior. Show Snape's complexity through his dialogue, revealing his guilt and desire to protect Harry, while Harry's reactions demonstrate his struggle to reconcile his feelings.  \n  - Use subtle interactions and introspection to develop characters. Illustrate Harry's growth through his introspective moments, where he reflects on Snape's actions and his own feelings of betrayal and understanding.  \n  - Create multidimensional characters by exploring their emotional arcs and motivations. Delve into Snape's motivations for revealing the truth and Harry's journey towards acceptance, using their interactions to highlight their evolving relationship.  \n\n- **Language Use**:  \n  - Employ dialogue and internal monologue to convey character emotions and tensions. Use Harry's internal thoughts to express his confusion and emotional conflict, such as, \"Harry's mind was a whirlwind of anger and disbelief, yet a part of him clung to the hope that Snape's intentions were genuine.\"  \n  - Use vivid and sensory language to create an immersive and atmospheric setting. Describe settings like the dimly lit Potions classroom or the quiet solitude of the library, using sensory details to enhance the emotional weight of the scenes.  \n  - Employ descriptive language and internal monologue to create an immersive narrative. Capture Harry's emotional state with phrases like \"Harry's heart felt heavy, as if burdened by the weight of Snape's confession,\" to engage the reader deeply with the story.  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a chaotic interrogation at Gringotts, accusations of theft, goblin rivalries, and a mysterious break-in. The narrative should incorporate elements of internal conflict, surreal introspection, high-stakes confrontation, and humor, as evidenced in the Author Writing Sheet. The characters, particularly Harry and Hagrid, should be developed through nuanced dialogue and introspection, while the setting of Gringotts should be vividly described to enhance the atmosphere. Language should convey tension, humor, and character emotions effectively. I will create detailed, actionable Story Rules that reflect these elements and are tailored to the Writing Prompt.  \n</thinking>  \n<story_rules>  \n- **Plot**:\n  - Structure the plot around internal conflict and emotional resolution. Begin with Harry and Hagrid's internal struggles during the interrogation, gradually revealing external support from unexpected allies among the goblins. For example, depict Harry's confusion and frustration as he tries to understand Griphook's betrayal, leading to a moment of clarity when a sympathetic goblin discreetly offers help.\n  - Develop the narrative as a surreal and introspective journey. Use Harry's perspective to explore the dreamlike chaos of the goblin rivalries, where time seems to stretch and reality blurs. Illustrate this with Harry feeling detached, as if watching the events unfold from a distance, pondering the true motives behind the break-in.\n  - Incorporate a high-stakes confrontation with intense dialogue. Create a scene where Harry confronts Griphook, demanding answers about the theft and the goblin's deceit. Use sharp, accusatory dialogue to heighten the tension, such as Harry saying, \"Tell me why you lied, Griphook, or I'll make sure every goblin knows your treachery.\"\n  - Use multiple encounters to build tension. Have Harry and Hagrid experience several confrontations with different goblin factions, each revealing more about the internal goblin politics and the true mastermind behind the break-in, culminating in a dramatic escape.\n\n- **Creativity**:\n  - Blend elements of psychological tension and character introspection. Focus on Harry's internal monologue as he processes the chaos around him, exploring his fears and suspicions about the goblins' motives and Griphook's betrayal.\n  - Integrate surrealism and emotional realism. Describe the Gringotts setting as a place where \"the air was thick with tension, and the walls seemed to close in,\" emphasizing the surreal nature of the goblin rivalries and Harry's emotional turmoil.\n  - Infuse humor and whimsy into the narrative. Include light-hearted moments, such as Hagrid's comical attempts to calm the goblins with his booming voice, or a goblin accidentally triggering a magical trap that sends them flying, adding levity to the tense situation.\n  - Explore themes of redemption through character reflection. Use Harry's reflections on his past interactions with Griphook and other goblins to explore themes of trust and betrayal, leading to a moment of realization about who he can truly rely on.\n\n- **Development (Character and Setting)**:\n  - Develop characters through nuanced dialogue and subtle shifts in behavior. Show Harry's growth as he navigates the complex goblin politics, using dialogue to reveal his increasing understanding and strategic thinking.\n  - Use subtle interactions and introspection to develop characters. Highlight Hagrid's protective nature and loyalty through his actions and internal thoughts, as he worries about Harry's safety amidst the chaos.\n  - Create multidimensional characters by exploring their emotional arcs. Delve into Griphook's motivations and internal conflict, revealing his guilt and fear through his interactions with Harry and other goblins.\n  - Develop the Gringotts setting with vivid and sensory descriptions. Paint a picture of the chaotic scene with phrases like \"the clinking of gold echoed ominously,\" and \"the flickering torchlight cast eerie shadows,\" immersing the reader in the tense atmosphere.\n\n- **Language Use**:\n  - Employ dialogue and internal monologue to convey character emotions and tensions. Use Harry's thoughts and conversations to highlight his confusion and determination, such as \"Harry's mind raced, piecing together the puzzle of Griphook's betrayal.\"\n  - Use vivid and sensory language to create an immersive setting. Describe the Gringotts environment with sensory details, like \"the cold stone floor sent shivers up Harry's spine,\" and \"the acrid smell of burning parchment filled the air.\"\n  - Employ playful and humorous language to enhance the comedic tone. Include Hagrid's humorous exclamations, like \"Blimey, these goblins are nuttier than a fruitcake!\" to lighten the mood amidst the chaos.\n  - Use a straightforward and engaging narrative style to convey the protagonist's perspective. Capture Harry's perspective with direct language, such as \"Harry knew he had to act fast. The goblins were closing in, and time was running out.\"  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves Harry dealing with a devastating loss and finding strength through a conversation with Neville, focusing on themes of prophecy, friendship, and emotional resilience.\n\n**Plot**: The author often structures plots around internal conflict and emotional resolution, with gradual revelations and character interactions. For this prompt, the plot should focus on Harry's internal struggle with the prophecy and his emotional journey towards finding strength through his bond with Neville. The narrative should unfold through a series of interactions, revealing layers of support and understanding.\n\n**Creativity**: The author blends psychological tension and introspection with surreal and emotional realism. The story should creatively explore Harry's fears and the weight of the prophecy, using introspective moments and surreal elements to highlight his internal conflict and the transformative power of friendship.\n\n**Development (Character and Setting)**: Characters are developed through nuanced dialogue, introspection, and emotional arcs. Harry and Neville's conversation should reveal their complexities and growth, with Neville's unexpected strength and support playing a crucial role in Harry's emotional journey.\n\n**Language Use**: The author employs vivid, sensory language and internal monologue to convey emotions and create an immersive atmosphere. The story should use descriptive language to capture the emotional weight of the prophecy and the setting, enhancing the reader's engagement with Harry's internal and external struggles.\n\nWith these insights, I will craft Story Rules that guide the narrative to reflect the author's style while aligning with the Writing Prompt.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the plot around Harry's internal conflict with the prophecy and his emotional journey towards finding strength. Begin with Harry's struggle, gradually revealing Neville's unwavering support through a series of interactions. For example, depict Harry sitting alone in the Gryffindor common room, lost in thought, when Neville quietly joins him, initiating a conversation that slowly uncovers layers of shared burdens and mutual understanding.\n  - Use a surreal and introspective journey to explore Harry's fears and the weight of the prophecy. Create a dreamlike sequence where Harry envisions the prophecy as a tangible weight, only to find it lifted by Neville's presence, symbolizing the power of friendship and shared strength.\n\n- **Creativity**:\n  - Blend elements of psychological tension and character introspection to reinterpret the prompt. Use Harry's internal monologue to explore his fears and doubts about the prophecy, contrasting them with Neville's calm and reassuring demeanor. For instance, have Harry reflect on his perceived inadequacies, only to be interrupted by Neville's quiet confidence, which challenges Harry's self-doubt.\n  - Integrate surreal and emotional realism to highlight the transformative power of friendship. Describe a moment where Harry feels the room around him shift, as if time itself pauses, when Neville speaks words of encouragement, emphasizing the surreal impact of their bond.\n\n- **Development (Character and Setting)**:\n  - Develop Harry and Neville's characters through nuanced dialogue and introspection. Use their conversation to reveal Harry's vulnerability and Neville's unexpected strength. For example, have Neville share a personal story of overcoming fear, which resonates with Harry and prompts a shift in his perspective.\n  - Highlight the emotional arcs and motivations of both characters. Show Harry's gradual acceptance of his role in the prophecy, driven by Neville's steadfast support and shared experiences. Use subtle shifts in their dialogue and behavior to illustrate their growth and deepening friendship.\n\n- **Language Use**:\n  - Employ vivid and sensory language to create an immersive and atmospheric setting. Describe the Gryffindor common room with phrases like \"the fire crackled softly, casting flickering shadows on the walls,\" to evoke a sense of warmth and intimacy during their conversation.\n  - Use internal monologue and descriptive language to convey Harry's emotions and tensions. Capture his internal struggle with phrases like \"Harry's heart felt heavy, as if the weight of the prophecy was a tangible burden,\" and contrast it with Neville's reassuring words, \"You're not alone, Harry. We face this together.\"\n  - Incorporate playful and humorous language to lighten the tone and enhance the bond between Harry and Neville. Include moments of levity, such as Neville joking about their shared misadventures, to underscore the strength of their friendship and provide relief from the story's emotional weight.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules for the given Writing Prompt, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. Each category provides insights into the author's unique storytelling style, which I will adapt to the prompt about Harry's newfound healing ability. The prompt suggests themes of discovery, power, and the potential consequences of possessing such a gift, which will be woven into the narrative structure, character development, and language style.\n\n**Plot**: The author often structures plots around internal conflict and emotional resolution, with gradual revelations. This can be applied to Harry's internal struggle with his newfound power and the external pressures from the magical world. The narrative should unfold through a series of interactions and introspective moments, rather than a single climactic event.\n\n**Creativity**: The author blends psychological tension and introspection, as well as surreal and emotional realism. This can be used to explore Harry's fears and relationships as he grapples with his ability. The narrative should creatively explore the implications of his power, perhaps through dreamlike sequences or introspective dialogues.\n\n**Development (Character and Setting)**: Characters are developed through nuanced dialogue and introspection. Harry's character can be explored through his interactions with others, such as Neville, and his internal monologue as he processes his ability. The setting of St. Mungo's and other magical locations should be vividly described to enhance the narrative.\n\n**Language Use**: The author employs vivid, sensory language and internal monologue to convey emotions. This can be used to create an immersive atmosphere as Harry navigates the challenges of his power. Playful and humorous language can also be incorporated to lighten the tone when appropriate.\n\nWith these insights, I will create detailed Story Rules that align with the Writing Prompt and reflect the author's style.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:\n  - Structure the plot around Harry's internal conflict with his newfound healing ability and the emotional resolution that follows. Begin with Harry's accidental healing of Neville's parents, leading to a series of interactions with other characters who react to his power. For example, depict a scene where Harry confides in Hermione about his fears, and she offers logical yet empathetic advice, gradually revealing the external support Harry receives.\n  - Develop the narrative through a surreal and introspective journey. Include scenes where Harry experiences dreamlike sequences, such as wandering through a misty forest where he encounters symbolic representations of his fears and hopes, reflecting his internal struggle with the implications of his power.\n  - Use intense dialogue to drive high-stakes confrontations. Create a scene where Harry is confronted by a group of Ministry officials, using sharp, accusatory dialogue to highlight the tension and urgency of the situation, such as, \"Why should we trust a power we don't understand, Potter?\"\n\n- **Creativity**:\n  - Blend elements of psychological tension and character introspection to explore Harry's fears and relationships. Use Harry's internal monologue to delve into his thoughts about the responsibility and potential danger of his ability, adding depth to the narrative.\n  - Integrate surrealism and emotional realism to explore the protagonist's fears. Describe a scene where Harry, in a moment of introspection, imagines a world where his power is both a blessing and a curse, using vivid imagery to convey the surreal nature of his thoughts.\n  - Incorporate humor and whimsy to balance the narrative. Include a light-hearted scene where Harry, Ron, and Hermione discuss the absurdity of Harry's situation over a meal, with Ron jokingly suggesting they start a \"Healing Business\" and Hermione rolling her eyes at the idea.\n\n- **Development (Character and Setting)**:\n  - Develop Harry's character through nuanced dialogue and subtle shifts in behavior. Show Harry's growth as he learns to accept his ability, using interactions with Neville and his family to highlight his empathy and determination to use his power for good.\n  - Use introspection to reveal character complexity. Include moments where Harry reflects on his past experiences and how they shape his current decisions, such as recalling his parents' sacrifices and how they inspire him to help others.\n  - Create immersive settings with vivid descriptions. Describe St. Mungo's as a bustling, yet serene place, with the scent of healing potions in the air and the soft glow of magical lights, enhancing the atmosphere of the narrative.\n\n- **Language Use**:\n  - Employ vivid and sensory language to create an immersive atmosphere. Use phrases like \"the air was thick with anticipation\" and \"the gentle hum of magic filled the room\" to evoke a vivid setting.\n  - Use internal monologue to convey Harry's emotions and tensions. Include thoughts like \"Harry's heart raced as he realized the weight of his gift\" to highlight his internal conflict.\n  - Incorporate playful and humorous language to lighten the tone. Use dialogue such as Ron's exclamation, \"Blimey, Harry, you're like a walking miracle!\" to add humor and warmth to the story.\n</story_rules>"
]