[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a post-apocalyptic setting with themes of loss, hope, and the search for loved ones. The author’s style includes internal conflict, creative narrative techniques, character development through relationships and dialogue, and vivid, introspective language. I will incorporate these elements into the Story Rules, ensuring they are actionable and tailored to the prompt.  \n</thinking>  \n<story_rules>  \n- **Plot**:\n  - Structure the narrative around Jonas's internal conflict, using his memories of past interactions with his family and Martha to create tension between his hope and despair. For example, as Jonas walks through the graveyard, he recalls a moment with Martha where she laughed at his jokes, contrasting it with the silence of the graveyard.\n  - Develop the plot around Jonas's uncertainty about the future. Illustrate his lack of direction by having him pause at a gravestone, unsure if he should continue searching or accept the loss, reflecting, \"Jonas doesn’t know if he’s chasing ghosts or if hope still lingers in the ruins.\"\n  - Introduce interpersonal conflict through Jonas's interactions with other survivors he encounters, who may have differing views on the futility of his search. For instance, a survivor might challenge Jonas, saying, \"Why waste time on the dead when the living need you?\"\n\n- **Creativity**:\n  - Use imagined conversations with deceased loved ones to explore Jonas's emotional state. As he stands by a gravestone, he might hear Martha's voice teasing him about his stubbornness, adding depth to his internal struggle.\n  - Intertwine timelines by having Jonas experience flashbacks of life before the apocalypse, enhancing the narrative's complexity. For example, as he touches a gravestone, he might be transported to a memory of a family picnic, juxtaposing the past's warmth with the present's desolation.\n  - Integrate elements of psychological tension by exploring Jonas's fear of losing hope. Introduce a darker self that questions his sanity, whispering doubts like, \"What if they’re all gone, and you’re just too afraid to admit it?\"\n\n- **Development (Character and Setting)**:\n  - Develop Jonas's character through his relationships and emotional responses to the graveyard's familiar names. Show his personality through memories of shared moments, such as a family dinner where laughter echoed, now replaced by the eerie silence of the graveyard.\n  - Use dialogue and subtle actions to reveal character dynamics. For instance, when Jonas meets another survivor, their conversation might reveal Jonas's desperation and the survivor's skepticism, highlighting their differing perspectives on hope and survival.\n\n- **Language Use**:\n  - Employ vivid imagery and internal monologue to convey Jonas's emotional turmoil and connection to the past. Describe the graveyard with phrases like, \"The gravestones stood like silent sentinels, each name a whisper of a life once vibrant,\" to evoke a sense of loss and longing.\n  - Use introspective and reflective language to explore Jonas's internal struggles. Capture his emotional complexity with thoughts like, \"Jonas wonders if hope is a blessing or a curse, a flicker of light in a world shrouded in darkness.\"\n  - Incorporate casual and conversational language in Jonas's interactions with other survivors to reflect their shared experiences and youthful dynamics. Use phrases like, \"Who’d have thought we’d end up here, huh?\" to create a relatable and engaging tone.\n  - Use dialogue and humor to add a lively element to the narrative, even in a somber setting. For example, Jonas might joke with a fellow survivor about the irony of searching for life among the dead, saying, \"Guess we’re the only ones who didn’t get the memo about the end of the world.\"  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves ghosts trapped in an afterlife setting at a high school, dealing with themes of escape, resentment, dreams, and rule-breaking. I will incorporate the author's style of internal conflict, humor, and complex character dynamics into this supernatural narrative.  \n\nFor **Plot**, I will focus on internal and interpersonal conflicts, using the ghosts' past memories and unresolved issues to drive the narrative. For **Creativity**, I will integrate imagined conversations and intertwine timelines to enhance the supernatural elements. In **Development (Character and Setting)**, I will emphasize relationships and emotional responses, using dialogue to reveal character dynamics. For **Language Use**, I will employ vivid imagery and introspective language to convey the ghosts' emotional turmoil and connection to their past lives.  \n\nThese elements will be tailored to the Writing Prompt, ensuring the narrative captures the essence of being trapped in the afterlife and the complexities of attempting to escape.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:  \n  - Structure the narrative around the ghosts' internal conflicts and their unresolved issues from their high school days. Use past memories to create tension between their current state and their past lives. For example, a ghost might reflect, \"I had the popularity I always wanted, but now I can't even leave this hallway.\"  \n  - Develop the plot around interpersonal conflicts and rivalries among the ghosts. Highlight how old resentments resurface when one ghost escapes, such as a scene where a ghost accuses another, \"You always thought you were better than us, and now you think you can just leave us behind?\"  \n  - Incorporate a subplot involving humor and family-like interactions among the ghosts to explore their shared experiences in the afterlife. Include scenes where they reminisce about high school pranks or events, adding a light-hearted tone to the narrative.  \n\n- **Creativity**:  \n  - Use imagined conversations with living characters or other ghosts to explore the protagonist's emotional state and unresolved feelings. For instance, a ghost might hear their old teacher's voice, advising them on how to move on, adding complexity to their emotional journey.  \n  - Intertwine timelines by shifting between the ghosts' past high school experiences and their current afterlife existence, enhancing the narrative's complexity. For example, a ghost might suddenly find themselves back in a classroom, reliving a pivotal moment.  \n  - Integrate elements of psychological tension and duality, using the concept of a darker self to explore the protagonist's fears about breaking the rules to escape. A ghost might fear, \"What if escaping means losing who I am?\"  \n\n- **Development (Character and Setting)**:  \n  - Develop characters through their relationships and shared memories of high school. Use scenes where they discuss past events, revealing their personalities and dynamics. For example, two ghosts might argue about a prom night incident, showcasing their unresolved issues.  \n  - Use dialogue and subtle actions to reveal character dynamics. For instance, a ghost might casually mention, \"Remember when we thought we'd be friends forever?\" highlighting the irony of their current situation.  \n  - Create a vivid setting of the high school in the afterlife, using familiar locations like the gym or cafeteria to evoke nostalgia and a sense of entrapment.  \n\n- **Language Use**:  \n  - Employ vivid imagery and internal monologue to convey the ghosts' emotional turmoil and connection to their past. Use phrases like, \"The echoes of laughter still haunt these halls, a reminder of what we once had.\"  \n  - Use introspective and reflective language to explore the ghosts' internal struggles and emotional complexity. For example, a ghost might ponder, \"We were supposed to move on, but what if this is all there is?\"  \n  - Incorporate casual and conversational language to reflect the youthful dynamics of the ghosts, capturing their informal interactions. Use lines like, \"Whose bright idea was it to haunt a high school, anyway?\"  \n  - Use dialogue and humor to create an engaging and lively narrative. Include playful banter among the ghosts, such as, \"If we can't leave, at least we can still prank the living.\"  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a supernatural mystery with emotional depth, requiring a blend of internal conflict, creative narrative techniques, and vivid language. The author’s style emphasizes internal and interpersonal conflicts, creative use of timelines and imagined conversations, character development through relationships and dialogue, and a mix of vivid, introspective, and humorous language. I will incorporate these elements into the Story Rules, ensuring they are tailored to the prompt's themes of haunting, mystery, and emotional resolution.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:\n  - Structure the narrative around Simon's internal conflict, using his memories of Maddie and his current experiences to create tension between his disbelief and the chilling reality of her ghostly presence. For example, depict Simon recalling a moment when Maddie laughed at his skepticism about ghosts, now juxtaposed with his fear of her spectral form.\n  - Develop the plot through Simon's uncertainty and gradual acceptance of the supernatural, mirroring his journey from skepticism to belief. Illustrate this with a scene where Simon hesitates before entering the school at night, reflecting on his fear of what he might find.\n  - Integrate interpersonal conflict by introducing a rival student who dismisses Simon's claims, creating tension and rivalry as Simon seeks allies in uncovering the school's secrets. For instance, show a heated exchange where the rival mocks Simon's ghost stories, only to be silenced by an unexplained phenomenon.\n  - Use family interactions and humor to provide relief and depth, such as Simon's sibling teasing him about his ghost obsession, only to later join him in a light-hearted ghost-hunting expedition.\n\n- **Creativity**:\n  - Use imagined conversations with Maddie to explore Simon's emotional state and unresolved feelings, adding complexity to his journey. For example, have Simon hear Maddie's voice guiding him through the school's dark corridors, offering both comfort and urgency.\n  - Intertwine timelines by revealing past events through Simon's visions or dreams, enhancing the narrative's complexity. Create a scene where Simon experiences a vivid dream of the school's past, witnessing the tragedy that led to the hauntings.\n  - Integrate elements of psychological tension and duality by exploring Simon's fear of losing his grip on reality, using the concept of a darker self that doubts his sanity. Illustrate this with Simon questioning whether his mind is playing tricks or if the ghosts are truly real.\n  - Incorporate Simon's school life and relationships to add complexity, such as his interactions with teachers and friends who either support or challenge his quest. Show a teacher who unknowingly holds a key piece of the mystery, revealed through casual conversation.\n\n- **Development (Character and Setting)**:\n  - Develop Simon's character through his relationships and emotional responses to shared memories with Maddie. For instance, depict a scene where Simon finds an old photo of them together, triggering a flood of emotions and determination to help her.\n  - Use dialogue and subtle actions to reveal character dynamics, such as Simon's growing bond with a fellow student who believes in his quest. Show their camaraderie through shared jokes and whispered plans during class.\n  - Create a vivid setting by describing the school's eerie atmosphere, using sensory details to evoke a sense of mystery and unease. For example, describe the creaking floors, flickering lights, and cold drafts that hint at the school's haunted past.\n\n- **Language Use**:\n  - Employ vivid imagery and internal monologue to convey Simon's emotional turmoil and connection to Maddie. Use phrases like \"Maddie's laughter echoed in Simon's mind, a haunting melody that both comforted and chilled him.\"\n  - Use introspective and reflective language to explore Simon's internal struggles and emotional complexity. Include thoughts like, \"Simon never imagined he'd be chasing ghosts, yet here he was, caught between fear and a desperate need for answers.\"\n  - Use casual and conversational language to reflect the youthful dynamics of Simon and his peers. Capture their interactions with phrases like, \"Who knew ghost hunting could be this complicated?\" to maintain a relatable tone.\n  - Integrate dialogue and humor to create an engaging narrative, such as Simon joking with friends about starting a ghost-busting club, adding levity to the otherwise tense atmosphere.  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a ghost trapped in a high school, dealing with themes of deception, fear of abandonment, and the supernatural. The author's style includes internal and interpersonal conflict, creative use of timelines and humor, character development through relationships and dialogue, and vivid, introspective language. I will incorporate these elements into the Story Rules, ensuring they are actionable and tailored to the prompt.  \n</thinking>  \n<story_rules>  \n- **Plot**:\n  - Structure the narrative around the protagonist ghost's internal conflict, focusing on their fear of abandonment and the lies they've told to other spirits. Use past memories of their life and death to create tension between their desire for companionship and the inevitability of being left behind. For example, have the ghost reflect, \"I told them the light was a trap, but really, I just couldn't bear the thought of being alone again.\"\n  - Develop the plot through interpersonal conflict among the spirits, highlighting rivalries and alliances as they begin to uncover the truth. Include scenes where a spirit confronts the protagonist, saying, \"You knew all along, didn't you? You kept us here for yourself.\"\n  - Incorporate humor and family-like interactions among the spirits to explore their relationships and the protagonist's attempts to maintain control. For instance, include a scene where a spirit jokes about the protagonist's outdated fashion sense, adding levity to the tension.\n\n- **Creativity**:\n  - Use imagined conversations with a deceased friend or mentor to explore the protagonist's unresolved feelings and fears about moving on. For example, the protagonist might hear a familiar voice saying, \"You can't keep them here forever, you know.\"\n  - Creatively intertwine timelines by having the protagonist experience flashbacks to their life and death, enhancing the narrative's complexity and their emotional journey. Include a scene where the protagonist watches a memory of their last day alive, feeling the weight of unfinished business.\n  - Integrate elements of psychological tension by exploring the protagonist's darker self, perhaps manifesting as a shadowy figure that taunts them about their lies. Use this to delve into their fears of being forgotten and alone.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist and other spirits through their relationships and shared memories of the high school. Use dialogue and subtle actions to reveal their personalities and dynamics. For example, show a spirit reminiscing about a school dance, revealing their longing for the past.\n  - Create a vivid setting by describing the high school in detail, capturing its eerie, timeless atmosphere. Use sensory details to evoke the feeling of being trapped in a place that never changes, such as the sound of lockers slamming or the smell of old textbooks.\n\n- **Language Use**:\n  - Employ vivid imagery and internal monologue to convey the protagonist's emotional turmoil and connection to the past. Use phrases like, \"The halls echoed with laughter that only I could hear, a reminder of the life I once had.\"\n  - Use introspective and reflective language to explore the protagonist's internal struggles and emotional complexity. Include thoughts like, \"I never wanted to be alone, but maybe it's time to let go.\"\n  - Incorporate casual and conversational language in the dialogue between spirits to reflect their youthful dynamics and create an engaging narrative. Use lines like, \"Seriously, who died and made you boss?\" to capture the informal tone.\n  - Use humor and irony to enhance the narrative, such as a spirit sarcastically commenting on the protagonist's leadership, \"Oh great, another ghost meeting. Can't wait to hear more lies.\"  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a young boy in a perpetually wintry town attempting to bring back Christmas, despite the townsfolk's division. This scenario suggests themes of internal and external conflict, community dynamics, and a blend of whimsical and serious tones. I will incorporate these elements into the Story Rules, ensuring they reflect the author's unique storytelling style as described in the Author Writing Sheet.  \n</thinking>  \n<story_rules>  \n- **Plot**:\n  - Structure the narrative around the protagonist's internal conflict and determination to bring back Christmas, using his memories of past holidays and the current state of the town to create tension. For example, the boy might reflect, \"He remembered the warmth of Christmas lights, but now the town felt colder than ever, even with the snow.\"\n  - Develop the plot around interpersonal conflict and rivalry among the townsfolk, highlighting their differing opinions on the holiday's return. Illustrate this through scenes where townspeople argue over the boy's plans, such as a neighbor saying, \"Why should we bother with Christmas when it only brings false hope?\"\n  - Use family interactions and humor to explore the boy's journey, perhaps through his interactions with a quirky relative who supports his mission. Include light-hearted moments, like the boy's grandmother joking about how she used to make snowmen with \"carrot noses and button eyes that scared the crows away.\"\n\n- **Creativity**:\n  - Integrate imagined conversations with a deceased character, such as the boy's late grandfather, to explore his emotional state and resolve. The boy might hear his grandfather's voice encouraging him, \"Remember, lad, Christmas is about bringing light to the darkest days.\"\n  - Creatively intertwine timelines by having the boy discover old letters or photos that reveal past Christmas celebrations, enhancing the narrative's depth and connection to the town's history.\n  - Use elements of psychological tension and duality, perhaps through the boy's fear of failing to unite the town, represented by a darker version of himself whispering doubts like, \"What if they never believe in Christmas again?\"\n\n- **Development (Character and Setting)**:\n  - Develop characters through their relationships and shared memories of past Christmases, showing how these experiences shape their current attitudes. For instance, a character might reminisce, \"I remember when the whole town would gather for the tree lighting, but now we barely speak to each other.\"\n  - Use dialogue and subtle actions to reveal character dynamics, such as a scene where the boy's friend hesitantly supports his plan, saying, \"I guess it wouldn't hurt to try, but don't expect everyone to join in.\"\n\n- **Language Use**:\n  - Employ vivid imagery and internal monologue to convey the boy's emotional turmoil and connection to the past. Use phrases like, \"The snowflakes danced like ghosts of forgotten Christmases, whispering secrets of joy and warmth.\"\n  - Use introspective and reflective language to explore the boy's internal struggles, such as his thoughts on the town's resistance: \"He wondered if the town had forgotten how to hope, or if they were just too afraid to try.\"\n  - Incorporate casual and conversational language to reflect the youthful dynamics of the boy and his peers, using phrases like, \"Who knew bringing back Christmas would be such a big deal?\"\n  - Use dialogue and humor to create an engaging narrative, with lines like, \"If we can't have Christmas, at least we can have a snowball fight,\" adding a playful tone to the boy's interactions with his friends.  \n</story_rules>"
]