[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a daily routine between Will Solace and Nico di Angelo, which is humorously disrupted by a suggestion from Nico. The author's style emphasizes humor, emotional connections, and playful interactions, which will be crucial in crafting the Story Rules. I will ensure the rules incorporate these elements while tailoring them to the narrative potential of the prompt.  \n</thinking>  \n<story_rules>  \n- **Plot**:\n  - Structure the plot around humorous and lighthearted interactions between Will and Nico. Begin the story with a typical morning scene filled with laughter and playful banter, such as Will teasing Nico about his bedhead or Nico joking about Will's morning breath.\n  - Focus the narrative on intimate, personal moments that highlight the emotional connection between the characters. For example, describe a cozy morning scene where they share a quiet moment over coffee, emphasizing their comfort and familiarity with each other.\n  - Introduce a pivotal moment where Nico suggests a change to their routine. This suggestion should be unexpected yet fitting within their dynamic, such as proposing they start a morning dance-off to get out of bed, leading to a humorous and chaotic scene.\n\n- **Creativity**:\n  - Use humor and irony to reinterpret the prompt, focusing on exaggerated character reactions. For instance, when Nico suggests the change, have Will respond with mock horror, saying something like, \"You want me to dance before coffee? Are you trying to kill me?\"\n  - Employ a stream-of-consciousness style to convey Will's internal thoughts as he processes Nico's suggestion. Capture his initial confusion and eventual amusement, reflecting on how this change might affect their mornings.\n  - Incorporate modern cultural references to add a light-hearted tone. For example, have Nico reference a popular dance trend or meme as part of his suggestion, adding a layer of contemporary humor to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop characters through playful banter and mutual teasing. Highlight their relationship dynamics by showing how they communicate through jokes and light-hearted insults, such as Nico calling Will a \"morning zombie\" and Will retorting with a playful jab about Nico's \"vampire-like\" sleep habits.\n  - Use their interactions and dialogue to create a sense of familiarity and depth. Describe how they move around their shared space with ease, finishing each other's sentences or anticipating each other's needs, like Will automatically handing Nico his favorite mug.\n  - Highlight subtle changes in their routine to emphasize the impact of Nico's suggestion. Show how this new element brings them closer, perhaps by illustrating how they laugh more or find new ways to connect through the shared experience.\n\n- **Language Use**:\n  - Employ playful and informal language to maintain a comedic tone. Use phrases that capture the light-hearted nature of their mornings, such as \"Will groaned dramatically, flopping back onto the pillows like a defeated hero.\"\n  - Use vivid and sensory language to create an immersive atmosphere. Describe the morning light filtering through the curtains, the warmth of their shared bed, and the aroma of freshly brewed coffee to set the scene.\n  - Use repetitive and reflective language to emphasize Will's initial resistance and eventual acceptance of the change. Have him internally repeat phrases like, \"This is madness,\" followed by, \"But maybe madness is exactly what we need,\" to capture his evolving perspective.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a discovery of candid photos, which can be explored through humorous and intimate interactions, a hallmark of the author's style. The rules will incorporate playful banter, emotional connections, and vivid language to create a lighthearted yet meaningful narrative.  \n\nFor **Plot**, the story should revolve around humorous and intimate interactions, focusing on the emotional connection between the protagonist and their partner. The discovery of the photos can be a catalyst for both humor and deeper emotional exploration.\n\nIn **Creativity**, humor and irony should be used to reinterpret the prompt, with exaggerated reactions to the discovery of the photos. The narrative can include modern cultural references and a stream-of-consciousness style to convey the protagonist's internal thoughts.\n\nFor **Development (Character and Setting)**, character dynamics should be highlighted through playful banter and mutual teasing. The setting should be described in a way that enhances the emotional atmosphere, using subtle actions to show the depth of the relationship.\n\nIn **Language Use**, playful and informal language should create a comedic tone, while vivid and sensory descriptions immerse the reader in the emotional atmosphere. Repetitive and reflective language can emphasize the protagonist's surprise and introspection upon discovering the photos.\n\nThese elements will be tailored to the Writing Prompt, ensuring the story is both engaging and true to the author's style.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:  \n  - Structure the plot around the humorous and lighthearted discovery of the candid photos. Begin with a playful interaction where the partner casually mentions the open phone policy, leading to the protagonist's surprise at finding the photos. For example, have the protagonist jokingly accuse their partner of being a \"secret paparazzo,\" prompting laughter and a playful argument about the best candid shot.  \n  - Focus on intimate, personal moments that highlight the emotional connection between the protagonist and their partner. Use the photos as a narrative device to explore these moments, such as a photo capturing a quiet moment of the protagonist reading, which leads to a discussion about why the partner found it special.  \n\n- **Creativity**:  \n  - Use humor and irony to reinterpret the prompt, focusing on exaggerated reactions to the discovery. For instance, the protagonist might dramatically gasp and say, \"I knew you were up to something with all those sneaky smiles!\"  \n  - Incorporate a stream-of-consciousness style to convey the protagonist's internal thoughts as they scroll through the photos, reflecting on each moment's unexpected significance. Include thoughts like, \"I never realized how much joy a simple cup of coffee could bring until I saw it through your eyes.\"  \n  - Add modern cultural references to enhance the light-hearted tone, such as comparing the candid shots to a \"behind-the-scenes Instagram story\" that captures the essence of their relationship.  \n\n- **Development (Character and Setting)**:  \n  - Develop characters through playful banter and mutual teasing, emphasizing their relationship dynamics. For example, have the partner tease the protagonist about their \"serious face\" in one of the photos, leading to a mock debate about their photogenic qualities.  \n  - Highlight the setting with vivid descriptions that enhance the emotional atmosphere. Describe the room where the discovery takes place with sensory details, like \"the soft glow of the evening sun filtering through the curtains, casting a warm, golden hue over the room.\"  \n  - Use subtle actions to show the depth of the relationship, such as the partner gently brushing a stray hair from the protagonist's face as they discuss the photos, indicating affection and familiarity.  \n\n- **Language Use**:  \n  - Employ playful and informal language to create a comedic tone. Use phrases like \"You caught me in my natural habitat!\" or \"I can't believe you captured my 'thinking face'—it's a rare sight!\" to add humor to the narrative.  \n  - Use vivid and sensory language to create an immersive atmosphere. Describe the photos with details like \"the candid shot of me laughing, eyes crinkled, with the sun setting behind me, painting the sky in hues of pink and orange.\"  \n  - Use repetitive and reflective language to emphasize the protagonist's surprise and introspection. Include lines like, \"I never knew you saw me like this. I never knew these moments mattered so much.\"  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The author's style is characterized by humorous and lighthearted interactions, intimate personal moments, creative use of humor and irony, stream-of-consciousness for emotional depth, playful banter, and vivid language. I will tailor these elements to the prompt about a mischievous makeup artist and their partner, focusing on humor, character dynamics, and a playful tone.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:\n  - Structure the plot around humorous and lighthearted interactions between the makeup artist and their partner. Begin with the artist playfully convincing their partner to participate in the video, using witty banter and teasing. For example, have the artist say, \"Come on, it'll be fun! You can be my canvas, and I'll make you a masterpiece—or at least a meme.\"\n  - Focus the narrative on intimate, personal moments that highlight the emotional connection between the characters. After the transformation is revealed, include a scene where they share a genuine laugh, perhaps over the partner's exaggerated reaction to their new look, like, \"I look like a disco ball had a baby with a clown!\"\n\n- **Creativity**:\n  - Use humor and irony to reinterpret the prompt, focusing on exaggerated character reactions and the playful aspects of their relationship. For instance, the partner might dramatically gasp and say, \"I can't believe you turned me into a walking art exhibit!\"\n  - Incorporate a stream-of-consciousness style to convey the partner's internal struggle and emotional turmoil as they process their unexpected transformation. Use thoughts like, \"I can't believe I let them do this. But their smile... it's worth it, right? Or am I just a fool in glitter?\"\n  - Add modern cultural references to enhance the light-hearted tone. Mention something like, \"This is going viral faster than a cat video on TikTok!\"\n\n- **Development (Character and Setting)**:\n  - Develop characters through playful banter and mutual teasing, emphasizing their relationship dynamics. Have the makeup artist tease, \"You always said you wanted to try something new. Well, here it is!\" and the partner retort with a grin, \"I didn't mean becoming a human rainbow!\"\n  - Highlight the characters' relationship through their interactions and dialogue, creating a sense of familiarity and depth. Show the partner's initial reluctance melting away as they see the artist's enthusiasm, saying, \"Okay, okay, I admit it. You got me. But only because you look so happy.\"\n  - Use subtle actions to show the partner's growing acceptance of the situation, like them adjusting their new look in the mirror with a resigned smile.\n\n- **Language Use**:\n  - Employ playful and informal language to maintain a comedic tone throughout the story. Use phrases like, \"The room erupted in laughter as the partner struck a pose, their face a canvas of chaos and color.\"\n  - Use vivid and sensory language to create an immersive atmosphere, especially when describing the transformation. Describe the makeup as \"a riot of colors, each shade more outrageous than the last, shimmering under the lights like a kaleidoscope.\"\n  - Use repetitive and reflective language to emphasize the partner's initial confusion and eventual acceptance. Include lines like, \"I can't believe this is me. I can't believe I let this happen. But maybe... just maybe, it's not so bad after all.\"  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves Nico encountering a boy from the future who claims to be his future boyfriend, which suggests themes of time travel, romance, and humor. The author's style is characterized by humorous interactions, emotional connections, playful banter, and vivid language. I will incorporate these elements into the Story Rules, ensuring they are actionable and tailored to the prompt.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the plot around humorous and lighthearted interactions between Nico and the freckled boy. For example, have them laugh about the absurdity of time travel, with the boy jokingly saying, \"I promise I'm not here to mess up your timeline, just your heart.\"\n  - Focus the narrative on intimate, personal moments that highlight the emotional connection between Nico and the boy. Include scenes where they share stories about their lives, creating a cozy atmosphere amidst the chaos of the Labyrinth.\n\n- **Creativity**:\n  - Use humor and irony to reinterpret the prompt, focusing on exaggerated reactions to the concept of a future boyfriend. For instance, Nico might sarcastically remark, \"Great, now I have to worry about future me's love life too?\"\n  - Employ a stream-of-consciousness style to convey Nico's internal struggle with the idea of destiny and romance. Capture his thoughts as he processes the boy's claims, such as, \"Is this real? Am I really destined to fall for this freckled time traveler?\"\n  - Incorporate modern cultural references to add a light-hearted tone. Perhaps the boy mentions future pop culture phenomena, leaving Nico both amused and confused.\n\n- **Development (Character and Setting)**:\n  - Develop characters through playful banter and mutual teasing. Have Nico and the boy engage in witty exchanges, like Nico teasing, \"So, do future boyfriends come with a warranty?\"\n  - Highlight their relationship dynamics through interactions and dialogue, creating a sense of familiarity and depth. Show the boy's attempts to prove his claims with small, personal details about Nico's life that only a close partner would know.\n  - Use subtle actions and changes in routine to highlight the growing bond between them. For example, depict moments where Nico starts to trust the boy, like sharing a secret or relying on him during a Labyrinth challenge.\n\n- **Language Use**:\n  - Employ playful and informal language to maintain a comedic tone. Use phrases like \"Nico was both intrigued and exasperated, his mind a whirlwind of 'what ifs' and 'why nots.'\"\n  - Use vivid and sensory language to create an immersive atmosphere within the Labyrinth. Describe the setting with phrases like \"The Labyrinth's walls shimmered with an eerie glow, casting long shadows that danced with every flicker of torchlight.\"\n  - Use repetitive and reflective language to emphasize Nico's confusion and curiosity about the boy's claims. Have Nico internally repeat questions like, \"Why me? Why now? Why him?\" to convey his inner turmoil.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves Will and Nico, characters who have survived Tartarus, finding solace in a quiet, intimate moment. The story should focus on their emotional connection, using humor and lighthearted interactions to highlight their relationship dynamics. The narrative should incorporate playful banter, vivid sensory language, and a stream-of-consciousness style to convey internal struggles. The setting should be immersive, with a focus on the emotional atmosphere of the scene.  \n\n**Plot**: The plot should revolve around intimate, personal moments, using humor to highlight character dynamics. The narrative should focus on the emotional connection between Will and Nico as they dance in the kitchen, using lighthearted interactions to explore their relationship.\n\n**Creativity**: The story should creatively reinterpret the prompt by using humor and irony, focusing on exaggerated character reactions and playful aspects of their relationship. The narrative should include modern cultural references and a stream-of-consciousness style to convey the characters' internal struggles.\n\n**Development (Character and Setting)**: Characters should be developed through playful banter and mutual teasing, emphasizing their relationship dynamics. The setting should be described with vivid sensory language to create an immersive and emotional atmosphere.\n\n**Language Use**: The language should be playful and informal, creating a lighthearted and comedic tone. Vivid and sensory language should be used to create an immersive atmosphere, while repetitive and reflective language can emphasize the characters' emotional struggles.\n\nUsing these insights, I will craft detailed Story Rules that guide the language model in creating a narrative that aligns with the Writing Prompt and the author's unique style.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:  \n  - Structure the plot around the intimate, personal moment of Will and Nico dancing in the kitchen. Use humor to highlight their character dynamics, such as incorporating playful dialogue about their dancing skills or lack thereof. For example, have Nico jokingly complain about Will stepping on his toes, leading to a lighthearted exchange that reveals their deep bond.\n  - Focus on the emotional connection between Will and Nico, using the dance as a metaphor for their journey from the horrors of Tartarus to finding peace in each other's presence. Include moments where they share quiet laughter or tender glances, emphasizing the comfort they find in each other.\n\n- **Creativity**:  \n  - Use humor and irony to reinterpret the prompt, focusing on exaggerated character reactions. For instance, have Will make a humorous comment about their dance moves being more suited for a monster battle than a romantic moment, which Nico counters with a playful retort.\n  - Incorporate modern cultural references to add a light-hearted tone. For example, mention a song playing in the background that is a favorite of theirs, perhaps something unexpected like a pop song that contrasts with their serious past, adding depth to their shared history.\n  - Employ a stream-of-consciousness style to convey Nico's internal struggle as he reflects on their past and the solace he finds in the present moment with Will.\n\n- **Development (Character and Setting)**:  \n  - Develop Will and Nico's characters through playful banter and mutual teasing during their dance. Highlight their relationship dynamics by showing how they communicate through subtle gestures and shared jokes, such as Will teasing Nico about his serious demeanor and Nico responding with a rare smile.\n  - Describe the kitchen setting with vivid sensory language to create an immersive atmosphere. Use phrases like \"the soft glow of the kitchen lights casting gentle shadows\" and \"the faint aroma of chamomile tea lingering in the air\" to evoke a serene and comforting environment.\n  - Highlight the emotional distance they have overcome by subtly contrasting their current closeness with past moments of isolation, using their dance as a symbol of their renewed connection.\n\n- **Language Use**:  \n  - Employ playful and informal language to create a lighthearted and comedic tone. Use phrases like \"Nico's laughter bubbled up, a rare sound that filled the kitchen with warmth\" to convey the joy of the moment.\n  - Use vivid and sensory language to create an immersive atmosphere. Describe the music as \"a gentle melody that wrapped around them like a comforting embrace,\" enhancing the emotional depth of the scene.\n  - Incorporate repetitive and reflective language to emphasize Nico's emotional journey, such as \"He held onto Will, feeling the weight of their past slip away with each step, each turn, each shared breath.\"  \n</story_rules>"
]