[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a haunted school setting with chaotic students and a curious supply teacher, which offers opportunities for humor, whimsical adventure, and character-driven interactions. The author’s style emphasizes quick resolutions, character interactions, humor, and vivid dialogue, which will be integrated into the Story Rules.  \n\n1. **Plot**: The author favors simple, whimsical adventures with quick resolutions and character-driven plots. For the prompt, the plot should focus on the supply teacher's interactions with the ghost and students, resolving conflicts swiftly, such as the teacher discovering the truth about the camel rumors or finding a way to appease the ghost.\n\n2. **Creativity**: The author uses humor and whimsy, often blending logical and fantastical elements. The story should incorporate humorous interpretations of the ghost and camel rumors, perhaps with the ghost offering comedic insights or the camel being a metaphorical or literal presence.\n\n3. **Development (Character and Setting)**: Characters are developed through witty dialogue and interactions, with settings enhancing the story's tone. The staff room and school should be depicted as chaotic yet charming, with the ghost and students providing opportunities for humorous and insightful exchanges.\n\n4. **Language Use**: The author employs a humorous tone and vivid dialogue. The story should use playful language to convey the chaos and humor of the situation, with the ghost and students providing opportunities for comedic dialogue and interactions.\n\nThese insights will guide the creation of detailed, actionable Story Rules tailored to the Writing Prompt.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the story around the supply teacher's whimsical adventure in the haunted staff room. Begin with the teacher's arrival and immediate encounter with the ghost, leading to humorous interactions with the students. For example, have the ghost appear while the teacher is trying to calm a chaotic classroom, leading to a comedic misunderstanding.\n  - Resolve conflicts swiftly and decisively. If the ghost causes a disruption, have the teacher quickly devise a plan to appease it, such as offering it a favorite book from the library. Use direct actions, like the teacher saying, \"Let's settle this with a story,\" and immediately reading aloud to calm both the ghost and students.\n  - Focus the plot on character interactions rather than action sequences. Highlight the teacher's exchanges with the ghost and students, such as a humorous debate about the camel rumors, rather than focusing on physical chaos.\n\n- **Creativity**:\n  - Use humor to reinterpret the prompt in a lighthearted manner. Introduce the ghost as a former headmaster with a penchant for dramatic entrances, like appearing with a gust of wind that scatters papers, leading to a playful chase around the staff room.\n  - Blend elements of whimsy and logic. Have the ghost offer logical yet whimsical advice to the teacher, such as suggesting that the camel rumors are a metaphor for the school's wild spirit, or perhaps hinting at a hidden camel-themed art project.\n  - Incorporate imaginative elements by personifying the ghost with relatable, human-like traits. Give the ghost a quirky habit, like rearranging the staff room furniture to its liking, which the teacher must humorously navigate.\n\n- **Development (Character and Setting)**:\n  - Develop characters through witty dialogue and interactions. Use exchanges between the teacher and ghost to reveal their personalities, such as the ghost teasing the teacher about modern teaching methods, prompting the teacher to retort with, \"Well, at least I don't haunt my old office.\"\n  - Establish an immersive setting that enhances the story's intimate and magical tone. Describe the staff room as a cozy yet chaotic space, with the ghost's presence adding a layer of enchantment, like flickering lights and mysteriously rearranged books.\n  - Develop the students' characters through their reactions to the ghost and camel rumors, highlighting their playful and curious nature. Show them eagerly participating in the ghost's antics or concocting wild theories about the camel.\n\n- **Language Use**:\n  - Employ a humorous and light-hearted tone through dialogue and playful language. Use phrases like \"The ghost floated in with all the grace of a misplaced breeze,\" or \"The students were a whirlwind of giggles and whispers, like a living rumor mill.\"\n  - Use dialogue to convey characters' emotions and establish a sense of urgency. Have the teacher exclaim, \"If we don't settle this ghost business, we'll never get through the lesson!\" to convey both humor and urgency.\n  - Employ descriptive language and dialogue to create a vivid and engaging narrative. Describe the ghost's interactions with phrases like \"The ghost hovered, a spectral grin playing on its translucent lips,\" to vividly convey its playful nature.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves Sherlock Holmes and John Watson at a seaside attraction, which suggests a whimsical and potentially humorous narrative. The author's style emphasizes quick resolutions, character-driven plots, humor, and vivid character interactions. I will incorporate these elements into the Story Rules, ensuring they are actionable and tailored to the prompt.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:\n  - Structure the story around a simple, whimsical adventure at the seaside attraction. Begin with Sherlock and John arriving at the attraction, quickly moving to their interactions with the quirky characters, such as the grumpy Punch and Judy operator. Resolve the mystery of the missing flags swiftly, perhaps through a humorous misunderstanding or a clever deduction by Sherlock, ensuring the resolution is decisive and satisfying.\n  - Focus the plot on character interactions rather than action sequences. Highlight the humorous exchanges between Sherlock, John, and the seaside staff, such as playful banter about the donkeys or the eccentricities of the Punch and Judy show. Use these interactions to drive the narrative forward.\n  - Incorporate a sequence of events that reveal deeper insights into the characters or the setting, such as Sherlock's observations about the sandcastles or John's attempts to mediate between the grumpy operator and the visitors, leading to the resolution of the flag mystery.\n\n- **Creativity**:\n  - Use humor to reinterpret the seaside setting in a lighthearted manner. Include comedic elements like Sherlock's bemusement at the seaside attractions or John's attempts to ride a donkey, adding a whimsical twist to the scenario.\n  - Blend elements of whimsy and logic to reinterpret the prompt. Have Sherlock muse about the peculiarities of the seaside attraction, perhaps comparing it to a scene from a Lewis Carroll story, highlighting the blend of reality and fantasy.\n  - Incorporate imaginative elements by personifying the donkeys or giving them a relatable, human-like perspective, such as a donkey that seems to have a particular fondness for John, adding a layer of creativity to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop characters through witty dialogue and interactions. Use Sherlock's sarcastic remarks and John's good-natured responses to reveal their personalities and relationship dynamics. For example, Sherlock might quip about the absurdity of the missing flags, while John tries to keep the peace.\n  - Establish an immersive setting that enhances the story's whimsical tone. Describe the seaside attraction with vivid details, such as the colorful sandcastles, the braying donkeys, and the bustling atmosphere, creating a lively and enchanting backdrop for the narrative.\n  - Develop the grumpy Punch and Judy operator's character through his interactions with Sherlock and John, highlighting his gruff exterior but perhaps revealing a softer side as the mystery unfolds.\n\n- **Language Use**:\n  - Employ a humorous and light-hearted tone through dialogue and playful language. Use phrases like \"I think I'd be far better suited to building sandcastles\" or \"These donkeys aren't known for their patience,\" contributing to a comedic tone.\n  - Use direct and confrontational dialogue to convey tension and character relationships. For instance, have the Punch and Judy operator grumble, \"If you two think you can solve this mystery, be my guest,\" to establish his skeptical attitude.\n  - Employ descriptive language and dialogue to create a vivid and engaging narrative, emphasizing the characters' interactions and emotions. Use phrases like \"Sherlock's eyes twinkled with amusement\" or \"John's laughter echoed across the beach,\" vividly conveying the story's atmosphere and character dynamics.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a humorous clash between a strict new curate and a village choir, which suggests a lighthearted and character-driven narrative. The author's style emphasizes whimsical adventures, swift conflict resolution, character interactions, humor, and vivid dialogue. I will incorporate these elements into the Story Rules, ensuring they are actionable and tailored to the prompt.\n\n**Plot**: The author structures stories around simple, whimsical adventures with a focus on character interactions and swift resolutions. For the prompt, the plot should center on the curate's attempts to impose his musical vision, leading to humorous interactions with the choir members. The resolution should be quick and satisfying, perhaps with the curate finding a way to appreciate the choir's unique style.\n\n**Creativity**: The author uses humor and whimsy to reinterpret prompts. The story should creatively highlight the contrast between the curate's high standards and the choir's laid-back approach, using humorous situations and dialogue to emphasize this clash.\n\n**Development (Character and Setting)**: Characters are developed through witty dialogue and interactions. The curate's strictness and the choir's casual nature should be revealed through their exchanges. The setting of a small village should enhance the intimate and comedic tone, perhaps with quirky details about the choir's rehearsal space.\n\n**Language Use**: The author employs a humorous and light-hearted tone through dialogue. The story should use playful language and dialogue to convey the comedic tension between the curate and the choir, ensuring the tone remains light and engaging.\n\nWith these insights, I will craft detailed Story Rules that guide the narrative to reflect the author's style while aligning with the Writing Prompt.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:  \n  - Structure the story around the curate's first rehearsal with the choir, focusing on his ambitious plans clashing with the choir's relaxed style. Begin with the curate introducing his vision, such as, \"We shall perform Handel's Messiah by Christmas,\" and the choir's bemused reactions.  \n  - Resolve conflicts swiftly by having the curate adapt to the choir's unique approach, perhaps by the end of the rehearsal. For example, after a series of humorous mishaps, the curate might say, \"Perhaps a medley of village favorites is more our style,\" leading to a harmonious conclusion.  \n  - Focus on character interactions rather than action sequences. Highlight the humorous exchanges between the curate and choir members, such as a soprano insisting, \"We always sing with a cup of tea in hand,\" to emphasize the character-driven plot.\n\n- **Creativity**:  \n  - Use humor to reinterpret the prompt by exaggerating the curate's musical ambitions and the choir's unconventional methods. For instance, the curate might attempt to introduce complex harmonies, only for the choir to respond with a cacophony of off-key notes.  \n  - Blend whimsy and logic by having the curate try to logically explain musical theory, only for the choir to respond with whimsical interpretations, like mistaking \"crescendo\" for \"crescents,\" leading to a discussion about pastries.  \n  - Incorporate imaginative elements by personifying the choir's rehearsal space, perhaps describing the old church hall as having \"walls that seemed to hum along with the choir's unique melody.\"\n\n- **Development (Character and Setting)**:  \n  - Develop characters through witty dialogue and contrasting viewpoints. The curate's strictness can be shown through lines like, \"Precision is key,\" while a choir member might retort, \"We prefer to sing from the heart, not the sheet.\"  \n  - Establish the village setting as cozy and intimate, enhancing the comedic tone. Describe the rehearsal space with details like \"pews that creaked in rhythm with the choir's steps\" to create an immersive atmosphere.  \n  - Highlight the choir's personalities through their reactions to the curate's instructions, such as a tenor joking, \"I thought 'forte' was a type of cheese,\" to reveal their playful nature.\n\n- **Language Use**:  \n  - Employ a humorous and light-hearted tone through dialogue. Use playful language, such as the curate exclaiming, \"This is not a jazz improvisation!\" and a choir member responding, \"But it could be!\" to maintain a comedic atmosphere.  \n  - Use descriptive language to vividly convey the choir's antics and the curate's reactions. Phrases like \"the choir erupted in a symphony of giggles\" can enhance the narrative's engagement.  \n  - Convey characters' emotions and the story's comedic tension through dialogue, ensuring the tone remains light and engaging. For example, the curate might sigh, \"I fear I am conducting a circus,\" to which a choir member replies, \"And you're the ringmaster!\"  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a high-stakes protest and a team infiltrating the scene disguised as construction workers, which requires a focus on tension, disguise, and quick thinking. The author's style emphasizes whimsical adventures, swift conflict resolution, character-driven plots, humor, and vivid character interactions. I will incorporate these elements into the Story Rules, ensuring they are actionable and tailored to the prompt.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:\n  - Structure the story around a simple, whimsical adventure where the team quickly moves from planning their disguise to infiltrating the protest scene. For example, have the team brainstorm their construction worker personas over a quick breakfast meeting, then immediately transition to the protest site, focusing on their interactions with each other and the crowd.\n  - Resolve conflicts swiftly and decisively. If the team encounters a suspicious protester, have a character like the quick-thinking leader, Alex, defuse the situation with a convincing story about a \"safety inspection,\" followed by a swift change of location to avoid further scrutiny.\n  - Focus the plot on character interactions rather than action sequences. Highlight humorous exchanges between team members as they navigate the protest, such as debating the authenticity of their construction jargon or the absurdity of their hard hats.\n\n- **Creativity**:\n  - Use humor to reinterpret the high-stakes protest scenario in a lighthearted manner. For instance, include a scene where the team struggles with their construction worker costumes, leading to comedic moments like a character accidentally wearing a tool belt upside down.\n  - Blend elements of whimsy and logic by having the team use unconventional methods to maintain their cover, such as using a \"construction worker's handbook\" filled with nonsensical tips that somehow work in their favor.\n  - Incorporate imaginative elements by personifying an inanimate object, like a traffic cone, as a \"team mascot\" that the characters humorously consult for advice during tense moments.\n\n- **Development (Character and Setting)**:\n  - Develop characters through witty dialogue and interactions. For example, have team members exchange sarcastic remarks about their disguises or the protest's chaotic atmosphere, revealing their personalities and camaraderie.\n  - Establish an immersive setting that enhances the story's tense yet whimsical tone. Describe the protest scene with vivid details, such as colorful banners, the cacophony of chants, and the bustling energy, creating a backdrop that contrasts with the team's humorous antics.\n  - Develop characters through their practical responses to crisis, highlighting their resilience and adaptability. Show a character like Jamie improvising a solution when their disguise is nearly compromised, such as using a nearby toolbox to convincingly \"fix\" a barricade.\n\n- **Language Use**:\n  - Employ a humorous and light-hearted tone through dialogue and playful language. Use phrases like \"I think I'd be better suited to being a mime than a construction worker\" to add levity to the tense situation.\n  - Use direct and confrontational dialogue to convey tension and character relationships. Include a scene where a team member, Sam, confronts an agitator with a firm, \"We're just here to ensure safety, not to take sides,\" to maintain their cover.\n  - Employ descriptive language and dialogue to create a vivid and engaging narrative, emphasizing the team's interactions and emotions. Use phrases like \"nervously adjusted his hard hat\" and \"exchanged a knowing glance\" to convey the team's dynamics and the protest's atmosphere.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The prompt involves Sherlock Holmes and John Watson in a humorous and chaotic scenario at a Haunted House attraction. The author's style is characterized by whimsical adventures, swift conflict resolution, character-driven plots, and a blend of humor and logic. Characters are developed through witty dialogue and interactions, and the language is playful and descriptive. I will create Story Rules that incorporate these elements, ensuring they are tailored to the prompt's themes of absurdity and humor.  \n</thinking>  \n<story_rules>  \n- **Plot**:\n  - Structure the story around a whimsical adventure at the Haunted House, focusing on immediate interactions and resolutions. Begin with Sherlock and John being reluctantly assigned to manage the attraction, quickly moving to the chaos of the dragon costume mishap and candy floss disaster. Resolve each conflict swiftly, such as Sherlock's jumper disdain leading to a humorous compromise with John suggesting, \"Perhaps a cape would suit you better, Sherlock.\"\n  - Focus the plot on character interactions rather than action sequences. Highlight the humorous exchanges between Sherlock, John, and the visitors, such as Sherlock's sarcastic remarks about the costumes and John's attempts to mediate the chaos, creating a narrative driven by their dynamic.\n  - Use a sequence of comedic events, like the dragon costume biting a visitor and the candy floss machine going haywire, to reveal deeper insights into Sherlock's personality, such as his unexpected enjoyment of the absurdity.\n\n- **Creativity**:\n  - Employ humor to reinterpret the prompt in a lighthearted manner. Use comedic elements like Sherlock's struggle with the dragon costume and his disdain for the jumper, adding a whimsical twist to the scenario.\n  - Blend elements of whimsy and logic by having Sherlock apply his deductive skills to solve trivial Haunted House problems, such as deducing the best way to untangle candy floss from a visitor's hair, musing whether he is in a story by H.G. Wells or Lewis Carroll.\n  - Incorporate imaginative elements by personifying the dragon costume, giving it a playful, mischievous personality that adds to the chaos, such as it \"snapping playfully at unsuspecting visitors.\"\n\n- **Development (Character and Setting)**:\n  - Develop characters through witty dialogue and interactions. Use Sherlock's sarcastic remarks and John's attempts to mediate to reveal their personalities and relationship, such as Sherlock quipping, \"This is hardly the case of the century, John,\" while John retorts, \"But it might be the most colorful.\"\n  - Establish an immersive setting that enhances the story's intimate and magical tone. Describe the Haunted House with vivid details, like flickering lanterns casting eerie shadows and the scent of candy floss mingling with the autumn air, creating a cozy yet chaotic atmosphere.\n  - Develop Sherlock's character through his reactions to the absurdity, highlighting his playful and occasionally begrudgingly appreciative nature, such as his reluctant smile when a child praises his \"scary\" dragon costume.\n\n- **Language Use**:\n  - Employ a humorous and light-hearted tone through dialogue and playful language. Use phrases like \"I think I'd be far better suited to being a dragon tamer\" and \"These jumpers aren't known for their flattering fit,\" contributing to a comedic tone.\n  - Use direct and confrontational dialogue to convey tension and character relationships, such as Sherlock's exasperated, \"If you ever suggest I wear that jumper again, John, I will personally see to its destruction.\"\n  - Employ descriptive language and dialogue to create a vivid and engaging narrative, emphasizing the chaotic yet festive atmosphere of the Haunted House, with phrases like \"the dragon costume's playful snap\" and \"candy floss clouds swirling like mischievous spirits.\"  \n</story_rules>"
]