[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves uncovering a partner's secret past filled with supernatural elements, which provides a rich ground for emotional exploration and character dynamics.\n\n**Plot**: The author emphasizes emotional responses and supportive interactions, often structuring narratives around direct confrontations and resolutions. For this prompt, the plot should focus on the emotional impact of discovering the partner's secret past, leading to a confrontation and resolution that strengthens their relationship.\n\n**Creativity**: The author integrates secondary characters for emotional healing and uses familiar magical elements to enhance interactions. The story should creatively incorporate supernatural elements like vampire slaying and werewolf boyfriends, using them to explore themes of trust and acceptance.\n\n**Development (Character and Setting)**: The author develops characters through supportive actions, intimate dialogue, and shared experiences. The characters should be developed through their reactions to the discovery, with dialogue revealing their emotional states and past experiences.\n\n**Language Use**: The author uses direct, emotive language and affectionate dialogue to convey intimacy and warmth. The language should vividly portray the protagonist's shock and the partner's vulnerability, using tender dialogue to resolve the emotional tension.\n\nWith these insights, I will craft Story Rules that guide the narrative to reflect the author's style while aligning with the Writing Prompt.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:\n  - Begin the narrative with the protagonist's immediate emotional response upon discovering the wooden stake and prom photo, emphasizing the urgency of understanding their partner's past. For example, have the protagonist exclaim, \"What is this? Why do you have a stake?\" to set the tone of shock and curiosity.\n  - Structure the plot around a direct confrontation between the protagonist and their partner, focusing on the emotional dialogue that ensues. Ensure the confrontation leads to a resolution where the partner explains their past, such as revealing, \"I used to hunt vampires to protect my family.\"\n  - Emphasize the development of their relationship through this revelation, highlighting how the protagonist processes the information and decides to support their partner, leading to a strengthened bond.\n\n- **Creativity**:\n  - Integrate supernatural elements creatively to facilitate emotional healing and understanding. For instance, introduce a secondary character, like a former werewolf boyfriend, who provides insight into the partner's past and helps the protagonist accept it.\n  - Use familiar magical elements, such as a protective charm or a vampire-hunting journal, to enhance the narrative and deepen the protagonist's understanding of their partner's secret life.\n  - Reinterpret the prompt by focusing on the emotional journey of acceptance and trust rather than the supernatural adventures themselves.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist and their partner through supportive actions and intimate dialogue. For example, have the partner gently explain their past, saying, \"I never wanted to hide this from you, but I was afraid of losing you.\"\n  - Use dialogue to reveal shared experiences and interests that help the protagonist and partner reconnect, such as reminiscing about their prom night and how it was overshadowed by a vampire encounter.\n  - Create a setting that reflects the partner's secret life, such as a hidden room filled with vampire-hunting tools and memorabilia, to add depth to the narrative.\n\n- **Language Use**:\n  - Use direct and emotive language to convey the protagonist's shock and the partner's vulnerability. For example, describe the protagonist's reaction with phrases like \"heart pounding\" and \"mind racing.\"\n  - Employ affectionate and tender language during the resolution to convey intimacy and warmth, such as the partner saying, \"I love you more than anything, and I hope you can accept this part of me.\"\n  - Use straightforward and practical language when describing the supernatural elements, focusing on their significance to the partner's past and the current relationship dynamics.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves Hermione, Ginny, Luna, Harry, and Draco navigating the complexities of starting a family, which suggests themes of love, friendship, and magic. The author's style emphasizes emotional responses, supportive interactions, and character relationships over external conflict. The narrative should focus on emotional healing, intimate dialogue, and the use of magical elements to enhance character interactions. Language should be emotive, affectionate, and practical, with cultural references enriching the setting. I will create Story Rules that incorporate these elements, ensuring they are actionable and tailored to the Writing Prompt.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:  \n  - Structure the narrative around the emotional responses and supportive interactions of the characters as they navigate the plan to start a family. Begin with an immediate emotional reaction, such as Hermione's initial surprise or hesitation, and have Ginny and Luna offer reassurance, emphasizing the urgency and care in their proposal. For example, start with Hermione exclaiming, \"Are you serious? This is huge!\" followed by Luna gently saying, \"We've thought it through, Hermione. We can do this together.\"  \n  - Focus on character relationships and emotional moments over external conflict. Center the plot on the group's discussions and decisions, highlighting their emotional connections and the resolution of any doubts or fears. For instance, have a scene where Harry and Draco express their support, with Harry saying, \"We've always been family, in one way or another,\" and Draco adding, \"And this is just another step.\"  \n  - Include a direct confrontation and resolution, such as a moment where Hermione confronts her own fears about the unconventional plan, leading to a resolution where she embraces the idea with the support of her partners.  \n\n- **Creativity**:  \n  - Integrate secondary characters, like Fleur or Neville, to facilitate emotional healing and offer fresh perspectives on the group's plan. For example, have Fleur provide advice based on her own family experiences, saying, \"Family is what you make it, and magic only strengthens those bonds.\"  \n  - Reinterpret the prompt by focusing on emotional healing through personal interactions rather than external adventures. Highlight the group's journey through heartfelt conversations and shared magical experiences, such as a bonding ritual that symbolizes their commitment to each other.  \n  - Use familiar magical elements to enhance character interaction, such as the use of a magical artifact that symbolizes their new family, like a charmed locket that holds a piece of each person's magic.  \n\n- **Development (Character and Setting)**:  \n  - Develop characters through their supportive actions and dialogue, creating a network of care around Hermione. Show Ginny and Luna's roles in comforting Hermione, with Ginny saying, \"We're in this together, no matter what,\" and Luna adding, \"Our love is the strongest magic there is.\"  \n  - Use intimate dialogue and physical interactions to develop characters, such as a scene where Hermione, Ginny, and Luna share a quiet moment, holding hands and discussing their hopes for the future.  \n  - Develop characters through dialogue that reveals shared experiences and interests, such as a conversation where Harry and Draco discuss their own unconventional family dynamics and how it has prepared them for this new journey.  \n\n- **Language Use**:  \n  - Use direct and emotive language to convey Hermione's vulnerability and the compassion of her friends. Include phrases like \"Hermione's heart raced with a mix of fear and excitement\" and \"Ginny's voice was a soothing balm to her worries.\"  \n  - Employ affectionate and tender language to convey intimacy and warmth, such as \"Luna wrapped her arms around Hermione, whispering promises of love and support.\"  \n  - Use straightforward and practical language to convey the narrative, especially during discussions of the plan's logistics, with phrases like \"We need to consider the magical implications and how it will affect us all.\"  \n  - Enrich the narrative with cultural references, such as a mention of a magical tradition or a French phrase that adds authenticity to the setting, like \"C'est la vie magique,\" to highlight the magical nature of their journey.  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a character, Lionel, boarding the Hogwarts Express with his cat, Panther, on his birthday, anticipating surprises and wondering about his house placement. The narrative should focus on emotional responses, character relationships, and supportive interactions, as highlighted in the Author Writing Sheet. The author’s style emphasizes emotional healing, character development through dialogue, and the use of direct and emotive language. I will incorporate these elements into the Story Rules, ensuring they are actionable and tailored to the Writing Prompt.  \n</thinking>  \n<story_rules>  \n- **Plot**:\n  - Begin the narrative with Lionel's emotional response to boarding the Hogwarts Express, emphasizing the significance of this moment. For example, describe Lionel's excitement and nervousness as he clutches Panther, thinking, \"This is it, Panther. Our new adventure begins.\"\n  - Structure the plot around Lionel's interactions with other students on the train, focusing on forming new friendships. Highlight a shared interest, such as a mutual love for magical creatures, that leads to an immediate bond with a fellow student.\n  - Develop the plot through a direct confrontation and resolution, such as Lionel encountering a mischievous magical creature on the train, which he helps to calm, showcasing his bravery and hinting at his potential house placement.\n  - Conclude with a supportive interaction that reassures Lionel about his house placement, perhaps through a conversation with a prefect who shares their own sorting experience, easing Lionel's worries.\n\n- **Creativity**:\n  - Integrate secondary characters, like a friendly prefect or a quirky fellow first-year, to facilitate Lionel's emotional journey, offering support and guidance as he navigates his first day.\n  - Focus on emotional healing through personal interactions rather than external adventures. For instance, have Lionel share a heartfelt conversation with a new friend about their hopes and fears for the school year.\n  - Use humor in character interactions to lighten the narrative, such as a playful exchange between Lionel and his cat, Panther, where Lionel jokes, \"Panther, if you get sorted into Slytherin, I might just have to follow you.\"\n  - Incorporate familiar magical elements, like the Sorting Hat or enchanted sweets from the trolley, to enhance character interactions and deepen the magical atmosphere.\n\n- **Development (Character and Setting)**:\n  - Develop Lionel's character through his supportive actions and dialogue, creating a network of care around him. For example, show Lionel offering to share his snacks with a nervous fellow first-year, saying, \"Here, have some chocolate frogs. They always make me feel better.\"\n  - Use intimate dialogue and physical interactions to develop relationships. Describe Lionel's comforting gesture of petting Panther when he feels anxious, or a reassuring pat on the back from a new friend.\n  - Highlight shared experiences and interests in dialogue to establish connections. For instance, have Lionel bond with another student over their mutual excitement for the upcoming Quidditch season.\n  - Use reflective dialogue to reveal Lionel's emotional state and resolve any initial fears about his house placement, such as a conversation with a house ghost who shares wisdom about the Sorting process.\n\n- **Language Use**:\n  - Employ direct and emotive language to convey Lionel's vulnerability and excitement. Use phrases like \"Lionel's heart raced with anticipation\" and \"He felt a surge of warmth as Panther purred in his lap.\"\n  - Use affectionate and tender language to convey intimacy and warmth in Lionel's interactions, such as describing a friend's comforting words or Panther's gentle nuzzle.\n  - Incorporate cultural references and magical terminology to enrich the narrative and establish setting, such as mentioning the \"scarlet steam engine\" and \"Hogwarts robes fluttering in the breeze.\"\n  - Use straightforward and practical language to convey the narrative, especially during action sequences, like when Lionel helps calm the mischievous creature, focusing on his quick thinking and calm demeanor.\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves Severus Snape discovering an art exhibit by Hermione Granger, with a secret to be revealed. The author's style emphasizes emotional responses, character relationships, and supportive interactions, which will be crucial in crafting the narrative. The plot should focus on emotional moments and direct confrontations, while creativity should integrate secondary characters and humor. Character development will rely on dialogue and shared experiences, and language use will be emotive and direct. These elements will be tailored to the prompt, ensuring a cohesive and engaging story.  \n</thinking>  \n<story_rules>  \n- **Plot**:\n  - Begin the narrative with Snape's immediate emotional response upon discovering the art exhibit, emphasizing the urgency and surprise of the moment. For example, describe Snape's initial shock as he sees a portrait of himself with the caption, \"The Unsung Hero.\"\n  - Structure the plot around the emotional interactions between Snape and Hermione, focusing on their shared history and unresolved tensions. Highlight a scene where Snape confronts Hermione, demanding to know why she chose him as her subject.\n  - Develop the plot through a direct confrontation and resolution, where Hermione reveals her secret to Snape. This could involve a private conversation in the gallery's back room, where Hermione confesses, \"I painted you because you saved my life in ways you never knew.\"\n  - Use a shared interest, such as a mutual appreciation for art or potions, to establish a connection between Snape and Hermione, leading to a deeper understanding and potential friendship.\n\n- **Creativity**:\n  - Integrate secondary characters, such as Luna Lovegood or Neville Longbottom, to facilitate Snape's emotional journey and offer fresh perspectives. For instance, Luna could provide insight into Hermione's motivations, saying, \"She sees the beauty in your bravery, Severus.\"\n  - Focus on emotional healing through personal interactions rather than external adventures. Illustrate this by showing how the art exhibit becomes a space for Snape to reflect on his past and find closure.\n  - Incorporate humor into character interactions to lighten the narrative. For example, have Snape sarcastically remark, \"I never imagined I'd be immortalized in oil paint,\" to which Hermione responds with a playful smile.\n  - Use familiar magical elements, such as enchanted canvases that animate Snape's memories, to enhance the interaction between Snape and Hermione.\n\n- **Development (Character and Setting)**:\n  - Develop Snape and Hermione through their supportive actions and dialogue, creating a network of care and understanding. Show Hermione gently explaining her artistic choices, saying, \"I wanted to capture the man behind the mask.\"\n  - Use intimate dialogue and physical interactions to deepen their relationship. For example, describe a moment where Hermione places a reassuring hand on Snape's arm, saying, \"You deserve to be seen for who you truly are.\"\n  - Reveal shared experiences and interests through dialogue, such as a discussion about their time at Hogwarts or their mutual respect for each other's intellect.\n  - Use reflective dialogue to resolve emotional tensions, with Snape admitting, \"I never thought anyone would see me as anything but a villain,\" and Hermione reassuring him, \"You were always more than that to me.\"\n\n- **Language Use**:\n  - Employ direct and emotive language to convey Snape's vulnerability and Hermione's compassion. Use phrases like \"Snape's heart clenched\" and \"Hermione's eyes softened\" to vividly portray their emotional states.\n  - Use affectionate and tender language to convey intimacy and warmth, especially in moments of reconciliation. For example, describe Hermione's voice as \"soft and soothing\" when she speaks to Snape.\n  - Incorporate cultural references or magical terminology to enrich the narrative and establish the setting. Use terms like \"Pensieve\" or \"Patronus\" to evoke the magical world.\n  - Use straightforward and practical language to convey the narrative, especially during the art exhibit's description. For instance, describe the paintings with clear, vivid imagery, such as \"A portrait of Snape, his eyes fierce yet kind, surrounded by swirling colors of green and silver.\"\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's writing style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves Hermione Granger's first day at LCorp and her encounter with Kara Danvers, suggesting themes of new beginnings, unexpected connections, and potential friendship or romance. The author's style emphasizes emotional responses, character relationships, and supportive interactions, which will be crucial in crafting the narrative. I will incorporate these elements into the Story Rules, ensuring they are actionable and detailed, with examples inspired by the Evidence provided.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Begin the narrative with an immediate emotional response from Hermione as she navigates her first day at LCorp. Use a moment of clumsiness, such as spilling drinks, to introduce urgency and set the stage for her encounter with Kara Danvers. For example, describe Hermione's internal monologue as she thinks, \"Oh no, not on my first day!\" to convey her anxiety and the urgency of the situation.\n  - Focus the plot on the development of Hermione and Kara's relationship through supportive interactions rather than external conflicts. Highlight their shared experiences and interests, such as their mutual love for journalism or justice, to build a connection. For instance, have Kara say, \"I remember my first day here; it was a disaster too,\" to create a bond over shared experiences.\n  - Structure the plot around a direct confrontation and resolution, such as Hermione and Kara working together to solve a minor office crisis, which leads to a deeper understanding and friendship. Use dialogue to resolve any misunderstandings quickly, like Kara reassuring Hermione, \"It's just a spill; we can fix it together.\"\n\n- **Creativity**:\n  - Integrate secondary characters, such as a friendly coworker or a quirky office assistant, to facilitate Hermione's emotional adjustment to her new environment. Use these characters to offer fresh perspectives on support, like a coworker saying, \"Kara's the best person to have on your side,\" to highlight Kara's supportive nature.\n  - Reinterpret the prompt by focusing on emotional healing through personal interactions. Use the office setting to explore themes of belonging and acceptance, with Hermione finding comfort in Kara's company. For example, describe a scene where Kara invites Hermione to lunch, saying, \"Let's make this a tradition,\" to signify the start of a supportive friendship.\n  - Use humor in character interactions to enhance the narrative and lighten the tone. For instance, have Kara joke about the spill, saying, \"Well, at least it wasn't coffee; that would have been a real disaster,\" to add a light-hearted touch to their encounter.\n\n- **Development (Character and Setting)**:\n  - Develop Hermione and Kara's characters through their supportive actions and dialogue. Show Hermione's vulnerability and Kara's compassion, such as Kara offering Hermione a spare shirt after the spill, saying, \"Here, take this; I've got plenty,\" to demonstrate her kindness.\n  - Use intimate dialogue and physical interactions to build their relationship. Describe moments where Kara gently touches Hermione's shoulder to reassure her, or Hermione laughing at Kara's jokes, to convey their growing connection.\n  - Develop the office setting as a vibrant and dynamic environment, using specific details like the bustling newsroom or the cozy break room to create a sense of place. For example, describe the newsroom as \"a hive of activity, with phones ringing and reporters typing furiously,\" to immerse the reader in the setting.\n\n- **Language Use**:\n  - Use direct and emotive language to convey Hermione's initial nervousness and Kara's warmth. Employ phrases like \"Hermione's heart raced\" and \"Kara's smile was like a warm embrace\" to vividly portray their emotional states.\n  - Incorporate affectionate and tender language to convey the intimacy and warmth of their budding friendship. Use terms of endearment or gentle actions, such as \"Kara's voice was a soothing balm,\" to create a tone of closeness.\n  - Use straightforward and practical language to convey the narrative, especially during office-related tasks or problem-solving moments. For example, describe Hermione's thought process as she tackles a new assignment, using clear and concise language to focus on the task at hand.\n</story_rules>"
]