[
    "<thinking>\nThe writing prompt centers on two grieving girls who come together under one roof, navigating their shared pain and forming an unexpected bond. The thematic elements include grief, healing, and the development of a fragile hope amidst sorrow. The tone is somber and reflective, with potential for deep emotional exploration and character development.\n\nThe user profile indicates a preference for starting stories with a reflective or somber tone, developing well-rounded characters through their actions and interactions, and concluding with a significant revelation or resolution. The user also incorporates unique elements and vivid imagery, avoiding clichés by presenting characters in nuanced ways. The narrative perspective is typically third-person limited, focusing on the protagonist's thoughts and experiences, with effective use of dialogue and monologue.\n\nCombining these insights, the Story Rules will guide the creation of a narrative that begins with a reflective scene, develops the characters' grief and bond through their interactions, and concludes with a hopeful resolution. The story will include unique elements and vivid imagery, maintaining a somber yet hopeful tone throughout.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a reflective scene that introduces the two girls in the midst of their grief. Use a setting that emphasizes their sorrow, such as a quiet, dimly lit room or a rainy day, to set a somber tone.\n\n#### Story Ending\n- Conclude with a significant revelation or resolution that deepens the characters' bond and offers a sense of hope. This could involve a moment of shared understanding or a symbolic act that signifies their healing process.\n\n#### Narrative Structure\n- Structure the story with a clear beginning that sets up the conflict of their grief, a middle that explores their interactions and growing bond, and an end that resolves their immediate emotional turmoil. Ensure smooth transitions between these elements to create a cohesive narrative.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements that add depth to the narrative, such as a shared memory or a symbolic object that connects the girls. These elements should enhance the story's complexity and engagement.\n\n#### Engaging Themes and Imagery\n- Use themes of resilience, unexpected kindness, and healing to create an immersive and engaging narrative. Employ vivid imagery, such as the changing weather or the transformation of their living space, to reflect their emotional journey.\n\n#### Use of Tropes or Clichés\n- Avoid clichés by presenting the girls' grief and bond in a nuanced light. Subvert typical tropes by showing their unexpected strengths or moments of levity amidst their sorrow.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the two girls with clear motivations and emotional arcs. Show their grief through their actions, dialogue, and internal conflicts, and highlight their growth as they navigate their shared pain.\n\n#### Setting Establishment\n- Build immersive settings with descriptive details that bring their shared living space to life. Use specific details, such as the arrangement of their room or the view from their window, to create a vivid and relevant atmosphere.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters, such as family members or friends, who contribute meaningfully to the plot. Use their interactions with the main characters to add emotional depth and advance the story.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person limited narrative perspective to focus on the girls' thoughts and experiences. Employ dialogue and monologue to reveal their motivations and enhance the reader's connection to the story.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Use rhetorical devices, such as imagery and metaphor, to create impact and evoke the story's somber yet hopeful tone.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the themes of grief and healing. Use word choices and recurring phrases to reinforce this alignment, creating a cohesive and engaging narrative atmosphere.\n</story_rules>",
    "<thinking>\nThe writing prompt involves a significant emotional revelation from Severus Snape to Harry Potter, which threatens to disrupt their growing bond. This scenario suggests themes of trust, betrayal, reconciliation, and the complexity of human relationships. The tone is likely to be tense and emotional, with a focus on character development and internal conflict.\n\nThe user profile indicates a preference for starting stories with a reflective or somber tone, developing characters deeply through their actions and interactions, and concluding with a significant revelation or resolution. The user also enjoys incorporating unique elements and subverting typical tropes, while maintaining a clear narrative structure and using vivid imagery and descriptive language.\n\nTo align with the user's style, the story should begin with a reflective or tense scene, develop the characters of Harry and Snape through their interactions and internal conflicts, and conclude with a resolution that deepens their relationship. The narrative should include unique elements that add depth and avoid clichés, while using a third-person limited perspective and descriptive language to create an immersive atmosphere.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a reflective or tense scene that sets the tone for the emotional revelation. For example, Harry could be contemplating his growing trust in Snape while in a quiet, dimly lit room, or they could be in the middle of a tense conversation.\n\n#### Story Ending\n- Conclude with a resolution or significant revelation that deepens the complexity of Harry and Snape's relationship. This could involve Harry finding a way to reconcile Snape's past mistakes with the man he has come to trust, leading to a moment of understanding or forgiveness.\n\n#### Narrative Structure\n- Structure the story with a clear beginning that sets up the conflict, a middle that explores Harry's internal struggle and interactions with Snape, and an end that resolves the immediate dilemma. Ensure smooth transitions between these elements to create a cohesive narrative.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements that add depth to the narrative, such as a specific memory or event from Snape's past that is revealed to Harry, or a magical element that symbolizes their fragile bond.\n\n#### Engaging Themes and Imagery\n- Use themes of trust, betrayal, reconciliation, and the complexity of human relationships. Employ vivid imagery to draw the reader in, such as the dim lighting of the room, the expressions on the characters' faces, and the atmosphere of tension and emotion.\n\n#### Use of Tropes or Clichés\n- Subvert typical tropes by presenting Snape in a nuanced light, showing his vulnerability and regret. Avoid clichés by making the revelation and its impact on Harry's perception of Snape unique and original.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop Harry's character through his internal conflict and reactions to Snape's revelation. Show his struggle to reconcile the man he has come to trust with the mistakes of his past, highlighting his resilience and capacity for forgiveness.\n\n#### Setting Establishment\n- Establish the setting with vivid descriptions that contribute to the overall atmosphere. For example, describe the quiet, dimly lit room where the revelation takes place, using details like the flickering candlelight and the heavy silence to enhance the mood.\n\n#### Supporting Characters and Interactions\n- Develop Snape's character through his interactions with Harry, showing his vulnerability and regret. Use their dialogue and body language to reveal hidden emotions and motivations, adding depth to their relationship.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person limited narrative perspective, focusing on Harry's thoughts and experiences. This will allow the reader to connect deeply with Harry's internal struggle and emotional journey.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Use rhetorical devices such as imagery and metaphor to create impact, and ensure the language is descriptive and evocative.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the themes of trust, betrayal, and reconciliation. Use word choices and recurring phrases to reinforce this alignment, creating a cohesive and engaging narrative atmosphere.\n</story_rules>",
    "<thinking>\nThe writing prompt involves a chaotic interrogation at Gringotts, with Harry and Hagrid accused of theft amidst goblin rivalries. Key elements include the mystery of Griphook's lie, the true culprit behind the break-in, and the ensuing chaos that allows for an escape. The tone is tense and action-packed, with potential for both dramatic and humorous moments.\n\nThe user profile indicates a preference for starting stories with a reflective or somber tone, developing characters deeply, and using vivid settings. The user also enjoys unique twists and subverting clichés, often ending stories with significant revelations or humorous resolutions. Their language use is descriptive and evocative, with a third-person limited perspective focusing on the protagonist's thoughts and experiences.\n\nCombining these insights, the Story Rules will guide the creation of a narrative that begins with a reflective or tense scene, develops the mystery and character motivations, and concludes with a resolution that deepens character complexity or provides a humorous twist. The narrative will be structured clearly, with immersive settings and nuanced character interactions, using descriptive language to enhance the tone and mood.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a reflective or tense scene that sets the tone for the chaotic interrogation at Gringotts. Focus on Harry's internal thoughts and the oppressive atmosphere of the goblin bank.\n\n#### Story Ending\n- Conclude with a significant revelation about Griphook's lie or the true culprit behind the break-in. Alternatively, end with a humorous twist that provides a satisfying resolution to the chaos.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end. Start with the interrogation, explore the chaos and character interactions in the middle, and resolve the immediate conflict by the end. Ensure smooth transitions between these elements.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements that add depth to the narrative, such as an unexpected ally among the goblins or a magical artifact that plays a crucial role in the escape.\n\n#### Engaging Themes and Imagery\n- Use themes of betrayal, resilience, and unexpected alliances. Employ vivid imagery to describe the chaotic scenes at Gringotts, the tension among the goblins, and the escape.\n\n#### Use of Tropes or Clichés\n- Subvert typical tropes by presenting goblins in a nuanced light, showing their internal rivalries and motivations. Avoid clichéd portrayals of goblins as purely antagonistic.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop Harry's character through his reactions to the interrogation and the chaos. Highlight his resilience and determination to uncover the truth behind the break-in.\n\n#### Setting Establishment\n- Describe Gringotts in detail, emphasizing its grandeur and the tension-filled atmosphere during the interrogation. Use specific details to make the setting immersive and relevant to the story.\n\n#### Supporting Characters and Interactions\n- Incorporate Hagrid and the goblins effectively through their interactions with Harry. Use these interactions to reveal hidden emotions and motivations, adding depth to the narrative.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person limited narrative perspective, focusing on Harry's thoughts and experiences. Employ dialogue and monologue to add depth to the narrative and reveal character motivations.\n\n#### Stylistic Elements\n- Use varied sentence structures and appropriate vocabulary to enhance the narrative. Employ rhetorical devices such as imagery and metaphor to create impact. Ensure the language is descriptive and evocative.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the tense and chaotic nature of the prompt. Use word choices and recurring phrases to reinforce this alignment, creating a cohesive and engaging narrative atmosphere.\n</story_rules>",
    "<thinking>\nThe writing prompt centers on Harry Potter dealing with the aftermath of a significant loss and the weight of a prophecy, with Neville Longbottom providing unexpected support. Key thematic elements include grief, friendship, resilience, and the power of love. The tone is likely to be somber and reflective, with moments of emotional revelation and strength.\n\nThe user profile indicates a preference for starting stories with a reflective or somber tone, developing characters deeply through their interactions and internal conflicts, and concluding with a significant revelation or resolution. The user also incorporates unique elements and vivid imagery, avoids clichés, and uses a third-person limited perspective with descriptive and evocative language.\n\nCombining these insights, the Story Rules will guide the creation of a narrative that begins with a reflective scene, develops Harry and Neville's characters through their conversation, and concludes with a revelation about the power of their friendship. The narrative will be structured clearly, with smooth transitions and immersive settings, and will use descriptive language to evoke the appropriate tone and mood.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a reflective scene where Harry is alone, grappling with his grief and the weight of the prophecy. Set a somber tone that immediately engages the reader and introduces the main conflict.\n\n#### Story Ending\n- Conclude with a significant revelation about the power of friendship and love, highlighting the strength Harry gains from Neville's support. Ensure the ending provides a sense of resolution and deepens the characters' complexity.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end. Start with Harry's internal struggle, move to his conversation with Neville, and end with the revelation and resolution. Ensure smooth transitions between these elements to create a cohesive narrative.\n\n---\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements that add depth to the narrative, such as a specific memory or shared experience between Harry and Neville that strengthens their bond. These imaginative twists should enhance the story's complexity and engagement.\n\n#### Engaging Themes and Imagery\n- Use themes of grief, resilience, friendship, and the power of love to create an immersive and engaging narrative. Employ vivid imagery, such as the setting sun casting long shadows or the quiet of the empty common room, to draw the reader in and resonate with the story's tone.\n\n#### Use of Tropes or Clichés\n- Subvert typical tropes by presenting Neville as a source of unexpected strength and wisdom. Avoid clichés by showing nuanced emotions and interactions, making the characters' support for each other feel genuine and impactful.\n\n---\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop Harry's character through his internal conflict and his interactions with Neville. Show his pain, exhaustion, and resilience, and how he finds strength in their friendship. Ensure his character arc is well-established and reflective of his motivations and growth.\n\n#### Setting Establishment\n- Build immersive settings with descriptive details that bring the scenes to life. Describe the quiet, dimly lit common room or the serene, moonlit grounds of Hogwarts to create a vivid atmosphere that complements the narrative.\n\n#### Supporting Characters and Interactions\n- Develop Neville as a supportive and insightful character who helps Harry navigate his grief. Use their conversation to reveal hidden emotions and motivations, adding depth to both characters and advancing the plot.\n\n---\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person limited narrative perspective to focus on Harry's thoughts and experiences. Employ dialogue and monologue effectively to add depth to the narrative and reveal character motivations, enhancing the reader's connection to the story.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Use rhetorical devices such as imagery and metaphor to create impact. Ensure the language is descriptive and evocative, contributing to the overall tone and mood.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the somber and reflective themes of the prompt. Use word choices and recurring phrases to reinforce this alignment, creating a cohesive and engaging narrative atmosphere.\n</story_rules>",
    "<thinking>\nThe writing prompt suggests a scenario where Harry discovers a new, powerful ability to heal incurable conditions, which could lead to significant consequences in the magical world. The thematic elements include discovery, power, responsibility, and the potential conflict arising from such a unique ability. The tone is likely to be a mix of awe, tension, and perhaps a sense of danger or urgency as Harry navigates this new aspect of his life.\n\nThe user profile indicates a preference for starting stories with a reflective, somber, or mysterious tone, and ending them with a resolution or significant revelation. The narrative structure is clear and cohesive, with smooth transitions. The user enjoys incorporating unique elements and engaging themes, avoiding clichés by presenting characters in a nuanced light. The main characters are well-developed, and settings are vividly described. The third-person limited perspective is consistently used, with effective language and a tone that aligns with the story's themes.\n\nCombining these insights, the Story Rules will guide the creation of a narrative that begins with a reflective or mysterious scene, explores Harry's discovery and its implications, and concludes with a significant revelation or resolution. The story will include unique elements, well-developed characters, and immersive settings, using a third-person limited perspective and descriptive language to maintain the appropriate tone and mood.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a reflective or mysterious scene at St. Mungo's, where Harry is visiting Neville's parents. Set a somber tone that hints at the gravity of the situation and Harry's internal thoughts.\n\n#### Story Ending\n- Conclude with a significant revelation or resolution that deepens Harry's character complexity. This could involve a decision Harry makes about his new ability or a surprising reaction from the magical community.\n\n#### Narrative Structure\n- Structure the story with a clear beginning that introduces Harry's discovery, a middle that explores the implications and conflicts arising from his ability, and an end that resolves the immediate dilemma. Ensure smooth transitions between these elements.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements such as the specific nature of Harry's healing ability and the reactions of different characters to this discovery. Consider adding a subplot involving a mysterious figure or organization interested in Harry's power.\n\n#### Engaging Themes and Imagery\n- Use themes of discovery, power, responsibility, and conflict. Employ vivid imagery to describe the healing process and the reactions of those around Harry, creating an immersive and engaging narrative.\n\n#### Use of Tropes or Clichés\n- Avoid clichés by presenting Harry's ability and the reactions of others in a nuanced light. Subvert typical tropes by showing unexpected kindness or support from unlikely characters, or by exploring the moral and ethical dilemmas Harry faces.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop Harry's character through his actions, dialogue, and internal conflicts. Show his initial shock and confusion, followed by his determination to understand and control his new ability. Highlight his resilience and sense of responsibility.\n\n#### Setting Establishment\n- Vividly describe the settings, particularly St. Mungo's and any other significant locations. Use specific details to make these settings immersive and relevant to the story, contributing to the overall atmosphere.\n\n#### Supporting Characters and Interactions\n- Incorporate supporting characters such as Neville, Hermione, Ron, and Dumbledore. Use their interactions with Harry to advance the plot and reveal hidden emotions and motivations. Show how they react to Harry's new ability and the potential consequences.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person limited narrative perspective, focusing on Harry's thoughts and experiences. Employ dialogue and monologue to add depth to the narrative and reveal character motivations.\n\n#### Stylistic Elements\n- Use varied sentence structures and appropriate vocabulary to enhance the narrative. Employ rhetorical devices such as imagery and metaphor to create impact. Ensure the language is descriptive and evocative, contributing to the overall tone and mood.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the themes of discovery, power, and conflict. Use word choices and recurring phrases to reinforce this alignment, creating a cohesive and engaging narrative atmosphere.\n</story_rules>"
]