[
    "<thinking>\nThe writing prompt presents a mysterious and suspenseful scenario involving a green light, a man waiting for a phone call, and a group of strangers gathering at the invitation of a woman with secrets. The key thematic elements include mystery, suspense, and hidden truths. The tone is likely to be tense and intriguing, with potential for dramatic revelations.\n\nThe user profile indicates a preference for detailed setups, open or unresolved endings, and a clear narrative structure. The user excels in creating immersive settings, developing characters through their thoughts and interactions, and avoiding clichés by presenting fresh takes on common scenarios. Their language use is descriptive and evocative, with a focus on maintaining a consistent tone and mood.\n\nCombining these insights, the Story Rules will guide the creation of a narrative that begins with a detailed setup, develops characters and settings vividly, and concludes with an open ending that leaves readers in suspense. The story will incorporate unique elements and avoid clichés, using rich language to enhance the tone and mood.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Start with a detailed description of the room filled with the mysterious green light, establishing a tense and intriguing atmosphere. Introduce the man waiting for the phone call, highlighting his anxiety and anticipation.\n\n#### Story Ending\n- Conclude with an open or unresolved ending that leaves readers in suspense. For example, reveal a partial truth about the connection between the man and the strangers, but leave key questions unanswered, hinting at deeper secrets.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end, connected through the protagonist's journey and thoughts. Use detailed descriptions, interactions, and internal monologue to transition smoothly between these elements, maintaining a cohesive narrative.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce original ideas by adding specific character behaviors and detailed settings not mentioned in the prompt. For example, describe the peculiar habits of the man waiting for the call or the unique decor of the cramped apartment where the strangers gather.\n\n#### Engaging Themes and Imagery\n- Use themes of mystery, suspense, hidden truths, and human connections. Employ vivid imagery to describe the green light, the man's anxious demeanor, and the cramped apartment, drawing readers into the narrative.\n\n#### Use of Tropes or Clichés\n- Avoid clichés by presenting fresh takes on common scenarios. For instance, instead of a typical mysterious phone call, add a unique twist to the nature of the call or the secrets held by the kindly woman.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the man waiting for the phone call through his thoughts, reactions, and interactions with his environment. Highlight his internal conflict and anxiety, making his character arc clear and engaging.\n\n#### Setting Establishment\n- Establish immersive settings with detailed descriptions. Describe the room with the green light in a way that enhances the mysterious atmosphere. Similarly, provide vivid details of the cramped apartment and the strangers gathered there.\n\n#### Supporting Characters and Interactions\n- Introduce the strangers and the kindly woman through interactions that reveal their personalities and roles. Use dialogue and actions to add depth to these characters and advance the story.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person narrative perspective, focusing on the protagonist's point of view. Incorporate dialogue and internal monologue to provide insight into the protagonist's thoughts and experiences.\n\n#### Stylistic Elements\n- Employ varied sentence structures and a rich vocabulary to enhance the story's tone and impact. Use clear and descriptive language, along with rhetorical devices, to create a vivid and engaging narrative.\n\n#### Tone and Mood Alignment\n- Maintain a tone of subtle unease, mystery, and suspense. Use word choices and recurring phrases to reinforce the mood, making the narrative cohesive and immersive.\n\n</story_rules>",
    "<thinking>\nThe writing prompt involves a group of troubled teens on a wilderness retreat who must navigate survival challenges and uncover secrets in the forest as a storm approaches. Key thematic elements include survival, mystery, and the tension of an impending storm. The tone is likely to be tense and suspenseful, with opportunities for character development and dramatic revelations.\n\nThe user profile indicates a preference for detailed setups, open or unresolved endings, and a clear narrative structure. The user excels in creating original elements, engaging themes, and vivid imagery. They avoid clichés by presenting fresh takes on common scenarios and develop characters through thoughts, reactions, and interactions. The user’s language use is descriptive, with varied sentence structures and a rich vocabulary, maintaining a tone that aligns with the story’s themes.\n\nCombining these insights, the Story Rules will guide the creation of a narrative that begins with a detailed setup of the wilderness retreat, develops the teens' characters through their interactions and internal monologues, and builds suspense as they uncover secrets in the forest. The story will conclude with an open ending, leaving readers in anticipation.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Start with a detailed description of the wilderness retreat, setting the context and tone. Introduce the group of troubled teens and their initial reactions to the retreat, establishing a sense of unease and tension.\n\n#### Story Ending\n- Conclude with an open or unresolved ending, leaving the teens on the brink of a significant discovery as the storm intensifies. Create a sense of suspense and anticipation, hinting at deeper secrets yet to be uncovered.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end, connected through the teens' journey and thoughts. Use detailed descriptions, interactions, and internal monologue to transition smoothly between these elements, maintaining a cohesive narrative.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce original elements such as specific behaviors of the teens, unique challenges they face in the wilderness, and mysterious clues they find in the forest. Ensure these elements add depth and originality to the narrative.\n\n#### Engaging Themes and Imagery\n- Use themes of survival, mystery, and tension to engage the reader. Incorporate vivid imagery of the forest, the brewing storm, and the teens' interactions to create a compelling and immersive reading experience.\n\n#### Use of Tropes or Clichés\n- Avoid clichés by presenting fresh takes on common survival and mystery scenarios. Develop the teens' characters and their interactions in unique ways, adding originality to the story.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the main characters through their thoughts, reactions, and interactions with each other. Ensure each teen has a distinct personality and backstory that influences their behavior and decisions during the retreat.\n\n#### Setting Establishment\n- Establish the wilderness setting with detailed descriptions of the forest, the campsite, and the approaching storm. Make the setting vivid and engaging, enhancing the atmosphere and contributing to the overall mood of the story.\n\n#### Supporting Characters and Interactions\n- Introduce supporting characters such as the retreat leaders or other teens. Use their interactions with the main characters to reveal their personalities and roles, advancing the story and adding depth to the narrative.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person narrative perspective, focusing on the teens' points of view. Incorporate dialogue and internal monologue to provide insight into their thoughts and experiences, allowing for a comprehensive understanding of their journey.\n\n#### Stylistic Elements\n- Employ varied sentence structures and a rich vocabulary to enhance the story's tone and impact. Use clear and descriptive language, along with rhetorical devices, to create a vivid and engaging reading experience.\n\n#### Tone and Mood Alignment\n- Maintain a tone of tension and suspense, aligning with the prompt's themes. Use word choices and recurring phrases to reinforce the mood, making the narrative cohesive and engaging. Ensure the tone and mood enhance the reader's immersion in the story.\n</story_rules>"
]