[
    "<thinking>\nThe writing prompt presents a unique scenario where a group of extreme accountants, the White Collar Gang, storms a bank demanding tax returns and ledgers. This sets up a humorous yet potentially tense situation, blending elements of crime, heroism, and bureaucracy. The heroes in the story must decide whether to confront this unusual threat or succumb to the mundane challenge of paperwork, suggesting a mix of action and comedy.\n\nThe user profile indicates a preference for vivid scene-setting, mysterious or unresolved endings, and a clear narrative structure. The user’s stories often feature unique elements, engaging themes, and well-developed characters and settings. The language is formal and descriptive, with a third-person perspective that provides a broad view of events and character motives.\n\nTo align with the user’s style, the story should begin with a detailed description of the bank and the atmosphere in Emerald City. The narrative should introduce the conflict with the White Collar Gang and the heroes’ dilemma. The ending should leave some tension unresolved, hinting at future developments. Unique elements and engaging themes should be incorporated, with a focus on the humorous and tense aspects of the scenario. Characters should be developed through their actions and interactions, and the setting should be immersive and detailed. The language should be formal and descriptive, maintaining a tone that balances humor and tension.\n\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a vivid description of the second National Bank of Emerald City, capturing the atmosphere and setting the mood for the impending conflict.\n- Introduce the White Collar Gang dramatically, emphasizing their unusual demands for tax returns and ledgers to create an immediate sense of intrigue and humor.\n\n#### Story Ending\n- Conclude with a sense of unresolved tension, perhaps hinting at the heroes’ ongoing struggle with the bureaucratic challenge or a looming threat from the White Collar Gang.\n- Leave the reader with a cliffhanger or a mysterious element that suggests future developments.\n\n#### Narrative Structure\n- Follow a clear structure with a well-defined beginning that sets the scene, a middle that introduces and escalates the conflict, and an end that hints at future developments.\n- Ensure smooth transitions between scenes, maintaining a cohesive narrative flow.\n\n### **Creativity**\n\n#### Unique Elements\n- Incorporate unique and imaginative details, such as the extreme accountants’ quirky methods and the heroes’ unconventional strategies to deal with the paperwork.\n- Add original elements that enhance the humor and tension, like unexpected gadgets or unusual alliances.\n\n#### Engaging Themes and Imagery\n- Use themes of bureaucracy versus heroism, the absurdity of the situation, and the tension between action and mundane tasks.\n- Create striking imagery, such as the chaotic scene inside the bank, the meticulous accountants, and the heroes’ reactions to the unusual threat.\n\n#### Use of Tropes or Clichés\n- Subvert common tropes related to crime and heroism by presenting the accountants as the antagonists and the paperwork as a significant challenge.\n- Avoid over-reliance on clichés, instead offering fresh takes on familiar concepts, such as the heroes’ reluctance to engage in mundane tasks.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the main heroes through their actions and interactions, highlighting their personalities and motivations.\n- Provide a collective viewpoint that shows how different characters perceive and react to the situation.\n\n#### Setting Establishment\n- Build an immersive setting with detailed descriptions of the bank, the city, and the atmosphere during the heist.\n- Establish the historical context and community dynamics of Emerald City, making the setting feel vivid and relevant.\n\n#### Supporting Characters and Interactions\n- Introduce distinct supporting characters, such as bank employees, other heroes, and members of the White Collar Gang, through dialogue and actions.\n- Use interactions to advance the plot and add depth to the characters, showing their unique personalities and roles.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person perspective to provide a broad view of events and character motives, allowing for a comprehensive understanding of the situation.\n- Balance between action and introspection, giving insight into the characters’ thoughts and feelings.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative, creating a vivid and tense atmosphere.\n- Use rhetorical devices, such as humor, irony, and vivid descriptions, to add depth and impact to the story.\n\n#### Tone and Mood Alignment\n- Maintain a tone that balances humor and tension, reflecting the absurdity and seriousness of the situation.\n- Align the mood with the prompt’s themes, using word choices and recurring themes to reinforce the intended atmosphere.\n\n</story_rules>",
    "<thinking>\nThe writing prompt presents a dramatic scenario involving a sinking galleon, a crew fighting for survival, and the townsfolk's dilemma of saving lives, salvaging goods, and preventing disaster. Key thematic elements include survival, tension, community response, and the chaos of a maritime disaster. The tone is urgent and suspenseful, with potential for both heroic and tragic outcomes.\n\nThe user profile indicates a storytelling style that begins with vivid descriptions, ends with unresolved tension or cliffhangers, and follows a clear narrative structure. The user incorporates unique elements, engaging themes, and striking imagery, while avoiding over-reliance on common tropes. Characters are developed through actions and interactions, and settings are immersive and detailed. The narrative perspective is typically third-person, with formal and descriptive language that creates a vivid and tense atmosphere.\n\nCombining these insights, the Story Rules will guide the creation of a story that starts with a vivid description of the sinking galleon and the chaotic scene at the docks, develops characters through their actions and interactions, and ends with unresolved tension. The narrative will be structured clearly, with unique elements and engaging themes, and will use a third-person perspective with formal, descriptive language to create a vivid and tense atmosphere.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a vivid description of the sinking galleon approaching the docks, emphasizing the chaos and urgency of the situation. Use sensory details to immerse the reader in the scene, such as the sound of creaking wood, the sight of circling sharks, and the smell of saltwater and fear.\n\n#### Story Ending\n- Conclude with a sense of unresolved tension or a cliffhanger. For example, end with the townsfolk making a critical decision or facing an unexpected twist, leaving the reader in suspense about the outcome.\n\n#### Narrative Structure\n- Follow a clear structure with a well-defined beginning, middle, and end. Start by setting the scene, introduce the conflict as the townsfolk respond to the disaster, and end with a hint of future developments or unresolved tension.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements that add originality to the narrative, such as a mysterious figure among the crew or an unexpected resourcefulness from an unlikely townsperson. Ensure these elements enhance the story's originality and intrigue.\n\n#### Engaging Themes and Imagery\n- Use themes of survival, community response, and the chaos of disaster to engage the reader. Create striking imagery, such as the galleon’s dramatic descent, the frantic efforts of the crew, and the townsfolk’s desperate actions.\n\n#### Use of Tropes or Clichés\n- Handle common tropes like the heroic rescuer or the greedy salvager in a fresh and original manner. Avoid over-reliance on clichés by adding depth and complexity to these characters and their motivations.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist through their actions and interactions with others. For example, a town leader or a brave fisherman could be the main character, showing their leadership and resourcefulness in the crisis.\n\n#### Setting Establishment\n- Build an immersive setting with detailed descriptions of the docks, the galleon, and the surrounding town. Establish the historical context and community dynamics, making the setting feel vivid and relevant.\n\n#### Supporting Characters and Interactions\n- Introduce distinct supporting characters, such as townsfolk, crew members, and possibly a mysterious outsider. Use their interactions to advance the plot and add emotional depth to the story.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person perspective to provide a broad view of events and character motives. This perspective will help in understanding the different characters and their interactions, adding depth to the narrative.\n\n#### Stylistic Elements\n- Employ formal and descriptive language with varied sentence structures and rich vocabulary. Use a mix of descriptive and straightforward sentences to create a vivid and tense atmosphere.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the prompt’s themes of urgency, tension, and survival. Use word choices and recurring themes to reinforce the intended atmosphere, creating a sense of impending danger and community effort.\n</story_rules>"
]