[
    "<thinking>\nThe writing prompt presents a mysterious and fantastical scenario where strangers from different worlds are drawn into a labyrinth of libraries, galleries, and corridors. The key thematic elements include mystery, exploration, and the unknown force behind the labyrinth. The tone is likely to be suspenseful and intriguing, with a focus on discovery and the characters' interactions within this strange environment.\n\nThe user profile indicates a preference for starting stories with immediate action or strong emotional tones, maintaining suspenseful endings, and using a clear narrative structure. The user also values unique elements, vivid themes and imagery, and well-developed characters and settings. Their language use is descriptive and evocative, with a third-person narrative perspective and a tone that aligns well with the story's themes.\n\nCombining these insights, the Story Rules will guide the creation of a story that begins with an engaging and mysterious scene, develops through the characters' exploration and interactions, and concludes with a suspenseful or unresolved ending. The narrative will be rich in unique elements and vivid imagery, with well-developed characters and settings, and a descriptive and evocative language style.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Start with a scene where a character is abruptly pulled into the labyrinth, capturing the immediate confusion and disorientation. Use strong emotional tones to immerse the reader quickly.\n\n#### Story Ending\n- Conclude with a suspenseful or unresolved note, hinting at future developments or deeper mysteries within the labyrinth. Leave readers eager to discover what happens next.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end. Ensure the narrative flows smoothly through character interactions and continuous action, maintaining engagement throughout.\n\n---\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce original and imaginative details about the labyrinth, such as its ever-shifting nature and the diverse worlds the characters come from. Ensure these elements add depth and intrigue to the story.\n\n#### Engaging Themes and Imagery\n- Use vivid and engaging themes of mystery, exploration, and the unknown. Employ rich imagery to describe the labyrinth's libraries, galleries, and corridors, making them feel immersive and otherworldly.\n\n#### Use of Tropes or Clichés\n- Handle common tropes of mysterious labyrinths and diverse characters with a fresh perspective. Subvert expectations by adding unique character abilities or unexpected twists within the labyrinth.\n\n---\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist with a clear backstory and motivation for exploring the labyrinth. Ensure their arc is well-established and connected to the prompt's scenario.\n\n#### Setting Establishment\n- Build immersive settings with detailed descriptions of the labyrinth's various sections. Make the libraries, galleries, and corridors feel vivid and relevant to the story's context.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters from different worlds, each with unique backgrounds and abilities. Use their interactions to add depth to the narrative and advance the plot.\n\n---\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person narrative perspective to provide a comprehensive view of the characters' thoughts and actions. Employ multiple character viewpoints to maintain a cohesive narrative.\n\n#### Stylistic Elements\n- Employ descriptive and evocative language, using varied sentence structures and rich vocabulary. Enhance the narrative with specific details related to the labyrinth and the characters' experiences.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the prompt's themes of mystery and exploration. Use word choices and recurring phrases to reinforce the suspenseful and intriguing atmosphere.\n\n</story_rules>",
    "<thinking>\nThe writing prompt presents a dystopian scenario where an alien coalition has taken over the world, promising peace at the cost of freedom. The key thematic elements include resistance, survival, and the struggle for freedom. The tone is likely to be serious and tense, with a focus on the emotional and physical challenges faced by the survivors. The narrative possibilities include exploring the dynamics of the resistance movement, the personal journeys of the characters, and the broader implications of the alien occupation.\n\nThe user profile indicates a preference for starting stories with immediate action or strong emotional tones, maintaining suspenseful endings, and structuring narratives with clear beginnings, middles, and ends. The user’s creativity shines through unique elements, engaging themes, and vivid imagery. Characters are well-developed with clear motivations, and settings are immersive and detailed. The user employs a third-person narrative perspective, using descriptive and evocative language to align tone and mood with the story’s themes.\n\nCombining these insights, the Story Rules will guide the creation of a narrative that begins with a dramatic or emotional scene, develops through continuous action and character interactions, and concludes with unresolved tension. The story will incorporate unique elements and vivid imagery, with well-developed characters and immersive settings. The language will be descriptive and evocative, maintaining a serious and tense tone throughout.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Start with a dramatic scene that immediately immerses the reader in the tension of the alien occupation. This could be a raid by the resistance or a moment of personal crisis for the protagonist, reflecting the user’s style of immediate action or strong emotional tone.\n\n#### Story Ending\n- Conclude with a suspenseful or unresolved ending that hints at future developments. This could involve a cliffhanger where the resistance faces a new threat or a moment of hope that leaves readers eager for more, maintaining the user’s preference for engaging endings.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end. Ensure that each part is connected through continuous action and character interactions, reflecting the user’s cohesive narrative style. Use direct action and descriptive passages to maintain a smooth flow.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce original ideas that add depth to the story. This could include unique alien technologies, resistance tactics, or personal backstories of the characters that enrich the narrative, in line with the user’s preference for originality.\n\n#### Engaging Themes and Imagery\n- Use vivid imagery and engaging themes to capture the mood of the prompt. Themes of resistance, sacrifice, and hope should be vividly portrayed through detailed descriptions of the alien-occupied world and the resistance’s efforts, resonating with the user’s style.\n\n#### Use of Tropes or Clichés\n- Handle common tropes of dystopian and sci-fi genres with a fresh perspective. Subvert expectations by adding unique twists to familiar elements, such as the nature of the alien coalition or the resistance’s strategies, ensuring originality and engagement.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist with a clear backstory and motivation connected to the resistance. Ensure their personal journey is well-established and drives the narrative, reflecting the user’s detailed character-building approach.\n\n#### Setting Establishment\n- Build immersive settings with descriptive details that bring the alien-occupied world to life. Describe the contrast between the controlled areas and the hidden resistance bases, making the settings relevant and vivid, matching the user’s immersive style.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters that complement the protagonist and contribute meaningfully to the plot. Use interactions to add emotional depth, advance the story, and highlight the dynamics within the resistance, reflecting the user’s approach to character interactions.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person narrative perspective to provide depth and balance between action and introspection. Employ multiple character viewpoints to offer a comprehensive view of the resistance’s efforts and the alien occupation, aligning with the user’s narrative techniques.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Use descriptive and evocative language to create impact, incorporating specific vocabulary related to the alien occupation and resistance efforts, reflecting the user’s stylistic approach.\n\n#### Tone and Mood Alignment\n- Maintain a serious and tense tone that reflects the prompt’s themes of resistance and survival. Use word choices and recurring phrases to reinforce the mood, ensuring alignment with the user’s balance of tension and emotional depth.\n</story_rules>"
]