[
    "<thinking>\nThe writing prompt sets a scene on Nar Shadaa, a chaotic moon known for its criminal underworld. It introduces four distinct characters: a desperate thief, a hunted bounty hunter, a Force-sensitive wanderer, and a cunning smuggler. The narrative involves their intertwined fates amidst Hutt schemes, Imperial shadows, and the criminal underworld's rising power. Key thematic elements include danger, intrigue, and the convergence of diverse characters with hidden secrets.\n\nThe user profile indicates a storytelling style that begins with immersive descriptions, uses a clear narrative structure, and often ends with open-ended or suggestive conclusions. The user excels in creating unique elements, engaging themes, and vivid imagery. Characters are developed through actions and interactions, and settings are richly described. The third-person perspective is preferred, with varied sentence structures and rich vocabulary enhancing the narrative. The tone and mood are consistently aligned with the prompt, creating a compelling atmosphere.\n\nCombining these insights, the Story Rules will guide the creation of a narrative that starts with a detailed, immersive scene, develops characters through their interactions and personal struggles, and ends with an open-ended conclusion. The narrative will be rich in unique elements, vivid imagery, and engaging themes, maintaining a tone of tension and intrigue throughout.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a detailed, immersive description of Nar Shadaa, highlighting its chaotic and dangerous atmosphere. Introduce the main characters in a way that immediately sets the tone of desperation and intrigue.\n\n#### Story Ending\n- Conclude with an open-ended or suggestive ending that leaves room for interpretation or continuation. Ensure there is unresolved tension or a hint of future developments to keep readers engaged.\n\n#### Narrative Structure\n- Use a clear narrative structure with a well-defined beginning, middle, and transitions between character perspectives. Ensure each character's storyline is cohesively connected through central themes and smooth transitions.\n\n---\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements such as detailed histories and personal struggles of the characters. Include imaginative details about the Hutt schemes, Imperial shadows, and the criminal underworld that are not explicitly mentioned in the prompt.\n\n#### Engaging Themes and Imagery\n- Use themes of danger, political intrigue, and personal turmoil. Employ vivid imagery to describe the settings and scenarios, such as the bustling streets of Nar Shadaa, the shadowy dealings of the Hutt, and the tense encounters with Imperial forces.\n\n#### Use of Tropes or Clichés\n- Handle common tropes like the desperate thief and the hunted bounty hunter in a way that adds originality. Use detailed descriptions and unique character traits to give familiar elements a fresh twist.\n\n---\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the main characters through their actions, thoughts, and interactions with others. Ensure each character has a distinct backstory and current predicament that makes them relatable and interesting.\n\n#### Setting Establishment\n- Establish the setting with rich, immersive descriptions that make Nar Shadaa feel alive and relevant to the story. Include specific details about the environment, such as the neon-lit streets, the seedy cantinas, and the hidden corners where deals are made.\n\n#### Supporting Characters and Interactions\n- Introduce supporting characters that play significant roles in advancing the plot and adding depth to the main characters. Use their interactions to reveal more about the main characters' motivations and challenges.\n\n---\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person perspective to provide a broad view of events and characters. Employ dialogue and monologue to add depth to the narrative, revealing character motivations and emotions.\n\n#### Stylistic Elements\n- Use varied sentence structures and a rich vocabulary to enhance the story's impact. Employ descriptive language and rhetorical devices, such as similes and metaphors, to create vivid imagery and set the tone.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the prompt's themes of tension and intrigue. Use word choices and recurring phrases to reinforce the story's atmosphere, ensuring a sense of mystery and danger throughout.\n\n</story_rules>",
    "<thinking>\nThe writing prompt involves five children from different backgrounds receiving their Hogwarts letters under unusual circumstances, uncovering secrets about their pasts and abilities, and realizing their intertwined destinies. This prompt suggests themes of discovery, mystery, and interconnected fates, with a magical and adventurous tone.\n\nThe user profile indicates a storytelling style that begins with detailed, immersive descriptions, often ends with open-ended or suggestive conclusions, and maintains a clear narrative structure. The user excels in creating unique elements, engaging themes, and vivid imagery, while effectively using common tropes with originality. Characters are developed through actions, thoughts, and interactions, and settings are richly described to enhance the narrative. The user employs a third-person perspective, varied sentence structures, and a rich vocabulary to create a compelling narrative, with a tone and mood that align with the story's themes.\n\nCombining these insights, the Story Rules will guide the creation of a narrative that starts with immersive descriptions of each child's unique background and the unusual circumstances of receiving their Hogwarts letters. The story will develop through their discoveries and interactions, leading to an open-ended conclusion that suggests further adventures. The narrative will be rich in unique elements, vivid imagery, and engaging themes, with well-developed characters and settings, and a consistent tone and mood that align with the magical and adventurous nature of the prompt.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with detailed, immersive descriptions of each child's unique background and the unusual circumstances under which they receive their Hogwarts letters. Set the tone of mystery and adventure from the outset.\n\n#### Story Ending\n- Conclude with an open-ended or suggestive ending that hints at further adventures and unresolved mysteries, leaving room for interpretation and continuation.\n\n#### Narrative Structure\n- Maintain a clear narrative structure with a well-defined beginning, middle, and end for each character's journey. Ensure smooth transitions between character perspectives and central themes that connect their stories cohesively.\n\n---\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements that enhance the narrative, such as detailed histories and personal struggles of each child. Include imaginative details about their pasts and abilities that are not explicitly mentioned in the prompt.\n\n#### Engaging Themes and Imagery\n- Use vivid imagery and thematic depth to capture the magical and adventurous tone of the prompt. Create compelling scenarios and descriptions that draw the reader into the story.\n\n#### Use of Tropes or Clichés\n- Handle common tropes related to magical discovery and interconnected destinies with originality. Add fresh twists through detailed descriptions and unique character traits to keep the narrative interesting.\n\n---\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop each child through their actions, thoughts, and interactions with others. Provide distinct backstories and current predicaments that make them relatable and interesting.\n\n#### Setting Establishment\n- Establish immersive settings with rich, descriptive details that bring the magical world to life. Ensure the environments feel alive and relevant to the story, enhancing the overall narrative.\n\n#### Supporting Characters and Interactions\n- Introduce supporting characters that play significant roles in advancing the plot and adding depth to the main characters. Use their interactions to reveal more about the main characters' motivations and challenges.\n\n---\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person perspective to provide a broad view of events and characters. Employ dialogue and monologue to add depth to the narrative, revealing character motivations and emotions.\n\n#### Stylistic Elements\n- Employ varied sentence structures and a rich vocabulary to enhance the story's impact. Use descriptive language and rhetorical devices, such as similes and metaphors, to create vivid imagery and set the tone.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflect the magical and adventurous themes of the prompt. Use word choices and recurring phrases to reinforce the story's atmosphere, enhancing reader immersion.\n</story_rules>"
]