[
    "<thinking>\nThe writing prompt presents a scenario where the protagonist, having suffered from a wish gone wrong, discovers a blog that promises justice against those who twist desires. The protagonist receives an invitation to meet an enigmatic figure named \"Candent,\" and must decide whether to pursue revenge despite the risks. Key thematic elements include betrayal, justice, revenge, and the supernatural. The tone is likely to be tense and mysterious, with potential for dramatic and reflective moments.\n\nThe user profile indicates a storytelling style that begins with vivid and immersive descriptions, often ends with reflective or open-ended conclusions, and maintains a clear narrative structure. The user introduces unique elements and engaging themes, develops main characters with distinctive traits, and establishes detailed settings. The language use is rich and varied, with a third-person narrative perspective and a mix of descriptive and reflective sentences.\n\nTo align the story with the user's style, the rules should emphasize a vivid and immersive beginning, a reflective or open-ended ending, and a clear narrative structure. Unique elements and engaging themes should be incorporated, with detailed character and setting development. The language should be rich and varied, maintaining a tense and mysterious tone throughout.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a vivid and immersive description of the protagonist's current state after the wish gone wrong. Set the tone with sensory details that convey their emotional and physical turmoil.\n- Introduce the mysterious blog in a way that captures the protagonist's curiosity and desperation, using descriptive language to highlight the blog's eerie and intriguing nature.\n\n#### Story Ending\n- Conclude with a reflective or open-ended scene that leaves some elements to the reader's imagination. Consider the protagonist's internal conflict about revenge and the potential consequences of their actions.\n- Ensure the ending ties back to the central theme of justice and the risks involved, maintaining a sense of intrigue and anticipation.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end. Start with the protagonist's discovery of the blog, build up to the invitation from Candent, and climax with the decision to pursue revenge.\n- Use distinct character perspectives and interactions to connect the elements cohesively, ensuring a logical progression of events.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements that add originality to the story, such as specific details about the blog's content, the nature of the beings who twist desires, and the enigmatic figure of Candent.\n- Consider adding imaginative details like the blog's cryptic messages, the protagonist's past experiences with wishes, and the supernatural aspects of the beings involved.\n\n#### Engaging Themes and Imagery\n- Emphasize themes of betrayal, justice, and revenge, using vivid imagery to enhance the reader's experience. Describe the protagonist's emotional journey and the mysterious atmosphere surrounding the blog and Candent.\n- Create sensory-rich scenes that capture the tension and intrigue of the protagonist's quest for justice.\n\n#### Use of Tropes or Clichés\n- Handle common tropes like the quest for revenge and the mysterious mentor figure in a fresh and intentional manner. Add unique reflections and discoveries to keep the story engaging and original.\n- Subvert or enhance these tropes by incorporating unexpected twists or deeper character motivations.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist with clear motivations and a connection to the prompt's scenario. Highlight their emotional state, past experiences with wishes, and internal conflict about seeking revenge.\n- Ensure the protagonist's arc is well-established, showing their growth and the impact of their decisions throughout the story.\n\n#### Setting Establishment\n- Build immersive settings with detailed descriptions that bring the blog, the protagonist's environment, and the meeting place with Candent to life. Use sensory details to create a vivid and relevant backdrop for the narrative.\n- Ensure the settings enhance the story's mysterious and tense atmosphere, making them integral to the plot.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters that complement the protagonist and contribute meaningfully to the plot. Use interactions to add emotional depth and advance the story.\n- Develop characters like Candent and any other figures involved in the blog or the beings who twist desires, providing brief but meaningful interactions that enrich the narrative.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person narrative perspective to provide depth and balance between action and introspection. Shift perspectives when necessary to offer insights into different characters' thoughts and actions.\n- Ensure the tone aligns with the user's preferred narrative techniques, maintaining a sense of urgency and intrigue.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Use descriptive and reflective sentences to create impact and maintain the story's tone and mood.\n- Include rhetorical devices like vivid descriptions, irony, and tension to engage the reader and enhance the storytelling.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the prompt's themes of betrayal, justice, and revenge. Use word choices and recurring phrases to reinforce the intended atmosphere.\n- Ensure the tone remains consistent throughout the story, with a focus on creating a tense and mysterious ambiance that aligns with the user's style.\n\n</story_rules>",
    "<thinking>\nThe writing prompt sets the stage at Basilisk University, a magical institution where students aim to graduate with a dragon. The prompt hints at a mysterious and potentially dangerous valley nearby, with Mallaidh Macbridei warning newcomers about it. This suggests themes of magic, mystery, and potential danger, with a focus on exploration and discovery.\n\nThe user profile indicates a storytelling style that begins with vivid descriptions, employs unique elements, and develops characters and settings in detail. The user prefers reflective or open-ended conclusions and uses a third-person narrative perspective. Their stories often include themes of urgency, intrigue, and conflict, with a mix of descriptive and reflective language.\n\nCombining these insights, the Story Rules will guide the creation of a narrative that starts with an immersive description of Basilisk University, introduces unique magical elements, and develops characters and settings in detail. The story will maintain a tone of mystery and intrigue, with a reflective or open-ended conclusion.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a vivid and immersive description of Basilisk University, highlighting its magical atmosphere and the anticipation of students aiming to graduate with a dragon.\n- Introduce Mallaidh Macbridei as a formidable figure, setting the tone of caution and mystery regarding the nearby valley.\n\n#### Story Ending\n- Conclude with a reflective or open-ended scene that leaves some elements to the reader's imagination, such as a hint of the secrets or dangers in the valley without fully revealing them.\n- Ensure the ending adds a layer of intrigue and anticipation for what might come next.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end, ensuring a cohesive flow through distinct character perspectives and interactions.\n- Use the middle of the story to build tension and explore the mysteries of the valley, leading to a climax that ties back to the initial warning.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique magical elements that add originality to the story, such as specific spells, magical creatures, or enchanted artifacts related to Basilisk University.\n- Incorporate imaginative details about the valley, such as hidden magical phenomena or ancient secrets that the students might uncover.\n\n#### Engaging Themes and Imagery\n- Use themes of mystery, exploration, and the pursuit of knowledge to drive the narrative.\n- Create vivid imagery of the university, the valley, and any magical occurrences, ensuring consistency in the sensory details to enhance the reader's experience.\n\n#### Use of Tropes or Clichés\n- Employ common tropes like the wise mentor, the curious student, and the hidden danger, but add unique twists to keep the story fresh and engaging.\n- Subvert expectations where possible, such as revealing unexpected aspects of the valley or the true nature of Mallaidh Macbridei's warning.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist with clear motivations, such as a desire to uncover the secrets of the valley or prove themselves at Basilisk University.\n- Ensure the protagonist's arc is well-established, showing growth and learning through their experiences.\n\n#### Setting Establishment\n- Build an immersive setting with detailed descriptions of Basilisk University, its magical environment, and the mysterious valley.\n- Highlight specific locations within the university and the valley that are relevant to the plot, making them vivid and engaging.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters, such as fellow students, professors, or townsfolk, who contribute meaningfully to the plot and the protagonist's journey.\n- Use interactions to add emotional depth, reveal information about the valley, and advance the story.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person narrative perspective to provide an overview of the story, allowing for insights into multiple characters' thoughts and actions.\n- Shift perspectives where necessary to deepen the reader's understanding of the characters and the unfolding mystery.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative, mixing descriptive and reflective sentences to create impact.\n- Use rhetorical devices, such as foreshadowing, irony, and vivid descriptions, to maintain the tone of mystery and intrigue.\n\n#### Tone and Mood Alignment\n- Maintain a tone of mystery, caution, and anticipation throughout the story, aligning with the prompt's themes.\n- Ensure the mood is consistent, using word choices and recurring phrases to reinforce the atmosphere of Basilisk University and the enigmatic valley.\n\n</story_rules>",
    "<thinking>\nThe writing prompt sets a dramatic and urgent scenario on the frozen planet of Hoth, where Luke Skywalker is missing, and the Rebel base is in chaos. Key thematic elements include survival in harsh conditions, the urgency of a rescue mission, and the looming threat of the Empire. The tone is tense and foreboding, with a focus on navigating icy dangers and unpredictable wilds.\n\nThe user profile indicates a storytelling style that begins with vivid and immersive descriptions, reflective or open-ended endings, and a clear narrative structure. The user introduces unique elements and engaging themes, with well-developed main characters and immersive settings. The language use is rich and varied, with a third-person narrative perspective and a mix of descriptive and reflective sentences.\n\nCombining these insights, the Story Rules will guide the creation of a story that starts with a vivid description of the frozen wastelands, develops a clear rescue mission narrative, introduces unique elements to the Hoth setting, and maintains a tense and urgent tone throughout. The story will end on a reflective or open-ended note, leaving some elements to the reader's imagination.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a vivid and immersive description of the frozen wastelands of Hoth, setting the tone and context effectively. Describe the harsh environment, the biting cold, and the chaos at the Rebel base as night falls.\n\n#### Story Ending\n- Conclude with a reflective or open-ended note, leaving some elements to the reader's imagination. For example, hint at the ongoing dangers or the uncertain future of the Rebel base after the rescue mission.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end. Start with the chaos at the Rebel base, move through the rescue mission with escalating dangers, and end with the reflective or open-ended conclusion. Ensure the elements are connected cohesively through distinct character perspectives and interactions.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements to the Hoth setting, such as specific names for the icy dangers or unique wildlife. Add original details that make the rescue mission stand out, like a specialized piece of equipment or a unique strategy used by the rescuers.\n\n#### Engaging Themes and Imagery\n- Use themes of urgency, survival, and camaraderie. Create vivid imagery of the icy landscape, the Rebel base in chaos, and the perilous journey through the wilds. Ensure the imagery is consistent and enhances the reader's experience.\n\n#### Use of Tropes or Clichés\n- Employ common tropes like the perilous quest and the heroic rescue mission, but handle them in a way that feels fresh and intentional. Add unique reflections or discoveries to keep the story engaging and original.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist with clear motivations and a connection to the rescue mission. Ensure their arc is well-established, showing their determination and resourcefulness in the face of danger.\n\n#### Setting Establishment\n- Build an immersive setting with detailed descriptions of the frozen wastelands, the Rebel base, and the icy dangers. Make the environment feel relevant and vivid, enhancing the reader's immersion.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters that complement the protagonist and contribute meaningfully to the plot. Use interactions to add emotional depth and advance the story, showing the camaraderie and tension among the rescuers.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person narrative perspective to provide depth and balance between action and introspection. Shift between characters to provide insights into their thoughts and actions, enhancing the overall narrative.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Use descriptive and reflective sentences to create impact, and include rhetorical devices like vivid descriptions and tension-building phrases.\n\n#### Tone and Mood Alignment\n- Maintain a tense and urgent tone throughout the story, reflecting the prompt's themes. Use word choices and recurring phrases to reinforce the atmosphere of danger and urgency, ensuring the tone aligns with the user's storytelling style.\n</story_rules>",
    "<thinking>\nThe writing prompt presents a dystopian setting in the divided city of Neo Elysia, where the protagonist crosses forbidden boundaries driven by a strong motivation to defy the city's rigid hierarchy. The prompt suggests themes of survival, rebellion, and systemic change, with an underlying tone of tension and urgency.\n\nThe user profile indicates a storytelling style that begins with vivid, immersive descriptions and often ends with reflective or open-ended conclusions. The user’s narrative structure is clear and cohesive, with distinct character perspectives and interactions. Creativity is marked by unique elements and engaging themes, while character and setting development are detailed and immersive. The language use is rich and varied, with a third-person narrative perspective that shifts between characters to provide depth.\n\nCombining these insights, the Story Rules will guide the creation of a story that aligns with the user’s style while addressing the prompt’s themes and tone.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a vivid and immersive description of Neo Elysia, highlighting the stark contrasts between its zones. Set the tone by describing the protagonist’s immediate environment and the palpable tension as they prepare to cross a forbidden boundary.\n\n#### Story Ending\n- Conclude with a reflective or open-ended scene that leaves some elements to the reader's imagination. Ensure the ending ties back to the protagonist’s motivations and the broader implications of their actions on the city's hierarchy.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end. Ensure each part is connected cohesively through the protagonist’s journey and interactions with other characters. Use distinct character perspectives to enhance the narrative depth.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements that add originality to the story, such as specific technologies, cultural practices, or hidden zones within Neo Elysia. These should enhance the dystopian setting and the protagonist’s journey.\n\n#### Engaging Themes and Imagery\n- Use themes of rebellion, survival, and systemic change to drive the narrative. Create vivid imagery of the divided city, contrasting the opulent zones with the more dangerous, neglected areas. Ensure the imagery is consistent and enhances the reader’s immersion.\n\n#### Use of Tropes or Clichés\n- Employ common dystopian tropes like the oppressive regime, the underground resistance, and the forbidden zones. Handle these tropes in a fresh and intentional manner, adding unique details and reflections to keep the story engaging.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist with clear motivations for defying the city’s hierarchy. Provide insights into their background, personal stakes, and the internal conflicts driving their actions. Ensure their arc is well-established and relatable.\n\n#### Setting Establishment\n- Build an immersive setting with detailed descriptions of Neo Elysia’s zones. Highlight the differences in rules, dangers, and living conditions across the city. Ensure the setting feels relevant and vivid, enhancing the narrative.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters that complement the protagonist and contribute meaningfully to the plot. Use their interactions to add emotional depth, reveal different aspects of the city, and advance the story.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person narrative perspective to provide an overview of the protagonist’s journey. Shift between characters’ perspectives to offer insights into their thoughts and actions, adding depth to the narrative.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Use descriptive and reflective sentences to create impact, and incorporate rhetorical devices like irony or vivid descriptions to enrich the story.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the prompt’s themes of tension, urgency, and rebellion. Ensure the language choices and recurring phrases reinforce this atmosphere, creating a cohesive and engaging narrative.\n</story_rules>",
    "<thinking>\nThe writing prompt presents a mysterious and intriguing scenario where a once-vanished town, Frostvale, has returned from another dimension. Key thematic elements include mystery, the supernatural, and the unknown. The tone is likely to be eerie and suspenseful, with potential for both dark and fantastical narrative directions. The prompt suggests a plot centered around uncovering the secrets of Frostvale, with possible subplots involving the town's inhabitants and the strange phenomena accompanying its return.\n\nThe user profile indicates a storytelling style that begins with vivid and immersive descriptions, often ending with reflective or open-ended conclusions. The user employs a clear narrative structure with distinct character perspectives and interactions. Their creativity shines through unique elements and engaging themes, often involving urgency, intrigue, and conflict. Characters are well-developed with distinctive traits, and settings are richly described to enhance immersion. The user prefers a third-person narrative perspective, using varied sentence structures and rich vocabulary to create an engaging and impactful narrative.\n\nCombining these insights, the Story Rules will guide the creation of a story that begins with a vivid description of Frostvale's return, develops through the exploration of its secrets, and concludes with a reflective or open-ended ending. The narrative will include unique and imaginative elements, well-developed characters, and immersive settings, all conveyed through a third-person perspective with rich and varied language.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a vivid and immersive description of Frostvale's return, capturing the eerie and bustling atmosphere of the town. Use sensory details to draw the reader into the scene, such as the towering walls, bustling shops, and the strange cracks and dark marks.\n\n#### Story Ending\n- Conclude with a reflective or open-ended ending that leaves some elements to the reader's imagination. Consider a scene where a character contemplates the lingering mysteries of Frostvale or an unresolved tension that hints at future developments.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end. Start with the return of Frostvale, develop through the exploration of its secrets and the strange phenomena, and end with a reflective or open-ended conclusion. Ensure transitions between events are logical and cohesive.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique and imaginative elements inspired by the prompt, such as mysterious artifacts, supernatural occurrences, or peculiar inhabitants of Frostvale. Ensure these elements add depth and originality to the narrative.\n\n#### Engaging Themes and Imagery\n- Use themes of mystery, the supernatural, and the unknown to create an engaging and suspenseful narrative. Employ vivid imagery to enhance the reader's experience, such as the dark marks and black fire associated with Frostvale's return.\n\n#### Use of Tropes or Clichés\n- Handle common tropes like the mysterious town, the curious investigator, and the supernatural phenomena in a fresh and intentional manner. Add unique reflections and discoveries to keep the story engaging and original.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist with clear motivations and a connection to the mysteries of Frostvale. Ensure their arc is well-established and relatable, with distinctive traits and actions that drive the narrative forward.\n\n#### Setting Establishment\n- Build an immersive setting with detailed descriptions of Frostvale and its surroundings. Capture the eerie and bustling atmosphere, the towering walls, the bustling shops, and the strange phenomena. Ensure the setting feels relevant and vivid.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters that complement the protagonist and contribute meaningfully to the plot. Use interactions to add emotional depth, advance the story, and explore the secrets of Frostvale.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person narrative perspective to provide depth and balance between action and introspection. Shift perspectives between characters to offer insights into their thoughts and actions, enhancing the overall narrative.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Use descriptive and reflective sentences to create impact, and include rhetorical devices such as vivid descriptions and suspenseful language.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the eerie and suspenseful themes of the prompt. Use word choices and recurring phrases to reinforce this alignment, ensuring the intended atmosphere is maintained throughout the story.\n</story_rules>"
]