[
    "<thinking>\nThe writing prompt presents a scenario where the protagonist, having suffered from a wish gone wrong, discovers a blog that promises justice against those who twist desires. The protagonist receives an invitation to meet an enigmatic figure named \"Candent,\" and must decide whether to pursue revenge despite the risks. Key thematic elements include betrayal, justice, revenge, and the supernatural. The tone is likely to be tense and mysterious, with potential for dramatic and reflective moments.\n\nThe user profile indicates a storytelling style that begins with vivid and immersive descriptions, often ends with reflective or open-ended conclusions, and maintains a clear narrative structure. The user introduces unique elements and engaging themes, develops main characters with distinctive traits, and establishes detailed settings. The language use is rich and varied, with a third-person narrative perspective and a mix of descriptive and reflective sentences.\n\nTo align the story with the user's style, the rules should emphasize a vivid and immersive beginning, a reflective or open-ended ending, and a clear narrative structure. Unique elements and engaging themes should be incorporated, with detailed character and setting development. The language should be rich and varied, maintaining a tense and mysterious tone throughout.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a vivid and immersive description of the protagonist's current state after the wish gone wrong. Set the tone with sensory details that convey their emotional and physical turmoil.\n- Introduce the mysterious blog in a way that captures the protagonist's curiosity and desperation, using descriptive language to highlight the blog's eerie and intriguing nature.\n\n#### Story Ending\n- Conclude with a reflective or open-ended scene that leaves some elements to the reader's imagination. Consider the protagonist's internal conflict about revenge and the potential consequences of their actions.\n- Ensure the ending ties back to the central theme of justice and the risks involved, maintaining a sense of intrigue and anticipation.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end. Start with the protagonist's discovery of the blog, build up to the invitation from Candent, and climax with the decision to pursue revenge.\n- Use distinct character perspectives and interactions to connect the elements cohesively, ensuring a logical progression of events.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements that add originality to the story, such as specific details about the blog's content, the nature of the beings who twist desires, and the enigmatic figure of Candent.\n- Consider adding imaginative details like the blog's cryptic messages, the protagonist's past experiences with wishes, and the supernatural aspects of the beings involved.\n\n#### Engaging Themes and Imagery\n- Emphasize themes of betrayal, justice, and revenge, using vivid imagery to enhance the reader's experience. Describe the protagonist's emotional journey and the mysterious atmosphere surrounding the blog and Candent.\n- Create sensory-rich scenes that capture the tension and intrigue of the protagonist's quest for justice.\n\n#### Use of Tropes or Clichés\n- Handle common tropes like the quest for revenge and the mysterious mentor figure in a fresh and intentional manner. Add unique reflections and discoveries to keep the story engaging and original.\n- Subvert or enhance these tropes by incorporating unexpected twists or deeper character motivations.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist with clear motivations and a connection to the prompt's scenario. Highlight their emotional state, past experiences with wishes, and internal conflict about seeking revenge.\n- Ensure the protagonist's arc is well-established, showing their growth and the impact of their decisions throughout the story.\n\n#### Setting Establishment\n- Build immersive settings with detailed descriptions that bring the blog, the protagonist's environment, and the meeting place with Candent to life. Use sensory details to create a vivid and relevant backdrop for the narrative.\n- Ensure the settings enhance the story's mysterious and tense atmosphere, making them integral to the plot.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters that complement the protagonist and contribute meaningfully to the plot. Use interactions to add emotional depth and advance the story.\n- Develop characters like Candent and any other figures involved in the blog or the beings who twist desires, providing brief but meaningful interactions that enrich the narrative.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person narrative perspective to provide depth and balance between action and introspection. Shift perspectives when necessary to offer insights into different characters' thoughts and actions.\n- Ensure the tone aligns with the user's preferred narrative techniques, maintaining a sense of urgency and intrigue.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative. Use descriptive and reflective sentences to create impact and maintain the story's tone and mood.\n- Include rhetorical devices like vivid descriptions, irony, and tension to engage the reader and enhance the storytelling.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the prompt's themes of betrayal, justice, and revenge. Use word choices and recurring phrases to reinforce the intended atmosphere.\n- Ensure the tone remains consistent throughout the story, with a focus on creating a tense and mysterious ambiance that aligns with the user's style.\n\n</story_rules>",
    "<thinking>\nThe writing prompt sets the stage at Basilisk University, a magical institution where students aim to graduate with a dragon. The prompt hints at a mysterious and potentially dangerous valley nearby, with Mallaidh Macbridei warning newcomers about it. This suggests themes of magic, mystery, and potential danger, with a focus on exploration and discovery.\n\nThe user profile indicates a storytelling style that begins with vivid descriptions, employs unique elements, and develops characters and settings in detail. The user prefers reflective or open-ended conclusions and uses a third-person narrative perspective. Their stories often include themes of urgency, intrigue, and conflict, with a mix of descriptive and reflective language.\n\nCombining these insights, the Story Rules will guide the creation of a narrative that starts with an immersive description of Basilisk University, introduces unique magical elements, and develops characters and settings in detail. The story will maintain a tone of mystery and intrigue, with a reflective or open-ended conclusion.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a vivid and immersive description of Basilisk University, highlighting its magical atmosphere and the anticipation of students aiming to graduate with a dragon.\n- Introduce Mallaidh Macbridei as a formidable figure, setting the tone of caution and mystery regarding the nearby valley.\n\n#### Story Ending\n- Conclude with a reflective or open-ended scene that leaves some elements to the reader's imagination, such as a hint of the secrets or dangers in the valley without fully revealing them.\n- Ensure the ending adds a layer of intrigue and anticipation for what might come next.\n\n#### Narrative Structure\n- Structure the story with a clear beginning, middle, and end, ensuring a cohesive flow through distinct character perspectives and interactions.\n- Use the middle of the story to build tension and explore the mysteries of the valley, leading to a climax that ties back to the initial warning.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique magical elements that add originality to the story, such as specific spells, magical creatures, or enchanted artifacts related to Basilisk University.\n- Incorporate imaginative details about the valley, such as hidden magical phenomena or ancient secrets that the students might uncover.\n\n#### Engaging Themes and Imagery\n- Use themes of mystery, exploration, and the pursuit of knowledge to drive the narrative.\n- Create vivid imagery of the university, the valley, and any magical occurrences, ensuring consistency in the sensory details to enhance the reader's experience.\n\n#### Use of Tropes or Clichés\n- Employ common tropes like the wise mentor, the curious student, and the hidden danger, but add unique twists to keep the story fresh and engaging.\n- Subvert expectations where possible, such as revealing unexpected aspects of the valley or the true nature of Mallaidh Macbridei's warning.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist with clear motivations, such as a desire to uncover the secrets of the valley or prove themselves at Basilisk University.\n- Ensure the protagonist's arc is well-established, showing growth and learning through their experiences.\n\n#### Setting Establishment\n- Build an immersive setting with detailed descriptions of Basilisk University, its magical environment, and the mysterious valley.\n- Highlight specific locations within the university and the valley that are relevant to the plot, making them vivid and engaging.\n\n#### Supporting Characters and Interactions\n- Introduce secondary characters, such as fellow students, professors, or townsfolk, who contribute meaningfully to the plot and the protagonist's journey.\n- Use interactions to add emotional depth, reveal information about the valley, and advance the story.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person narrative perspective to provide an overview of the story, allowing for insights into multiple characters' thoughts and actions.\n- Shift perspectives where necessary to deepen the reader's understanding of the characters and the unfolding mystery.\n\n#### Stylistic Elements\n- Employ varied sentence structures and rich vocabulary to enhance the narrative, mixing descriptive and reflective sentences to create impact.\n- Use rhetorical devices, such as foreshadowing, irony, and vivid descriptions, to maintain the tone of mystery and intrigue.\n\n#### Tone and Mood Alignment\n- Maintain a tone of mystery, caution, and anticipation throughout the story, aligning with the prompt's themes.\n- Ensure the mood is consistent, using word choices and recurring phrases to reinforce the atmosphere of Basilisk University and the enigmatic valley.\n\n</story_rules>"
]