[
    "<thinking>\n1. **Plot**: The Author Written Story takes a unique approach to the prompt by framing the narrative within a courtroom setting, where the protagonist is on trial for attempting to have a newborn kill him. This adds a layer of legal drama and irony, contrasting with the Base Story's more straightforward fantasy setting. The Author Written Story introduces conflict through the trial and resolves it with the protagonist's eventual execution, which he welcomes as a release from his long existence. This differs from the Base Story, which focuses on the immediate aftermath of the prophecy revelation and the mother's emotional turmoil.\n\n2. **Creativity**: The Author Written Story creatively blends legal drama with the fantasy element of the chosen one prophecy. It reinterprets the prompt by focusing on the absurdity and irony of the situation, using the courtroom as a stage for this unusual defense. The Base Story, on the other hand, remains within the fantasy genre, exploring the mystical and predestined aspects of the chosen one narrative. The Author Written Story's creativity lies in its unexpected setting and the protagonist's resigned acceptance of his fate.\n\n3. **Development (Character and Setting)**: The Author Written Story develops its characters through dialogue and courtroom interactions, highlighting the eccentricity of the protagonist and the skepticism of the legal system. The setting is primarily the courtroom, which is depicted as a place of both drama and absurdity. In contrast, the Base Story focuses on the emotional depth of the mother and the mystical presence of the stranger, with a setting that emphasizes the fantastical elements of the prophecy.\n\n4. **Language Use**: The Author Written Story employs a tone of irony and dark humor, using legal jargon and courtroom dialogue to create a sense of absurdity. The language is straightforward, with a focus on the interactions between characters and the protagonist's internal monologue. The Base Story uses more descriptive and poetic language, with a focus on the mystical and emotional aspects of the narrative. The Author Written Story's language is more direct and grounded, reflecting the legal setting and the protagonist's weary acceptance of his fate.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Frame the narrative within an unexpected setting that contrasts with the fantastical elements of the prompt, such as a courtroom. Use this setting to introduce conflict and irony, as seen in the trial of the protagonist who wishes for the newborn to fulfill the prophecy.\n  - Resolve the narrative by focusing on the protagonist's acceptance of their fate, using a conclusion that ties back to the initial conflict, such as the protagonist's execution being a release from their long existence.\n\n- **Creativity**:\n  - Blend genres by incorporating elements of legal drama into the fantasy narrative. Use the courtroom as a stage to explore the absurdity and irony of the chosen one prophecy.\n  - Reinterpret the prompt by focusing on the protagonist's resigned acceptance of their fate, highlighting the irony of their situation and the legal system's response to it.\n\n- **Development (Character and Setting)**:\n  - Develop characters through dialogue and interactions within the chosen setting, emphasizing their eccentricities and the skepticism of others. For example, portray the protagonist as eccentric yet resigned, and the legal system as both skeptical and entertained by the unusual defense.\n  - Establish the setting as a place of both drama and absurdity, using it to enhance the narrative's tone and themes. In the courtroom, depict the interactions and reactions of the characters to highlight the story's irony.\n\n- **Language Use**:\n  - Employ a tone of irony and dark humor, using straightforward language and legal jargon to create a sense of absurdity. For example, use phrases like \"Your defence is usually weak, but come on man!\" to convey the judge's disbelief and the courtroom's atmosphere.\n  - Focus on character interactions and internal monologue to convey the protagonist's weary acceptance of their fate, using direct and grounded language that reflects the legal setting and the protagonist's perspective.\n</story_rules>",
    "<thinking>\n1. **Plot**: The Author Written Story diverges from the Base Story by focusing on a humorous and casual interaction between the protagonist and the time traveler. The plot is structured around repeated interruptions, creating a comedic rhythm. The protagonist's nonchalant attitude towards the grave warnings contrasts with the Base Story's more serious tone. The resolution involves a humorous twist where the protagonist is imprisoned in their own home, emphasizing the absurdity of the situation. The Author Written Story engages with the prompt by making the protagonist's decision to stay home a result of annoyance rather than understanding the gravity of the situation.\n\n2. **Creativity**: The Author Written Story employs a comedic approach, using humor to reinterpret the prompt. The protagonist's dismissive attitude and the time traveler's exasperation create a unique dynamic. The story introduces imaginative elements, such as the time traveler's resemblance to the protagonist's father and the VonTrunch family's time loop, which add layers of absurdity and intrigue. This contrasts with the Base Story's more straightforward and serious treatment of time travel and its consequences.\n\n3. **Development (Character and Setting)**: The Author Written Story develops its characters through dialogue and interaction. The protagonist is portrayed as laid-back and irreverent, while the time traveler is persistent and slightly exasperated. The setting is primarily the protagonist's home, which becomes a comedic battleground for their interactions. The story uses the setting to enhance the humor, with repeated doorbell rings and the protagonist's attempts to return to bed. This contrasts with the Base Story's more detailed exploration of the protagonist's internal conflict and the broader implications of their decision.\n\n4. **Language Use**: The Author Written Story uses casual and humorous language, with short, snappy dialogue that drives the comedic tone. The protagonist's irreverent responses and the time traveler's exasperation are conveyed through informal diction and playful banter. The story employs repetition and comedic timing to enhance the humor, such as the repeated doorbell rings and the protagonist's changing demands for silence. This contrasts with the Base Story's more formal and descriptive language, which creates a sense of tension and urgency.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Structure the story around a series of humorous interruptions, using the protagonist's repeated attempts to return to bed as a comedic device. For example, have the protagonist close the door multiple times, only to be interrupted by the doorbell.\n  - Resolve the narrative with a humorous twist that emphasizes the absurdity of the situation, such as the protagonist being imprisoned in their own home due to their flippant attitude.\n\n- **Creativity**:\n  - Employ a comedic approach to the prompt, using humor to reinterpret the concept of time travel and its consequences. For instance, introduce a time traveler who resembles a family member, adding a layer of absurdity.\n  - Incorporate imaginative elements, such as a family caught in a time loop due to a mathematical error, to add intrigue and humor to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop characters through dialogue and interaction, focusing on the protagonist's laid-back and irreverent attitude and the time traveler's persistence and exasperation. Use dialogue to reveal character traits and dynamics.\n  - Use the setting, primarily the protagonist's home, as a comedic battleground for interactions. Enhance the humor with repeated elements, such as doorbell rings and the protagonist's attempts to return to bed.\n\n- **Language Use**:\n  - Use casual and humorous language, with short, snappy dialogue that drives the comedic tone. Convey the protagonist's irreverent responses and the time traveler's exasperation through informal diction and playful banter.\n  - Employ repetition and comedic timing to enhance the humor, such as repeated doorbell rings and the protagonist's changing demands for silence. Use these elements to create a rhythm and build comedic tension.\n</story_rules>",
    "<thinking>\n1. **Plot**: The Author Written Story diverges significantly from the Base Story by introducing a fantastical and science fiction setting, where the protagonist is thrust into a cosmic conflict against their will. The plot is driven by a reluctant hero narrative, where the protagonist is initially resistant to their role in saving a planet. The story explores themes of destiny, choice, and moral ambiguity, contrasting with the Base Story's more straightforward detective narrative. The conflict is internal and external, with the protagonist grappling with their unwillingness to participate and the external threat posed by the People. The resolution is not a complete acceptance of the hero's role but a reluctant agreement to act, motivated by personal gain rather than altruism.\n\n2. **Creativity**: The Author Written Story creatively reinterprets the prompt by setting it in a science fiction universe with interplanetary stakes. The narrative incorporates elements of destiny and cosmic responsibility, blending them with a critique of human expansionism and environmental destruction. The protagonist's cynicism and the moral complexity of their choices add depth to the narrative, contrasting with the Base Story's more conventional moral clarity. The story uses imaginative elements like interplanetary travel, a mysterious being, and the concept of Earth as a buffer planet to create a unique narrative landscape.\n\n3. **Development (Character and Setting)**: The protagonist in the Author Written Story is developed as a reluctant and cynical character, providing a fresh take on the hero archetype. Their internal conflict and skepticism about the mission add layers to their character. The setting is vividly described, with references to a hellish planet, Martian refugees, and the cosmic implications of Earth's destruction. This creates an immersive and expansive universe that contrasts with the more confined and realistic setting of the Base Story.\n\n4. **Language Use**: The Author Written Story employs a conversational and informal tone, with dialogue that reveals character motivations and conflicts. The use of first-person perspective allows for an intimate exploration of the protagonist's thoughts and feelings. The language is direct and often blunt, reflecting the protagonist's frustration and cynicism. Descriptive language is used to paint a vivid picture of the setting and the stakes involved, while rhetorical questions and sarcasm add to the narrative's tone. This contrasts with the Base Story's more formal and descriptive style, which focuses on creating a somber and reflective mood.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a protagonist who is thrust into an unwanted role, emphasizing their reluctance and resistance to the task at hand. Use a narrative hook that immediately places the protagonist in a situation where they must confront their destiny, such as being whisked away to a foreign planet.\n  - Develop the plot around a central conflict that is both internal and external. The protagonist should grapple with their unwillingness to participate in a cosmic mission while facing an external threat that has universal implications. For example, the protagonist might be tasked with saving a planet to prevent a larger catastrophe.\n  - Resolve the narrative with a reluctant acceptance of the protagonist's role, motivated by personal gain or a pragmatic understanding of the situation rather than pure altruism. The resolution should leave room for moral ambiguity and personal conflict.\n\n- **Creativity**:\n  - Set the story in a science fiction universe with interplanetary stakes, incorporating imaginative elements such as interplanetary travel, mysterious beings, and cosmic responsibilities. Use these elements to create a unique narrative landscape that challenges conventional hero narratives.\n  - Integrate themes of destiny, choice, and moral ambiguity into the narrative. The protagonist should question the morality of their mission and the innocence of those they are meant to save, adding depth and complexity to the story. For instance, the protagonist might question the innocence of a civilization that has destroyed its own planet.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a reluctant and cynical character, providing a fresh take on the hero archetype. Use internal monologue and dialogue to reveal their skepticism and internal conflict about the mission.\n  - Create an immersive and expansive setting that reflects the story's themes and stakes. Use vivid descriptions to convey the alien and cosmic nature of the setting, such as a hellish planet or the concept of Earth as a buffer planet. This should contrast with the protagonist's desire for a simpler, more familiar life.\n\n- **Language Use**:\n  - Employ a conversational and informal tone, using dialogue to reveal character motivations and conflicts. The protagonist's voice should be direct and often blunt, reflecting their frustration and cynicism.\n  - Use first-person perspective to provide an intimate exploration of the protagonist's thoughts and feelings. This perspective allows for a deeper connection with the protagonist's internal conflict and skepticism.\n  - Incorporate rhetorical questions and sarcasm to add to the narrative's tone, using these devices to highlight the protagonist's cynicism and the moral complexity of their choices. For example, the protagonist might sarcastically question the value of saving a civilization that has caused its own downfall.\n</story_rules>",
    "<thinking>\n1. **Plot**:\n   - The Author Written Story begins with an unexpected setting for an alien landing, New Zealand, which contrasts with the typical expectation of a major power like the United States. This choice immediately subverts the common trope of alien invasions targeting powerful nations.\n   - The plot introduces the aliens as refugees in need of help, aligning with the prompt's theme. The narrative unfolds with a focus on human kindness and cooperation, as opposed to fear and hostility.\n   - The resolution is hopeful, with humans offering assistance and the aliens expressing gratitude, creating a sense of unity and shared humanity.\n\n2. **Creativity**:\n   - The story creatively reinterprets the prompt by choosing an unconventional location and focusing on ordinary people rather than government or military responses.\n   - The aliens are depicted with unique physical characteristics and a malfunctioning translator, adding humor and relatability to their introduction.\n   - The narrative includes a twist with the aliens having a child onboard, which deepens the emotional impact and emphasizes their vulnerability.\n\n3. **Development (Character and Setting)**:\n   - Characters are developed through their actions and dialogue, showcasing a range of human responses from curiosity to compassion.\n   - The setting of a ski resort on Mount Ruapehu is vividly described, grounding the story in a specific and unusual location that contrasts with typical alien encounter settings.\n   - The characters' willingness to help the aliens highlights their individual traits and the collective spirit of the community.\n\n4. **Language Use**:\n   - The language is informal and conversational, with a focus on dialogue that captures the characters' personalities and the situation's absurdity.\n   - The use of humor and colloquial expressions (\"Mate, most our countries aren't even unified\") adds authenticity and relatability.\n   - Descriptive language is used to create vivid imagery, such as the aliens' neon pink skin and the mountain's long white cloud, enhancing the story's visual appeal.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with an unexpected and unconventional setting for the alien landing, such as a small or remote location that defies typical expectations. For example, choose a place like New Zealand instead of a major world power.\n  - Introduce the aliens as refugees in need of help, aligning with the prompt's theme. Focus on the human response of kindness and cooperation rather than fear or hostility.\n  - Resolve the narrative with a hopeful and unifying conclusion, where humans offer assistance and the aliens express gratitude, emphasizing shared humanity and compassion.\n\n- **Creativity**:\n  - Incorporate unique and imaginative elements in the depiction of aliens, such as distinctive physical characteristics or humorous situations, like a malfunctioning translator that initially garbles their speech.\n  - Add a twist to the narrative that deepens the emotional impact, such as revealing that the aliens have a child onboard, highlighting their vulnerability and need for refuge.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their actions and dialogue, showcasing a range of human responses from curiosity to compassion. Use dialogue to reveal character traits and build relationships.\n  - Establish a vivid and specific setting that contrasts with typical alien encounter locations. Use descriptive language to create a strong sense of place, such as a ski resort on a mountain.\n  - Highlight the collective spirit of the community and individual characters' willingness to help, emphasizing themes of unity and cooperation.\n\n- **Language Use**:\n  - Use informal and conversational language, focusing on dialogue that captures the characters' personalities and the situation's absurdity. Include colloquial expressions to add authenticity and relatability.\n  - Employ humor and light-heartedness in the narrative, using situations or dialogue that bring levity to the story, such as a character's casual response to the aliens' request for a world leader.\n  - Use descriptive language to create vivid imagery and enhance the story's visual appeal, such as describing the aliens' neon pink skin or the mountain's long white cloud.\n</story_rules>",
    "<thinking>\n1. **Plot**: The Author Written Story presents a plot that revolves around the aftermath of defeating a hero, focusing on the mundane and bureaucratic aspects of villainy. The narrative is structured around a conversation between Ruduxo and his henchman, Gizbolt, which reveals a systematic approach to villainy governed by an organization (WPO). The story introduces conflict through Gizbolt's confusion and Ruduxo's unexpected plan for a vacation, maintaining engagement through dialogue and the promise of future plots. In contrast, the Base Story explores existential questions and a potential shift in the villain's role, focusing on introspection and a change of heart.\n\n2. **Creativity**: The Author Written Story creatively integrates a bureaucratic system (WPO) that oversees heroes and villains, adding a layer of realism and humor to the narrative. The story blends mundane activities, like eating dinner, with the fantastical elements of villainy, creating a unique juxtaposition. The Base Story, however, leans towards a more traditional fantasy setting with a focus on introspection and moral ambiguity.\n\n3. **Development (Character and Setting)**: Characters in the Author Written Story are developed through dialogue and actions, with Ruduxo portrayed as a laid-back yet strategic villain, and Gizbolt as a curious and somewhat naive henchman. The setting is a villain's lair, depicted through everyday activities, which contrasts with the grandiose and dark setting of the Base Story's castle. The Author Written Story's setting is more intimate and less foreboding.\n\n4. **Language Use**: The Author Written Story employs casual and humorous language, with a focus on dialogue to drive the narrative. The tone is light-hearted, with a conversational style that contrasts with the more formal and introspective language of the Base Story. The Author Written Story uses simple, direct sentences and incorporates humor through the characters' interactions and the absurdity of their situation.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Structure the narrative around a central conversation that reveals the aftermath of defeating a hero. Use this dialogue to explore the bureaucratic and mundane aspects of villainy.\n  - Introduce conflict through the henchman's confusion and the villain's unexpected plans, maintaining engagement through dialogue and the promise of future plots. For example, have the villain reveal a plan for a vacation or a new scheme.\n\n- **Creativity**:\n  - Integrate a bureaucratic system that oversees heroes and villains, adding a layer of realism and humor. For instance, mention an organization like the WPO that monitors villainous activities and balances hero-villain dynamics.\n  - Blend mundane activities with fantastical elements, such as discussing villainy over dinner, to create a unique juxtaposition that adds humor and relatability.\n\n- **Development (Character and Setting)**:\n  - Develop characters through dialogue and actions, portraying the villain as laid-back yet strategic, and the henchman as curious and somewhat naive. Use their interactions to reveal their personalities and relationship.\n  - Set the story in an intimate and less foreboding environment, such as a villain's lair during a meal, to contrast with traditional dark and grandiose settings. Use everyday activities to ground the fantastical elements.\n\n- **Language Use**:\n  - Employ casual and humorous language, focusing on dialogue to drive the narrative. Use a light-hearted tone and a conversational style to create an engaging and accessible story.\n  - Use simple, direct sentences and incorporate humor through character interactions and the absurdity of their situation. For example, include lines like \"Tell Chef another A1 meal!\" to add levity and character depth.\n</story_rules>",
    "<thinking>\n1. **Plot**: The Author Written Story takes a humorous and satirical approach to the \"chosen one\" trope, focusing on the absurdity of expecting a child to fulfill such a role. The plot revolves around a conversation between a mother and an Elder Guardian, where the mother firmly rejects the idea of her young son being the chosen one. The story resolves with the mother setting conditions for her son's involvement, emphasizing parental protection and the child's right to a normal upbringing. In contrast, the Base Story follows a more straightforward narrative where the protagonist is approached by an eccentric figure claiming they are the chosen one, but the protagonist dismisses the claim and calls the police, leading to a more mundane resolution.\n\n2. **Creativity**: The Author Written Story creatively subverts the chosen one narrative by introducing a comedic element through the mother's practical concerns and sarcastic remarks. The story blends fantasy with real-world parenting issues, creating a unique and engaging narrative. The Base Story, while also incorporating humor, leans more towards a traditional fantasy setup with a mysterious prophecy and a reluctant hero, lacking the same level of creative subversion.\n\n3. **Development (Character and Setting)**: In the Author Written Story, characters are developed through dialogue and their reactions to the situation. The mother is portrayed as protective and pragmatic, while the Elder Guardian is depicted as ancient and somewhat out of touch with modern parenting. The setting is minimal but effectively supports the dialogue-driven narrative. The Base Story provides a more detailed setting with the alley behind a coffee shop, but character development is less nuanced, focusing on the protagonist's skepticism and the eccentricity of the elderly man.\n\n4. **Language Use**: The Author Written Story employs witty and sarcastic dialogue to convey humor and character dynamics. The language is informal and conversational, with a focus on the mother's perspective. The Base Story uses a more descriptive and narrative style, with a mix of dialogue and internal monologue to convey the protagonist's skepticism and the surreal nature of the encounter. The Author Written Story's language is more direct and focused on the comedic exchange between characters.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Structure the story around a humorous and satirical take on the \"chosen one\" trope. Focus on the absurdity of the situation and the practical concerns of a parent when faced with such a scenario.\n  - Resolve the narrative by emphasizing the importance of a child's normal upbringing and parental protection. Allow the parent to set conditions for the child's involvement in any fantastical role, highlighting their authority and care.\n\n- **Creativity**:\n  - Subvert traditional fantasy elements by introducing real-world concerns and humor. Use the juxtaposition of fantastical elements with mundane parenting issues to create a unique narrative.\n  - Incorporate comedic elements through the characters' dialogue and reactions. Use sarcasm and wit to highlight the absurdity of the situation and engage the reader.\n\n- **Development (Character and Setting)**:\n  - Develop characters primarily through dialogue and their responses to the situation. Focus on the parent's protective nature and the fantastical figure's ancient perspective.\n  - Keep the setting minimal and focused on supporting the dialogue-driven narrative. Use the setting to enhance the comedic and satirical tone of the story.\n\n- **Language Use**:\n  - Employ witty and sarcastic dialogue to convey humor and character dynamics. Use informal and conversational language to reflect the parent's perspective and enhance the comedic tone.\n  - Focus on direct and engaging exchanges between characters. Use language that highlights the contrast between the fantastical elements and the parent's practical concerns, such as: \"That's great and all, but he's 8. What exactly is an 8 year old chosen one going to do? He has school, homework and soccer practice.\"\n</story_rules>",
    "<thinking>\n1. **Plot**:\n   - The Author Written Story begins with a series of personal setbacks for the protagonist, establishing a tone of despair and hopelessness. The protagonist's girlfriend leaves him, and he loses his job, setting the stage for his emotional and financial ruin. This sequence of events is crucial as it builds the protagonist's character and sets up the emotional state that leads to the encounter with the thief.\n   - The story introduces the thief in a moment of vulnerability for the protagonist, who is drunk and emotionally drained. The interaction between the protagonist and the thief is unexpected, as the thief expresses concern rather than malice. This twist aligns with the prompt by subverting the typical expectations of a break-in scenario.\n   - The resolution is open-ended, with the protagonist and the thief sharing a moment of understanding. The story concludes with the protagonist acknowledging his rough day and accepting the thief's offer to talk, suggesting a potential turning point in his life.\n\n2. **Creativity**:\n   - The Author Written Story creatively subverts the typical break-in narrative by having the thief express genuine concern for the protagonist. This unexpected twist adds depth to the story and aligns with the prompt's theme of the thief being horrified for the protagonist.\n   - The story blends elements of dark humor and pathos, using the protagonist's dire circumstances to elicit both sympathy and a sense of irony. The thief's unexpected empathy adds a layer of complexity to the narrative, making it more engaging and thought-provoking.\n\n3. **Development (Character and Setting)**:\n   - The protagonist is developed through his internal monologue and interactions, revealing his emotional state and backstory. His despair is palpable, and his willingness to engage with the thief highlights his need for connection.\n   - The setting is minimal but effective, with the empty fridge and bare living room symbolizing the protagonist's desolation. The setting reinforces the themes of poverty and isolation, creating a vivid backdrop for the story's events.\n\n4. **Language Use**:\n   - The Author Written Story employs a conversational and introspective tone, with the protagonist's internal monologue providing insight into his thoughts and feelings. The use of first-person perspective creates intimacy and immediacy.\n   - Dialogue is used effectively to reveal character and advance the plot. The thief's concern is conveyed through his words, and the protagonist's responses reflect his emotional state.\n   - The story uses humor and irony to balance the darker themes, with phrases like \"copious amounts of liquid courage\" and \"I like to think I stayed cool, calm and collected\" adding levity to the narrative.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a series of personal setbacks for the protagonist, establishing a tone of despair and hopelessness. Use events such as a breakup and job loss to set the stage for the protagonist's emotional and financial ruin.\n  - Introduce the thief during a moment of vulnerability for the protagonist. Ensure the interaction is unexpected, with the thief expressing concern rather than malice, subverting typical expectations of a break-in scenario.\n  - Conclude the story with an open-ended resolution, where the protagonist and the thief share a moment of understanding. Allow the protagonist to acknowledge his rough day and accept the thief's offer to talk, suggesting a potential turning point.\n\n- **Creativity**:\n  - Subvert the typical break-in narrative by having the thief express genuine concern for the protagonist. Use this unexpected twist to add depth and align with the prompt's theme of the thief being horrified for the protagonist.\n  - Blend elements of dark humor and pathos, using the protagonist's dire circumstances to elicit both sympathy and a sense of irony. Use the thief's unexpected empathy to add complexity to the narrative.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through internal monologue and interactions, revealing his emotional state and backstory. Highlight his despair and need for connection through his willingness to engage with the thief.\n  - Create a minimal but effective setting, using elements like an empty fridge and bare living room to symbolize the protagonist's desolation. Use the setting to reinforce themes of poverty and isolation.\n\n- **Language Use**:\n  - Employ a conversational and introspective tone, using the protagonist's internal monologue to provide insight into his thoughts and feelings. Use first-person perspective to create intimacy and immediacy.\n  - Use dialogue to reveal character and advance the plot. Convey the thief's concern through his words, and reflect the protagonist's emotional state in his responses.\n  - Balance darker themes with humor and irony. Use phrases like \"copious amounts of liquid courage\" and \"I like to think I stayed cool, calm and collected\" to add levity to the narrative.\n</story_rules>"
]