[
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used in crafting the rules. The few-shot demonstrations emphasize introspective and emotional narratives, vivid imagery, and the use of metaphor and symbolism. They also focus on character development through introspection and interaction with symbolic elements. The language is often lyrical and evocative, with a strong emphasis on sensory details and emotional depth.\n\nFor the new writing prompt, the rules will need to guide the narrative from the ordinary to the extraordinary, focusing on the transformation of the blue afghan and its implications. The rules should encourage creativity in exploring the concept of infinity and the universe, while maintaining a strong emotional and introspective core. The examples will illustrate how to weave the ordinary into the boundless, using vivid imagery and metaphor to convey the transformation.\n\nI will ensure the rules are actionable, specific, and include examples that align with the new writing prompt's themes and narrative potential.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Begin the narrative with a focus on the ordinary setting, using the blue afghan as a central object that grounds the story in reality. Describe the afghan in detail, noting its texture and color as it rests on the couch.\n  - Develop the plot by gradually introducing the transformation of the afghan, using vivid imagery to depict its unraveling and expansion into the universe. For example, \"The threads began to shimmer, stretching beyond the confines of the room, weaving into the night sky.\"\n  - Conclude with the protagonist's realization or acceptance of the boundless nature of the universe, using the transformation as a metaphor for personal growth or understanding.\n\n- **Creativity**:\n  - Use metaphor and symbolism to explore the concept of infinity and the universe. Allow the afghan to represent both the comfort of the familiar and the mystery of the unknown. For instance, \"Each thread a star, each knot a galaxy, the afghan became a map of the cosmos.\"\n  - Encourage imaginative exploration of the transformation, considering how the ordinary can become extraordinary. Use the afghan's transformation to reflect on themes of connection, continuity, and the infinite possibilities of existence.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist through their interaction with the afghan and their response to its transformation. Use introspection to reveal their thoughts and emotions as they witness the ordinary becoming boundless.\n  - Describe the setting with attention to detail, using sensory imagery to create a vivid backdrop for the transformation. For example, \"The room was filled with the soft glow of the afghan's threads, casting shadows that danced like constellations on the walls.\"\n  - Use the transformation to deepen the protagonist's understanding of their place in the universe, highlighting their emotional journey and personal growth.\n\n- **Language Use**:\n  - Employ a lyrical and evocative style, using rich imagery and metaphor to convey the transformation of the afghan and its implications. Focus on sensory details to create an immersive narrative experience.\n  - Use poetic diction to enhance the narrative's emotional depth, allowing the language to reflect the wonder and mystery of the transformation. For example, \"The afghan whispered secrets of the stars, its threads singing the song of the universe.\"\n  - Maintain an introspective and contemplative tone, allowing the protagonist's internal reflections to drive the narrative and convey the story's themes.\n</story_rules>",
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify key storytelling elements such as introspection, emotional depth, and the use of vivid imagery. The new prompt involves themes of obsession, fear, and the supernatural, which require a nuanced approach to plot development, creativity, character and setting development, and language use. I will ensure the rules are specific to the prompt, providing detailed guidance and examples that reflect the haunting and mysterious tone of the narrative. The rules will be structured to guide the LLM in creating a story that explores the psychological and emotional complexities of the characters while maintaining a suspenseful and eerie atmosphere.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Develop a dual narrative structure that alternates between the photographer's growing obsession and the mother's escalating nightmares. Use this structure to build tension and suspense, gradually revealing the connection between the two characters.\n  - Create a pivotal scene where the photographer discovers a disturbing truth about the girl's identity or the nature of his obsession, leading to a climax that intertwines both narratives. For example, the photographer might find an old photograph of the girl in a forgotten archive, realizing she has not aged in decades.\n\n- **Creativity**:\n  - Use symbolic imagery to enhance the haunting and mysterious atmosphere of the story. Incorporate elements such as shadows, reflections, and distorted images to reflect the photographer's obsession and the mother's fears.\n  - Introduce subtle supernatural elements that blur the line between reality and nightmare, such as the girl's eyes appearing to follow the photographer in every photograph, or the mother experiencing déjà vu with strangers who seem eerily familiar.\n\n- **Development (Character and Setting)**:\n  - Develop the photographer as a complex character driven by a mix of artistic passion and an unsettling obsession. Use his internal monologue and interactions with his work to reveal his psychological state.\n  - Portray the mother as a deeply protective and intuitive character, whose nightmares are vivid and symbolic of her fears. Use her dreams to provide insight into her emotional turmoil and the mysterious connection to the photographer.\n  - Set the story in a moody, atmospheric environment that enhances the eerie tone, such as a foggy coastal town or an old, dimly lit studio filled with vintage photography equipment.\n\n- **Language Use**:\n  - Employ a descriptive and atmospheric writing style, using rich, sensory language to evoke the haunting and suspenseful mood of the story. For example, describe the girl's eyes as \"pools of shadow that seem to hold secrets untold.\"\n  - Use metaphor and simile to convey the intensity of the photographer's obsession and the mother's fear. For instance, compare the photographer's fixation to \"a moth drawn to a flame, unable to resist the pull of the light.\"\n  - Maintain a tone of suspense and unease throughout the narrative, using pacing and sentence structure to build tension and keep the reader engaged.\n</story_rules>"
]