[
    "<thinking>\nAnalyze the few-shot examples to understand the structure and level of detail required for the **Story Rules**. Focus on how the rules are tailored to the specific writing prompt, ensuring they provide comprehensive and actionable guidance. The new writing prompt involves creating a scene with two historical or literary figures, emphasizing their contrasting philosophies, desires, or vulnerabilities. The rules should guide the narrative to highlight these contrasts and the transformative nature of their interaction.\n\nKey elements to consider:\n- **Plot**: How to structure the scene, the nature of the interaction, and the resolution.\n- **Creativity**: Encouraging imaginative and unexpected pairings, and unique settings or scenarios.\n- **Development (Character and Setting)**: Detailed character development, establishing the setting, and how these elements interact.\n- **Language Use**: Tone, style, and techniques to convey the characters' philosophies and emotions.\n\nUse these insights to craft detailed, standalone rules for each category, ensuring they align with the new writing prompt.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the scene with a clear but subtle introduction of the two characters, hinting at their historical or literary backgrounds.\n  - Develop the interaction through dialogue and actions that reveal their contrasting philosophies, desires, or vulnerabilities.\n  - Create a moment of tension or conflict that forces the characters to confront their differences.\n  - Resolve the scene with a transformative moment that leaves a lasting impact on both characters, whether through mutual understanding, a shift in perspective, or a deepened sense of their own beliefs.\n\n- **Creativity**:\n  - Choose historical or literary figures who are unlikely to have met, ensuring their interaction is both surprising and thought-provoking.\n  - Set the scene in an imaginative or symbolic location that enhances the thematic elements of the interaction.\n  - Incorporate elements of magical realism or surrealism to heighten the emotional and philosophical stakes of the encounter.\n  - Use creative metaphors and symbols to underscore the characters' internal struggles and the transformative nature of their meeting.\n\n- **Development (Character and Setting)**:\n  - Develop each character's background, motivations, and philosophies through their dialogue and inner thoughts.\n  - Highlight the contrasts between the characters, using their interactions to reveal their vulnerabilities and desires.\n  - Establish the setting with rich, sensory details that reflect the emotional and philosophical themes of the scene.\n  - Ensure the setting plays a role in the interaction, influencing the characters' actions and the outcome of their meeting.\n\n- **Language Use**:\n  - Use a tone that reflects the gravity and intensity of the characters' interaction, balancing formality with emotional depth.\n  - Employ rich, descriptive language to convey the characters' philosophies and the atmosphere of the setting.\n  - Use dialogue to reveal the characters' inner thoughts and beliefs, ensuring it feels authentic to their historical or literary context.\n  - Incorporate poetic and symbolic language to enhance the emotional and philosophical impact of the scene.\n</story_rules>"
]