[
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used in crafting the rules. The few-shot demonstrations emphasize a narrative that unfolds through character interactions, humor, and cultural references, with a focus on character development and setting. The rules are structured into categories: Plot, Creativity, Development (Character and Setting), and Language Use, each with specific, actionable instructions and examples.\n\nFor the new writing prompt, the rules will need to focus on the emotional complexity of reconnecting with an old friend, the tension of unresolved betrayal, and the charm that once defined the relationship. The examples will illustrate how to convey these themes through dialogue, internal monologue, and vivid descriptions, ensuring the narrative captures the nuances of rekindled friendship and underlying conflict.\n\nThe rules will be tailored to guide the LLM in creating a story that explores the dynamics of friendship, trust, and reconciliation, using a tone that balances nostalgia with tension. The examples will demonstrate how to reveal character motivations and emotions through interactions and reflections, aligning with the prompt's themes and narrative potential.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Structure the narrative around the gradual unfolding of past events and emotions through interactions and reflections. Use the reconnection with the old friend as a catalyst for exploring unresolved issues and emotions. For example, depict a scene where you and your friend reminisce about a shared experience, only for the conversation to subtly shift towards the betrayal.\n  - Allow the story to progress through a series of encounters and dialogues that reveal the complexity of your relationship. Avoid a straightforward resolution, instead focusing on the emotional journey and the tension between nostalgia and unresolved conflict.\n\n- **Creativity**:\n  - Incorporate elements of charm and tension in the narrative, using humor and irony to highlight the contrast between past and present. Use these elements to explore themes of trust and reconciliation, such as a humorous anecdote that masks underlying tension.\n  - Use imaginative dialogue and scenarios to reveal the characters' personalities and the impact of their shared history. Create scenes where the charm of the old friend is evident, yet tinged with the weight of past betrayal.\n\n- **Development (Character and Setting)**:\n  - Develop characters through their interactions and internal monologues, revealing their emotions, motivations, and the evolution of their relationship. Use dialogue to show the charm of the old friend and the protagonist's mixed feelings about the reconnection.\n  - Create a vivid setting that reflects the emotional tone of the narrative, using sensory details to enhance the atmosphere. For example, describe a familiar location that evokes memories of the past, adding depth to the characters' interactions.\n\n- **Language Use**:\n  - Employ a reflective and conversational tone, focusing on dialogue and internal monologue to convey the characters' thoughts and emotions. Use idiomatic expressions and humor to capture the charm and tension of the relationship.\n  - Use first-person narration to provide an intimate view of the protagonist's thoughts and experiences. Include internal reflections on the complexity of the friendship and the unresolved betrayal, such as contemplating the friend's unchanged charm and the lingering sense of hurt.\n  - Incorporate vivid and sensory language to describe the setting and actions, such as the warmth of a familiar café or the chill of a shared memory, to enhance the emotional impact of the narrative.\n</story_rules>",
    "<thinking>\nTo generate the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used in crafting the rules. The few-shot demonstrations emphasize a vignette-style narrative, character-driven plots, and a blend of humor and surreal elements. They also focus on creating immersive settings and using language that reflects the characters' emotions and environments.\n\nFor the new writing prompt, the rules will need to capture the gritty, nostalgic atmosphere of 1970s Times Square, the protagonist's sense of entrapment and longing, and the tension of the mysterious job interview. The examples will illustrate how to convey these elements through plot, creativity, character and setting development, and language use.\n\nI will ensure the rules are actionable, specific, and include detailed examples that align with the new writing prompt's themes and narrative potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Structure the narrative around the protagonist's daily routine in the cigarette booth and the anticipation of the job interview. Use the protagonist's interactions with customers to reveal their inner thoughts and desires. For example, depict a scene where the protagonist hands a pack of cigarettes to a regular customer while daydreaming about the possibilities the interview might bring.\n  - Introduce the job interview as a pivotal moment that disrupts the protagonist's routine. Use this event to explore themes of ambition, risk, and the unknown. For instance, describe the protagonist's internal conflict as they weigh the potential escape against the uncertainty of the job offer.\n\n- **Creativity**:\n  - Incorporate elements of nostalgia and the gritty atmosphere of 1970s Times Square to enhance the narrative. Use sensory details to evoke the era's unique vibe, such as the neon lights, bustling crowds, and the ever-present smell of tobacco. For example, describe the protagonist's view from the booth as a kaleidoscope of neon signs and hurried footsteps.\n  - Use the job interview as an opportunity to introduce surreal or unexpected elements that challenge the protagonist's perceptions. Create a scene where the interview takes place in an unusual setting, such as a dimly lit backroom filled with eccentric characters.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist's character through their interactions with customers and their internal monologue. Use these elements to reveal their aspirations, frustrations, and personality. For example, show the protagonist's impatience with a particularly demanding customer, reflecting their desire for change.\n  - Create an immersive setting by vividly describing the cigarette booth and its surroundings. Use sensory language to capture the sights, sounds, and smells of Times Square, such as the constant hum of traffic and the flickering neon lights.\n\n- **Language Use**:\n  - Employ a conversational and introspective tone, focusing on the protagonist's thoughts and emotions. Use first-person narration to provide an intimate view of their experiences and aspirations. For example, include internal reflections on the monotony of the job and the allure of the interview.\n  - Use vivid and sensory language to convey the setting and the protagonist's emotions. Describe the cigarette booth as a \"tiny island in a sea of chaos,\" capturing the protagonist's sense of isolation and longing for escape.\n</story_rules>"
]