[
    "<thinking>\nTo craft the **Story Rules** for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used in the rules. The few-shot demonstrations emphasize a deep exploration of internal conflict, societal pressures, and emotional depth, often using vivid imagery and introspective language. The rules are organized into categories that guide plot development, creativity, character and setting development, and language use, with each rule accompanied by concrete examples.\n\nFor the new prompt, the rules will need to focus on the themes of tradition versus modernity, societal judgment, and personal loss. The plot should center around Chichi's defiance and the subsequent tragedy, while creativity should explore the cultural and emotional landscape. Character development will focus on Chichi and her mother's relationship and their interactions with the community. Language use should reflect the emotional weight and cultural context of the story.\n\nI will ensure the rules are actionable, specific, and include examples that align with the new prompt's themes and narrative potential.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Begin the story with a scene that highlights Chichi's decision to use a modern method of childbirth, setting the stage for the conflict with traditional village norms. For example, describe a tense conversation between Chichi and a village elder who warns her of the consequences.\n  - Develop the narrative around the aftermath of the tragedy, focusing on Chichi and her mother's emotional journey and their interactions with the community. Use specific incidents, such as a public confrontation or a private moment of grief, to drive the plot forward.\n  - Conclude the story with a moment of introspection or a symbolic gesture that reflects Chichi's acceptance of her choices and the beginning of healing. Avoid providing a clear resolution, allowing the narrative to end on an emotionally resonant note.\n\n- **Creativity**:\n  - Incorporate cultural elements and traditions into the narrative, using them to contrast with Chichi's modern choices. For example, describe a traditional village ceremony that Chichi chooses not to attend, highlighting her defiance.\n  - Use symbolic imagery to convey the emotional weight of the story, such as describing the whispers of the community as a \"storm of shadows\" that follows Chichi and her mother.\n\n- **Development (Character and Setting)**:\n  - Develop Chichi and her mother as complex characters, focusing on their relationship and individual emotional arcs. Use internal monologues and dialogues to reveal their thoughts, feelings, and motivations.\n  - Depict the village setting with attention to its cultural and traditional aspects, using it to enhance the themes of societal judgment and personal defiance. For example, describe the village as a place where \"every corner holds the weight of history and expectation.\"\n\n- **Language Use**:\n  - Employ evocative and introspective language to capture the emotional depth of the story. Use metaphors and vivid imagery to convey the characters' internal struggles and the cultural context. For example, describe Chichi's grief as \"a river that carves its path through the heart, relentless and unyielding.\"\n  - Use dialogue sparingly but effectively to reveal character dynamics and societal pressures. For instance, include a line where a villager says, \"Tradition is the thread that binds us, and you have chosen to unravel it,\" to highlight the community's resistance to change.\n</story_rules>",
    "<thinking>\nTo generate the Story Rules for the new writing prompt, I will analyze the few-shot demonstrations to identify the style, structure, and level of detail used in crafting the rules. The few-shot demonstrations emphasize a deep exploration of internal conflict, the use of vivid imagery and metaphor, and a focus on character development and emotional depth. The rules are structured into categories: Plot, Creativity, Development (Character and Setting), and Language Use, each with specific, actionable instructions and examples.\n\nFor the new prompt, the rules will need to focus on the young girl's internal struggle with her mother's manipulation, her journey towards self-discovery, and the dynamics of power and identity. The examples will illustrate these themes, using vivid language and introspective narrative to capture the protagonist's emotional journey. The rules will be tailored to guide the narrative in exploring the protagonist's complex relationship with her mother and her quest for autonomy.\n\nI will ensure the rules are comprehensive, providing detailed guidance on plot development, creative elements, character and setting development, and language use, all aligned with the new writing prompt's themes and objectives.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Structure the narrative around pivotal moments where the young girl confronts her mother's manipulative behavior, highlighting her internal conflict and growing awareness of her own desires. For example, depict a scene where the girl overhears her mother speaking disparagingly about her to a family friend, sparking a realization of her need for independence.\n  - Focus on the girl's journey of self-discovery, using her interactions with her mother and the world around her to explore themes of loyalty, rebellion, and identity. Allow the plot to evolve through her gradual empowerment and the choices she makes to assert her autonomy.\n\n- **Creativity**:\n  - Use symbolic imagery and metaphors to illustrate the girl's internal struggle and the oppressive influence of her mother. For instance, describe the mother's presence as a shadow that stretches across the girl's path, representing the control she exerts over her life.\n  - Incorporate elements of magical realism to blur the lines between reality and the girl's perception of her world, enhancing the narrative's emotional depth. For example, depict a moment where the girl imagines herself as a bird trapped in a gilded cage, longing to break free.\n\n- **Development (Character and Setting)**:\n  - Develop the protagonist as a complex character, focusing on her internal monologue and emotional growth. Show her evolving understanding of her own identity and power through her reflections and decisions. For example, illustrate her internal debate as she contemplates whether to confront her mother or continue to play the obedient daughter.\n  - Create a vivid setting that reflects the girl's emotional state and the dynamics of her relationship with her mother. Use specific details, such as the oppressive atmosphere of their home or the vibrant, chaotic world outside, to contrast the girl's internal and external experiences.\n\n- **Language Use**:\n  - Employ a rich, introspective narrative voice, using poetic language and vivid imagery to convey the girl's emotional journey. For example, describe her thoughts as \"a tangled web of loyalty and rebellion, each thread pulling her in a different direction.\"\n  - Use dialogue sparingly but effectively to reveal character dynamics and emotional truths. For instance, include a conversation where the mother subtly undermines the girl's confidence, prompting an internal realization of her need to assert herself.\n  - Focus on the protagonist's internal reflections, using rhetorical questions and contemplative statements to deepen the narrative's emotional impact and explore the themes of identity and empowerment.\n</story_rules>"
]