[
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - Focus on the immediate and visceral depiction of the protagonist's defiance and the subsequent tragedy.\n   - Include direct interactions with the community, vividly depicting their reactions and the protagonist's emotional journey.\n   - Incorporate a recurring motif of tradition versus modernity, juxtaposed with the protagonist's personal loss to create strong emotional tension.\n\n2. **Creativity**:\n   - Use imaginative elements, such as flashbacks or symbolic imagery, to convey the protagonist's inner world and emotional state.\n   - Blend the protagonist's modern choices with traditional elements to create a richer, more layered narrative.\n\n3. **Development (Character and Setting)**:\n   - Provide detailed and immersive depictions of the village setting, including the cultural and traditional aspects that govern life.\n   - Develop the protagonist's character through their actions, thoughts, and interactions with their mother and the community, revealing their inner conflict and sense of loss.\n   - Include nuanced and complex character interactions, particularly between the protagonist and their mother.\n\n4. **Language Use**:\n   - Employ vivid and descriptive language to create an immersive and emotionally resonant narrative.\n   - Use varied and dynamic sentence structures to enhance the pacing and emotional impact of the narrative.\n   - Include direct and impactful dialogue to reveal character emotions and relationships effectively.\n</thinking>\n\n<story_rules>\n- **Plot**:\n  - Focus on the immediate and visceral depiction of Chichi's decision to use a modern method of childbirth and the subsequent tragedy.\n  - Include direct interactions with the community, vividly depicting their reactions and the protagonist's emotional journey.\n  - Incorporate a recurring motif of tradition versus modernity, juxtaposed with Chichi's personal loss to create strong emotional tension.\n  - Highlight the internal conflicts and societal pressures faced by Chichi and her mother, creating a sense of urgency and desperation.\n  - Conclude the narrative with a moment of emotional resolution or realization, rather than a clear-cut solution or reconciliation.\n\n- **Creativity**:\n  - Use imaginative elements, such as flashbacks or symbolic imagery, to convey Chichi's inner world and emotional state.\n  - Blend Chichi's modern choices with traditional elements to create a richer, more layered narrative.\n  - Employ a realistic and somber tone, using vivid descriptions of the characters' suffering and the cultural pressures they face.\n  - Integrate unconventional or imaginative elements through the characters' thoughts and memories, rather than external plot devices.\n\n- **Development (Character and Setting)**:\n  - Provide detailed and immersive depictions of the village setting, including the cultural and traditional aspects that govern life.\n  - Develop Chichi's character through her actions, thoughts, and interactions with her mother and the community, revealing her inner conflict and sense of loss.\n  - Create multidimensional characters with complex motivations and relationships, emphasizing their resilience and vulnerability.\n  - Use the setting to enhance the narrative's tone and themes, making it an integral part of the story rather than just a backdrop.\n\n- **Language Use**:\n  - Employ vivid and descriptive language to create an immersive and emotionally resonant narrative.\n  - Maintain a reflective and poignant tone, focusing on internal thoughts and feelings rather than external actions.\n  - Use varied and dynamic sentence structures to enhance the pacing and emotional impact of the narrative.\n  - Include direct and impactful dialogue to reveal character emotions and relationships effectively.\n</story_rules>",
    "<thinking>\nAnalyze the style, structure, and detailing of the examples to infer patterns and key elements. Use this analysis to determine how to craft the **Story Rules** for the new writing prompt.\n\n1. **Plot**:\n   - Focus on the immediate and visceral depiction of the young girl's relationship with her manipulative mother, detailing specific interactions and power dynamics.\n   - Include scenes that highlight the girl's internal struggle between loyalty to her mother and her desire for independence.\n   - Incorporate moments of rebellion and self-discovery, showing the girl's journey towards claiming her own identity and power.\n   - Conclude with a significant turning point or realization that reflects the girl's growth and changing perspective.\n\n2. **Creativity**:\n   - Use imaginative elements, such as dreams or symbolic imagery, to convey the girl's inner world and emotional state.\n   - Blend the girl's everyday experiences with her imaginative thoughts to create a richer, more layered narrative.\n   - Employ irony and subtle hints to convey the complexities of the girl's relationship with her mother and her evolving sense of self.\n\n3. **Development (Character and Setting)**:\n   - Develop the young girl's character through her actions, thoughts, and interactions with her mother, revealing her inner conflict and growth.\n   - Provide detailed and immersive depictions of the setting, including the household environment and any significant locations that reflect the girl's emotional journey.\n   - Create multidimensional characters, particularly the mother, with complex motivations and relationships, emphasizing the manipulative dynamics and the girl's struggle for autonomy.\n\n4. **Language Use**:\n   - Use rich, descriptive language to create an immersive and emotionally resonant narrative.\n   - Employ varied and dynamic sentence structures to enhance the pacing and emotional impact of the narrative.\n   - Include direct and impactful dialogue to reveal character emotions and relationships effectively.\n   - Maintain a reflective and poignant tone, focusing on the girl's internal thoughts and feelings as she navigates her journey.\n</thinking>\n<story_rules>\n- **Plot**:\n  - Focus on the immediate and visceral depiction of the young girl's relationship with her manipulative mother, detailing specific interactions and power dynamics.\n  - Include scenes that highlight the girl's internal struggle between loyalty to her mother and her desire for independence.\n  - Incorporate moments of rebellion and self-discovery, showing the girl's journey towards claiming her own identity and power.\n  - Conclude with a significant turning point or realization that reflects the girl's growth and changing perspective.\n\n- **Creativity**:\n  - Use imaginative elements, such as dreams or symbolic imagery, to convey the girl's inner world and emotional state.\n  - Blend the girl's everyday experiences with her imaginative thoughts to create a richer, more layered narrative.\n  - Employ irony and subtle hints to convey the complexities of the girl's relationship with her mother and her evolving sense of self.\n\n- **Development (Character and Setting)**:\n  - Develop the young girl's character through her actions, thoughts, and interactions with her mother, revealing her inner conflict and growth.\n  - Provide detailed and immersive depictions of the setting, including the household environment and any significant locations that reflect the girl's emotional journey.\n  - Create multidimensional characters, particularly the mother, with complex motivations and relationships, emphasizing the manipulative dynamics and the girl's struggle for autonomy.\n\n- **Language Use**:\n  - Use rich, descriptive language to create an immersive and emotionally resonant narrative.\n  - Employ varied and dynamic sentence structures to enhance the pacing and emotional impact of the narrative.\n  - Include direct and impactful dialogue to reveal character emotions and relationships effectively.\n  - Maintain a reflective and poignant tone, focusing on the girl's internal thoughts and feelings as she navigates her journey.\n</story_rules>"
]