[
    {
        "post_title": "To the Moon and Back",
        "comment": "Icelebrate the kid’s birthday the day after. Always the day after or the day before, never on the actual date. Always the same shit. Why? Because his honor the judge decided that the kid has to be with his mommy on his birthday, even if she’s a bitch and a liar who fucks every jerk who smiles at her at work. Daddy is less important.\n\nLidor and I go to the mall together, not for a present; the last time I was in a duty-free shop, I bought him a remote-control multicopter drone. Eighty-nine dollars—eighty-nine!—and they didn’t even put batteries for the remote in the box. So we’re going to the mall to pick up some batteries, but I tell Lidor that it’s to have fun. What can I tell him? Not only did Daddy bring his present a day late but he didn’t even check to see if there were batteries inside? No way.\n\nThe bitch. Yesterday I say to her, Let me come to the party, just for ten minutes. To give the kid a kiss, take a shot of him with my cell when he blows out the candles, and then I’ll leave. But she starts with the threats and the restraining orders, texts her boyfriend, the law clerk, while she’s on the line with me—I can actually hear her tapping—and says that if she sees me anywhere near the building she’ll make my life hell.\n\nLidor wants us to fly the drone first and then go to the mall, but there are no batteries in the remote, and I don’t want to tell him that, so I say, We’ll go to the big candy store on the third floor, the one with the SpongeBob SquarePants helium balloons and the lady with yellow teeth who yells, “Come in! Come in! Buy candy for the little boy,” and I’ll buy him another present there, whatever he wants.\n\nLidor says, The mall’s great, but first the drone. I lie to him, tell him that the mall closes early. Luckily for me, he’s still young enough to believe.\n\nThree in the afternoon and the mall is packed. To be with him for his birthday, I had to take half a day off work. Judging by how mobbed the mall is, I must be the only person in this country who works. But Lidor, what a sweet kid, he laughs all the time, never whines, not even when we have to wait in line forever to get inside.\n\nAt the escalator, he wants to go up the down side, for the fun of it, and I go along with him. It’s a good workout for both of us. You have to run as fast as you can so you won’t be dragged down, have to strain the whole time not to fall on your ass. Just like in life. A hunchbacked old lady who is coming down tries to argue with us, asks why we don’t go up the regular way, like everyone else. She’ll be in her grave in another minute, and this is what bothers her? I don’t even answer her.\n\nWhen we get to the candy store on the third floor, the lady with yellow teeth isn’t there, only a pimple-faced teen-ager, as thin as a chopstick. I say to Lidor, “Pick out whatever you want. But only one thing, O.K.? And whatever it is, even if it costs a million shekels, Daddy will buy it for you, promise. What does Lidor want?”\n\nThe kid is excited, walks around the store like a junkie in a pharmacy, looks at the shelves, picks things up, tries to decide. Meanwhile, I use the time to buy AAA batteries. Pimple-Face doesn’t ring them up on the register, even though I wave the money in front of him. “What are we waiting for?” I ask.\n\n“For the kid to decide,” he says, and pulls a string of gum out of his mouth. “I’ll ring them up together.” And, before I can say anything, he starts playing with his cell.\n\nFeatured Video\n\nSwift Justice: A Taliban Courtroom in Session\n\n\n“Do them separately, man,” I insist, shoving the batteries into the bag with the drone. “Before the kid comes over. It’s a surprise.” Pimple-Face rings them up, and the cash-register drawer springs open with a ding. He doesn’t have small bills to make change for me, so he loads me down with coins.\n\nJust then, Lidor comes over. “What did you buy, Daddy?”\n\n“Nothing,” I say. “Just some gum.”\n\n“Where is it?” Lidor asks.\n\n“I swallowed it.”\n\n“But it’s bad to swallow gum,” he says. “It can stick to your stomach.”\n\nPimple-Face gives a stupid laugh.\n\n“You want a present or what?” I say, changing the subject. “Come on, pick out something.”\n\n“I want that,” Lidor says, pointing to the cash register. “So I can play with Yanir and Lyri, like we have a candy store.”\n\n“They don’t sell the cash register,” I say. “Pick out something else.”\n\n“I want the cash register,” Lidor persists. “Daddy, you promised.”\n\n“I said to pick out something that’s for sale.”\n\n“You’re a liar!” Lidor yells and kicks my leg as hard as he can. “Just like Mommy says. You’re all talk.”\n\nThe kick hurts, and, when something hurts me, I get pissed off. But today I manage to control myself. Because I love my son more than anything else in the world, and today’s a special day, his birthday. I mean, the day after his birthday. The bitch.\n\n“How much do you want for the cash register?” I ask Pimple-Face, as cool as can be.\n\n“What are you, six years old?” he says with a crooked smile. “You know it’s not for sale.” He says “six years old” as if Lidor were a moron or something, and I realize now that he’s trapped me. I have to choose a side—either I’m with him or I’m with Lidor.\n\n“A thousand shekels,” I say and extend my hand. “We shake on it now, and I go down to the A.T.M. and come back with the money.”\n\n“It’s not mine,” he says, squirming. “I just work here.”\n\n“So whose is it?” I ask. “The lady with yellow teeth?”\n\n“Yes,” he says, nodding. “Tirza.”\n\n“So get her on the phone,” I say. “Let me talk to her. For a thousand shekels, she can get a new register. A better one.”\n\nLidor looks at me like I’m some kind of a superhero. There’s nothing greater than to have your kid look at you that way. It’s better than a vacation in Thailand. Better than a blow job. Better than punching someone who has it coming. “Go ahead, call her,” I say and give him a little push. Not because I’m angry. For the kid.\n\n\nHe taps in the number and walks away from us, half whispering into the phone. I follow him wherever he goes, Lidor behind us. He looks happy. He was already happy earlier, when I picked him up, but now he’s flying.\n\n“She says no,” Pimple-Face tells me and shrugs as if the word had come from God.\n\n“Give her to me.” I gesture with my hand.\n\n“She says stores don’t sell their cash registers,” he says. I grab the phone away from him. That makes Lidor laugh. Daddy’s making Lidor laugh.\n\n“Youll feel a pinch and then a burn.”\n“You’ll feel a pinch and then a burn.”\nCopy link to cartoon\nLink copied\n\nShop\n“Tirza,” I say. “Hi, this is Gabi, a good customer of yours. You don’t recognize the name, but you’d know my face in a second. Listen, I need you to help me out here. A thousand shekels—you not only buy a new register, but I owe you a favor.”\n\n“And where the fuck will we ring up the thousand?” Tirza asks on the other end of the line. She’s in a noisy place; I can hardly hear her.\n\n“So you don’t ring it up,” I say. “What am I, the Tax Authority? A thousand shekels straight into your pocket. Come on, what do you say?”\n\n“Put him on the phone,” she says impatiently.\n\n“The teen-ager?” I ask.\n\n“Yes,” Tirza says, starting to sound angry. “Put him on.”\n\nI hand the phone to Pimple-Face. He talks to her for a minute, then ends the call. “She says no,” he tells me. “Sorry.”\n\nLidor takes my hand. “Cash register,” he says in his most serious voice. “You promised.”\n\n“Two thousand,” I say to Pimple-Face. “Call her back and tell her I’ll give her two thousand, a thousand now and another thousand tomorrow.”\n\n“But—” Pimple-Face starts.\n\n“I can’t take out more than a thousand at a time,” I interrupt him. “I’ll bring the other thousand tomorrow morning. Don’t worry, I’ll leave you my driver’s license as a guarantee.”\n\n“She told me not to call anymore,” he says. “She’s sitting shivah for her father. She doesn’t want to be disturbed.”\n\n“Sorry for your loss,” I say, putting a consoling arm around his shoulder. “So think about it. Two thousand is a lot of money. If she finds out later that I offered it and you said no, she’ll tear you a new one. Listen to a grownup—it’s not worth getting into trouble over a small thing like this.”\n\nI press the bottom of the cash-register drawer and, bam, it opens. It’s a trick I learned when I worked at the Burger Ranch, after the Army. “Take out the money,” I tell him, but he doesn’t move, so I collect the money for him and stick it into the front pocket of his jeans.\n\n“Stores don’t sell their cash registers,” he says.\n\n“Who cares,” I say. “Trust me, it’s a sweet deal. Wait here for me, and I’ll be back in five minutes with a thousand shekels so the bills in your pocket don’t get lonely.”\n\nBefore he can answer, I take Lidor by the hand and go down to the A.T.M. Sometimes the machine gives me problems, but today it spits out the thousand in blue two-hundred-shekel bills without arguing.\n\nWhen we get back, a sweaty fat guy with a mustache is talking to Pimple-Face. I know him, he owns the frozen-yogurt stand next door. When Pimple-Face sees us come in, he points at me. I wink at him and put the thousand on the counter. “Here,” I say. Pimple-Face doesn’t move. “Come on, take it already! Lighten up!” I pick the bills up and try to shove them into his pocket.\n\n“Leave him alone,” Fat Guy says. “He’s just a kid.”\n\n“I can’t,” I say. “I promised my son. Today’s his birthday.”\n\n“Happy birthday,” Fat Guy says and tousles Lidor’s hair without even looking at him. “Want some ice cream, buddy? A present from me—a cup of ice cream with whipped cream and chocolate syrup and gummy bears on top.” The whole time he’s talking his small eyes stay fixed on me.\n\n“I want the cash register,” Lidor says, moving away from him and pressing up against me. “Daddy promised.”\n\n“What will you do with a cash register?” Fat Guy asks but doesn’t wait for an answer. “We have one, too, but only because the tax people make us use it. It’s not good for anything. It just makes noise. What do you say—let Daddy take you to the computer store on the second floor and buy you an Xbox instead. For a thousand shekels, you can get the best one, with Kinect and everything.”\n\nI don’t say anything. I actually like the idea. It’ll save me a lot of trouble here, and later, too, with Lilia, when I take him back home. Because the minute Lilia sees the cash register, she’ll start carrying on.\n\n“So what do you say?” Fat Guy asks Lidor. “Xbox is the best. Races, chases, whatever you want.”\n\n“Cash register,” Lidor says, hugging my legs tightly.\n\n“Look at what an angel he is,” I say and try to hand the money to Fat Guy. “Help me make him happy on his birthday.”\n\n“It’s not my store,” Fat Guy protests. “I don’t even work here. I’m just trying to help—”\n\n“But you’re not.” I move so close to him now that my face almost touches his.\n\n“I have to go back to the store.” Fat Guy shrugs and says to Pimple-Face, “If he tries anything, call the police,” and leaves. A real hero.\n\nI put the thousand shekels on the counter, unplug the register, and start rolling up the cord, and, when Lidor sees that, he claps his hands.\n\n“I’m calling the cops,” Pimple-Face says, and begins punching in numbers. I grab the phone away from him again.\n\n“Why?” I say. “It’s his birthday today. Everyone’s happy, don’t ruin it.” Pimple-Face looks at his phone, which is in my hand, then at me, and runs out of the store. I put Pimple-Face’s phone on the counter and pick up the register. “Now we’ll leave here fast,” I say to Lidor, my voice cheerful, as if this were a game. “We’ll go back home and show Mommy what you got.”\n\n“No,” Lidor says, stamping his feet. “First we fly the helicopter and then we go home. You promised.”\n\n“Yes,” I say in my gentlest voice. “But the cash register is heavy. Daddy can’t carry it and fly the helicopter at the same time. Now the register and tomorrow, right after school, we’ll go fly the helicopter in the park.”\n\nLidor thinks for a minute. “Now the helicopter,” he says. “And tomorrow the cash register.” And right then, just in time, Pimple-Face comes running back into the store with a security guard.\n\n\n“What do you think you’re doing?” the guard says. He’s a short, hairy guy, looks more like a pinscher than like a security guard.\n\n“Nothing.” I give him a wink and put the cash register back in place. “Just trying to make the kid laugh. It’s his birthday today.”\n\n“Happy birthday, kid,” the guard says to Lidor, as if he couldn’t care less. “Many happy returns. But now you and your father have to leave.”\n\n“Yes,” Lidor says. “We have to go and fly the helicopter.”\n\nIn the park, Lidor and I play with the multicopter drone. The brochure says that it can fly forty metres high, but after about fifteen metres it can’t pick up the signal from the remote, its propeller stops spinning, and it falls. Lidor likes that.\n\n“Who loves Lidor the most in the world?” I ask, and Lidor answers, “Daddy!”\n\n“And how much does Lidor love Daddy?” I ask while the multicopter drone spins around him, and he yells, “A whole bunch!”\n\n“Up to the sky,” I shout. “Up to the moon and back!”\n\nMy cell starts vibrating in my pocket, but I ignore it. It must be Lilia. Above us, the drone is getting smaller and smaller. In another second, it’ll be out of our field of vision and will fall. Then we’ll both start running across the grass and try to catch it, and if Lidor beats me to it again he’ll laugh that killer laugh of his. There’s nothing nicer in this stinking world than the sound of a kid laughing. ♦\n\n"
    },
    {
        "post_title": "Mitzvah",
        "comment": "Yogev and I sit on the tattered couch in his brother’s living room, waiting for the Molly to kick in.\n\nYogev’s brother is a dealer. He hates it when people call him a dealer. Says he’s just buying for friends. But he’s the mother of all dealers. Looks like a lizard. Cold-blooded. Takes money from his own little brother, but gives him a thirty-per-cent discount, like he’s generosity personified. While we wait for the high to kick in, he drones on about how this is primo shit, super pricey, and how he paid top dollar to the Dutchman who sold it to him and now he’s losing money on us. Yeah, right, Dutchman. I guarantee he bought the whole stash from some Arab kid in Jaffa. “When this shit goes to your head, it’s straight to the penthouse!” he gushes. “Rocket launch. No stops.”\n\n“Let’s go,” I say to Yogev. “We bought it, we popped it, now it’s beach time.” Yogev’s plan is to get high and go pick up girls on the beach. He did it with his brother once—got lit and went down to the promenade and came home with a Norwegian tourist. Normally, he wouldn’t have the balls to talk to a girl like that, especially not in English. But the Molly made Yogev feel powerful, like a superhero. “You’re so beautiful,” he told her. “If God appears on Earth right now and grants me one wish, I’ll ask him for ten minutes to go down on you. If he says, ‘You can have another one,’ I’ll ask for eternal life. If I get a third, I might go for peace in the Middle East—throw a bone to my country. But, if he cheaps out and all I get is one, then it’s just going down on you.” Then he looked up at the clouds, like some dipshit, like he really was waiting for God to appear. The Norwegian chick laughed and said, “You’re cute. Fucked up, but cute.” They spent the whole night going at it in his brother’s apartment. She was so happy, she had tears streaming down her face. He cried, too. From the joy, from the high, from both.\n\nEtgar Keret on writing as anger management.\n\n“Let’s go,” I tell Yogev for the second time. “We paid, we swallowed, let’s get the fuck out of here. We said we’d go to the beach to find girls.” Yogev doesn’t move. This is the fourth time he’s done Molly. And it’s always the same thing. He doesn’t feel anything. Then he takes a shit. The stuff goes to his head only after he drops a load. It’s like uncorking a bottle. “It’s not gonna happen until I take a dump,” he says. And the last thing he wants is for the urge to come when he’s out. The bathrooms at the beach are all wet and stinky and there’s never any paper. Even when there is, it’s scratchy, it doesn’t breathe, like those napkins you get at a hummus joint next to a gas station.\n\n“What’s with the stick up your ass?” Yogev’s lizard brother asks me, flicking his forty-inch TV on to the fashion network. “Scared you’ll lose your high before you get downstairs? This is primo shit. It’ll give you ten hours at least. I guarantee it.”\n\nI keep sitting there without saying anything. I’m not in the mood for a fight. On the fashion network, a flat-chested but pretty model is being interviewed. She talks a lot, but we can’t hear what she’s saying, because the TV’s on mute. Yogev’s brother gives her a horny look. He didn’t take anything—he’s just horny. Like Yogev, I’m not feeling the Molly yet. It’s my first time taking it. “Put some music on,” Yogev says, but his brother doesn’t budge, just keeps looking at the model moving her lips and being careful not to smear her mascara when she wipes a tear from her eye.\n\nPodcast: The Writer’s Voice\nListen to Etgar Keret read “Mitzvah.”\n\n“Not now,” the lizard hisses, without taking his eyes off the screen. “You’re interrupting the words I’m making up for her.”\n\nI try to help out. “Seriously, dude,” I say to the lizard, “play us some music.”\n\nYogev’s brother puts a finger on his lips, like a teacher shushing me. “Sh-h-h,” he says. “See her now? She’s saying, ‘It’s been seven years since I got any, and I am so ready for it.’ ”\n\n“Seven?” I say. “That chick isn’t even twenty yet.”\n\n“Then four,” Yogev’s brother says, and lights a cigarette. “Don’t interrupt.”\n\nYogev’s getting impatient: “Go on, give us some music. And a Coke.” His brother picks up a remote control from the table and turns on the stereo at top volume. It’s trance. But the crap kind. Mindless beats. “And a Coke,” Yogev repeats.\n\n“I don’t have any Coke,” his brother snaps. “There’s water in the tap.”\n\n\nYogev says he can’t be bothered to get up, and then he heads off. But not to the kitchen. To take a shit. I watch the model do a hair toss at the camera, and I can finally feel the Molly kicking in. Yogev keeps up his soundtrack: “Now she’s saying, ‘I’d kill to be sucking on some dick right now, but only with a hot guy who knows what he’s doing.’ In other words”—he flashes his gross smile at me—“you’re outta luck, loser.”\n\nSara Bareilles talks with Rachel Syme\n\n\nThrough the thumping bass line, I hear Yogev hollering in the bathroom like he’s trying to lift a two-hundred-pound weight. And then a plop. Or maybe I just imagined that. It almost sounded too loud. Like someone threw a brick in the toilet. A minute later, he comes out, sweating, and says, “Let’s go.”\n\nOutside, the sky is blue and reddish. The colors of the cars and the traffic lights get all mixed up in my head, but in a good way. A dry breeze cools my face. A bendy bus honks and almost runs me over. Yogev turns seaward, moving fast: every second we waste on Allenby Street is a second with no hot tourist. I try to keep up.\n\nBy the Great Synagogue, a bald guy with a big black yarmulke stops us and mumbles something about a mitzvah. “Not a penny on us,” Yogev lies, but the bald guy keeps talking. Says he’s not after money. Tells us about some eighty-year-old dude called Sasson, who comes every day for evening prayers and on Saturday mornings, too. Sixteen years the man hasn’t missed a service. But today he didn’t show up. So they call his cell phone and his son answers: Sasson’s in the hospital. Broke his pelvis in the shower. And now the sun’s setting and they’re short one man for a quorum. “If we don’t get ten men for the minyan, it won’t work,” the bald guy says with a sigh, like the prayers are a cell phone that has to be charged with the right cable. “Do a mitzvah, guys, make up the minyan for us.”\n\nYogev laughs like an idiot. At first, he thought the bald guy was a bum, and now he’s confused. “Me? Now? Prayers? Are you for real?”\n\n“You don’t have to be religious,” the bald guy insists. “You don’t even have to believe. Do it for your fellow-man. It’s like if my car got stuck and you helped me jump it.”\n\n“Right,” Yogev says. “And what makes you think I’d help you jump your car if you got stuck?”\n\nThe bald guy comes close and puts his hand on my shoulder. He smells. Like airplane food. He looks at me with his enormous eyes—the eyes of a cow the second before it’s slaughtered. To me, in my state, it looks like he’s about to cry.\n\n“Let’s do it,” I say to Yogev. “Let’s pray, no big deal. Come on, it’s going to be a blast.”\n\nYogev shakes his head and walks away, toward the sea. Splitting off from Yogev and staying on my own in the middle of Allenby, high as a kite, seems like a bad idea. But I also can’t leave the cow-eyed bald guy. I want to fuck, but I also want to be a good person. And praying is super easy. Much easier than talking to girls.\n\nThe synagogue is huge but empty. The bald guy brings me a prayer book and a white yarmulke with golden embroidery. It has a stain on it. Not exactly a stain but a kind of sticky patch caked with dirt. It’s a gross shade of brown, but it’s on the side that doesn’t touch your head, so I put the yarmulke on and fasten it with a hair clip. I haven’t opened a prayer book since my bar mitzvah. Nine years, and I still remember my portion by heart, and how I was so afraid to mess up, and how they threw candy at me afterward and one piece hit me in the eye.\n\nThere are eight guys there in addition to the bald one. Almost all of them have one foot in the grave. There’s only one young dude, with an earring, and eyebrows plucked like a girl’s. Of course he’s the one who stands next to me, really close. Shows me where we are in the book. The letters are a blur, and they look blue, but all I have to do is mumble anyway. When we get to the end of the page, he turns it for me. Maybe he’s not gay. Maybe he’s just nice. Or maybe he’s gay and nice.\n\nMy phone rings. It’s Yogev. “Where are you?” I ask him.\n\n“No clue,” he answers, but he sounds chill, like it’s all good.\n\n“Turn it off,” Earring Dude whispers. “This is God’s house. It’s not right.”\n\nI hang up, but Yogev calls back a second later. I don’t pick up, so he texts, but it’s just random letters that don’t form any words. I hope he’s O.K. I want to help him, but I feel bad about Earring Dude. And about God. They’re up to Shema Yisrael, and I remember that one, so I shout it out because I want everyone to know I know all the lyrics.\n\nWhen the prayers are over, all nine of the men shake my hand and say I did a mitzvah. The fact that I hung up the phone when Earring Dude asked me to is what won them over. The bald guy asks if I need a ride somewhere. He has a moped. I try calling Yogev, but it goes to voice mail. “Take me to the beach,” I say, and the bald guy nods and hands me a helmet. He drives really fast. Or maybe that’s just how it feels because I’m high. I hold on to him and try not to tip over. When he drops me off at the promenade, I say thanks and walk away, but he calls after me, pointing at my head. He wants his helmet back.\n\nEven though it’s dark, there are still people on the beach. Two women are walking toward me. One of them’s tall. Pretty. If I were Yogev, I’d probably say something to her. She and her friend walk past me, and I just keep standing there. But then the pretty one turns back. “Are you O.K.?” she asks. “You’re shaking.” It’s the pretty one who says that, not her pimply friend. It’s the pretty one who’s worried about me. She takes an interest. She cares about me. It must be a reward from God.\n\nI want to tell her something. Something good. But I can’t think of anything. I try to remember what Yogev told that Norwegian girl, and I stretch out a smile and say, “If God comes down from a cloud right now and grants me a wish, I’ll ask for ten minutes to go down on you.” I know there’s another part, but I can’t remember it.\n\nThe ugly one says, “Let’s get out of here.” The pretty one makes a hurt expression and they both turn and walk away. Maybe it wasn’t a reward from God after all. Or maybe it was, but it didn’t work because I couldn’t remember the ending of the spiel. Only that it was funny. Something to do with peace in the Middle East.\n\nI walk around looking for Yogev. Maybe he’s back at his brother’s place with a girl, and the lizard is in the living room watching the fashion network and dubbing some Chinese model with high cheekbones while Yogev blows his wad. No way. He has to be here somewhere. I just need to keep looking. All of a sudden, I fall on the sand. Or did someone knock me down? A guy is hovering above me like Superman. He’s kind of tall. He says something that sounds like a curse, and then he kicks me or throws something heavy at me. I think it was a kick. My head is spinning from being high. Or from being kicked. The pretty girl’s there, too, and so is her friend. The pretty one grabs Superman and pulls him off me. Maybe it was God after all. Maybe it’s my reward for not taking Yogev’s call in the synagogue. That stoner could be anywhere by now. But he’s probably farther down the beach, sitting next to a tourist, asking what her horoscope sign is in his crappy English. Superman gets away from the pretty girl, runs back, and gives me another kick in the ribs. “Doron, stop!” the pretty one screams. “Enough!” She has a gentle voice, even when she’s shouting. A pretty girl’s voice. He keeps kicking me.\n\nI wake up on the beach. I can only open one eye. There’s sand stuck to my face. Stuck to the blood on my face. Superman is gone. But the pretty girl’s still here, handing me a can of Coke. She says they didn’t have any water at the kiosk. I try to drink, but I can’t swallow. A guy in a baseball hat comes over. The pretty girl tells him something about what I said or about that guy, Doron, who beat me up. The baseball cap looks at me and says, “He should lie down,” and the pretty girl tries to smile, but the smile is lopsided. She says something I can’t understand, and then the word “ambulance,” and although her mouth is completely crooked now and she’s almost crying, she’s still pretty. I’ve never been with a pretty girl. I don’t even mean sex—just sitting on the same towel at the beach, talking. It was really nice of her to buy me a Coke. ♦\n\n"
    },
    {
        "post_title": "Fly Already",
        "comment": "P.T. sees him first. We’re on our way to the park to play ball when he suddenly says, “Daddy, look!” His head is tilted back and he’s squinting hard to see something far above me, and before I can even begin to imagine an alien spaceship or a piano about to fall on our heads my gut tells me that something really bad is happening. But, when I turn to see what P.T. is looking at, all I notice is an ugly, four-story building covered in plaster and dotted with air-conditioners, as if it had some kind of skin disease. The sun is hanging directly above it, blinding me, and as I’m trying to get a better angle I hear P.T. say, “He wants to fly.” Now I can see a guy in a white button-down shirt standing on the roof railing looking down at me, and, behind me, P.T. whispers, “Is he a superhero?”\n\nInstead of answering him, I shout at the guy, “Don’t do it!”\n\nThe guy just stares at me.\n\nI shout again, “Don’t do it, please! Whatever took you up there must seem like something you’ll never get over, but, believe me, you will! If you jump now, you’ll leave this world with that dead-end feeling. That’ll be your last memory of life. Not family, not love, only defeat. If you stay, I swear to you by everything I hold dear that your pain will start to fade and, in a few years, the only thing left of it will be a weird story you tell people over a beer. A story about how you once wanted to jump off a roof and some guy standing below shouted at you . . .”\n\nBooks & Fiction\nEarly access to new short stories, plus essays, criticism, and coverage of the literary world. Paid subscribers get author interviews and poems.\n\nSign up\nBy signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\n“What?” the guy on the roof yells back at me, pointing at his ear. He probably can’t hear me because of the noise coming from the road. Or maybe it isn’t the noise, because I heard his “What?” perfectly well. Maybe he’s just hard of hearing.\n\nP.T., who’s hugging my thighs without being able to completely encircle them, as if I were some kind of giant baobab tree, yells at the guy, “Do you have super powers?”\n\nBut the guy points at his ear again, as if he were deaf, and shouts, “I’m sick of it! Enough! How much can I take?”\n\nP.T. shouts back at him, as if they were having the most ordinary conversation in the world, “Come on, fly already!”\n\nAnd I’m starting to feel that stress, the stress that comes with knowing that it’s all on you.\n\nI have it a lot at work. With the family, too. Like what happened back then, on the way to Lake Kinneret, when I tried to brake and the tires locked. The car started to skid along the road and I said to myself, “Either you fix this or it’s all over.” Driving to the Kinneret, I didn’t fix it, and Liat, who was the only one not buckled in, died, and I was left alone with the kids. P.T. was two and barely knew how to speak, but Amit never stopped asking me, “When is Mommy coming back? When is Mommy coming back?”—and I’m talking about after the funeral. He was eight then, an age when you’re supposed to understand what it means to die, but he kept asking. Even without the constant, annoying questions, I knew that everything was my fault and I wanted to end it all, just like the guy on the roof. But here I am today, walking without crutches, living with Simona, being a good dad.\n\nI want to tell the guy on the roof all this. I want to tell him that I know exactly how he feels and that, if he doesn’t flatten himself like a pizza on the sidewalk, it’ll pass. I know what I’m talking about, because no one on this blue planet is as miserable as I was. He just has to get down from there and give himself a week. A month. Even a year, if necessary. But how can you say all that to a half-deaf guy who’s four stories above you?\n\nMeanwhile, P.T. pulls on my hand and says, “He’s not going to fly today, Daddy. Let’s go to the park before it gets dark.”\n\nLiz Cheney talks with David Remnick\n\n\nBut I stay where I am and shout as loudly as I can, “People die like flies all the time, even without killing themselves. Don’t do it! Please don’t do it!”\n\nThe guy on the roof nods—it looks like he heard something this time—and shouts at me, “How did you know? How did you know she died?”\n\nSomeone always dies, I want to yell back. Always. If not her, then someone else. But that won’t get him down from there, so instead I say, “There’s a kid here,” and point at P.T. “He doesn’t need to see this!”\n\nP.T. yells, “Yes, I do! Yes, I do! Come on and fly already, before it gets dark!” It’s December, and it really does get dark early.\n\nIf the guy jumps, that’ll be on my conscience, too. Irena, the psychologist at the clinic, will give me that after-you-I’m-going-home look of hers and say, “You’re not responsible for everyone. You have to get that into your head.” And I’ll nod, because I know that the session will end in two minutes and she has to pick her daughter up from day care, but it won’t change anything, because I’ll have to carry that half-deaf guy on my back, along with Liat and Amit’s glass eye.\n\n“Wait there for me!” I scream. “I’m coming up to talk to you!”\n\n“I can’t go on without her. I can’t!” he shouts back.\n\n“Wait a minute,” I yell, and I say to P.T., “Come on, sweetie, let’s go up to the roof.”\n\nP.T. gives an adorable shake of his head, the way he always does right before he sticks the knife in, and says, “If he flies, we can see better from here.”\n\n“He won’t fly,” I say. “Not today. Let’s go up there just for a minute. Daddy has to tell the man something.”\n\nBut P.T. persists, “So yell from here.” His arm slips out of my grasp and he throws himself down on the ground, as he likes to do with Simona and me at the mall.\n\n“Let’s race to the roof,” I say. “If we get there without stopping, P.T. and Daddy get ice cream as a prize.”\n\n“Ice cream now!” P.T. wails, rolling around on the sidewalk. “Ice cream now!”\n\nI have no time for this crap. I pick him up. He squirms and screams, but I ignore him and start running toward the door to the building.\n\n“What happened to the kid?” I hear the guy shout from the roof. I don’t answer. Maybe his curiosity will keep him from jumping long enough for me to get up to the roof.\n\nP.T. is heavy. It’s hard to climb all those stairs when you’re holding a five-and-a-half-year-old kid in your arms, especially one who doesn’t want to go up the stairs. By the third floor, I’m completely out of breath. A fat redheaded woman who must have heard P.T.’s screams opens her door a crack and asks who I’m looking for, but I ignore her and keep climbing. Even if I wanted to say something to her, I don’t have enough air in my lungs.\n\n“No one lives upstairs,” she calls after me. “It’s just the roof.”\n\nWhen she says “roof,” her shrill voice breaks, and P.T. yells back at her in a tear-filled tone, “Ice cream now! Now!”\n\nI don’t have a free hand to push open the peeling door that should lead outside—my arms are full of P.T., who doesn’t stop flailing—so I kick it as hard as I can. The roof is empty. The guy who was on the railing a minute ago isn’t there anymore. He didn’t wait for us. Didn’t wait to see why the kid was screaming.\n\n“He flew,” P.T. sobs. “He flew and because of you we didn’t see anything!”\n\nI start walking toward the railing. Maybe he changed his mind and went back inside, I try to tell myself. But I don’t believe it. I know he’s down there, his body sprawled at an unnatural angle on the sidewalk. I know it, and I have a kid in my arms who absolutely should not see that, because it would traumatize him for the rest of his life, and he’s already been through enough. But my legs take me toward the edge of the roof. It’s like scratching a wound, like ordering another shot of Chivas when you know you’ve had too much to drink, like driving a car when you know you’re tired, so tired.\n\n\nNow that we’re almost at the railing, we start to feel the height. P.T. stops crying, and I can hear both of us panting and an ambulance siren in the distance. It seems to be asking me, “Why? Why do you need to see it? You think it’ll change anything? Make anyone feel better?”\n\nSuddenly, the redhead’s high-pitched voice commands me from behind: “Put him down!” I turn around, not really understanding what she wants.\n\n“Put me down!” P.T. shouts, too. It always gets him going when a stranger butts in.\n\n“He’s just a kid,” the redhead is saying, but her voice is suddenly soft. She’s on the verge of tears. The sound of the siren is getting closer, and the redhead starts walking toward me. “I know you’re suffering,” she says. “I know that everything is so hard. I know, believe me.” There’s so much pain in her voice that even P.T. stops flailing and stares at her, mesmerized. “Look at me,” she whispers. “Fat, alone. I had a child once, too. You know what it is to lose a child? Do you have any idea what you’re about to do?” Still in my arms, P.T. hugs me tight. “Look at what a sweet child he is,” she says, already beside us, her thick hand stroking P.T.’s hair.\n\n“There was a man here,” P.T. says, fixing his huge green eyes—Liat’s eyes—on her. “There was a man here, but now he flew away. And, because of Daddy, we didn’t get to see him.”\n\nThe siren stops right below us and I take another step toward the railing, but the redhead’s sweaty hand grabs my arm. “Don’t do it,” she says. “Please, don’t do it.”\n\nP.T. has a scoop of vanilla in a plastic cup. I order pistachio and chocolate chip in a cone. The redhead asks for a chocolate milkshake. All the tables in the ice-cream parlor are filthy, so I clean one for us. P.T. insists on tasting the milkshake and she lets him. She’s called Liat, too. It’s a common name. She doesn’t know about my Liat, about the accident. She doesn’t know anything about us. And I don’t know anything about her. Except that she lost a kid.\n\nWhen we left the building, medics were putting the guy’s body into the ambulance. Luckily, it was covered with a white sheet. One less image of a corpse in my mind.\n\nThe ice cream is too sweet for me, but P.T. and the redhead look happy. With his cup in one hand, he reaches out for her milkshake with the other. I don’t know why he always does that. After all, he’s still eating his own ice cream—why does he need more? I open my mouth to say something to him, but the redhead signals that it’s O.K. and gives him her almost empty cup. Her child is dead, my wife is dead, the guy on the roof is dead.\n\n“He’s so cute,” she whispers, as P.T. strains to suck up the last drop of milkshake in the paper cup. He really is cute. ♦\n\n"
    },
    {
        "post_title": "Gravity",
        "comment": "Three days after they moved into their new apartment, the woman who lived above them, on the eighth floor, jumped out of her window. Romi was just coming back from the coffee shop, carrying two lattes, when the neighbor hit the sidewalk. Romi dropped the tray, spilling coffee all over herself, and her eyes locked in on the stains on her sweatpants so she wouldn’t have to see anything else. She heard running, panting, and voices shouting. Within seconds, a crowd had gathered, and the sweaty guy who cleaned the lobby was calling an ambulance. Someone said that the woman’s name was Rinat or Ronit, and someone else said that she’d seen her crying in the elevator a few days earlier. “It’s because of COVID,” the cleaner said. “Everyone’s committing suicide these days. They were just talking about it on the news.”\n\nThe distant sirens mingled with the vibration of Romi’s cell. It was Daniel, but she didn’t want to tell him anything over the phone. She touched her cheeks to make sure she wasn’t crying, took a deep breath, and walked into the building. “Hey!” she heard the cleaner calling after her, and, when she turned around, he yelled, “Lady, where d’you think you’re going? You’re a witness.” “A witness to what?” Romi asked. “I didn’t see anything.” But the cleaner wouldn’t back down. “You were the closest one!” he shouted. “Look—her blood’s all over your clothes!” “It’s not blood. It’s coffee. I dropped my coffee,” Romi said. “Well, it looks like blood to me,” the cleaner proclaimed. “The police should have a look at it.” Romi froze for a moment, but, when her phone started vibrating again, she kept walking. “Hey!” the cleaner yelled again, but then a different male voice said, “Poor girl. Leave her alone.”\n\nDaniel opened the door irritably. “Why aren’t you answering my calls?” he asked, but, before she could explain, he saw the stains on her sweats and said, “What’s going on? Are you O.K.?” Romi wanted to tell him about the neighbor who’d jumped and about the bossy cleaner and about how the stains on her pants would probably never come out, but all she could manage was a strange whimper. Daniel gave her one of his feeble hugs in which he barely touched her. “Come on, baby, what’s the matter?”\n\nShe told him everything. She wanted to feel sorry for the neighbor and say how horrible it was and how she must have really been suffering, but all that came out was anger. They’d plunked down 3.4 million shekels for this apartment. Daniel’s mother had given them almost a million and a half, and they’d taken out a twenty-three-year mortgage for the rest. Twenty-three years! If Daniel got her pregnant now, having post-traumatic sex, she thought, the kid would grow up, finish school, join the army, fight a war, and be discharged—and she and Daniel would still be paying for the apartment every month. And every time he came home from kindergarten—this kid who didn’t even exist yet—or from high school, or on leave from the army, he would step over the spot where that Rinat or Ronit woman’s body now lay.\n\nThe sales pitch for their apartment building had been that it was for “upwardly mobile young professionals.” People who bought homes here wanted to improve their lives: they took out loans, they poured in blood, sweat, and tears, and for what? So that some Rinat or Ronit would jump out her window and crush the life out of them? Even if the woman was depressed, she could at least have acknowledged that she wasn’t the only person in this world and had the decency to kill herself in her bed or in the bathroom. If she simply had to jump out a window, then why not do it at a hotel instead of onto her neighbor’s head? “I don’t want this,” Romi told Daniel. “I don’t want to live here anymore. I can’t live in a building where people jump.” “Calm down, babe,” Daniel said, lightly stroking her back. “It’s not the building. It’s one woman who jumped. Poor thing. It has nothing to do with us at all.” “She’s not a poor thing,” Romi fumed. “I’m the poor thing! Me and you and your mom. For this she dipped into her pension? So some neighbor whose name we don’t even know could commit suicide right on our heads?”\n\nThe woman’s name turned out to be Sarit, and the next day Daniel insisted that they go to the funeral. He said that they needed closure, and that, as far as he was concerned, it was either a funeral or couples therapy. Romi had no desire to go to the funeral, but therapy sounded even worse, like a cross between mud wrestling and divorce court. Daniel typed the cemetery’s address into Waze, and they hardly spoke the whole way there. When they arrived, he insisted on buying flowers from some religious guy who was selling half-wilted bunches out of black buckets. There were maybe ten other people there, and the only one she recognized was the cleaner from the lobby, who hurried over and said that it was totally unacceptable that she’d left before the police got there yesterday. Instead of standing by her and telling the cleaner to leave her alone, Daniel nodded and said, “You’re right, you’re right,” and the cleaner walked away and came back a minute later with an elderly couple whose eyes were puffy. “You see?” he said, gesturing at Romi. “This is the neighbor I told you about, who saw your daughter fall.” The elderly man nodded and held out his hand, and, even though Romi and Daniel were very strict about social distancing, they both shook his hand. “I’m Isaac,” he said, “and this is Shoshana.” After a moment, perhaps because no one else said anything, he added, “We’re Sarit’s parents,” and, as soon as he said that, Shoshana started crying. “When she fell,” Isaac asked Romi, “could you see her? Her face?” Romi didn’t answer. She didn’t know what to say, and she hoped that, if she waited long enough, Daniel would say something to get her out of it. But Daniel was quiet, and they all stood in silence, except for the mother, who kept weeping.\n\nThat night, Daniel fell asleep instantly and started snoring. Romi lay awake in bed for almost an hour, and then she got up, rolled a joint, and went out onto the balcony. A friend of Daniel’s had sold them the pot; it smelled like cookies and was really potent. Romi looked down over the railing and tried to find the spot where the Sarit woman had hit the ground. At the funeral, the cleaner had talked about how the gray sidewalk had been covered with blood, but now, from seven floors up, everything looked clean and fresh, and a young couple were standing there making out.\n\nWhen Romi had told Daniel that she was angry at the woman for deciding to kill herself right as she was walking up, Daniel said that she was self-centered and it was time for her to grasp that not everything in the world had to do with her. But now, as she watched the couple practically fucking on the neatly trimmed hedge in front of her building, she couldn’t help thinking that it definitely did have something to do with her. And that maybe Sarit had once believed that the new smell coming from the walls and the gleaming white marble in the lobby would restart her life, and then, when she’d looked out and seen Romi coming back from the coffee shop in her sweats, she’d had the impression, from that high-up vantage point, that Romi was happy and living in a perfect marriage, that she and Daniel were as close as the two paper cups in her coffee carrier. And maybe Sarit couldn’t take it anymore, so she’d jumped out the window in order to ruin everything for Romi. Just as Romi was dying to plummet onto those moaning lovers and knock the lust out of them.\n\n"
    },
    {
        "post_title": "Creative Writing",
        "comment": "The first story Maya wrote was about a world in which people split themselves in two instead of reproducing. In that world, every person could, at any given moment, turn into two beings, each one half his/her age. Some chose to do this when they were young; for instance, an eighteen-year-old might split into two nine-year-olds. Others would wait until they’d established themselves professionally and financially and go for it only in middle age. The heroine of Maya’s story was splitless. She had reached the age of eighty and, despite constant social pressure, insisted on not splitting. At the end of the story, she died.\n\nIt was a good story, except for the ending. There was something depressing about that part, Aviad thought. Depressing and predictable. But Maya, in the writing workshop she had signed up for, actually got a lot of compliments on the ending. The instructor, who was supposed to be this well-known writer, even though Aviad had never heard of him, told her that there was something soul-piercing about the banality of the ending, or some other piece of crap. Aviad saw how happy that compliment made Maya. She was very excited when she told him about it. She recited what the writer had said to her the way people recite a verse from the Bible. And Aviad, who had originally tried to suggest a different ending, backpedalled and said that it was all a matter of taste and that he really didn’t understand much about it.\n\nBooks & Fiction\nEarly access to new short stories, plus essays, criticism, and coverage of the literary world. Paid subscribers get author interviews and poems.\n\nSign up\nBy signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nIt had been her mother’s idea that she should go to a creative-writing workshop. She’d said that a friend’s daughter had attended one and enjoyed it very much. Aviad also thought that it would be good for Maya to get out more, to do something with herself. He could always bury himself in work, but, since the miscarriage, she never left the house. Whenever he came home, he found her in the living room, sitting up straight on the couch. Not reading, not watching TV, not even crying. When Maya hesitated about the course, Aviad knew how to persuade her. “Go once, give it a try,” he said, “the way a kid goes to day camp.” Later, he realized that it had been a little insensitive of him to use a child as an example, after what they’d been through two months before. But Maya actually smiled and said that day camp might be just what she needed.\n\nThe second story she wrote was about a world in which you could see only the people you loved. The protagonist was a married man in love with his wife. One day, his wife walked right into him in the hallway and the glass he was holding fell and shattered on the floor. A few days later, she sat down on him as he was dozing in an armchair. Both times, she wriggled out of it with an excuse: she’d had something else on her mind; she hadn’t been looking when she sat down. But the husband started to suspect that she didn’t love him anymore. To test his theory, he decided to do something drastic: he shaved off the left side of his mustache. He came home with half a mustache, clutching a bouquet of anemones. His wife thanked him for the flowers and smiled. He could sense her groping the air as she tried to give him a kiss. Maya called the story “Half a Mustache,” and told Aviad that when she’d read it aloud in the workshop some people had cried. Aviad said, “Wow,” and kissed her on the forehead. That night, they fought about some stupid little thing. She’d forgotten to pass on a message or something like that, and he yelled at her. He was to blame, and in the end he apologized. “I had a hellish day at work,” he said and stroked her leg, trying to make up for his outburst. “Do you forgive me?” She forgave him.\n\nThe workshop instructor had published a novel and a collection of short stories. Neither had been much of a success, but they’d had a few good reviews. At least, that’s what the saleswoman at a bookstore near Aviad’s office told him. The novel was very thick, six hundred and twenty-four pages. Aviad bought the book of short stories. He kept it in his desk and tried to read a little during lunch breaks. Each story in the collection took place in a different foreign country. It was a kind of gimmick. The blurb on the back cover said that the writer had worked for years as a tour guide in Cuba and Africa and that his travels had influenced his writing. There was also a small black-and-white photograph of him. In it, he had the kind of smug smile of someone who feels lucky to be who he is. The writer had told Maya, she said to Aviad, that when the workshop was over he’d send her stories to his editor. And, although she shouldn’t get her hopes up, publishers these days were desperate for new talent.\n\nHer third story started out funny. It was about a woman who gave birth to a cat. The hero of the story was the husband, who suspected that the cat wasn’t his. A fat ginger tomcat that slept on the lid of the dumpster right below the window of the couple’s bedroom gave the husband a condescending look every time he went downstairs to throw out the garbage. In the end, there was a violent clash between the husband and the cat. The husband threw a stone at the cat, which countered with bites and scratches. The injured husband, his wife, and the kitten she was breastfeeding went to the clinic for him to get a rabies shot. He was humiliated and in pain but tried not to cry while they were waiting. The kitten, sensing his suffering, uncurled itself from its mother’s embrace, went over to him, and licked his face tenderly, offering a consoling “Meow.” “Did you hear that?” the mother asked emotionally. “He said ‘Daddy.’ ” At that point, the husband could no longer hold back his tears. And, when Aviad read that passage, he had to try hard not to cry, too. Maya said that she’d started writing the story even before she knew she was pregnant again. “Isn’t it weird,” she asked, “how my brain didn’t know yet, but my subconscious did?”\n\nA Family Reckons with a Father’s Wish to Be Preserved Using Cryonics in “Eternal Father”\n\n\nThe next Tuesday, when Aviad was supposed to pick her up after the workshop, he arrived half an hour early, parked his car in the lot, and went to find her. Maya was surprised to see him in the classroom, and he insisted that she introduce him to the writer. The writer reeked of body lotion. He shook Aviad’s hand limply and told him that if Maya had chosen him for a husband he must be a very special person.\n\nThree weeks later, Aviad signed up for a beginners’ creative-writing class. He didn’t say anything about it to Maya, and, to be on the safe side, he told his secretary that if he had any calls from home she should say that he was in an important meeting and couldn’t be disturbed. The other members of the class were mostly elderly women, who gave him dirty looks. The thin young instructor wore a head scarf, and the women in the class gossiped about her, saying that she lived in a settlement in the occupied territories and had cancer. She asked everyone to do an exercise in automatic writing. “Write whatever comes into your head,” she said. “Don’t think, just write.” Aviad tried to stop thinking. It was very hard. The old women around him wrote with nervous speed, like students racing to finish an exam before the teacher tells them to put their pens down, and after a few minutes he began writing, too.\n\n\nThe story he wrote was about a fish that was swimming happily along in the sea when a wicked witch turned it into a man. The fish couldn’t come to terms with his transformation and decided to chase down the wicked witch and make her turn him back into a fish. Since he was an especially quick and enterprising fish, he managed to get married while he was pursuing her, and even to establish a small company that imported plastic products from the Far East. With the help of the enormous knowledge he had gained as a fish who had crossed the seven seas, the company began to thrive and even went public. Meanwhile, the wicked witch, who was a little tired after all her years of wickedness, decided to find all the people and creatures she’d cast spells on, apologize to them, and restore them to their natural state. At one point, she even went to see the fish she had turned into a man. The fish’s secretary asked her to wait until he’d finished a satellite meeting with his partners in Taiwan. At that stage in his life, the fish could hardly remember that he was in fact a fish, and his company now controlled half the world. The witch waited several hours, but when she saw that the meeting wouldn’t be ending any time soon she climbed onto her broom and flew off. The fish kept doing better and better, until one day, when he was really old, he looked out the window of one of the dozens of huge shoreline buildings he’d purchased in a smart real-estate deal, and saw the sea. And suddenly he remembered that he was a fish. A very rich fish who controlled many subsidiary companies that were traded on stock markets around the world, but still a fish. A fish who, for years, had not tasted the salt of the sea.\n\nWhen the instructor saw that Aviad had put down his pen, she gave him an inquiring look. “I don’t have an ending,” he whispered apologetically, keeping his voice down so as not to disturb the old ladies who were still writing. ♦\n\n"
    }
]