[
    {
        "post_title": "The Kingdom That Failed",
        "comment": "Just behind the kingdom that failed ran a nice little river. It was a clear, lovely stream, and many fish lived in it. Weeds grew there, too, and the fish ate the weeds. The fish didn’t care whether or not the kingdom had failed, of course. Whether it was a kingdom or a republic made no difference to them. They didn’t vote or pay taxes. Makes no difference to us, they figured.\n\nI washed my feet in the stream. A short soak in the icy-cold water turned them red. From the stream, you could see the walls and the tower of the castle in the kingdom that failed. The two-colored flag still flew from the tower, fluttering in the breeze. Everyone passing along the riverbanks would see the flag and say, “Hey, look at that. It’s the flag of the kingdom that failed.”\n\nQand I are friends—or should I say, were friends in college. It’s been more than ten years since the two of us did anything that friends do. Which is why I use the past tense. Anyhow, we were friends.\n\nWhenever I try to tell anyone about Q—to describe him as a person—I feel totally helpless. I’ve never been very good at explaining anything, but, even taking that into account, it’s a special challenge to try to explain Q to someone. And when I do try I’m overcome by a deep, deep sense of despair.\n\nLet me make this as simple as I can.\n\nQ and I are the same age, but he’s about five hundred and seventy times more handsome. He has a nice personality, too. He’s never pushy or boastful, and he never gets angry if someone accidentally causes a problem for him. “Oh, well,” he’ll say. “I’ve done the same thing myself.” But, in fact, I’ve never heard of him doing anything bad to anyone.\n\nHe was well brought up, too. His father was a doctor who had his own clinic on the island of Shikoku, which meant that Q never wanted for pocket money. Not that he was extravagant with it. He was a smart dresser and also an impressive athlete, who’d played interscholastic tennis in high school. He enjoyed swimming and went to the pool at least twice a week. Politically, he was a moderate liberal. His grades, if not outstanding, were at least good. He almost never studied for exams, but he never failed a course. He really listened to the lectures.\n\nHe was surprisingly talented on the piano, and he owned a lot of Bill Evans and Mozart records. His favorite writers tended to be French—Balzac and Maupassant. Sometimes he’d read a novel by Kenzaburo Oe or another writer. His critiques were always right on the mark.\n\nHe was popular with women, naturally enough. But he was not one of those “anyone he can get his hands on” type of guys. He had a steady girlfriend, a pretty sophomore from one of the fancy women’s colleges. They went out every Sunday.\n\nAnyhow, that was the Q I knew in college. In short, he was a character without flaws.\n\nCrossword Puzzles with a Side of Millennial Socialism\n\n\nBack then, Q lived in the apartment next door to mine. What with lending salt or borrowing salad dressing, we got to be friends, and soon we were at each other’s places all the time, listening to records, drinking beer. Once, my girlfriend and I drove out to the Kamakura shore with Q and his girlfriend. We were very comfortable together. Then, during the summer break of my senior year, I moved out, and that was that.\n\nThe next time I saw Q, almost a decade had gone by. I was reading a book by a swanky hotel pool near the Akasaka district. Q was sitting in the deck chair next to mine, and beside him was a beautiful long-legged woman in a bikini.\n\nI knew right away that it was Q. He was as handsome as ever, and now, just over thirty, he evinced a certain dignity that he hadn’t had before. Young women walking by gave him a quick once-over.\n\nHe didn’t notice me sitting next to him. I’m a fairly ordinary-looking guy, and I was wearing sunglasses. I wasn’t sure whether I should talk to him, but in the end I decided not to. He and the woman were deep in conversation, and I hesitated to interrupt them. Besides, there wasn’t a lot that he and I could have talked about. “I lent you salt, remember?” “Hey, that’s right, and I borrowed a bottle of salad dressing.” We would have run out of topics quickly. So I kept my mouth shut and stuck to my book.\n\nStill, I couldn’t help overhearing what Q and his pretty companion were saying to each other. It was a fairly complicated matter. I gave up trying to read and listened to them.\n\n“No way,” the woman said. “You’ve got to be kidding.”\n\n“I know, I know,” Q said. “I know exactly what you’re saying. But you’ve got to see it my way, too. I’m not doing this because I want to. It was the guys upstairs. I’m just telling you what they decided. So don’t look at me that way.”\n\n“Yeah, right,” she said.\n\nQ let out a sigh.\n\nLet me summarize their long conversation—filling in a good deal by way of imagination, of course. Q seemed to be now a director at a TV station or some such place, and the woman was a moderately well-known singer or actress. She was being let go from a project because of some sort of trouble or scandal she had become involved in, or maybe just because her popularity had declined. The job of informing her had been left to Q, who was the person most directly responsible for day-to-day operations. I don’t know much about the entertainment industry, so I can’t be sure of the finer points, but I don’t think I’m too far off over all.\n\nJudging from what I heard, Q was discharging his duty with genuine sincerity.\n\n“We can’t survive without sponsors,” he said. “I don’t have to tell you that—you know the business.”\n\n“So you’re telling me that you don’t have any responsibility or say in the matter?”\n\n“No, I’m not telling you that. But what I can do is really limited.”\n\nTheir conversation took another turn into a dead-end street. She wanted to know just how much he had exerted himself on her behalf. He insisted that he had done everything he could, but he had no way to prove it, and she didn’t believe him. I didn’t really believe him, either. The more sincerely he tried to explain things, the more a fog of insincerity came to hang over everything. But it wasn’t Q’s fault. It wasn’t anybody’s fault. Which was why there was no way out of this conversation.\n\nIt appeared that the woman had always liked Q. I sensed that they had got along well until this business came up. Which probably only added to the woman’s anger. In the end, though, she was the one who gave in.\n\n“O.K.,” she said. “I’ve had it. Buy me a Coke, will you?”\n\nWhen he heard that, Q breathed a sigh of relief and went off to the drink stand. The woman put on her sunglasses and stared straight ahead. By this time, I had read the same line in my book a couple hundred times.\n\n\nSoon, Q came back with two big paper cups. Handing one to the woman, he lowered himself into his deck chair. “Don’t get too depressed about this,” he said. “Any day now you’ll—”\n\nBut, before he could finish, the woman threw her full cup at him. It caught him square in the face, and about a third of the Coca-Cola splashed onto me. Without a word, the woman stood up and, giving a little yank at the seat of her bikini, strode off without a backward glance. Q and I just sat there stunned for a good fifteen seconds. The people nearby were staring at us in shock.\n\nQ was the first to regain his composure. “Sorry,” he said and held a towel out to me.\n\n“That’s O.K.,” I answered. “I’ll just take a shower.”\n\nLooking slightly annoyed, he drew the towel back and used it to dry himself.\n\n“At least let me pay for the book,” he said. It was true that my book was soaked. But it was just a cheap paperback, and not a very interesting one at that. Anyone who threw a Coke on it and prevented me from reading it was doing me a favor. He brightened up when I said that. He had the same great smile as always.\n\nQ left at that point, apologizing to me once more as he stood to go. He had never realized who I was.\n\nIdecided to give this story the title “The Kingdom That Failed” because I happened to read an article in the evening paper that day about an African kingdom that had failed. “To see a splendid kingdom fade away,” it said, “is far sadder than seeing a second-rate republic collapse.”\n\n"
    },
    {
        "post_title": "Ice Man",
        "comment": "Short story about a woman who marries an ice man... I married an ice man. I first met him in a hotel at a ski resort. \"Look, that's an ice man,\" my friend whispered. The iceman was tall, and he seemed to be young, but his fingers were rimed with a white frost that looked as if it would never melt. Something about him pierced me to the heart. I made up some excuse not to go out, and stayed in the hotel. I felt compelled to talk to the ice man no matter what. \"I don't ski,\" he said. \"I just like to sit here and read and look at the snow. You're interested in me, aren't you? You want to know what an ice man is.\" I held back from asking personal questions. Instead, the iceman talked about me. Somehow, he knew all about me. \"How do you know so much about me?\" \"I can't read minds or anything. I just know.\" Eventually we started dating. We always sat on a bench in the park and talked.\" \"Why don't you talk about yourself? How did you come to be an ice man?\" \"I don't know. I don't even know if I had parents.\" I fell seriously in love with this ice man. The ice man loved me just as I wasóin the present. My mother and my older sister were strongly opposed to my marrying the ice man. \"You don't know a thing about his background.\" So we got married. Nobody blessed the wedding, and no friends or relatives were happy for us. We rented a tiny apartment, and the ice man made a living by working at a cold-storage meat facility The two of us lived a happy life together, without bothering or being bothered by anyone. I even started to love having sex with the ice man. We wanted to have a child but that didn't seem to be possible. It may have been that human genes and ice-man genes didn't combine easily. I found myself with time on my hands. I would finish up all the housework, and then having nothing to do. I was still young, and doing the same thing day after day. \"How would it be if the two of us went away on a trip somewhere, just for a change?\" \"Well, if you really want to go on a trip so badly, I don't have anything against it.\" \"How about visiting the South Pole?\" It seemed as soon as I spoke the words \"South Pole,\" something changed inside him. I had a premonition that if we went to the South Pole something would happen to us, but I couldn't find a good reason to cancel the trip. When we stepped off onto the ground of the South Pole I felt my husbands body lurch. something inside the ice man had been secretly violently shaken. He walked enthusiastically from place to place as if he couldn't get enough of it. He learned the local language quickly. I felt as though my husband had betrayed me and left me to care for myself. I eventually lost my strength. The airplane that had brought us there wad long since gone, and the runway was covered with ice. \"Winter has come It looks as though we'll have to stay here until next spring.\" About three months after we arrived, I realized I was pregnant. The child would be a little ice man. I could feel its chill inside me, Our new family would never again set foot outside the South Pole. I am lonelier than anyone else in the world.\n\n"
    },
    {
        "post_title": "The Year of Spaghetti",
        "comment": "Nineteen-seventy-one was the Year of Spaghetti.\n\nIn 1971, I cooked spaghetti to live, and lived to cook spaghetti. Steam rising from the pot was my pride and joy, tomato sauce bubbling up in the saucepan my one great hope in life.\n\nPublished in the print edition of the November 21, 2005, issue.\n\nI went to a cooking specialty store and bought a kitchen timer and a huge aluminum pot, big enough to bathe a German shepherd in, then went around to all the supermarkets that catered to foreigners, gathering an assortment of odd-sounding spices. I picked up a pasta cookbook at the bookstore, and bought tomatoes by the dozen. I purchased every brand of spaghetti I could lay my hands on, simmered every sauce known to man. Fine particles of garlic, onion, and olive oil swirled in the air, forming a harmonious cloud that penetrated every corner of my tiny apartment, permeating the floor and the ceiling and the walls, my clothes, my books, my records, my tennis racquet, my bundles of old letters. It was a fragrance one might have smelled on ancient Roman aqueducts.\n\nThis is a story from the Year of Spaghetti, 1971 A.D.\n\nAs a rule, I cooked spaghetti, and ate it, by myself. I was convinced that spaghetti was a dish best enjoyed alone. I can’t really explain why I felt that way, but there it is.\n\nI always drank tea with my spaghetti and ate a simple lettuce-and-cucumber salad. I’d make sure I had plenty of both. I laid everything out neatly on the table and enjoyed a leisurely meal, glancing at the paper as I ate. From Sunday to Saturday, one Spaghetti Day followed another. And each new Sunday started a brand-new Spaghetti Week.\n\nEvery time I sat down to a plate of spaghetti—especially on a rainy afternoon—I had the distinct feeling that somebody was about to knock on my door. The person who I imagined was about to visit me was different each time. Sometimes it was a stranger, sometimes someone I knew. Once, it was a girl with slim legs whom I’d dated in high school, and once it was myself, from a few years back, come to pay a visit. Another time, it was William Holden, with Jennifer Jones on his arm.\n\nWilliam Holden?\n\nNot one of these people, however, actually ventured into my apartment. They hovered just outside the door, without knocking, like fragments of memory, and then slipped away.\n\nSpring, summer, and fall, I cooked and cooked, as if cooking spaghetti were an act of revenge. Like a lonely, jilted girl throwing old love letters into the fireplace, I tossed one handful of spaghetti after another into the pot.\n\nI’d gather up the trampled-down shadows of time, knead them into the shape of a German shepherd, toss them into the roiling water, and sprinkle them with salt. Then I’d hover over the pot, oversized chopsticks in hand, until the timer dinged its plaintive note.\n\nSpaghetti strands are a crafty bunch, and I couldn’t let them out of my sight. If I were to turn my back, they might well slip over the edge of the pot and vanish into the night. The night lay in silent ambush, hoping to waylay the prodigal strands.\n\nSpaghetti alla parmigiana\n\nSpaghetti alla napoletana\n\nSpaghetti al cartoccio\n\nSpaghetti aglio e olio\n\nSpaghetti alla carbonara\n\nSpaghetti della pina\n\nAnd then there was the pitiful, nameless leftover spaghetti carelessly tossed into the fridge.\n\nA Public Defender's Radical Approach to Representing The January 6th Rioters\n\n\nBorn in heat, the strands of spaghetti washed down the river of 1971 and vanished.\n\nI mourn them all—all the spaghetti of the year 1971.\n\nWhen the phone rang at 3:20 p.m. I was sprawled out on the tatami, staring at the ceiling. A pool of winter sunlight had formed in the place where I lay. Like a dead fly I lay there, vacant, in a December spotlight.\n\nAt first, I didn’t recognize the sound as the phone ringing. It was more like an unfamiliar memory that had hesitantly slipped in between the layers of air. Finally, though, it began to take shape, and, in the end, a ringing phone was unmistakably what it was. It was one hundred per cent a phone ring in one-hundred-per-cent real air. Still sprawled out, I reached over and picked up the receiver.\n\nOn the other end was a girl, a girl so indistinct that, by four-thirty, she might very well have disappeared altogether. She was the ex-girlfriend of a friend of mine. Something had brought them together, this guy and this indistinct girl, and something had led them to break up. I had, I admit, reluctantly played a role in getting them together in the first place.\n\n“Sorry to bother you,” she said, “but do you know where he is now?”\n\nI looked at the phone, running my eyes along the length of the cord. The cord was, sure enough, attached to the phone. I managed a vague reply. There was something ominous in the girl’s voice, and whatever trouble was brewing I knew that I didn’t want to get involved.\n\n“Nobody will tell me where he is,” she said in a chilly tone. “Everybody’s pretending they don’t know. But there’s something important I have to tell him, so please—tell me where he is. I promise I won’t drag you into this. Where is he?”\n\n“I honestly don’t know,” I told her. “I haven’t seen him in a long time.” My voice didn’t sound like my own. I was telling the truth about not having seen him for a long time, but not about the other part—I did know his address and phone number. Whenever I tell a lie, something weird happens to my voice.\n\nNo comment from her.\n\nThe phone was like a pillar of ice.\n\nThen all the objects around me turned into pillars of ice, as if I were in a J. G. Ballard science-fiction story.\n\n“I really don’t know,” I repeated. “He went away a long time ago, without saying a word.”\n\nThe girl laughed. “Give me a break. He’s not that clever. We’re talking about a guy who has to make a lot of noise no matter what he does.”\n\nShe was right. The guy really was a bit of a dim bulb.\n\nBut I wasn’t about to tell her where he was. Do that, and next I’d have him on the phone, giving me an earful. I was through with getting caught up in other people’s messes. I’d already dug a hole in the back yard and buried everything that needed to be buried in it. Nobody could ever dig it up again.\n\n“I’m sorry,” I said.\n\n“You don’t like me, do you?” she said suddenly.\n\nI had no idea what to say. I didn’t particularly dislike her. I had no real impression of her at all. It’s hard to have a bad impression of somebody you have no impression of.\n\n“I’m sorry,” I said again. “But I’m cooking spaghetti right now.”\n\n“I’m sorry?”\n\n“I said I’m cooking spaghetti,” I lied. I had no idea why I said that. But the lie had already become a part of me—so much so that, at that moment at least, it didn’t feel like a lie at all.\n\n\nI went ahead and filled an imaginary pot with imaginary water, lit an imaginary stove with an imaginary match.\n\n“So?” she asked.\n\nI sprinkled imaginary salt into the boiling water, gently lowered a handful of imaginary spaghetti into the imaginary pot, set the imaginary kitchen timer for eight minutes.\n\n“So I can’t talk. The spaghetti will be ruined.”\n\nShe didn’t say anything.\n\n“I’m really sorry, but cooking spaghetti is a delicate operation.”\n\nThe girl was silent. The phone in my hand began to freeze again.\n\n“So could you call me back?” I added hurriedly.\n\n“Because you’re in the middle of making spaghetti?” she asked.\n\n“Yeah.”\n\n“Are you making it for someone, or are you going to eat alone?”\n\n“I’ll eat it by myself,” I said.\n\nShe held her breath for a long time, then slowly breathed out. “There’s no way you could know this, but I’m really in trouble. I don’t know what to do.”\n\n“I’m sorry I can’t help you,” I said.\n\n“There’s some money involved, too.”\n\n“I see.”\n\n“He owes me money,” she said. “I lent him some money. I shouldn’t have, but I had to.”\n\nI was quiet for a minute, my thoughts drifting toward spaghetti. “I’m sorry,” I said. “But I’ve got the spaghetti going, so . . .”\n\nShe gave a listless laugh. “Goodbye,” she said. “Say hi to your spaghetti for me. I hope it turns out O.K.”\n\n“Bye,” I said.\n\nWhen I hung up the phone, the circle of light on the floor had shifted an inch or two. I lay down again in that pool of light and resumed staring at the ceiling.\n\nThinking about spaghetti that boils eternally but is never done is a sad, sad thing.\n\nNow I regret, a little, that I didn’t tell the girl anything. Perhaps I should have. I mean, her ex-boyfriend wasn’t much to start with—an empty shell of a guy with artistic pretensions, a great talker whom nobody trusted. She sounded as if she really were strapped for money, and, no matter what the situation, you’ve got to pay back what you borrow.\n\nSometimes I wonder what happened to the girl—the thought usually pops into my mind when I’m facing a steaming-hot plate of spaghetti. After she hung up the phone, did she disappear forever, sucked into the 4:30 p.m. shadows? Was I partly to blame?\n\nI want you to understand my position, though. At the time, I didn’t want to get involved with anyone. That’s why I kept on cooking spaghetti, all by myself. In that huge pot, big enough to hold a German shepherd.\n\nDurum semolina, golden wheat wafting in Italian fields.\n\nCan you imagine how astonished the Italians would be if they knew that what they were exporting in 1971 was really loneliness? ♦\n\n"
    },
    {
        "post_title": "My Cheesecake-Shaped Poverty",
        "comment": "The Triangle Zone was our name for the place. I couldn’t think of any better name for it. I mean, the area was a perfect triangle, as if someone had drawn it out. And she and I lived there, on that land. This was back in 1973 or ’74.\n\nWhen I say “Triangle Zone,” don’t go picturing a kind of delta. The Triangle Zone we lived in was much narrower, more like a wedge. Imagine, say, a round, full-sized cheesecake. Cut it into twelve equal pieces with a knife so it’s like the face of a clock. What you’d end up with, of course, are twelve slices of thirty degrees each at the tip. Place one of these on a plate and, as you sip your tea, take a good hard look at it. That tapered end of the thin slice of cake? That’s exactly the shape of the Triangle Zone I’m talking about.\n\nO.K., so how did such a weirdly shaped plot of land come about? Well you might ask. Or maybe not. Either way’s fine with me, since I don’t know the answer. I asked some of the neighbors about it, but all I found out was that it had been shaped like a triangle long, long ago, was a triangle now, and would probably—far, far into the future—remain a triangle. People there didn’t seem to want to talk about this Triangle Zone, or even think about it. For them, it was like talking about a wart behind your ear. Better left undiscussed. Probably because of its weird shape.\n\nRailroad lines ran along either side of the Triangle Zone, one a national railway line, the other a private line. The two lines ran parallel for a while, then at the very tip of the wedge formed a junction where it was as if they were ripped apart, branching off at strange angles, one north and one south. It was quite a sight to see. Whenever I gazed at the trains whizzing by at the tip of the Triangle Zone, I felt as if I were standing on the bridge of a destroyer slicing its way through the ocean waves.\n\nIn terms of livability, the Triangle Zone was appalling. First of all, there was the obvious noise level. But what do you expect? How could it not be earsplitting to live hemmed in between two railroad lines? Open the front door and there was a train roaring by; open a window at the back of the house and yet another train would thunder by, right before your eyes. And when I say “right before your eyes,” I’m not exaggerating. The trains were so close that I could look the passengers in the eye and nod a greeting. Really something, now that I think about it.\n\nYou’d assume that it would be quiet after the last train of the night had passed by, right? I thought so, too, before I moved there. Problem was, there was no such thing as a last train. The last passenger train was just before 1 A.M., but then came the late-night freight trains. And, once they’d finished rolling by, at dawn, the next day’s passenger trains would start up again. It was an endless repeat of this, day after day.\n\nTalk about crazy.\n\nWe picked this place to live in for one simple reason: it was dirt cheap. It was a detached house with three rooms, its own bath, and even a small garden, all for about the same price as renting a studio apartment. Since it was a stand-alone house, we could bring our cat along, too. It was as if the place had been specially made, just for us. We’d only recently got married, and, not to brag or anything, but we could very well have been featured in the Guinness Book of Records under “World’s Poorest Couple.” We saw the house listed in the window of a real-estate agent’s office near the station. At least as far as the rent and the layout of the rooms were concerned, this was a lucky find. Astonishing, even.\n\n“Yeah, cheap it is. For sure,” the bald real-estate agent said. “But I have to warn you—it’s really noisy. As long as you can stand that, you could call it a lucky find.”\n\n“Would you mind showing it to us?” I asked.\n\n“Sure. But can’t the two of you just go? I get a headache every time I go to that place.”\n\nHe handed me the keys and drew a map. What an easygoing agent.\n\nOn the map, the Triangle Zone didn’t look far from the station, but, when we actually walked to it, it took forever. We had to detour around the railroad tracks, cross an overpass, and trudge up and down a somewhat filthy hill before we finally arrived at the rear of the Triangle Zone. There wasn’t a store in sight. A totally seedy neighborhood.\n\nMy wife and I went into the house at the very tip of the Triangle Zone and stayed for about an hour, just hanging out. During this time, trains kept on rumbling past. Whenever an express train roared by, the windows would rattle. We couldn’t hear each other while a train was passing. We’d be talking and then would have to stop until it was gone. We’d resume talking when it got quiet, only to be interrupted a moment later by yet another train. Choppy, interrupted communication à la Jean-Luc Godard.\n\nAside from the noise, the house wasn’t so bad. The structure itself was old-fashioned and in need of some serious repair, but on the plus side it had a tokonoma recessed alcove and a small outside sitting area attached to the house, and had a nice feel to it. Spring light shining in through the windows formed little sunny squares on the tatami. It was a lot like the house I’d lived in, years ago, when I was little. “Let’s take it,” I said. “I know it’s noisy, but we’ll get used to it.”\n\n“If that’s what you think, I’m O.K. with it,” she said.\n\n\n“Sitting here together like this, it feels like we’re married, our own family.”\n\n“Well, we are married.”\n\n“Well, yeah. True enough,” I said.\n\nWe went back to the real-estate agency and told the bald agent that we’d take it.\n\n“Isn’t it too noisy?” he asked.\n\n“Yes, it is, but we’ll get used to it,” I said.\n\nThe agent took off his glasses, wiped them with a tissue, took a sip of tea from his teacup, put his glasses back on, and looked at me.\n\n“Well, ’cause you’re young,” he said.\n\n“Right,” I replied.\n\nAnd we filled out the rental agreement.\n\nA friend’s little minivan was more than enough for our move. Futons, clothes, a lamp, a few books, and a cat—that was the extent of our belongings. Nothing else. No radio or TV. No washer or dining table or gas stove or telephone or kettle or vacuum cleaner. That was how poor we were. So our move, such as it was, took only half an hour. Life can be simpler if you don’t have much money.\n\nWhen the friend who helped us move took one look at our new dwelling, hemmed in by railroad lines, he was aghast. After we’d unloaded everything, he turned to me and said something, but a passing express train drowned out his words.\n\n“Did you say something?” I asked.\n\n“People really live in a place like this, huh?” he commented, impressed.\n\nWe ended up living in that house for two years.\n\nIt was a poorly built house in a way, since wind blew in through cracks and gaps all over the place. Pleasant enough in the summer, but, come winter, it was hell. With no money to buy a space heater, my wife and I and the cat would crawl under the futons once the sun set, literally clinging to each other to keep warm. Many a time we’d wake up to find the water in the kitchen faucet frozen solid.\n\nOnce winter passed, the spring would come. And spring was a lovely season. She and I and the cat would breathe a sigh of relief. In April, the railroads went on strike for a few days, and we were ecstatic. Not a single train came rumbling by all day. We carried the cat down to the railroad tracks and sat there sunning ourselves. It was so quiet it was as if we were sitting at the bottom of a lake. We were young, just married, and the sunshine was free!\n\nEven now, when I hear the word “poor,” I remember that thin, triangular sliver of land. And I wonder, Who could be living there now? ♦\n\n"
    }
]