[
    {
        "post_title": "The Half-Century Dispute",
        "comment": "“Iforget,” Ilka says to the friends around the table. “Do we allow ourselves to tell our dreams?”\n\n“You have a good one?” Bessie asks her.\n\nBooks & Fiction\nEarly access to new short stories, plus essays, criticism, and coverage of the literary world. Paid subscribers get author interviews and poems.\n\nSign up\nBy signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\n“You know the kind of movie in which something has to be prevented? In this dream, there is some fatal thing I need urgently to say to my cousin Frieda, but she is on the far side of an abyss, and then she is on the other side of a wall.”\n\n“What’s the urgent thing you need to say to her?”\n\n“The dream doesn’t specify.”\n\nThe friends, who have been meeting for lunch for some thirty years, live in a fifteen-block area on the Upper West Side. They talk the politics you expect on the Upper West Side of New York, except when Ilka is talking to them about her cousin Frieda Fishgoppel, professor of philosophy, now emerita.\n\nIlka says, “The dream is something to do with our most recent reconciliation.”\n\n“Why reconcile when you know that you will keep quarrelling?” Farah asks.\n\n“Our project,” Ilka says, “is to be reconciled to quarrelling.”\n\n“But why do you keep the argument going?” asks Ruth, the bona-fide retired activist. “You disagree with everything she stands for and disbelieve what she believes.”\n\n“And believe,” Ilka says, “in her inalienable right to believe what I disagree with. It’s in the nature, on my part certainly, of a demonstration, proof that we live in a democracy where people—and people we love—may have different, have wrong, opinions.”\n\n“And she is game to let you keep disagreeing?” asks Bridget.\n\n“Nnnnno,” Ilka says rather slowly. “But I like, I love, the intelligible, passionate language in which she disagrees. Frieda is in love with her truths in a way I do not love mine. And you all know that she was my ticket to America—my old ur-story.”\n\n“Tell it again,” the friends say, and settle themselves on their chairs.\n\n“After the end of the war,” Ilka says, “Frieda searched for the western, Viennese branch of our family. The generation of the grandparents who weren’t dead of old age had been killed in the camps, but there were cousins who had emigrated to Uruguay, to Paraguay, to the Dominican Republic, to Argentina. An uncle went to Canada. Frieda sent the visa for me to come to New York. She settled me in her funny little apartment in Washington Heights—in the fifties, there were so many of us we called it Washingstein Heights. She handed me an Oxford English Dictionary and hurried back to New Haven for her exams. She would come in to see if I was O.K., bring me ‘David Copperfield’ or a Jane Austen. I had arrived speaking minimal English, but all the refugees were soon reading novels in English, though maybe not the Henry James that Frieda brought me.”\n\n“What was her field?” Ruth asks.\n\n“Frieda’s first Ph.D. was in literature, and her dissertation was about antisemitism in her favorite writings from—I don’t exactly remember—was it ‘Beowulf’ to Eliot?\n\n“Frieda and I still e-mail. If we don’t hear from each other, we worry. ‘The earth is flat and has four sharp corners,’ she writes me. ‘It’s easy to drop off the edge.’ She has not replied to my last, and so I promptly assume that she has fallen! She is in emergency! Or, this time, did I go too far?”\n\nCrossword Puzzles with a Side of Millennial Socialism\n\n\n“But what about?’’ Bridget asks.\n\n“I’m trying to remember—what were we saying on the bus in Jerusalem?” Ilka muses. “Frieda and I were travelling with a group of Americans—that was in the eighties. We were sitting, talking, and she remembers that I got up and walked away and that I got off the bus. I remember that we did not talk for the last leg of the trip. We didn’t get together back in New York until Lotte invited both of us to dinner. She left us in a room together with the door shut, and Frieda and I started to laugh. You and I, we said to each other, we don’t have to go on doing this. You know what I will say, and I know what you are going to answer. But to this day we are still arguing the same opposing politics without having made a dent in each other’s opinion.”\n\n“Her wrong opinion, which leads her to vote on the wrong side,” Ruth says.\n\n“Which she believes to be the right side as fully as she believes that yours and mine is wrong.”\n\n“And you know the disastrous consequences of hers,” Ruth says.\n\n“That’s why I walked off the bus, I suppose,” says Ilka.\n\n“But you go on talking.”\n\n“We go on talking.”\n\nBridget says, “You keep not telling us what you argue about.”\n\n“Because I am more interested in the fact, the nature, of disagreement,” Ilka says. “Also, it keeps the conversation from going to Israel, though Frieda says, correctly I think, that ‘to not go there’ is to silence speech.”\n\nRuth asks, “So exactly what is the dispute?”\n\nIlka says, “One way of putting it is that I choose to think of myself as a humanist, a child of Adam, where Frieda thinks of herself as a child of God-chosen Abraham. The DNA, as she says, will be the same.\n\n“I search for what Isaac, the progenitor of Israel, has in common with his brother Ishmael, progenitor of Canaan: They both laugh if you tickle them and bleed when you prick them, which drives poor Frieda frantic. She says Shakespeare probably never met a Jew in his life. She challenges—no, she demolishes—my dearest belief, that it’s the imagination which could save the world, that if we imagined our neighbor’s griefs we would not do to him what we don’t want him to do to us. Frieda says that, having imagined what it’s like to be the abused Jew, Shakespeare confiscates half his fortune, hounds him ignominiously off the stage, and makes him convert.”\n\n“I’m going to open a bottle of wine,” Farah says. “Ilka, go on.”\n\nIlka says, “Frieda argues that the basis for our innate difference is my inclination for seeing sameness where hers is for seeing distinctions. Where I search for harmony in equality, she sees how one thing—one people, history, ethos—is distinct from another. Frieda says that for me distinctions spell the disruption of harmony; that, for her, harmony is a lie where distinction is present.\n\n“ ‘Harmony?’ I holler. ‘What, me? Aren’t I your favorite contrarian, your in-house skeptic who tests your every certainty by opposing my uncertainties? Do, please, notice,’ I tell her, ‘that I end with my universal question mark.’\n\n“But then she asked if I and you—my ‘Lunch Ladies’—still vote on the left, and I said, ‘You bet,’ and we were back on the bus, you see. I e-mailed her: ‘I’m discouraged.’ She answered, ‘For the record (if there is a record) I feel terrible, not simply discouraged but terrible.’\n\n“I wrote her, ‘I don’t know if it will ease your distress, but I reconfirm my love and friendship if you will accept them with the acceptance also of our irreconcilable differences, which are totally unchanged after half a century’s disputation.\n\n“She answered, ‘Noted. Confirmed and renewed.’ ”\n\nIlka says, “And then I dreamed that there was something essential that has to be prevented.” ♦\n\n"
    },
    {
        "post_title": "Soft Sculpture",
        "comment": "“My birthday party was in March,” Ilka told Bridget. The two old friends were walking on Riverside Drive at the turn of the season when you learn all over again that forty-nine degrees requires more than a jacket. “And I got what seemed an inspired present, a little . . . a . . . a . . . a what do you call the animal with the exoskeleton?” Ilka frowned, impatient and irritated at what was not, at that moment, available to her. “I always mean to figure how, routinely and with minimal fuss, to apologize for another word I can’t find in my head, cannot form in my mouth. Bridget, what’s the obvious—what is the first animal you think of that carries its roof so conveniently attached on its own back?”\n\n“A tortoise,” said Bridget.\n\n“A little tortoise,” Ilka said. “Eine kleine Schildkröte. I called it my Kröterl. That was the week of the Hitler takeover.”\n\nBridget had stopped and turned to her friend, who was saying, “No way am I going to remember which of the six or seven little girls brought what turned out to be an embarrassment. That thing sat and didn’t do anything. Just sat there. We shoved it, we pushed, we poked, we nudged. It withdrew its head under its roof and would not and would not move. My mother to the rescue. Mutti took all the children into the bathroom. You have to understand that this is a bathroom in Vienna and it’s the thirties. Mutti had to go find the matches and light the wall-mounted gas heater and warm two inches of water to cover the bottom of the tub, and she put in the Kröterl, which began immediately to march, and it marched round and round the bathtub at the speed of an Olympic footrace.\n\n“The next day, the three Brown Shirts walked in and gave us twenty-four hours to be out of our apartment.” If Ilka frowned, it was to find herself, still and again rehearsing her ur-story.\n\n\nWhen the ready tears that strangled Bridget’s throat allowed her to speak, she asked, “Where could you go?”\n\nIlka said, “They took me to Edith’s, a school friend. Mutti and Vati found beds with . . . people.”\n\nBridget was a writer with an indigestible Irish past of her own. Now she kept walking, alert to a fertile convergence in her understanding of the raw chill of a March day and the meaning of the word “apartment”: of having no choice but to leave a place where one was apart; of being without, that is outside walls of one’s own, and without a roof. Not to have a roof.\n\n“And the tortoise?” Bridget asked Ilka. “Did you take it with you?”\n\nIlka thought, and she said, “I look back and I don’t see. . . . The Kröterl didn’t come to Edith’s with me.”\n\nBridget said, “But you remember walking out the door of your apartment? Did your mother take it? Did your father take the Kröterl?”\n\n“What I remember,” Ilka said, “is the bathroom in our old apartment, mornings, my father sharpening his straight razor on the leather strop attached . . . was it to the doorknob? Sounds like Bluebeard—my poor Vati! And my recurring mishaps because I did not like to go into the bathroom after dark. My father’s terry-cloth robe, which hung on top of my mother’s robe behind the bathroom door, would put a ghostly sleeve on my shoulder.”\n\nBridget tended to invoke Henry James. She was trying to remember—what was it that James had said about a chatty old lady across the dinner table at one of those Victorian country weekends? The story of a dowager’s unwillingness to vacate the family home, the germ, if the old gossip would stop with the unusable detail—“the fatal futility of Fact,” James called it—that could be shaped into his next novel.\n\n“Before Hitler,” Ilka was saying, “we used to summer in the mountains. I keep wanting to turn and ask my mother about the consignment of Enzian that followed us home—the blue, upturned bell of the gentian that grows as if without a stem from the ground. Who sent such a mass of these bluest blue flowers that the only place large enough was the bathtub?”\n\n“Dead or alive,” worried Bridget. “The tortoise dead or alive must have gone somewhere.”\n\n“When my kids were little,” Ilka said, “I got them a stuffed toy, a soft sculpture, a green Kröterl. The -erl ending is the Viennese diminutive; in German it would have been a Krötchen. It must still be somewhere around the apartment. It was a hand puppet. You could put your hand inside and make it draw its head back under its stuffed cotton roof.”\n\n“Your e-mail,” Bridget said, “where I write you, is MyKroeterl38@usa.com.”\n\n“That’s my address,” said Ilka. ♦\n\n"
    },
    {
        "post_title": "Ladies’ Lunch",
        "comment": "It mattered that Lotte’s apartment was commodious. Lotte liked to boast that when she lay in bed and looked past the two closest water towers, past the architectural follies and oddities few people notice on Manhattan’s rooftops, she saw all the way to the Empire State Building. On the velvet sofa in Lotte’s living room, from which she could observe the Hudson River traffic as far as the George Washington Bridge, the caregiver sat watching television.\n\n“Get rid of her,” Lotte said.\n\nSamson dropped his voice, as if this might make his mother lower hers. “As soon as we find you a replacement.”\n\n“And I’ll get rid of her,” Lotte said.\n\nSam said, “We’ll go on interviewing till we find you the right one.”\n\n“Who will let me eat my bread and butter?”\n\n“Mom,” Sam said, “bread turns into sugar, as you know very well.”\n\n“And don’t care,” Lotte said.\n\n“If she lets you eat bread for breakfast, lunch, and dinner, she’ll get fired.”\n\n“Good,” said Lotte.\n\n•\n\n“Sarah,” Sam said to the caregiver, “I’ll take my mother to her ladies’ lunch if you’ll pick her up at three-thirty?”\n\n“That O.K. with you?” Sarah asked Lotte.\n\n“No,” said Lotte.\n\n•\n\n“Ladies’ lunch” is pronounced in quotation marks. The five women have grown old coming together, every other month or so for the last thirty or more years, around one another’s table. Ruth, Bridget, Farah, Lotte, and Bessie are longtime New Yorkers; their origins in California, County Mayo, Tehran, Vienna, and the Bronx might have grounded them but do not in these days often surface.\n\nRuth was a retired lawyer. She said, “I’ve forgotten, of course, who it was said that there are four or five people in the world to whom we tell things, and that’s us. Something happens and I think, I’ll tell the next ladies’ lunch.”\n\n“True! It’s true,” Lotte said. “When I suddenly sat on my rear on the sidewalk outside my front door, I was looking forward to telling you.”\n\nLotte had turned out to need a hip replacement. Dr. Goodman, the surgeon, was a furry man like a character in an Ed Koren cartoon, only jollier. He had promised Lotte, “From here on it’s all good.”\n\n“I’m eighty-two years old,” Lotte had said.\n\nGoodman told her, “I’m on my way to the ninety-second birthday of a patient whose knees I replaced eleven years ago.”\n\nBessie said, “And I told you, from my poor Colin’s experience, that the recovery is not so much like Goodman’s cheery projection.” These days, it depended on the state of Colin’s health and Colin’s mood whether Bessie was able to take the train in from Old Rockingham.\n\n•\n\nToday’s lunch was at Bridget’s, so she got to set the agenda: “ ‘How to Prevent the Inevitable.’ I mean any of the scenarios we would rather die than live in.” Bridget was a writer who still spent mornings at her computer.\n\nRunning the New York City Marathon at Age Eighty-Six\n\n\nFarah, a recently retired doctor, said, “The old problem of shuffling off this mortal coil.”\n\n“Of shuffling off,” Lotte said.\n\n“And it was you who said you wanted to see it all, to see what would happen to the end,” Farah reminded Lotte.\n\n“I wasn’t counting on the twenty-four-hour caregiver or the heart-healthy diet,” said Lotte. “You doctors need to do a study of the correlation between salt-free food and depression.”\n\n“Your Sarah seems pleasant enough,” Ruth said. “What’s wrong with her?”\n\n“That she’s in my living room,” Lotte said, “watching television; that she’s in my kitchen eating her lunch, which she does standing up; that she’s in my spare room asleep, and in my bathroom whenever I want to go in.”\n\nRuth asked Lotte what Sarah did for her. “Do you need a caregiver to help you dress?”\n\n“No,” Lotte said.\n\n“You need a caregiver to help you shower?”\n\n“No,” Lotte said.\n\n“Get your meals?”\n\n“God, _no! _”\n\n“So what do you need help with?”\n\n“The caregiver,” Lotte said.\n\n“Go away,” she said to Sarah, who had come to take her home. The four friends’ mouths dropped to see their friend raise her arm at the caregiver and slap the air.\n\n•\n\nThey were of an age when they worried if one of them did not answer her telephone.\n\nBessie, Lotte’s oldest friend, had known Sam since he was a baby. She called him from Connecticut. “Why doesn’t the caregiver pick up Lotte’s phone?”\n\n“She’s gone. There was just too much abuse.”\n\n“You’re kidding me! What? That nice Sarah? You’re talking elder abuse?”\n\n“More like caregiver abuse,” Sam said.\n\n“Like what?”\n\n“Like Mom would change the channel Sarah was watching on the TV. She’d come into the kitchen and pack away the food Sarah was preparing for her lunch, and turn on the light when Sarah was asleep. It was getting bizarre. I’m here waiting with her for the new woman.”\n\n•\n\nBessie e-mailed the friends in New York to look in on Lotte.\n\nBridget went to see Lotte. Bridget, Lotte, and Shareen, the new caregiver, sat looking out on Riverside Drive. Lotte said, “Shareen drives in from New Jersey. Shareen has a five-year-old who brushes his own teeth. Shareen told him that if he doesn’t brush, a roach will grow in his mouth.”\n\nBessie phoned Lotte. “How is the new caregiver?”\n\n“Intrusive,” said Lotte.\n\nWhen Farah called Lotte, it was Sam who picked up the phone. “Shareen is gone. Mom locked her—I can’t make out if it was into or out of the bathroom, but it wasn’t that. Shareen did not want to have to manhandle Mom to stop her eating sugar by the spoonfuls.”\n\n“Lotte is angry,” Farah said. “After making your own decisions your life long, it must be hell having someone tell you what you can eat and when to shower and what to wear.”\n\n\n“Because her own decisions are not tenable,” Sam said. “Greg is coming in from Chicago.” Gregor was Lotte’s younger son. “We’re going to check out this nice assisted-living home. It sounds really nice. Upscale.”\n\n“Sam? You’re moving Lotte out of her apartment?”\n\n“To a nice home in the country.”\n\n“A home in the country. You discussed this move with Lotte?”\n\n“Yes.”\n\n“And she has agreed?”\n\n“Well, yes, she has. In a way,” Sam said. “She said next year, maybe. Listen. Mom cannot deal with the round-the-clock caregivers. And believe me that she does not, does not, want to move in with Diana and me.”\n\n•\n\nBridget phoned Sam. “So, what’s this place you want to move Lotte into?”\n\n“Called Three Trees. It’s in the Hudson Valley,” Sam told her. “My brother will help me move Mom in, and move the stuff she’s fond of—the famous velvet sofa.”\n\n“And she will have an apartment of her own?”\n\n“A bedsitter, neat and convenient, with her own bathroom and a breakfast nook.”\n\n“Her own nook,” Bridget said. “What’s outside the window?”\n\n“The Hudson River view, unfortunately, is on the other side of the building. Trees. There’s a little parking lot and lots of green. Listen. We know Mom would prefer Manhattan—which would have been a hell of a lot more convenient for Diana and me to visit her—but who can afford something nice in the city?”\n\nBridget said, “It’s that none of us drives these days. How are we going to visit?”\n\n“One of the advantages is that there will always be people around.”\n\n“Does Lotte think this is an advantage?”\n\nSam said, “I have never been in a situation where there hasn’t been somebody to talk with.”\n\n“I have,” said Bridget.\n\n“And I would know she’s getting three proper meals.”\n\nGod. Poor Lotte, thought Bridget. And poor Sam. “You’re not a happy camper,” she said to him, wondering what the phrase came from.\n\n•\n\nRuth, an old activist, had an idea. She said, “I’ll talk to Sam.”\n\n“Have you closed on the Hudson Valley place?” she asked him.\n\n“Greg and I are going up on Thursday.”\n\nRuth said, “Will you give us a couple of days to figure something out?”\n\n“Believe me, there is nothing to . . . Yes, sure. O.K. But I need to get Mom and her stuff moved before Greg leaves for Chicago.”\n\nRuth said, “Could Lotte live alone if—”\n\n“Absolutely not.”\n\n“Sam, wait. Could Lotte live alone if the four of us—the three of us if Bessie can’t come in—take turns checking on Lotte, to see what she needs and if anything is wrong?”\n\n“Mom would put sugar on her bread and butter.”\n\n“Sounds delicious,” Ruth said.\n\n“She would never change her clothes.”\n\n“Probably not.”\n\n“She would have one shower a week. She would not shower.”\n\n“Sam! So what!”\n\n“Not on my watch,” Sam said. “Things need to be done right.”\n\n“No, they don’t. Why do they need to be right?”\n\n“When Mom messed up her medicines, Greg and I had to rush her to Emergency. She might have died.”\n\n“Yes. She might. Your mother might have died in her own bed, in sight of the Empire State Building and the George Washington Bridge. No, but Sam, we will go up and check on her. Let’s try it—a couple of days.”\n\n“What if she falls down again?”\n\n“She falls down. Sam, I’ll sleep over there tonight.”\n\nRuth slept over at Lotte’s, and Lotte fell going from her bed to the bathroom. Ruth called Sam, and Sam and Gregor came and took Lotte to Emergency.\n\n•\n\nSamson and Gregor moved their mother, the sofa, and whatever else out of Lotte’s ample apartment could be made to fit, into the bedsitter in the Hudson Valley. Greg flew back to Chicago.\n\n•\n\nWhen the ladies’ lunch met in Farah’s apartment, the agenda was Lotte’s rescue. Farah had a plan.\n\nThey brought each other up to date.\n\nLotte had phoned Ruth from Three Trees. Ruth said, “I didn’t recognize her voice. I mean, I knew that it was Lotte, but her voice sounded different, strangled, a new, strange voice.”\n\n“Lotte is furious,” Bessie said.\n\n“Yes, I know that voice,” Bridget said. “Lotte called me. She remembered my sitting with her and Shareen. She wanted me to get Shareen’s phone number. Shareen drives a car. Lotte wants Shareen to come and pick her up at Three Trees and drive her home to the apartment. Which is not going to happen.”\n\n“Now when I go abroad I tell everyone Im a Canadian goose.”\n“Now when I go abroad I tell everyone I’m a Canadian goose.”\nCopy link to cartoon\nLink copied\n\nShop\n“Lotte called me,” reported Farah. “She wants us—her and me—to rent a car together. I told her I haven’t renewed my license. I doubt if I could pass the eye test. Not a problem, Lotte said. She would drive.”\n\n“Does she even have a license?”\n\n“Lotte hasn’t driven in ten years.”\n\nBessie said, “Sam called me and he was fit to be tied. Wanted to know if I had something to do with Lotte buying a car. Buying a car! Me? I have never actually bought a car in my life. Lotte believes that she has bought a car and keeps calling this dealer to send her the keys.”\n\nBessie had called Lotte and asked her, “What’s this about a car?” Lotte said, “It’s down there in the parking lot.” “What kind of a car is this?” Bessie had asked her, and Lotte said, “I’m waiting till they send me the virtual key.”\n\n•\n\nFarah’s plan: Farah had an eighteen-year-old grandson, Hami. He would have his license as soon as he passed his test. “He’ll drive us to Three Trees, and we will bring Lotte back.”\n\n\n“Better be soon,” Bessie said. “Sam is putting Lotte’s apartment on the market.”\n\n“The test is this Monday.”\n\nBut Hami failed his test.\n\n•\n\nBridget phoned Lotte at Three Trees. “How’s it going?”\n\n“Not good.”\n\n“How is the food?”\n\n“Salt free.”\n\n“Judging from your voice, you’re getting a little bit used to being there?”\n\n“Can you come and get me and take me back to my apartment?”\n\n“Lotte, we just really wouldn’t know how. For the moment, might it be a good idea to accommodate yourself?”\n\n“Yes. But I need to go home,” Lotte said.\n\n“Have you found anyone to talk to?”\n\n“Yes. Alana. She sits next to me in the dining room. Alana has three children and five grandchildren, the oldest nineteen, the twins age thirteen, and a nine- and a five-year-old. Would you like me to tell you what their names are?”\n\n“Not really.”\n\n“Would you like me to tell you where each of them goes to school?”\n\n“Lotte . . . ”\n\n“Minnie Mansfield has a grandson. His name is Joel, and Joel has a friend whose name is Sam, like my Sam. Shall I tell you which colleges Sam and which colleges Joel are considering going to?”\n\n“Lotte . . . ”\n\n“Minnie’s sister’s granddaughter,” said Lotte, “is thinking of taking a gap year before she goes to Williams.”\n\n“Lotte . . . ”\n\nLotte said, “I have not told Alana or Minnie that I’ve died. I thought awhile before telling Sam, but he was fine. He was really very good about it, my poor Sam.”\n\n“You mean that you feel as if . . . ” Bridget hesitated between saying “as if you have died” and “as if you are dead.”\n\nLotte said, “No. I am dead. If I saw Dr. Goodman—or any doctor—he would look down my throat and see the four yellow spots dead people have. When you write the story, the question is whether, now that I am dead, I can die again, a second time, or is this what it is from here on.”\n\n“Lotte, you want me to write your story?”\n\n“You’ve already written how I got rid of Sarah and Shareen, and the roach in Shareen’s five-year-old’s mouth, and about Sam and Greg putting me here in the boonies.”\n\n“Lotte,” Bridget said, “we’re mobilizing ourselves. We’re trying to figure out how to come and visit you.”\n\n“Good! Oh, oh, good, good!” Lotte said. She wanted them to give her enough lead time so she could arrange a ladies’ lunch in the Three Trees dining room. “Then I’ll tell you how I lay down on my sofa—this was last Friday—just to take a nap, and when I woke up I knew that I was going to die, and I died.”\n\n•\n\nSam has taken time off twice this month to go and visit his mother. He feels that she is settling in. “When she says that she has died she means died to the old New York life in order to pass into the new life at Three Trees.”\n\n“That’s what you think she means?” Bessie asks him.\n\n“What else could she mean?”\n\nBessie is silent a moment. She says, “Lotte has stopped calling me.”\n\n“I know,” Sam says. “She doesn’t call me, and she doesn’t return Diana’s calls.”\n\n“She doesn’t pick up her phone.”\n\n“I know,” Sam says.\n\n•\n\nBessie is pretty much stuck in Old Rockingham. Colin seems to be on the decline. Poor Bridget didn’t make it to the last ladies’ lunch, because she had one of her frequent debilitating headaches, but she wants to come along if Ruth and Farah figure out how to go and visit Lotte.\n\nThe idea to hitch a ride with Sam when he drives up to Three Trees gets screwed up because Lotte does not return Farah’s call. “And then I guess I forgot to call her,” Ruth says. “In any case, there wouldn’t have really been time to change my doctor’s appointment.”\n\n•\n\nHami has got his license and has driven his new secondhand car to his first semester at Purchase.\n\n•\n\nFarah and Bridget still mean to figure out some way to go up and see Lotte, maybe in the spring, when the weather is nicer. ♦\n\n"
    },
    {
        "post_title": "Ruth, Frank, and Dario",
        "comment": "The February Ladies’ Lunch met at Ruth’s Riverside Drive apartment, so it was for her to set the agenda: You remember how we said that we’re the five people to whom we tell our stories? Well, I have a story for you.\n\nGreat, said Lotte.\n\nGood, said Farah and Bessie.\n\nA number of stories, Ruth told them. And at the end there is a puzzle.\n\nGood egg, said Bridget.\n\n•\n\nRuth said, There was this party at Sylvia’s that turned out to be a shiva for Sylvia’s aunt.\n\nLotte and I were there, said Bessie.\n\nBooks & Fiction\nEarly access to new short stories, plus essays, criticism, and coverage of the literary world. Paid subscribers get author interviews and poems.\n\nSign up\nBy signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\nRuth said, And Sylvia came over and asked if she should get me a chair. I told her, Thanks, very kind, but I’ll find one when I need to sit.\n\nGet you a drink? she said.\n\nI told her, Sylvia! I can manage. The cane is for balance.\n\nAnd I should stop fussing and go away?\n\nYou don’t have to go away, I said. We laughed and Sylvia said she hoped it was O.K. that she had given Frank my number. He was dying to talk to me.\n\nFrank? Which Frank is this?\n\nRuth, you know. Frank James.\n\nFrank James, yes. Oh, I think it’s that I think of him as James Frank.\n\nSylvia said, Frank works in a gallery on Bleecker Street and wants to know about your old buddy, your client—what was Dario d’Alessi? Anyhow he wants to talk to you.\n\nSo why doesn’t he walk over and talk?\n\nSylvia said, He says he’s afraid of you.\n\nI was annoyed. That is such nonsense. What does it even mean? Where is he?\n\nOver there, said Sylvia, walking out the door.\n\n•\n\nIt had irritated her, Ruth told the friends, to find herself waiting for Frank to call. The prospect of telling her old Dario stories, she said, had opened a window onto such a chunk of time. She called Sylvia and asked for James’s number.\n\nJames? Sylvia said. Which James is this?\n\nFrank, I mean, Frank James, who wants to talk to me.\n\n•\n\nRuth had dialled and hung up because she couldn’t think, at that moment, whether it was James or Frank. Frank. She dialled. Frank, this is Ruth. Your asking about Dario d’Alessi has started all these stories in my head.\n\nFrank said, That’s what I hoped. God! That’s what I want. I Googled you. You were Dario d’Alessi’s lawyer.\n\nI was, she had told him. There was paperwork to do with the people he hired to fabricate—fabricate, that was the word—one of his sculptures. I got to go upstate with him into this sort of hangar where men were working on a twenty-foot black curl. I was never happier. I loved listening to the craftsmen talking with each other.\n\nCrossword Puzzles with a Side of Millennial Socialism\n\n\nGod! Frank said. How did you meet him?\n\nRuth said, I was one of the groupies who hung around whenever he came to New York. Years later, I visited him in the Italian Alps, in his place. It was like a Mesa Verde cave dwelling, if you can imagine a Bauhaus cave carved out of the Italian mountainside. Did you know him?\n\nMe. No! No, Frank said. I saw him once coming out of a restaurant on East Seventeenth and I walked behind him for a number of blocks. He went into a grocery and I watched him through the window. He came out, went into a liquor store, and came out with a bottle. Then he got into a bus going west.\n\nRuth told her friends, I had the thrill of thinking: So that’s what Dario did on the way over to my place—like watching a scene happening thirty years ago. But then Frank said: I was just twenty, too young and shy to go up to this man and tell him that I loved his show. So that must have been Dario’s first exhibit, years before the one at the Guggenheim. Before I even knew him. I told Frank that Dario might have been grateful. Dario used to talk about the desolation of that early success and his first New York visit before he knew people.\n\nFrank said the gallery had just acquired a d’Alessi. Called “Hatch.”\n\nI remember, I remember! I remember the bunch of us sitting with a bottle of Malbec, trying to come up with a name for a new d’Alessi piece, to replace “Untitled.” It had to be what Clement Greenberg called a word “independent of meaning,” in the days when our favorite cartoon was of a museumgoer wiping a tender tear in front of a Russian Constructivist painting. You don’t know till you try how hard it is to think of words that signify no object, or feeling, or value. I’d wake up in the night with a sense of triumph: “Bout!”—but that means “strife.” “Upstanding” got shot down because it commented on its opposite—“standing down.” There are so many stories! I said.\n\nFrank said that I was a resource and asked whether he could take me to lunch, but the day of the lunch he called for a rain check. Major snafu at the gallery. I’ve invited him up for a drink.\n\n•\n\nThe March Ladies’ Lunch met at Bessie’s.\n\nFrank James had not made it to Ruth’s for that drink. Someone from the gallery called. Frank was out of state and would call as soon as he got back.\n\nThe friends said, Tell us the d’Alessi stories you were going to tell Frank James.\n\n•\n\nRuth said, Here’s something I didn’t understand when I was visiting Dario. I called his attention to a man, a farmer, sitting on the pavement in the village square with a little goat on his lap. The man held the animal’s hoof the way you might hold a child’s or a young girl’s hand. Dario said, He’s going to take the goat to be slaughtered, which I always remembered afterward the way you remember something that doesn’t add up.\n\n•\n\nRuth said, Dario took me on a climb. He climbed like a mountaineer—one foot after another at an even pace. I impressed myself by overtaking him. Then I had to sit down and recover my breath while he moved steadily on and up.\n\n•\n\nAnd the terrifying drive up the mountain road to see the oldest houses on the highest range. You have to understand that Dario was the world’s worst driver. On the way back we ran out of petrol. Because you are statistically more likely to come upon a wayside shrine where someone plunged to death than a gas pump, the locals—unlike Dario—drive with a spare can of gas. Dario and I sat with the car door open and we sat and we sat until the milkman’s truck tootled up the road. The milkman siphoned off enough gas to get us back to Altomonte. Dario took out his wallet—I had enough Italian to understand that the milkman said No, no no, no grazie! Signor Dario, no! che mi faccia un autografo. I wondered how many upstate New York milkmen would prefer a de Kooning or a Rothko signature to a couple of twenties.\n\n•\n\nAt Farah’s lunch in April, as Ruth reported that Frank James had cancelled another appointment, the friends began to smile. One of those spring colds that are so famously hard to shake.\n\n\nFarah asked her, Is this getting to you? Are you annoyed with him?\n\nRuth said, I would have said no way, except that I’m telling you about it.\n\n•\n\nBessie’s husband, Colin, was not well, so she did not come to the May lunch at Lotte’s.\n\nFrank had had to go and get a grown son out of some snafu and hadn’t made it to the latest appointment.\n\nHere was the puzzle, and it engaged the five friends’ powers of speculation:\n\nLotte said, First thing, if someone tells you they have a snafu, a cold, a son, is to believe them. Farah said, One can imagine a twenty-year-old too shy to approach a man with a famous name, but what stops the middle-aged New Yorker from crossing the room to speak to a woman . . .\n\nAn old woman, Ruth said.\n\nAt a New York party—\n\nA New York shiva, Ruth said.\n\n•\n\nThe June Ladies’ Lunch met at Bridget’s.\n\nFrank had not made it to Ruth’s place, and Bridget said she had a story: I asked my delightful twenty-year-old niece, Lily, if she remembers refusing to come into the house if my ninety-year-old mother was in. Lily says she remembers that my mother wore the earpiece of her glasses across her ear instead of tucked behind it and she had been spooked. She remembers crying and not wanting to come in.\n\nLily was how old? asked Lotte.\n\nSix years, maybe.\n\nAnd how does that throw light on a grown man not talking to Ruth at a party.\n\nAt a shiva, Ruth said.\n\nBridget said, Just another story that doesn’t add up.\n\n•\n\nThe Ladies’ Lunch met back at Ruth’s early in July, before everybody dispersed for the summer. No, Frank had not come. Frank had called.\n\nThe friends smiled.\n\nFrank said that there was a fire in the apartment next to his apartment.\n\nThe friends laughed.\n\nBridget said, Maybe there was a fire?\n\nIt’s possible, Ruth said.\n\n"
    },
    {
        "post_title": "Dandelion",
        "comment": "That Henry James, when he got old, rewrote his early work was my excuse for revisiting, at ninety, a story I had written in my twenties. I was ten years old when I had to leave Austria, so the day with my father in the Alps must have taken place on our last family holiday, the previous August.\n\nI wished Mutti were coming, but she had woken with one of her migraines. I stood outside the hotel, in the grass, getting my shoes wet with dew, waiting and wanting for nothing. “Light tinkled among the trees,” and the “grasses gleamed sword-like,” says my story. Curious how our language asks for similes. What is something “like”? The sky was “like liquid light,” I wrote. “Liquid” is close, but it’s not quite the right word. “The mountain’s back looked like something sculpted; one had the feel of the distant footpath in the fingertips. Between the mountain and myself, the land cupped downward, containing light like a mist.” How was it “like a mist,” the essence of which is to obscure? I remember it as a white, chilly presence. A dog barked and barked and barked and the purity of the air carried the sound to where I stood waiting.\n\nOn the road at the end of the hotel gardens, a group of silent walkers passed at the steady pace of those who have a day’s march ahead of them, young people. I followed them with my eyes. This was the moment that the sun crested the mountain—a sudden unobstructed fire. It outlined the young people’s backs with a faintly furred halo, while here, in the garden, it caught the head of a silver dandelion, fiercely, tenderly transfigured into light. I experienced a bliss of thought, new and inevitable, and I said, “Lieber Gott, if I ever ask you for anything, you don’t even have to listen, because nothing is necessary except this.” I knew that was right because of my vast happiness, and then my father called me and we walked out of the garden and started up the road.\n\nMy Vati was a tall man in excellent spirits. In August, the Viennese banks closed. In the mountains, my father wore knickerbockers and an Alpine hat with a feather. In his pocket he had a book in which to look up the names of the wayside flowers, trees, and birds. As we climbed, he pointed through the pines to the village farther and farther away below us. Vati’s plan was to reach the Alm by noon and take our lunch in the Alm hut. Did I know, he asked me, what an Alm was? It was a meadow high in the mountains where the cowherd brought all the cows from the valley to spend the summer eating the healthful upper grass, but I was being the world-famous ice-skating star Lucinda in her velvet dress with a skirt that swirled when I did my world-famous pirouette and I couldn’t listen to what my father was explaining.\n\nOh, but the sky was blue! It is bluest when you lie on your side and look through the grasses that grow by your cheek. I watched a spider climb a stalk that bent under its weight.\n\nI sat up. People were coming along the path, two men—young men walking together, one talking, using his hands. The other, who walked with his eyes to the ground, brought up his head and said something that made the first one shout with laughter. I watched them. They slowed their steps to look back at the people coming behind them. One of the girls called gaily, and the two groups joined. That was what I wanted to do when I got older—walk with friends, talking together and laughing.\n\nI looked after them with a suddenly sharpened interest. “You know something? Vati? I think those are the people I saw on the road this morning, when I was waiting for you. Vati, do you think they are the same people?”\n\nVati was asleep. It was rare, it was awesome, to see a sleeping grownup. His two shoes pointed skyward. Where his trouser leg folded back it exposed a piece of leg above the sock. I averted my eyes.\n\nWe resumed our ascent and it was hot and grew hotter. The climb became harder and steeper, until I thought I could not lift my foot to take the next step, and the next, and the next for the several hours it took us to reach the top.\n\nDigital Culture Wars with Naomi Klein\n\n\nIt was many years later, lying in the semi-dark and stillness, cleaned up and dry, after birthing my baby, my first—I could see where she lay wrapped, not crying, and everything was well—that I remembered sitting at long last, after climbing beyond my strength, under a tree in the shade, breathing in and out.\n\nYou know you have reached the top of the mountain when you are looking at a new world, the existence of which, a moment ago, you could not have suspected, ranges upon ranges paling into the blue distance, and here a peak rising and a second and a third, the relation in which they stand to one another becoming familiar under the blue sky. On the green expanse the cows graze, or move a step from here to there. When they lower their slow heads to chew the grass, the bells around their necks softly jingle.\n\nMy young folk sat at a long trestle table in the Alm hut. The cowherd, who sat with them, had a pipe between his teeth. The rumble of his voice, interrupted by the young people’s chatter and laughter, made its way to the table where my Vati and I were having our Mittagessen. It was a meal that I still think about and have not been able to reproduce: Kaiserschmarrn (the Emperor’s Pancake) served with blueberries. Alpine blueberries grow low to the ground and are both sweeter and sharper than the fruit you know. And a glass of fresh cow’s milk.\n\nI ate and watched. The girls were pretty and talked; the boys were tall and thin. I could see their knees. I loved how they clapped one another on the back and put pepper in one another’s soup and liked one another. I wanted to talk about them and I asked Vati who they were and where they were going, but he quieted me with a gesture. Vati, a city man, took an interest in the Alpine type and wanted to listen to what the cowherd was saying.\n\nThere was a general movement—the meal was breaking up. The young people gathered themselves. Vati and I followed them out of the cool dark of the hut into the sheer heat of midday. One of the boys, whose yellow hair jutted over his forehead, stood by the door adjusting the straps of his rucksack. Vati also took an interest in young people and questioned the boy about his party and their plans. Leaning against my father’s leg, I listened to the boy’s companionable answers and felt that life could offer no better happiness. Vati was reminded of his own young touring days and launched upon an anecdote. It was hot. I squeezed my eyes against the fierce brightness in which the blond boy’s head expanded and contracted among the little waves of heat. Vati’s voice proceeded upon the air, wanting to convey an idea of the exact conical rock formation that had been attempted. He described the attempt, and the failure that he, Vati, had predicted. I watched the boy’s hands play nervously with the ends of his straps and said, “Vati!,” saw the boy’s eyes steal to where his companions waited a little way along the path, and said, “Vati, let’s _go! _” Vati was recounting the witty remark made by himself in connection with said attempt and failure, laughing largely, recalling the occasion. The blond boy cackled foolishly. I saw the boy looking foolish and tugged on Vati’s sleeve. “_Let’s go! _” The boy excused himself, had his hand wrung long and heartily, dived for his freedom, and was received with laughter and a round of applause.\n\n\nMy face burned and I did not turn to look after the young people. They were going farther on and Vati and I started on our homeward journey.\n\nThe intensity of the midday light had burned the color out of things and deadened them. I was angry with the boy who had not wanted to hear Vati’s story and had wanted to get away from Vati. I hated the young people who had clapped their hands and had laughed. My father was walking along in a flow of spirits, and I was sorry for him because I had not cared to listen to the things he wanted to tell me. I resented and disliked this bad feeling, which would not let me be comfortable and be Lucinda the world-famous skating star.\n\nAnd I began to grizzle. I was tired, I said. There was a stone in my shoe and I didn’t feel like carrying my cardigan. Vati stopped his yodelling and looked at me. There was no stone. Vati put the cardigan in his backpack. I rubbed my right temple with the back of my right hand and said I wanted to go home. We were going home, Vati said, we were on our way home, but I meant home now. Vati said, “We’ll be home soon, we’re almost home, in a couple of hours.” He offered to tell me the story of Rikki-Tikki-Tavi, and the fight between the mongoose and the snake, but he had told it to me before. “How about an ice cream when we get home?” I understood that my father did not know what to do with me when I was like this, and I was afraid. I knew that this was God’s awe-full answer, for hadn’t I told him in the morning, “If I ever ask you for anything, you don’t have to listen, because nothing is necessary except this.”\n\nThe sun was gone, all light absorbed by the ring of mountains that stood around us, soft and velvet purple, without the play of color or movement save for our panicked descent. My father had hold of my wrist and hurried me along so that the stones rolled underfoot. ♦\n\n"
    },
    {
        "post_title": "The Arbus Factor",
        "comment": "On one of the first days of the New Year, Jack called Hope. “Let’s have lunch,” he said. “I’ve got an agenda.” No need to specify the Café Provence on upper Broadway, or the time—fifteen minutes before noon, when they were sure of getting their table by the window.\n\nThey did the menu, heard the specials. Hope said, “I’m always going to order something different,” but ordered the onion soup. Jack ordered the cassoulet, saying, “I should have the fish.\n\n“And a bottle of your Merlot,” he told the unsmiling proprietress, “which we will have right away.”\n\nBooks & Fiction\nEarly access to new short stories, plus essays, criticism, and coverage of the literary world. Paid subscribers get author interviews and poems.\n\nSign up\nBy signing up, you agree to our User Agreement and Privacy Policy & Cookie Statement. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\n“We’ll share a salad,” Hope said. She saw Jack watch the proprietress walk off in the direction of the bar, in a remarkably short skirt for a woman of fifty. Hope saw the long, brown, athletic legs, bare even in January, with Jack’s eyes. Jack, a large man, with a heavy, dark face, turned to Hope. “So?”\n\n“O.K., I guess. You?”\n\nJack said, “My agenda: if we were still making resolutions, what would yours be?”\n\nHope’s interest pricked right up. “I’m thinking. You go first.”\n\nJack said, “I’m going to watch what I eat. It’s not the weight; it’s the constantly thinking of eating. I don’t eat real meals unless Jeremy comes over.” Jeremy was Jack’s son.\n\nHope said, “I’m going to watch what I watch and then I’m going to turn the TV off. It’s ugly waking mornings with the thing flickering. It feels debauched.”\n\nJack said, “I’m not going to order books from Amazon till I’ve read the ones on my shelves.”\n\nHope said, “I’m going to hang up my clothes even when nobody is coming over. Nora is very severe with me.” Nora was Hope’s daughter.\n\nThe wine arrived. Jack did the label-checking, cork-sniffing, tasting, and nodding. The salad came. Hope served their two plates. Jack indicated Hope’s hair, which she had done in an upsweep. “Very fetching,” he commented.\n\nZooey Zephyr’s Defense of Trans Lives in a Deep-Red State in \"Seat 31\"\n\n\n“Thank you. Here’s an old new resolution: Going to learn French. What was the name of my teacher when we got back from Paris? I once counted eleven years of school French, but it was you who always had to do the talking.”\n\nJack said, “I want to learn how to pray.”\n\nHope looked across the table to see if he was being cute. Jack was concentrating on folding a whole lettuce leaf into his mouth.\n\nHope said, “I’ll never understand the principle of not cutting it into bite size.”\n\nThe onion soup came, the cassoulet came. Jack asked Hope if she would like to go back.\n\n“Go back? Back to Paris!” Jack and Hope had lived together before marrying two other people. Jack subsequently divorced his wife, who had subsequently died. Hope was widowed.\n\n“To Paris. To Aix,” Jack said.\n\n“Something I’ve been meaning to ask you,” Hope said. “Were you and I ever together in an old, old garden? Did we walk under century-old trees? Did we lie down in the grass and look into tree crowns in France, or was that in England? Was it an old English garden or is this a garden in a book?”\n\n“What’s to keep us?” Jack said.\n\nThere were a lot of reasons, of course, to keep them from going back. Two of the littlest were at this moment flattening their noses against the outside of the restaurant window. Ten-year-old Benjamin stuck his thumbs in his ears and wiggled his fingers at his grandfather. Hope made as if to catch her granddaughter’s hand through the glass. This made little Miranda laugh. And there was Hope’s daughter, Nora, with baby Julie in a stroller, and Jack’s son, Jeremy, standing out on the sidewalk.\n\n“I’m just going to the bathroom,” Hope mouthed to her daughter.\n\n“What?” Nora mouthed back, her face sharpened with irritation. The baby was crying.\n\n“She knows I can’t hear her through the glass,” Nora said to Jeremy.\n\nJeremy said, “You stay with the kids. I’ll go in and get him. I’ll see what your mother wants.” Jeremy walked into the restaurant, passing Jack and Hope on his way to the corner where, an hour ago, he had folded up his father’s wheelchair. Hope stood and came around the table to kiss Jack and be kissed goodbye.\n\n“On the double, Dad,” Jeremy said. “I need to get back to the office.”\n\n“I’ll call you,” Jack said to Hope. “We’ll have lunch.”\n\nHope was mouthing through the window again and Nora said, “Julie, shut up, please! Mom, what?” The baby had started screeching.\n\nHope pointed in the direction of the ladies’ room. Nora signalled, You need me to go with you? Hope shook her head no. One of the reasons for the Café Provence was that its bathrooms were on the street floor, not in the basement, down a long stair.\n\nGathering her coat and bag, Hope opened the door to the ladies’ room and saw, in the mirror above the basins, that her hair was coming out of its pins. She removed all the pins and stood gazing at the crone with the gray, shoulder-length hair girlishly loosened. Hope saw what Diane Arbus might have seen and was appalled, and being appalled pricked her interest right up. “I’ve got an agenda: the Arbus factor of old age,” Hope looked forward to saying to Jack the next time it would be convenient for Jeremy and Nora to arrange lunch for them at the Café Provence. ♦\n\n"
    },
    {
        "post_title": "Around the Corner You Can’t See Around",
        "comment": "Ladies’ Lunch over and talk for the moment exhausted, we continued to sit around the table by the window that overlooked the Hudson River, to sip our wine, pour ourselves another glass. It was here that Bridget asked what everybody thought about this idea of “finding oneself.” “Is there a character in Homer, in Shakespeare, in the Bible who thinks to ask, ‘Who am I?’ ” And the conversation was off again.\n\n“Besides Lear,” Farah said, “who asks ‘Who is it that can tell me who I am?’ And don’t you love the question ‘Who does he think he is’ or ‘Who do you think you are’ followed by a rhetorical exclamation point?”\n\nLucinella’s chair faced east. She had been watching people on the neighboring rooftop, and she said, “They’re having a party, and they didn’t invite me!”\n\n“Do you know those people?” Ruth asked her.\n\n“No,” Lucinella said.\n\nIlka said that her search began with her grandmother Ilonka, the one she was named for. “She died before I was born, but I’ve seen an old sepia photograph—two photographs, actually, taken by someone standing outside the open door to her bedroom. Great Aunt Mali used to let me play with—what did they call it?—the stereopticon, on Sunday afternoons when my mother’s cousins used to get together in Mali’s apartment just outside Vienna. I don’t think I remember my father being there. Tante Mali was immensely fat and old, with a sweet, lovely face. She and little Onkel Maxl ended up in Mauthausen. The magic of the stereopticon made the flower in a water glass on the bedside table, made the glass, three-dimensional and more real than the sepia grandmother sitting up in her crocheted bed jacket.”\n\nLotte frowned irritably when she said, “I will never understand why something made to look three-dimensional or virtual excites us more than the real thing in front of our noses. . . .”\n\n“Mimesis,” Farah said. “Is it Aristotle or is it me who said that we like a likeness, in which, I guess, we search for ourselves?”\n\nIlka was following her own thought: “The room is lit from the left, so there must be a window in the corner that one can’t see around. Secrets of the sepia bedroom: someone picked that flower and put water into the water glass; someone had set the glass on the bedside table. . . .”\n\n“That’s what I mean!” Lotte said. “What does it tell us about who we are that we are tenderly intrigued by an imaginary person walking through an old photograph but couldn’t care less about our neighbor passing our window at this very moment?”\n\n“My mother found Ilonka’s old ice skates,” continued Ilka. “The grandmother in the bed jacket ice-skating blew my mind. I mean, when were skates even invented?”\n\nCrossword Puzzles with a Side of Millennial Socialism\n\n\nRuth consulted her smartphone. She said, “In 3000 B.C.”\n\n“Look!” Lucinella said. “Look! The people on the roof! They’re bringing out the cake. It’s a birthday party.”\n\n“Birthdays,” Bessie said. “People talk of the pathos of having missed their own, or their kid’s birthday, or graduation. Tell me one thing that ever signified at a birthday party, a graduation, at Thanksgiving, a Seder, a wedding even—”\n\n“A funeral,” Farah said.\n\nRuth said, “Next Ladies’ Lunch will be at my place. The agenda: Tell some one thing that has thrown light on Who You Are.”\n\nThe next time the friends met, around Ruth’s table, Ilka read them what she had written about the morning she woke in her first English foster home, in 1938: “There, on a chest of drawers, was the suitcase my mother had packed for me. I lay in the strange bed and wondered what I was supposed to do. Presently I got up, I dressed slowly, and opened the door to the hallway. Where were all the people? The previous night there had been an old woman and her daughter who had fetched me from the station and brought me to this house where all the lights were on in all the rooms and a lot of smiling people stood around looking at me. A maidservant in a long white apron had taken me upstairs to the bathroom and run a bath. I understood that she meant me to get in, but I was ashamed and wouldn’t undress, and in the morning I could not remember having been brought up to this bedroom. I stepped out into the hallway and listened to the silence. A door stood ajar. I looked inside and saw a dressing table. A mirror, with photographs stuck into the frame, reflected a brush, a comb, and a pincushion in the shape of a heart. I gave the door what I told myself might have been an accidental push. It revealed the corner of somebody’s bed covered with a shiny green counterpane. I knew that I must not walk into other people’s bedrooms—should not be looking in. Was I allowed—was I meant—to use these stairs? I crept down to the next floor where there were a number of doors, but all of them were shut.”\n\n“Bedrooms,” Bessie said. “It was Robbe-Grillet, if you please, who showed us that we were part of the room’s geography before we were able to give an account of the color of the wall or form a relationship with this or that piece of furniture. Try it! Imagine yourself into bed in your first bedroom; notice that you know the direction your feet are pointing, and you remember the location of the door in relation to the window.”\n\n“And you define yourself as the who who inhabited that first bedroom?” Ruth asked her.\n\n“Why do I have to define myself?” Bessie asked.\n\nIlka said, “Well, I am the refugee who tells the old story.”\n\n“And I,” Lucinella said, “am the uninvited.”\n\n“No, you’re not,” Lotte said. “You are here at the Ladies’ Lunch. But why am I the person at the party who argues with everything anybody says?”\n\n“And I,” Farah said, “am the one who brings up the things nobody is interested in thinking about.”\n\n“And you,” Ruth said to Bridget, “it’s you who got us asking ourselves who we are. What do you say?”\n\n“That there isn’t any Who,” Bridget said. “I think it’s a silly question.”\n\n"
    }
]