[
    "<thinking>\nThe writing prompt sets a scene in a bustling trade station where a shadowy fixer offers a seemingly simple salvage job in a dangerous area. The prompt suggests themes of mystery, danger, and hidden secrets, with potential for unexpected twists and competing interests. The user profile indicates a preference for strong hooks, open endings, clear narrative structures, unique elements, vivid imagery, and well-developed characters and settings. The user also favors a third-person narrative perspective, rich vocabulary, and a tone that aligns with the story's themes.\n\nTo align with the user's style, the story should start with a compelling scene that sets the tone of chaos and intrigue. The narrative should be clear and cohesive, with detailed descriptions and character interactions driving the plot. Unique elements and vivid imagery should be incorporated to enhance the setting and themes. The main character should be developed through their actions and observations, and supporting characters should add depth through meaningful interactions. The language should be descriptive and varied, maintaining a tone of mystery and adventure.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a vivid description of Trade Station Heraklion, emphasizing the bustling chaos and setting a tone of intrigue and slight unease. Introduce the shadowy fixer in a way that immediately hooks the reader.\n\n#### Story Ending\n- Conclude with an open ending that hints at further challenges and mysteries in the Rivera Belt. Leave the reader with a sense of anticipation and curiosity about what secrets the scattered cargo might hold.\n\n#### Narrative Structure\n- Ensure a clear and cohesive structure with a defined beginning, middle, and end. Use detailed descriptions and character interactions to connect these elements and maintain a smooth flow throughout the story.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements that add depth to the story, such as specific cultural details of Trade Station Heraklion or the Rivera Belt. Consider adding unexpected twists or technological details that enhance the mystery.\n\n#### Engaging Themes and Imagery\n- Create engaging themes of adventure, mystery, and danger. Use vivid imagery to bring the setting and characters to life, such as the chaotic atmosphere of the trade station and the eerie, desolate environment of the Rivera Belt.\n\n#### Use of Tropes or Clichés\n- Handle common tropes like the mysterious job and hidden secrets with originality. Add unique cultural or technological details to avoid clichés and keep the story fresh and engaging.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the main character through their observations, actions, and interactions with the fixer and other characters. Ensure their motivations and reactions are clear and drive the narrative forward.\n\n#### Setting Establishment\n- Establish immersive settings with vivid descriptions. Bring Trade Station Heraklion to life with details of its bustling corridors and diverse inhabitants. Describe the Rivera Belt with eerie, desolate imagery that enhances the sense of danger and mystery.\n\n#### Supporting Characters and Interactions\n- Introduce supporting characters that add depth to the story, such as other traders, station staff, or rival salvagers. Use their interactions and dialogue to advance the plot and reveal more about the main character and the setting.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person narrative perspective to provide a broad view of events and add depth through dialogue. This perspective should help convey the emotions and actions of multiple characters, enhancing the overall narrative.\n\n#### Stylistic Elements\n- Employ clear, descriptive, and varied language with rich vocabulary. Use varied sentence structures and a mix of formal and informal vocabulary to maintain the tone and keep the reader engaged.\n\n#### Tone and Mood Alignment\n- Maintain a tone of mystery and adventure that aligns with the prompt. Choose words and phrases that evoke the intended emotions and atmosphere, enhancing the overall impact of the story and keeping the reader engaged.\n</story_rules>",
    "<thinking>\nThe writing prompt presents a scenario involving an archaeological dig, whispers of demons, and a bloodied mercenary with dire warnings, leading to a call for volunteers to investigate a mysterious excavation. Key thematic elements include mystery, danger, and adventure. The tone is tense and foreboding, with potential for supernatural or horror elements. Narrative possibilities include exploring the excavation, uncovering ancient secrets, and facing supernatural threats.\n\nThe user profile indicates a storytelling style that begins with a strong hook, uses clear and cohesive narrative structures, and concludes with open endings that leave room for anticipation. The user incorporates unique elements, engaging themes, and vivid imagery, while handling common tropes with originality. Characters are developed through their actions and interactions, and settings are described in immersive detail. The user employs a third-person narrative perspective, clear and descriptive language, and aligns tone and mood with the narrative effectively.\n\nCombining these insights, the Story Rules will guide the creation of a story that starts with a gripping scene, develops a clear and engaging narrative, incorporates unique and vivid details, and concludes with an open ending that leaves room for further exploration. The story will be told from a third-person perspective, with rich descriptions and a tone that matches the prompt's sense of mystery and danger.\n</thinking>\n\n<story_rules>\n### **Plot**\n\n#### Story Beginning\n- Begin with a dramatic scene where the bloodied mercenary stumbles into the archaeological camp, immediately setting a tense and foreboding tone. Describe the mercenary's appearance and the reactions of the expedition leaders to draw the reader in.\n\n#### Story Ending\n- Conclude with an open ending that hints at further dangers and mysteries within the Eastern Excavation. Leave the reader with a sense of anticipation and curiosity about what lies ahead.\n\n#### Narrative Structure\n- Create a clear and cohesive structure with a defined beginning, middle, and end. Ensure the story flows smoothly through detailed descriptions and character interactions, connecting the discovery of the mercenary, the decision to investigate, and the initial exploration of the excavation.\n\n### **Creativity**\n\n#### Unique Elements\n- Introduce unique elements such as ancient artifacts with mysterious inscriptions, supernatural occurrences, and cultural details of the civilization being excavated. These should add depth and originality to the story.\n\n#### Engaging Themes and Imagery\n- Use vivid imagery to describe the archaeological camp, the mercenary's injuries, and the eerie atmosphere of the Eastern Excavation. Themes of adventure, danger, and the supernatural should be explored in a way that captivates the reader.\n\n#### Use of Tropes or Clichés\n- Handle common tropes like the mysterious excavation and the bloodied messenger with originality. Add unique cultural and character details to avoid clichés and keep the story fresh and engaging.\n\n### **Development (Character and Setting)**\n\n#### Main Character\n- Develop the protagonist through their decision to volunteer for the investigation and their interactions with other characters. Ensure their motivations and actions drive the narrative forward.\n\n#### Setting Establishment\n- Establish the setting of the archaeological camp and the Eastern Excavation with immersive descriptions. Detail the camp's layout, the excavation site, and any notable landmarks or artifacts to bring the setting to life.\n\n#### Supporting Characters and Interactions\n- Introduce supporting characters such as the expedition leaders, other volunteers, and the mercenary. Use their interactions and dialogue to add depth to the story and advance the plot.\n\n### **Language Use**\n\n#### Narrative Perspective\n- Use a third-person narrative perspective to provide a broad view of events and add depth through dialogue. This perspective should convey the emotions and actions of multiple characters effectively.\n\n#### Stylistic Elements\n- Employ clear, descriptive, and varied language to enhance the story's impact. Use rich vocabulary and varied sentence structures to maintain the tone and keep the reader engaged.\n\n#### Tone and Mood Alignment\n- Maintain a tone and mood that reflects the prompt's themes of mystery and danger. Use words and phrases that evoke a sense of foreboding and urgency, aligning with the narrative's tense atmosphere.\n</story_rules>"
]