[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a mysterious green light, a man waiting for a phone call, and strangers gathering in a cramped apartment, suggesting themes of mystery, anticipation, and hidden connections. The author's style includes detailed setups, dialogue-driven plot revelations, introspective moments, and open-ended resolutions. Creativity is expressed through blending mundane settings with mysteries, reinterpreting traditional settings, and using layered narratives. Characters are developed through sensory descriptions, internal monologues, and duality, while language use involves vivid descriptions, introspective tones, and varied sentence structures. I will craft Story Rules that incorporate these elements, ensuring they are actionable and tailored to the Writing Prompt.  \n</thinking>  \n<story_rules>  \n- **Plot**:  \n  - Begin the story with a detailed setup that establishes the setting of the room filled with a mysterious green light and introduces the man waiting for a phone call. Describe his surroundings and his interactions with the environment to set the stage for the central conflict. For example, detail the eerie glow of the light casting shadows on the walls and the man's anxious pacing as he glances at the silent phone.  \n  - Use dialogue and character interactions to gradually reveal the connection between the man and the strangers gathering in the apartment. Introduce snippets of conversation that hint at a shared secret or past event linking them. For instance, have the man recall a cryptic message from the kindly woman, suggesting a deeper mystery.  \n  - Incorporate a reflective moment for the man as he contemplates the significance of the phone call and the green light. This introspection should serve as a turning point, prompting him to take action or make a decision. Describe his internal conflict and realization, such as questioning the nature of the light and its connection to the call.  \n  - Conclude the story with an open-ended resolution, leaving the reader to ponder the implications of the events. Perhaps the phone rings just as the strangers uncover a hidden truth, but the story ends before the call is answered, maintaining suspense.  \n\n- **Creativity**:  \n  - Blend the mundane setting of the cramped apartment with underlying mysteries to enhance intrigue. Describe ordinary objects in the room that take on new significance under the green light, such as a seemingly innocuous painting that hides a secret message.  \n  - Reinterpret the traditional setting of a waiting room by infusing it with modern sensibilities and character dynamics. Use the man's interactions with technology, like checking his phone or interacting with a smart device, to explore themes of isolation and connection.  \n  - Integrate historical and contemporary elements to create a unique narrative atmosphere. Perhaps the green light is linked to an ancient artifact, while the characters' dialogue reflects modern concerns about privacy and surveillance.  \n  - Use character interactions to reveal deeper themes and hidden truths. For example, the kindly woman might share a story that seems trivial but hints at her true motives and the reason for the gathering.  \n  - Employ a layered narrative structure to gradually unveil the story's core mysteries. Start with the man's perspective, then shift to the strangers in the apartment, revealing their individual reasons for attending and their connections to the man.  \n\n- **Development (Character and Setting)**:  \n  - Use detailed, sensory descriptions to create an immersive setting that reflects the story's tone. Describe the green light as \"casting an otherworldly glow, making the room feel both familiar and alien,\" enhancing the mystery.  \n  - Develop characters through their interactions and internal monologues, revealing their complexities and emotional states. Show the man's anxiety through his thoughts and the strangers' curiosity through their whispered conversations.  \n  - Establish character relationships and dynamics through dialogue that reveals underlying tensions and unspoken truths. For instance, a tense exchange between two strangers might hint at a past conflict or shared secret.  \n  - Use the setting as a backdrop to enhance the emotional arcs of the characters, aligning the environment with their internal conflicts. The cramped apartment could symbolize the characters' feelings of confinement and the pressure to uncover the truth.  \n  - Craft multidimensional characters by juxtaposing their public personas with private thoughts, creating a sense of duality. The kindly woman might appear welcoming but internally harbor doubts about the gathering's purpose.  \n\n- **Language Use**:  \n  - Use detailed and vivid descriptions to create a strong sense of place and atmosphere. Describe the green light as \"a pulsating emerald hue that seemed to breathe with a life of its own.\"  \n  - Employ a reflective and introspective tone, delving into the characters' internal thoughts and emotions. Capture the man's anticipation and fear as he waits for the call, using phrases like \"his mind raced with possibilities, each more unsettling than the last.\"  \n  - Use dialogue to reveal character relationships and underlying tensions. The strangers' conversations should be laced with curiosity and suspicion, such as \"Do you think she knows why we're really here?\"  \n  - Incorporate rhetorical questions to engage the reader and highlight characters' uncertainties. The man might wonder, \"What if the call never comes? What if the light is just a trick of the mind?\"  \n  - Use varied sentence structures to control pacing and emphasize key moments. Build tension with short, clipped sentences as the phone remains silent, then slow the pace with longer, descriptive passages as the strangers explore the apartment.  \n  - Employ figurative language to enhance imagery and convey deeper meanings. Describe the green light as \"a beacon of mystery, casting long shadows that whispered secrets only the brave dared to uncover.\"  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt about troubled teens on a wilderness retreat, I will analyze the Author Writing Sheet to extract key storytelling elements. The author’s style includes detailed setups, dialogue-driven plot development, introspective moments, and open-ended resolutions. Creativity is expressed through blending mundane settings with mysteries, reinterpreting traditional settings, and using layered narratives. Character and setting development involve sensory descriptions, internal monologues, and duality in character personas. Language use is characterized by vivid descriptions, introspective tones, dialogue revealing tensions, rhetorical questions, varied sentence structures, and figurative language.\n\nFor the Writing Prompt, the Story Rules will need to incorporate these elements while focusing on the themes of survival, secrets, and the impending storm. The plot should begin with a detailed setup of the wilderness retreat, using dialogue to reveal the teens' backgrounds and the retreat's purpose. The narrative should include introspective moments for the protagonist, reflecting on personal challenges and the group's dynamics. The resolution should be open-ended, leaving the discovery of the forest's secrets ambiguous.\n\nCreativity will involve blending the wilderness setting with mysterious elements, such as strange symbols or sounds in the forest. The narrative should reinterpret the traditional survival story by infusing it with modern themes of personal growth and group dynamics. A layered narrative structure will gradually unveil the forest's secrets.\n\nCharacter and setting development will use sensory descriptions to create an immersive wilderness environment, reflecting the teens' emotional states. Characters will be developed through interactions and internal monologues, revealing their complexities and the tensions within the group. The setting will enhance the emotional arcs, aligning with the storm's progression.\n\nLanguage use will include vivid descriptions of the forest and storm, introspective tones to explore the teens' thoughts, dialogue to reveal group dynamics, rhetorical questions to engage the reader, varied sentence structures to control pacing, and figurative language to enhance imagery.\n\nThese elements will be tailored into actionable Story Rules for the language model to follow.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Begin the story with a detailed setup of the wilderness retreat, describing the forest environment and introducing the group of troubled teens. Use sensory details to establish the setting, such as the scent of pine and the sound of rustling leaves.\n  - Use dialogue between the teens to gradually reveal their backgrounds and the purpose of the retreat. For example, a conversation around the campfire could hint at the personal challenges each teen faces and their initial skepticism about the retreat's effectiveness.\n  - Incorporate an introspective moment for the protagonist as they reflect on their personal struggles and the dynamics within the group. This could occur during a solitary walk in the forest, where the protagonist contemplates their past and the retreat's potential for change.\n  - Leave the resolution open-ended, allowing the reader to ponder the implications of the forest's secrets. As the storm begins, the teens might discover strange symbols carved into trees, but the narrative concludes with them huddled in their tents, listening to the rain, leaving the mystery unresolved.\n\n- **Creativity**:\n  - Blend the wilderness setting with mysterious elements to enhance intrigue. Introduce subtle signs of the forest's secrets, such as unusual animal behavior or eerie sounds at night, suggesting deeper mysteries beneath the surface.\n  - Reinterpret the traditional survival story by infusing it with modern themes of personal growth and group dynamics. Use the retreat as a backdrop to explore how the teens confront their inner demons and learn to work together.\n  - Employ a layered narrative structure to gradually unveil the forest's secrets. Start with the teens' initial exploration of the forest, then introduce clues and strange occurrences that build suspense and intrigue.\n\n- **Development (Character and Setting)**:\n  - Use detailed, sensory descriptions to create an immersive wilderness setting that reflects the story's tone. Describe the forest as both beautiful and foreboding, with towering trees and hidden dangers.\n  - Develop characters through their interactions and internal monologues, revealing their complexities and emotional states. For instance, a character might internally struggle with trust issues, which are highlighted through their hesitant interactions with the group.\n  - Establish character relationships and dynamics through dialogue that reveals underlying tensions and unspoken truths. A heated argument over leadership during a storm could expose the group's fractures and individual insecurities.\n  - Use the setting as a backdrop to enhance the emotional arcs of the characters, aligning the environment with their internal conflicts. The approaching storm could mirror the protagonist's growing anxiety and the group's escalating tensions.\n\n- **Language Use**:\n  - Employ detailed and vivid descriptions to create a strong sense of place and atmosphere. Describe the storm's approach with phrases like \"dark clouds rolling in, casting shadows over the forest.\"\n  - Use a reflective and introspective tone to delve into the characters' internal thoughts and emotions. The protagonist might ponder their past mistakes and hopes for redemption as they watch the storm gather.\n  - Use dialogue to reveal character relationships and underlying tensions. A conversation about the retreat's purpose could reveal differing motivations and hidden fears among the teens.\n  - Incorporate rhetorical questions to engage the reader and highlight characters' uncertainties. For example, \"What secrets did the forest hold, and were they ready to face them?\"\n  - Use varied sentence structures to control pacing and emphasize key moments. Short, abrupt sentences can heighten tension as the storm hits, while longer, flowing sentences can convey the calm before the storm.\n  - Employ figurative language to enhance imagery and convey deeper meanings. Describe the forest as \"a living entity, breathing secrets and shadows,\" to evoke a sense of mystery and foreboding.\n</story_rules>"
]