[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a mysterious green light, a man waiting for a phone call, and strangers gathering in a cramped apartment, suggesting themes of mystery, suspense, and interconnectedness. The author's style emphasizes gradual tension build-up, character-driven narratives, and vivid imagery, which will be crucial in crafting the Story Rules. I will ensure that the rules incorporate these elements while tailoring them to the specific narrative potential of the Writing Prompt.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:  \n  - Begin the story with a seemingly ordinary scene, such as the man sitting in a dimly lit room, waiting for a phone call. Gradually introduce the mysterious green light, using it to build tension and intrigue. For example, describe how the light flickers and casts eerie shadows, hinting at something otherworldly.\n  - Use the man's perspective to unravel the plot, focusing on his internal thoughts and reactions to the green light and the anticipated phone call. This will help convey his anxiety and the significance of the call.\n  - Introduce conflict through the man's internal struggle and his interactions with the green light, which seems to pulse with a life of its own. Use dialogue, perhaps a monologue or a conversation with himself, to reveal his motivations and fears.\n  - Resolve the narrative by leaving some elements open to interpretation. For instance, the phone call may never come, and the purpose of the strangers' gathering remains ambiguous, inviting readers to ponder the connections and hidden truths.\n\n- **Creativity**:  \n  - Blend elements of realism with the surreal by describing the green light in vivid, almost otherworldly terms, while maintaining a realistic setting in the man's apartment.\n  - Focus on character-driven narratives by exploring the man's internal experience and his anticipation of the phone call, rather than the external events of the gathering.\n  - Incorporate cultural or historical references to enrich the narrative. For example, the green light could be linked to an old legend or a forgotten piece of technology, adding depth to the mystery.\n  - Use the setting of the cramped apartment to enhance the tense atmosphere, describing how the walls seem to close in as the green light intensifies.\n\n- **Development (Character and Setting)**:  \n  - Develop the man’s character through his interactions with the green light and his internal monologue, revealing his backstory and the significance of the awaited call.\n  - Create a setting that reflects the emotional tone of the narrative. The apartment should feel claustrophobic and charged with tension, mirroring the man's anxiety.\n  - Use minor characters, such as the strangers gathering in the apartment, to highlight the man's traits and conflicts. Their presence should contrast with his solitude, emphasizing his isolation.\n  - Establish a strong sense of place by providing detailed descriptions of the apartment and the green light, grounding the narrative in a vivid and immersive setting.\n\n- **Language Use**:  \n  - Employ vivid imagery to create an immersive atmosphere. Describe the green light as \"a spectral glow that dances across the walls, casting long, wavering shadows.\"\n  - Use dialogue to convey the man's emotions and relationships, even if it's a conversation with himself or imagined dialogue with the person he expects to call.\n  - Vary sentence structures to control pacing and tension. Use long, descriptive sentences to build suspense and short, abrupt ones to convey the man's anxiety.\n  - Employ rhetorical questions to engage the reader and deepen the narrative. For example, \"What secrets did the green light hold? Would the call ever come, or was it all a cruel illusion?\"\n  - Use descriptive language to enhance character development. Describe the man with details like \"his eyes, weary and searching, reflected the green glow, hinting at sleepless nights and unspoken fears.\"  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt about troubled teens on a wilderness retreat, I will analyze the Author Writing Sheet to extract key storytelling elements. The author’s style involves a gradual build-up of tension, character-driven narratives, and a blend of realism with mysterious elements. The author also uses vivid imagery and dialogue to reveal character emotions and motivations. I will incorporate these elements into the Story Rules, ensuring they are tailored to the prompt's themes of survival, secrets, and a brewing storm. The rules will be organized into the categories of Plot, Creativity, Development (Character and Setting), and Language Use, providing detailed, actionable guidance for crafting a narrative that reflects the author's style while addressing the prompt's unique aspects.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:  \n  - Begin the story with a seemingly routine day at the wilderness retreat, gradually introducing subtle oddities in the environment, such as strange animal behavior or unusual weather patterns, to build suspense. For example, describe how the teens notice the forest growing eerily silent as they set up camp.\n  - Use the perspective of a central character, perhaps a teen with a troubled past, to unravel the plot. This character should notice and interpret the mysterious elements in the forest, such as finding an old, weathered journal with cryptic entries about the area.\n  - Introduce conflict through interpersonal dynamics among the teens, such as a rivalry or a past betrayal, and internal struggles, like fear of the unknown or guilt over past actions. Use a heated argument during a stormy night to reveal these tensions.\n  - Resolve the narrative by leaving some elements open to interpretation, such as the true nature of the secrets in the forest or the significance of the storm. End with the teens finding a hidden cave, its contents left undisclosed, inviting readers to ponder its mysteries.\n\n- **Creativity**:  \n  - Blend elements of realism with subtle hints of the surreal or mysterious. Describe the forest as both a tangible, rugged environment and a place where shadows seem to move on their own, and the wind carries whispers.\n  - Focus on character-driven narratives by exploring the internal experiences of the teens, such as their fears, hopes, and the impact of their pasts on their current situation. Highlight a character's internal monologue as they confront their fear of the dark.\n  - Incorporate cultural or historical references to enrich the narrative, such as local legends about the forest or historical events that might explain the strange occurrences. Mention an old tale about a hermit who once lived in the woods, rumored to have hidden treasures.\n  - Use the setting of the forest and the approaching storm to enhance the mysterious and tense atmosphere. Describe how the darkening sky and the rising wind create a sense of urgency and foreboding.\n\n- **Development (Character and Setting)**:  \n  - Develop characters through their interactions and internal monologues. Show how a character's leadership skills emerge as they guide the group through the forest, or how another's anxiety manifests in their behavior.\n  - Create settings that reflect the emotional tone of the narrative. Use the dense, shadowy forest to mirror the teens' feelings of isolation and fear, and the storm as a metaphor for their internal turmoil.\n  - Use minor characters, such as a camp counselor or a local guide, to highlight the protagonist's traits and conflicts. A counselor's calm demeanor could contrast with a teen's panic, emphasizing the teen's struggle with control.\n  - Establish a strong sense of place by vividly describing the forest's features, such as towering trees, hidden paths, and the sound of distant thunder, grounding the narrative in a tangible, immersive setting.\n\n- **Language Use**:  \n  - Employ vivid imagery to create an immersive atmosphere. Describe the forest with phrases like \"the canopy above, a tangled web of branches, blocking out the sun,\" or \"the storm clouds, a churning mass of gray and black, threatening to unleash their fury.\"\n  - Use dialogue to convey character emotions and relationships. Craft conversations that reveal the teens' fears, alliances, and rivalries, such as a whispered confession during a tense moment.\n  - Use varied sentence structures to control pacing and tension. Alternate between long, descriptive sentences to build atmosphere and short, abrupt ones to heighten moments of fear or surprise, such as when the storm suddenly breaks.\n  - Employ rhetorical questions to engage the reader and deepen the narrative. Pose questions like \"What secrets did the forest hold, and why did they feel so drawn to uncover them?\" to invite readers to ponder the unfolding mystery.\n</story_rules>"
]