[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt \"At the Library at the End of the Universe,\" I will analyze the Author Writing Sheet to identify key storytelling elements. The author’s style includes chaotic or unusual situations, character-driven narratives, humor, and open-ended resolutions. Creativity is expressed through blending reality with fantastical elements, pop culture references, and imaginative twists on mundane settings. Characters are depicted with exaggerated traits, and settings are familiar yet surreal. Language use is conversational, humorous, and sometimes crude, with distinct character voices.\n\nFor the Writing Prompt, the story will be set in a fantastical library where Librarians fix stories in Bookworlds. The narrative will explore what happens when their own story begins to change. The rules will incorporate the author's style by creating a chaotic and humorous plot, using exaggerated characters and surreal settings, and employing a conversational tone with vivid language. The rules will guide the language model to create a story that is both aligned with the prompt and reflective of the author's unique style.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Begin the story with a chaotic or unusual situation at the Library at the End of the Universe, such as a sudden shift in the dawn and dusk cycle that disrupts the Librarians' routine. Use this as a backdrop for character interactions.\n  - Introduce multiple Librarians, each with distinct personalities, such as a meticulous Librarian obsessed with order and a whimsical Librarian who thrives on chaos. Their interactions should lead to interconnected events as they venture into Bookworlds.\n  - Incorporate humor and absurdity by having the Chronicle start rewriting their story in unexpected ways, such as turning the Librarians into characters from the books they are trying to fix. Leave the resolution open-ended, with the Librarians pondering their new roles.\n\n- **Creativity**:\n  - Blend reality with fantastical elements by depicting the Library as a place where time is fluid and Bookworlds are accessed through magical portals. Include exaggerated scenarios, like a Bookworld where characters are aware of their fictional nature.\n  - Integrate pop culture references by having the Librarians encounter characters from well-known stories, such as a detective resembling Sherlock Holmes or a wizard akin to Gandalf, adding humor and depth to the narrative.\n  - Reinterpret the Library setting with imaginative twists, such as books that whisper secrets or shelves that rearrange themselves, enhancing the surreal atmosphere.\n\n- **Development (Character and Setting)**:\n  - Depict Librarians with exaggerated traits, such as a Librarian who speaks only in literary quotes or one who is perpetually lost in thought, adding humor and depth to their personalities.\n  - Create a setting that is both familiar and surreal, like a library with endless corridors and floating books, enhancing the comedic and fantastical elements of the story.\n  - Use character interactions and dialogue to reveal personalities and drive the plot, such as a debate between Librarians about the ethics of rewriting stories, which leads to a humorous and philosophical exploration of their roles.\n\n- **Language Use**:\n  - Employ a conversational and informal tone, using humor and sarcasm to engage the reader. For example, describe the Librarians' reaction to the Chronicle's changes with phrases like \"Well, this is a plot twist we didn't see coming.\"\n  - Craft dialogue that reflects each Librarian's distinct voice, contributing to the comedic tone. For instance, a Librarian might quip, \"I always knew I'd end up in a book, but I didn't expect it to be a romance novel.\"\n  - Use vivid and sometimes crude language to create an immersive narrative, such as describing the Library's chaotic atmosphere with phrases like \"a whirlwind of paper and ink that could rival any storm.\"\n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories: Plot, Creativity, Development (Character and Setting), and Language Use. The Writing Prompt involves a pirate crew stranded at a bus stop during an acid rainstorm, with their ship stolen by a gang. This scenario offers a chaotic and unusual setting, perfect for character-driven interactions and humor, which are key elements of the author's style. I will incorporate these elements into the Story Rules, ensuring they reflect the author's unique storytelling techniques while being tailored to the prompt.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:  \n  - Begin the story with the chaotic and unusual situation of the pirate crew stranded at a graffiti-covered bus stop during an acid rainstorm. Use this setting as a backdrop for character interactions, similar to the bustling city morning in the coffee shop story.  \n    - Example: Describe the acid rain sizzling on the pavement and the crew huddled under the bus stop, arguing over the last dry spot.  \n  - Introduce multiple characters with distinct personalities, each contributing to the unfolding events. Ensure their interactions lead to interconnected events, as seen with Sonya, Stevie, and Nate in the café story.  \n    - Example: Introduce characters like Captain Rumble, who insists on using the Nokia phone as a compass, and First Mate Squawk, who communicates only in pirate-themed riddles.  \n  - Use humor and absurdity to drive the narrative, leaving the resolution open-ended. The crew's attempts to reclaim their ship should be filled with comedic mishaps, akin to the unresolved Dungeons & Dragons session.  \n    - Example: End with the crew finally locating the Hermit Crabs' hideout, only to find it guarded by a flock of aggressive seagulls, leaving their next move uncertain.  \n\n- **Creativity**:  \n  - Blend reality with fantastical or exaggerated scenarios, such as the acid rainstorm and the pirate crew's modern-day predicament.  \n    - Example: Describe the crew's disbelief at the acid rain, with one member claiming it's a curse from a rival pirate.  \n  - Integrate pop culture references and unconventional elements, like the Nokia phone, to add humor and depth.  \n    - Example: Have a character attempt to use the Nokia phone's outdated games to strategize their next move, referencing its indestructible reputation.  \n  - Reinterpret the mundane setting of a bus stop with imaginative twists, turning it into a temporary pirate haven.  \n    - Example: Detail how the crew transforms the bus stop into a makeshift pirate camp, complete with a lookout post made from a discarded umbrella.  \n\n- **Development (Character and Setting)**:  \n  - Depict characters with exaggerated traits or quirks, enhancing the comedic tone.  \n    - Example: Captain Rumble is overly confident despite his questionable decisions, while Navigator Nelly insists on using a broken compass as a good luck charm.  \n  - Create settings that are both familiar and slightly surreal, enhancing the comedic elements.  \n    - Example: The bus stop is familiar but surreal, with graffiti depicting pirate battles and treasure maps, adding to the story's humor.  \n  - Use character interactions and dialogue to reveal personalities and drive the plot.  \n    - Example: Dialogue between Captain Rumble and First Mate Squawk reveals their dynamic, with Rumble's frustration at Squawk's cryptic advice pushing the plot forward.  \n\n- **Language Use**:  \n  - Employ a conversational and informal tone, using humor and sarcasm to engage the reader.  \n    - Example: Use phrases like \"the acid rain was just Mother Nature's way of saying 'stay indoors, you idiots'\" to add humor.  \n  - Ensure dialogue reflects characters' distinct voices and contributes to the comedic tone.  \n    - Example: Captain Rumble's exasperated \"Why is it always seagulls?\" contrasts with Squawk's cryptic \"The birds know more than they let on, Captain.\"  \n  - Use vivid and sometimes crude language to create an immersive narrative.  \n    - Example: Describe the bus stop as \"a graffiti-covered relic of civilization, now a pirate's last refuge against the sky's acidic wrath.\"  \n</story_rules>"
]