[
    {
        "post_title": "Portrait of the Artist with Four Other Guys",
        "comment": "As soon as Jimmy Boyle got back from Ireland, he went to see his friends. Roy, the Viper, Magic Frank, and Crazy Lester were hanging out under the viaduct on the corner of Warsaw and Bohemia, near Heart-of-Jesus Park. It was a late Friday afternoon in August, and Jimmy knew he’d find them there because the league games were over by four or four-thirty, and the boys liked to stay around for a while afterward to talk about what happened. Jimmy had gone to Ireland for a holiday with his mother, his grandmother, and his sister. They were there for two weeks, and he was happy to be back in the neighborhood.\n\nThe Viper was the first to spot Boyle.\n\n“Hey, Jimmy! Did you kiss the Blarney Stone?”\n\n“Yeah, all of us did, even my grandmother. We had to hold her by her legs. You gotta bend over backwards to do it. My ma got pictures of me and my sister there. What’d I miss?”\n\n“Roy hit two homers today,” said Lester.\n\n“He’s always hittin’ homers,” said Magic Frank. “That ain’t news.”\n\n“Red Dietz got killed,” said Roy.\n\n“No shit,” Jimmy said. “How?”\n\n“You know Red Dietz,” said Roy, “the one-armed pitcher on Margaret Mary’s?”\n\n“Yeah. Lost his right up to the elbow when he stuck it out a window on the Illinois Central.”\n\n“A line drive hit him right between the eyes in a game last week,” said the Viper. “Dietz died on the mound.”\n\n“Who hit it?”\n\n“Vidinski,” said Roy, “the third baseman for Mohegan Mortuary.”\n\n“They picked up the tab for the funeral,” said Frank.\n\n“Did you guys go?” asked Jimmy.\n\n“Nobody liked Red Dietz,” said the Viper. “I don’t know anybody that went.”\n\n“My mother did,” said Lester. “She dyes Dietz’s mother’s hair.”\n\n“He was all pissed off all the time,” said Frank.\n\n“You lost an arm, you’d probably be pissed off all the time, too,” said Roy.\n\n“So what was the best thing about Ireland?” the Viper asked Jimmy.\n\n“It don’t get so hot and humid in the summer like here. There’s a river goes through Dublin that’s pretty nice. Lots of old buildings and churches, stuff like that.”\n\n“Do the people speak English or Irish?” asked Roy.\n\n“Both, I guess. Sometimes I couldn’t understand what they were sayin’ in English. You know, like Cunningham’s mother. My grandmother speaks Gaelic pretty good and my ma, too, so we didn’t have no problems.”\n\n“What about girls?” asked Lester.\n\n“Didn’t hardly see any except for my cousin, Kathleen. She’s a couple years older, fifteen. We stayed with her family. One night after she took a bath, she came out in a towel and asked me if I wanted to use her bathwater while it was still warm.”\n\n“She’d already bathed in it?” asked Roy.\n\n“Yeah,” said Jimmy. “They share it ’cause there ain’t so much hot water.”\n\n“Too bad you couldn’ta shared it with her,” said Lester.\n\n“She showed me her tits,” said Jimmy.\n\n“Bullshit!” said Frank.\n\nJimmy nodded. “She did. Nobody else was around. Opened the towel and rewrapped it standin’ in front of me. They were the two best things I seen in Ireland.”\n\n“Were they big?” asked the Viper.\n\n“Average,” said Jimmy. “There were freckles all over ’em and the nipples pointed up.”\n\nClouds blocked the sun, and suddenly the air felt cooler.\n\n“Anybody hungry?” asked Roy.\n\n“Let’s go to the Cottage,” said Frank, “get fries with gravy.”\n\nThe boys began walking west on Warsaw, toward Pulaski. Roy and Jimmy Boyle trailed the others.\n\n“Do you think your cousin wanted to do somethin’ with you?” Roy asked.\n\n“I don’t know,” said Jimmy. “You think girls in Dublin are any different than the ones in Chicago?”\n\nBefore Roy could offer an opinion, a police car drove up and stopped in the street next to them. There were two cops in it, one driving and one riding shotgun.\n\nThe cop in the front passenger seat leaned out his window and said, “Any of you seen two colored boys drive by in a lime green Cadillac?”\n\n“I ain’t,” said Frank.\n\n“Me neither,” said Lester.\n\nRoy and the Viper shook their heads.\n\n“What about you?” the cop asked Jimmy Boyle.\n\n“I just got back from Ireland,” he said.\n\n“You go blind from drinkin’ the water over there?” said the cop.\n\n“No,” said Jimmy.\n\n“They got coloreds in Ireland?” the cop asked.\n\n“I don’t know,” Jimmy said. “I didn’t see any there.”\n\n“He seen his cousin Kathleen’s tits, though,” said Lester.\n\nThe cop stared at Lester for a moment. Crazy Lester was grinning.\n\n“Are you Irish?” the cop said.\n\n“No,” said Lester. “I’m Lithuanian on my mother’s side and Moldavian on my dad’s.”\n\n“You better watch yourself,” said the cop.\n\nThen the police car drove away.\n\n"
    },
    {
        "post_title": "Door to the River",
        "comment": "ROY READ IN A SCIENCE BOOK about a parasite that lives in water and enters the skin of human beings, goes to the head, and causes loss of sight. This condition, Roy learned, was sometimes called river blindness. Soon after he’d read this, Roy was taken on a Friday night by his cousin Ray to Rita’s Can’t Take It With You, a blues club on the West Side. Ray was twenty-two, six years older than Roy. Ray had recently enlisted in the navy and wanted to celebrate before leaving for boot camp the following Monday. The cousins were accompanied to Rita’s by Ray’s friend Marvin Kitna, an accordionist in a polka band who had been to the club several times before.\n\n“The Wolf’s playing tonight,” Kitna told Roy and Ray. “He’s gettin’ up there, but he’s still the best.”\n\nRoy, Ray, and Marvin Kitna were the only white patrons that night in Rita’s Can’t Take It With You. Kitna seemed to know almost everybody there, from the two bartenders, Earl and Lee, to many of the customers, as well as the two off-duty Chicago cops, Malcolm and Durrell, who were paid to provide security.\n\nRoy let his cousin and Kitna order beers and shots of Jim Beam for the three of them. The waitress, whom Marvin addressed as Dolangela, and who favored them with a dazzling dental display of gold and silver, did not ask any of them, even Roy, for verification of their ages.\n\nRoy slowly sipped his beer and kept his mouth shut. He did not touch the shot of bourbon. The Wolf put on a great performance, crawling around on the stage, lying on his back while playing guitar, and emitting his trademark howl. Ray and Marvin Kitna got up and danced a couple of times with girls Kitna knew. Roy was content to sit still and take in the show.\n\nAfter the boys had been there for about an hour, a girl came over to their table, pulled up a chair, and sat down between Roy and Ray.\n\n“Hi,” she said to Roy. “My name’s Esmeraldina. What’s yours?”\n\n“Roy.”\n\n“You got beautiful hair, Roy. You mind do I touch it?”\n\n“No.”\n\nEsmeraldina ran the fingers of her right hand through Roy’s wavy black hair.\n\n“You Eyetalian?” she asked him. “You an Eyetalian boy, huh?”\n\nRoy shook his head. “I’m mostly Irish,” he said.\n\n“Pretty Eyetalian boy with turquoise eyes.”\n\nEsmeraldina draped her left arm around Roy’s shoulders while she played with his hair.\n\n“Just go along with her, Roy,” said Marvin Kitna. “She won’t bite.”\n\n“Oh, yes, I do,” Esmeraldina said. “I surely do can bite when a particular feelin’ comin’ on.”\n\nShe poured Roy’s shot of Beam into his glass of beer and picked up the glass.\n\n“You mind do I take a taste?” she asked Roy.\n\nRoy shook his head no, and Esmeraldina drank half the contents.\n\n“What’s that particular feelin’ you’re talkin’ about, Esmeraldina?” asked Roy’s cousin.\n\nShe grinned, revealing a perfect row of teeth unadorned by metal, and replied, “When a man get under my skin, crawl all up inside so’s I can’t itch it or see straight. Happens, I ain’t responsible for myself, what I do until the feelin’ wear off.”\n\n“How long’s that take?” asked Marvin Kitna.\n\n“Depends on the man,” Esmeraldina said.\n\n“Like river blindness,” said Roy.\n\n“What’s that, honey?”\n\n“A water bug swims in through a person’s pores up to their head and makes them go blind.”\n\nEsmeraldina stared for a long moment into Roy’s eyes, then kissed him softly on the mouth.\n\n“I bet you know all kinds of interestin’ things, Roy,” she said. “You want to dance with me?”\n\n“Sure.”\n\nEsmeraldina picked up Roy’s glass and finished off the shot and the beer before they headed to the dance floor. Jimmie “Fast Fingers” Dawkins’ “All for Business” was playing on the jukebox. She pressed her skinny body hard against Roy’s and wrapped her arms around his back. Esmeraldina nudged him gently around in response to the slow blues. Roy guessed that Esmeraldina was in her early twenties, but he didn’t want to ask for fear she would in turn ask him how old he was, and he did not want to have to lie.\n\n“How old are you, Roy?”\n\n“Old enough to be here,” he said.\n\n“You pretty sharp. Sharp and pretty.”\n\n“You’re very pretty yourself, Esmeraldina.”\n\nAfter the song ended, Esmeraldina took Roy by the hand and led him out of the club. It was cold outside, too cold to be in the street without a coat. Roy had left his on the back of his chair at the table. Esmeraldina did not have one, either; she shivered in her short-sleeved blouse as she walked him to the right, around the corner onto Lake Street. A few yards ahead of them, two men, both wearing short-brimmed hats, were arguing. One of them pulled a gun from a pocket and shot the other man in the forehead. The man who had been shot flew off his feet backward as if he’d been caught off balance by Sugar Ray Robinson’s quick left hook. The shooter ran and disappeared under the El tracks. Roy looked at the man on the ground: his eyes were open and his short-brim was still on his head.\n\n“Bad timin’,” Esmeraldina said. “We’d best go back indoors.”\n\nShe and Roy hurried into Rita’s Can’t Take It With You, where Esmeraldina let go of him and lost herself in the crowd. Roy went over to the table where he’d been sitting with Ray and Marvin Kitna. They weren’t there. Roy looked for them on the dance floor, but he didn’t see them. He took his jacket off the back of his chair and put it on. The music coming from the jukebox was very loud, but Roy could hear a police siren. He saw Malcolm and Durrell, the security guards, go out the front door followed by Earl, one of the bartenders, and several customers. Roy ducked out too, turned left, and walked as fast as he could away from Lake Street. He could still see the dead man with a nickel-sized hole above the bridge of his nose.\n\n“How could his hat have stayed on?” Roy said.\n\n"
    },
    {
        "post_title": "Six Million and One",
        "comment": "Israel Rostov was a high school dropout who worked as a fur-cart pusher in the State and Lake Building. Roy was eight years old when he first saw him. On Saturdays Roy often accompanied his grandfather, Jack Colby, whom he called Pops, to the furriers’ office there that Pops shared with his brothers, Ike and Nate. Their brother Louie, who was the president of the Chicago Furriers Association, which he had founded, kept his office on the sixth floor of the building. The Colby brothers’ office was on the eighth floor.\n\nRoy would sit on a high stool and cut up pelts with a stiletto-like knife Pops had taught him to use, while his grandfather and great-uncles sat around a marble-topped table and played cards. When Louie joined them, the game was bridge; otherwise, they played three-handed gin rummy.\n\nIzzy Rostov delivered furs on carts from floor to floor. He was a short kid with thick, curly black hair and bushy eyebrows, small dark-brown eyes, and a huge hook nose that seemed to be trying to escape from his face. Rostov’s thick red lips curved upward at the corners so that it looked as if he were always smiling, except that his smile more resembled a sneer. He perpetually had a burning, unfiltered Lucky Strike dripping from his mouth. Roy was fascinated by Izzy’s ability to talk while never removing the cigarette from his lips, as if the butt end were glued between them.\n\nRostov called Roy “my little pal” and stopped his cart to talk to him whenever he encountered Roy in the hallways or in the freight elevator. This usually occurred when Roy was going between the sixth and eighth floors to visit with his Uncle Louie. The delivery boy always had a future plan for himself that he told Roy about. Most of the time it had to do with his moving to Miami Beach to hang out in the luxury hotels so that he could “hook up with rich, lazy broads.”\n\nOne afternoon, Rostov told Roy he had something special to show him but he couldn’t do it in the hallway. Roy followed Izzy into the men’s room on the eighth floor. After making sure that nobody else was in the bathroom, Rostov removed from one of his coat pockets a small black handgun and held it out for Roy to look at.\n\n“This is a .38-caliber snub-nosed revolver,” Rostov said. “A very accurate piece of hardware. I bought it from a spook on Maxwell Street.”\n\n“What are you going to do with it?” asked Roy.\n\n“Stick up a few gas stations, what else? I gotta get a stake together before I travel, buy some slick clothes to impress the broads, you know. I can’t make it on the peanuts these penny-pinchin’ Hebes pay me around here.”\n\nIzzy Rostov tapped the tip of his prodigious nose with the barrel of his revolver and said, “I might even have enough dough to get my beak fixed.”\n\nThen he laughed and put the gun back into his coat pocket. The ash from Rostov’s cigarette dangled dangerously, and Roy was certain it would fall off, but it didn’t. Roy moved farther away from him.\n\n“Don’t be frightened, little pal,” said Izzy. “I ain’t gonna shoot anyone. The piece is just to throw a scare into ’em, let the suckers know Israel Rostov means business. I could change my name too, once I get down south. How does Guy DeMarco sound? Smooth, huh? The broads’ll go for a name like that. Guy DeMarco.”\n\n“You think gas stations keep a lot of cash around?” Roy asked.\n\n“Depends,” said Rostov. “But I got bigger ideas.”\n\nRostov came close to Roy, mussed up his hair, and then walked out of the men’s room. Roy waited for a minute before returning to his grandfather’s office. Jack, Ike, and Nate were playing gin.\n\n“Hey, babe,” said Pops, “I thought you were going to see your Uncle Louie.”\n\n“I decided not to. I just went to the washroom.”\n\nRoy went over to his stool, climbed on, and resumed cutting up pelts.\n\nThe next time Roy ran into Izzy Rostov, the delivery boy winked at him but did not stop to talk. His cart was loaded with mink and fox stoles.\n\n“Gotta get these on a truck goin’ to the Merchandise Mart,” Izzy said, and pushed on toward the freight elevator.\n\nA couple of Saturdays after that, all four of the brothers were playing bridge, when Louie said, “You hear the Rostov boy got killed?”\n\n“The delivery cart kid?” asked Ike.\n\n“Yes. Apparently he tried to rob a liquor store on Huron the other night and the clerk shot him in the back before he could get away.”\n\n“You know about his parents?” asked Nate.\n\n“What about them?” Jack asked.\n\n“They were survivors of Auschwitz.”\n\n“Horrible,” said Ike. “Imagine how they must feel.”\n\n“What’s Auschwitz?” asked Roy.\n\nThe men were silent for a few moments before Nate spoke.\n\n“It was a concentration camp, a prison death camp during the war where the Germans murdered Jews.”\n\n“They also murdered Gypsies and communists,” said Ike, “but mostly Jews.”\n\n“But Rostov’s parents are still alive,” Roy said.\n\n“Some prisoners were rescued by the Allies before the Nazis could kill them,” said Louie.\n\n“How many people did they kill?” asked Roy.\n\n“Too many to count,” said his grandfather. “The accepted figure is six million.”\n\n“More,” said Louie. “They murdered more.”\n\n“To think that the parents escaped the Holocaust,” Nate said. “They come to America and their child is shot down in the street like a wild animal.”\n\n“He had a gun,” Roy said. “He showed it to me.”\n\nThe men all looked at Roy.\n\n“It was a snub-nosed .38,” he said. “Izzy told me he was going to stick up a gas station and move to Miami Beach.”\n\n“What kind of home life could the boy have had?” said Nate.\n\nRoy looked out a window onto State Street. The Chicago Theatre was showing Alan Ladd in The Badlanders. Clumps of brown dirt the size of pigeons were blowing through the gray air.\n\n“Let’s play cards,” said Ike.\n\n"
    },
    {
        "post_title": "The Red Studebaker",
        "comment": "Roy was twelve years old when his mother and her third husband, a jazz drummer named Sid “Spanky” Wade, told him that they were going to move out of Chicago to a suburb north of the city. They had already paid for the beginning of the construction of a new house, and the foundation had been laid. The next day, a Sunday, the four of them—Roy’s mother, her husband, Roy’s one-year-old sister, and Roy—drove out to see it.\n\nRoy had no desire to leave the neighborhood, and when he saw the property in Winnebago Gardens, a new development in the middle of nowhere, only sidewalks and streets and other houses under construction, no people, not even a kid on a bike, he knew immediately this place was not for him. The thought of being stranded like a lost legionnaire in the Sahara made Roy shiver. He disliked Sid Wade and Sid disliked him; and Roy’s mother, as always during her marriages, was either on the verge of a nervous breakdown or in the throes of collapse. His mother’s marriages—of which there would eventually be five—inevitably and rapidly deteriorated into disappointment and fear that found expression in the form of hysteria and vicious vitriol, behavior that terrorized not only her husband of the moment but Roy and anyone else who had to deal with her. This proposed move to the suburbs, to “somewhere quiet and less stressful,” as Sid Wade said, would surely salve her condition. City life made her nervous, agreed Dr. Martell, a heart specialist and old friend of Roy’s grandmother’s, who provided pills for his mother even in the middle of the night.\n\nSeveral days after their excursion to Winnebago Gardens, Roy was having dinner with the family when Sid Wade began telling Roy what he could and could not take with him when they moved.\n\n“I’m not moving,” Roy said. “Don’t worry about me, I’ll take care of my own things.”\n\nSid Wade dropped his fork onto his plate, his heavy-jowled face turned crimson, and he said, “Of course you’re moving. We all are.”\n\n“No, I’m not. I’ve already made arrangements to live next door with the McLaughlins. Mr. and Mrs. McLaughlin said it’s all right with them. Jimmy’s going into the army next month, so I’ll have his bunk in the room with Johnny and Billy. I told Mrs. McLaughlin I’d contribute money to the household out of my pay delivering for Kow Kow. I’ll be fine there.”\n\nRoy’s mother stood up from the table and put her dishes in the sink. Her face was green and her lips were trembling. Her body shook and she was crying.\n\n“Look what you’ve done to your mother!” Sid Wade shouted.\n\nRoy’s little sister, upset by his loud voice, began crying too.\n\n“If your father were here,” Wade snarled, “he wouldn’t put up with your insolence.”\n\n“I’m not being insolent,” said Roy. “And don’t talk about my father. You didn’t know him and he’s dead. You don’t know what he’d say or do. If he were alive, I’d go live with him. Johnny and Billy are my best friends and Mr. and Mrs. McLaughlin are good people.”\n\nFrank McLaughlin worked as a doorman at the Drake Hotel and his wife took in laundry. They were from Ireland and spoke Gaelic in their house. They let their sons drink coffee in the morning and Margaret McLaughlin made great peach and strawberry pies in the summer. Roy couldn’t wait to go live with them.\n\nSid Wade and Roy’s mother began arguing. She closed her eyes and fell down on the floor. The baby was screeching and Sid Wade wouldn’t stop yelling, carrying on about how Roy should be sent to reform school, that he’d never be any good, just like his gangster father.\n\n“He did time and you’ll do time!” Wade said. He snorted like a buffalo and his little eyes disappeared.\n\nRoy could hear his mother moaning.\n\n“You’re killing your mother!” screamed Wade, though he made no attempt to pick her up off the floor, where she was now writhing like a Moroccan fakir’s cobra being replaced in its basket.\n\nRoy rose from the table and walked out the back door, down the steps, through the yard, and into the alley behind the garage. It was windy and cold and he was wearing only a T-shirt. Mr. Anderson’s old red Studebaker was parked in the alley between his house and the McLaughlins’. Roy knew that Mr. Anderson never locked it, so he walked over, opened the passenger-side door, and got in. He sat there looking through the windshield. The sky was almost dark, there was a thin, pale-yellow ribbon running through the gray. At the far end of the alley two men came out of the rear door of the Green Harp tavern. They were smoking and laughing. One of them was wearing a blue zipper jacket and the other was wearing a brown one. Both men were hatless. Roy watched them standing and talking and smoking, their hair waving in the wind. Mr. Anderson had left an open pack of Lucky Strikes on top of the dashboard. Roy took one, put it between his lips, and punched in the lighter.\n\n\n\nThree months later, Roy’s mother told him that Sid had defaulted on their installments for the house in Winnebago Gardens and forfeited the down payment, so they weren’t going to move there. A week after that, Roy came home from school one day and found Sid Wade picking up his clothes and other belongings from in front of the house, where Roy’s mother had thrown them. Later the same day Sid moved out and Roy’s mother said she was divorcing him and going to work as a receptionist in Dr. Martell’s office.\n\nJimmy McLaughlin came home from the army on leave for a few days after completing basic training. Roy and Johnny and Billy were sitting on Johnny’s bunk listening to him. Jimmy was lying on his bed in his uniform smoking a Chesterfield, telling them about life at Fort Leonard Wood in Missouri. Johnny had taken over Jimmy’s job washing dishes at the Chinese restaurant, Roy had taken over Johnny’s delivery days, and Billy, the youngest McLaughlin brother, a year younger than Johnny and Roy, who were five years younger than Jimmy, now worked at Kow Kow too, sweeping up and taking out the garbage.\n\n“It’s good to be back home,” Jimmy said, “even if it’s only for a week. You don’t know how much you miss it until you can’t be there.”\n\n“What did you miss the most?” asked Johnny.\n\n“Strange things, little things, mostly.”\n\n“Yeah? Like what?” said Roy.\n\n“Oh, I don’t know,” said Jimmy. “Just seein’ Mr. Anderson’s red ’52 Studebaker parked in the alley is one, I guess. It gives me a good feelin’ knowin’ it’s still there.”\n"
    },
    {
        "post_title": "The Cuban Club",
        "comment": "Roy met Tina at the Cuban Brotherhood Club and Dance Hall in Tampa, Florida, when he was fourteen. Roy was spending the summer with his uncle Buck, working construction on weekdays, resting on Saturdays, and fishing on Sundays. Tina was a local girl who went with her girlfriends to the dances at the Cuban Club on Saturday nights.\n\nRoy and his friend Ralph were fascinated by the big-eyed dusky Cuban girls who had come to Florida with their families in the first wave of émigrés who fled the island following the revolution. These girls wore makeup, bright red lipstick, large gold hoop earrings, and short skirts. They danced only with one another and did not speak to white boys. Mostly they sat together in folding chairs in a corner of the dance hall and never stopped chattering and gesturing dramatically. Roy spoke some Spanish but when he got close enough to overhear their conversations, they spoke so rapidly and without fully pronouncing most of their words that he could not understand anything they were saying.\n\nTina didn’t like the Cuban girls. She was tall and blonde, as was her friend, LaDonna. When Roy asked Tina to dance she asked him what he thought of the Cuban girls. Before he could answer, Tina said, “They’re cheap. They have big asses and dress like whores. LaDonna says her mother told her that their fathers have sex with them starting when they’re five.”\n\nRoy found this hard to believe. He worked laying sewer pipe and shooting streets with Cuban men and liked them. They were good workers, glad to have a job, and they laughed a lot. Most of the time Roy didn’t get their jokes—they spoke as rapidly as the girls at the dances—but they always offered to share their homemade lunches with Roy. He loved the Cuban food: lechón and pollo asado, platanos maduros, black beans and yellow rice.\n\nTina had blue eyes with yellow spots in them, an almost pretty face, and a terrific figure. She and LaDonna wore as much makeup as or more than the Cuban girls.\n\n“Are you from around here?” Tina asked Roy. “You don’t talk like you are.”\n\n“I’m from Chicago,” he said. “I’m down here staying with my uncle for the summer.”\n\n“I’m almost seventeen,” said Tina. “How old are you?”\n\n“I’ll be sixteen in October,” Roy lied.\n\nTina was a little taller than Roy. She had slender, muscular arms and held him tightly, pulling him around during a slow dance. Her new breasts were as hard as her arms. She pushed herself against Roy and he got excited.\n\n“I can tell you like me, Roy,” Tina said, and smiled. Her teeth were crooked and up close Roy could see the pimples beneath cracks in her makeup.\n\nRalph was trying to get one of the Cuban girls to talk to him, and LaDonna was dancing with a heavyset guy whose ears were perpendicular to his head. Tina told Roy that his name was Woody and that he was one of LaDonna’s exes. “She’s got a lot of ’em,” Tina said.\n\nAfter the slow dance Roy and Tina got cups of lemonade at the host table and stood off to the side.\n\n“Do you want to walk me home?” Tina asked him. “I live four blocks from here. I don’t much like the music they’re playing tonight, and my parents make me come home early.”\n\nWhen they got to her house, a white, wooden bungalow set on concrete blocks with a wide front porch with a swing on it, Tina said, “Come in with me. My parents go to bed right after Perry Mason and then we can sneak out and go down to the river.”\n\nTina introduced Roy to Ed and Irma, both of whom Tina addressed by their given names, not by Mom and Dad, which Roy had never heard a kid do before. Ed and Irma sat in separate armchairs in the small living room watching Raymond Burr be a lawyer on their black-and-white Motorola. Roy and Tina sat slightly apart from each other on a lumpy couch. Ed and Irma did not say anything until the program was over. Ed stood up and turned off the television set after the theme music finished playing over the end credits.\n\n“Man never loses a case,” he said.\n\nEd had a huge belly and big arms. So did Irma. They both said goodnight and left the room. Tina put her right hand on Roy’s left leg and squeezed his thigh. As soon as Tina heard the door to her parents’ bedroom close and the lock click, she turned to Roy and kissed him hard on the mouth.\n\nTina stood, took Roy’s left hand, and said, “Let’s go down to the river and sit on the pier.”\n\nThe river was at the end of Tina’s street. She led him past a dwarf palm tree that was bent halfway over to a short pier and pulled him down onto the planks.\n\n“Lie back,” she said.\n\nThere were no boats moving on the water, and except for insect noises it was quiet. Tina lay on top of Roy and rubbed her body against his. They kissed a few times with their mouths closed, then Tina rolled onto her side and with one hand unzipped his fly. Roy’s cock popped up like a jack-in-the-box and Tina wrapped her right hand around it. He stared at the crescent moon as she stroked him slowly for a minute or so and then Roy tried to get up and lie on top of her. Tina pushed him back down, held him prostrate with her ropey arms, straddled his legs, and put his cock into her mouth. Roy came immediately.\n\nTina rolled off of him and spat into the water, turned back to Roy, and said, “You have a good dick, I think.”\n\nShe stood up, so Roy did too. He zipped up his pants. Tina had already begun walking back off the pier. They walked to her house without saying anything. Tina stopped in front of her porch steps. No lights were on. She stretched out her arms and rested them on Roy’s shoulders.\n\n“I won’t be at the Cuban Club next Saturday,” she said. “I’m going with Ed and Irma to Milwaukee on Monday. That’s where Mamie, Irma’s mother, lives. I have a cousin there, Ronnie. He’s the only boy I let fuck me. He’s twenty-one.”\n\n“How long have you been letting him do it?” Roy asked.\n\n“Since a couple of months before my thirteenth birthday. This will be the fifth year. I only see Ronnie in the summer when we visit Mamie. Ronnie’s getting married in September.”\n\nTina kissed Roy on the mouth and this time she stuck her tongue in. Roy watched her go up the steps and into the house. He saw Irma sitting on the swing in the dark, smoking a cigarette.\n\n“Go on now, boy,” she said.\n\n"
    },
    {
        "post_title": "The Exception",
        "comment": "Tampa, Florida, was a sleepy fishing and cigar-manufacturing city in the 1950s, when Roy’s Uncle Buck, his mother’s brother, moved there and went into the construction business. Roy enjoyed visiting Tampa, which was easy to do from either Key West or Havana, the two places Roy’s mother preferred spending time when Roy was a boy, before they went to live in Chicago. Roy’s mother would often leave him with her brother while she traveled elsewhere. Roy was happiest when he got to hang out with his Uncle Buck, taking fishing trips in the Gulf of Mexico or just accompanying him while he did business in Tampa.\n\nOne of Buck’s closest associates was his poker buddy, Chino Valdes, who owned the Oriente Bank in Ybor City. Chino’s real first name was Nestor, but everyone, including Roy, called him Chino because his narrow, slanted eyes gave him an Asian appearance.\n\n“Know why I’m called Chino?” he asked Roy.\n\n“No, why?”\n\n“ ’Cause my grandmother had a little yen.”\n\nChino was a partner in a nightclub on the outskirts of Tampa named El Paraíso bajo las Estrellas, where he and Roy’s uncle often met. Buck took Roy along with him to El Paraíso several times in the afternoons, letting his nephew sit at the bar and order Coca-Colas and watch the showgirls rehearse while he and Chino discussed matters of mutual importance.\n\nIt was on one of these afternoons at El Paraíso that Roy was present during a murder, an event about which he was sworn to secrecy by his uncle and Chino Valdes.\n\nThis incident occurred the day before Roy’s twelfth birthday. He and his uncle had arrived at El Paraíso shortly after two in the afternoon. Chino was already there, sitting at a table by himself, sipping Methusalem rum on the rocks. Roy and Buck walked over to Chino, who stood up and shook hands with both of them. Chino then sat down, as did Buck.\n\n“Go watch the girls, Roy,” said Chino, and handed the boy a five-dollar bill. “It’s educational. The drinks are on me.”\n\nRoy smiled at Chino, thanked him, and went over to the bar and climbed up on a stool. He placed the five down in front of him and when the bartender came over, said hello and ordered a Coke. Roy liked the bartender, Alfredito, a short, thin, bald-headed man with a mustache that looked like two caterpillars crawling toward each other. Alfredito never charged Roy for his drinks. The five-dollar bill that Chino gave Roy, as he did every time Roy came in, was to be left on the bar as a tip for Alfredito.\n\nThe dancers were onstage, practicing their routines. Most of them were coffee-colored Cuban girls. They wore short shorts and little tops that left their midriffs bare. Roy thought they were all beautiful.\n\n“How come you never look at the dancers?” Roy asked Alfredito. “You always keep your back to them.”\n\n“I’m an old man, chico,” said Alfredito. “I have grandchildren older than some of these girls. It is for their sake that I don’t turn around. When they look at me, I see pity in their eyes. I want to spare them the pain.”\n\nRoy remembered a story his uncle had told him after the first time they’d gone together to El Paraíso. It was about one of the dancers, a brunette originally from Matanzas named Soslaya Zancera, who was billed as the Ava Gardner of Cuba. Soslaya was the star of the show, and the girlfriend of one of the owners, Morris Perlstein. One night Perlstein caught her giving head in her dressing room to a club bouncer, Roberto Bulto, and shot Bulto dead before he could pull his cock out of Soslaya’s mouth. Perlstein then fired two bullets into the girl’s buttocks when she attempted to flee. The owner was subsequently convicted of second-degree murder and sentenced to twenty years in prison. His mistress survived, but her injuries put an end to her career as a dancer. Roy’s uncle told him that Soslaya now walked with the aid of two canes and worked as a manicurist at the Hotel Khartoum in Miami Beach.\n\nRoy looked over at the table where his uncle and Chino Valdes were sitting. A third man had joined them, a large, pale-faced person wearing a mauve guayabera, a panama hat, and dark glasses. Roy noticed that the man’s fingernails were painted blood red. He had never before seen a man wearing nail polish.\n\n“Who’s that guy?” Roy asked Alfredito.\n\n“Cherry Dos Rios. From Fort Lauderdale.”\n\n“What does he do?”\n\n“He’s in the construction business.”\n\n“Like my uncle.”\n\nAlfredito nodded and said, “It’s a good business to be in.”\n\nRoy returned his attention to the girls. Music came from a tape recorder because the band was there only at night. Alfredito told Roy the musicians slept during the day.\n\nSuddenly there was a loud popping sound, and the dancers stopped. Roy looked around and saw Chino Valdes hand a revolver to a man in a green seersucker suit, who walked quickly out of the club. Cherry Dos Rios sat slumped in his chair, a large dark stain spreading under his guayabera. His panama was on the table. He still had on the dark glasses. Someone turned off the music.\n\nRoy’s uncle came over to him and said, “Vámonos, sobrino.”\n\nChino stood up and came over too.\n\n“Chico,” he said to Roy, placing a hand on the boy’s left shoulder, “your uncle and I know that we can depend on your not having witnessed this unfortunate little accident.”\n\nRoy looked at Chino and nodded.\n\n“Buck tells me that tomorrow is your birthday. Here’s something from me.”\n\nChino handed Roy a hundred-dollar bill. Roy had never held one before.\n\n“If you’re anything like your uncle,” Chino said, “I know you’ll use it well.”\n\n“Thank you,” said Roy. “I will.”\n\nThe dancers had disappeared. Two men were dragging Cherry Dos Rios’s limp corpse into a back room. As Roy and his uncle walked together out of El Paraíso, Roy saw Alfredito pick up Cherry Dos Rios’s hat off the table at which he’d been sitting. Alfredito waved it at Roy and smiled.\n\nAs Buck pulled his white 1958 Eldorado convertible onto Gasparilla Road, he asked, “Would you like me to put the top down?”\n\n“Sure,” said Roy.\n\nHis uncle unhooked the latch on his side and Roy undid the one on his, then Buck flipped a switch on the dashboard and the top peeled back. The warm Gulf air felt good on Roy’s face and in his hair.\n\n“It’s time you started to think about what profession you want to go into when you get older,” said his uncle. “Do you have any ideas?”\n\n“Not yet,” said Roy.\n\n“You can’t go wrong in the construction business.”\n\n“Alfredito told me the guy who accidentally got shot was in the construction business.”\n\nRoy’s uncle picked a cigar out of a box he kept on the front seat next to him, bit off one end, spit the leaves out his window, and pushed in the dash lighter.\n\n“Forget about him, Roy,” said Buck. “He was the exception.”\n\n"
    },
    {
        "post_title": "The Age of Fable",
        "comment": "Roy read a story about a tribe of female warriors who interrupted the conﬂict between the Greeks and the Trojans in their quest for males to assist in the propagation of their race. These women called themselves Amazons and were led by Penthesilea, who, as had the rest of the tribe, severed her right breast in order to more swiftly and easily draw back her bow. The most exciting part of the story, Roy thought, was the Amazon queen’s confrontation with the champion of the Greeks, Achilles, whose ferocity in battle attracted Penthesilea as no man ever had. For the ﬁrst time she encountered a man she could consider her equal.\n\nThe idea of a tribe of brave, vicious, single-breasted women was almost beyond the comprehension of Roy’s eleven-year-old mind. He drew pictures of the Amazons as he imagined them, naked, tall, and lean, their long hair tied back with leather thongs.\n\nRoy asked his grandfather if he’d ever read this story.\n\n“Sure,” said Pops, “it’s in The Iliad, by Homer.”\n\n“That’s right,” Roy said. “I kind of found it by accident on a table at the library. Do you think there really ever was a tribe of savage women like that?”\n\n“I don’t think savage is the correct word for them, Roy. They knew what they were doing. The Amazons wanted to be independent of men, the problem being that they needed men to impregnate them in order to keep their race from dying out.”\n\n“But they only wanted girls, right?”\n\nPops nodded.\n\n“Then what did they do with boy babies?”\n\n“Killed at birth,” Pops said. “Drowned them or slit their throats.”\n\n“It’s just a story, though, isn’t it?” Roy asked. “Homer made it all up.”\n\n“Yes,” said Pops, “but there’s a lot of truth to it. Even today many Chinese drown their female babies because they think they’re worth less than men.”\n\n“But they need girls to keep China going.”\n\n“They don’t drown all of ’em.”\n\nAfter talking to Pops, Roy walked over to the park to see if anybody was playing ball. Halfway there it started to rain, so Roy ducked under a canopy in front of the entrance to an apartment building. A very tall, sturdily built blond lady wearing a thin black coat came out of the building. She stopped under a canopy and looked at the rain, which was falling hard.\n\n“Damn!” she said. “Now it’ll be a bitch to get a cab.”\n\nShe turned around and walked back into the building without glancing at Roy. He waited under the canopy for a few more minutes until the rain let up a little, then ran back to his house.\n\nPops was sitting in the kitchen eating a chopped chicken liver sandwich and drinking a beer.\n\n“I thought you were going to the park to play ball,” he said.\n\n“There won’t be a game. Maybe I’ll go when it stops raining.”\n\nHe opened the refrigerator and took out a bottle of milk.\n\n“What’s the leader of the Amazons called?” Roy asked.\n\n“A virago,” said Pops.\n\n“Is that the same as queen?”\n\n“You need a king to have a queen, Roy. No, a virago is a termagant.”\n\n“Termagant? That sounds like an insect.”\n\nPops bit into his sandwich.\n\n“It means a big, tough woman,” he said, as he chewed.\n\n“I guess the Chinese don’t want any of them,” said Roy.\n\n“Probably not,” Pops said. “Close the refrigerator door.”\n\n"
    }
]