[
    {
        "post_title": "In the Museum of the Americas",
        "comment": "These days, after work, he visits the Museum of the Americas. He wanders in the South American wing and looks at the figures amid artifacts in the glassed-in cases. Time collapses. Cortés is a few miles away; he has been with those who pushed back the Toltecs, Zapotecs, Mayans. There is no wristwatch on his arm, and he tells time by the use of twenty tons of stone. In a display case under glass are bones, the blade of a knife. He can believe that his people live on floating islands and that they farm corn, beans, peppers, tobacco. The air is clearer. He has a dark, young wife. His days are peaceful, and he knows what is expected. He’s taller, younger, stronger. Meaner. He has no children. He’s bronze colored from the sun, and he can see the polished walls of Tenochtitlán in the distance. No one has ever heard of a car. The clatter of the world, its weather and war and machinery—that’s all somewhere far off. He doesn’t hear the noise of it anymore.\n\nDo you know where you are now?\n\nWilliam P. Howell. Divorced. Forty-eight. Wife living with someone else. Pregnant with his child. One afternoon I start over there, planning what I’ll say. Filled with rage. Do not know Alphonse Blum, a boy running after a ball, afraid of his father, who is too strict. An imaginative boy worried about his pancreas, at nine years old. This bright child with the skinny legs and dark skin. I can now see him lying awake at night imagining himself a superhero.\n\nThis is good. Go on.\n\nWilliam P. Howell. Never hurt a soul.\n\nHere. Wipe your eyes. Talk about yourself some; it’s all right, and it’s true.\n\nIf William P. Howell had a son, the son would also be dark. A boy with hair that shines, down to his shoulders. He would be strong and fast.\n\nGo on. Keep telling. You never hurt a soul. And remember, you intended no harm.\n\nIn his part of the city, the streets are crowded with others. Each life gathers and glides past him. He thinks of the great dedication of the pyramid temple in Tenochtitlán: the sacrifice of twenty thousand lives.\n\nWhen you can speak. You know . . .\n\nHe has the museum. He walks in every day and waits for the faint but bearable condolence of the settling dust. It doesn’t matter what else there has been in a day—work, the so-called healing process, the kindness of others (priests, friends, professional listeners like you, the parents of the boy), the weight of his grief, the food he swallows, the blur of seeing all day, the work of his hands, the music coming out of the walls where he works. He craves the museum.\n\nYou had a moment’s inattention. It could happen to any of us. A lapse. A man driving home at sundown from work. It’s been months. And it wasn’t your fault. The police report says he ran out between two cars.\n\nDoctors, counselors, the difficult forgiveness of two young people who can’t bring themselves to mean it, friends, women and men whose faces change when he comes near. No one knows quite how to put it away.\n\nOthers have told him what they can tell him. Not good living alone. He has friends who watch him closely now, and worry. He loves them. He can’t stand the thought of losing anyone at all. He doesn’t drive anymore. But in the Museum of the Americas, among the yellow pieces of temple wall and the shards of pottery and the depictions of Chapultepec, the anguish begins to change at last, begins to shift, like a slow lengthening of light.\n\nWhen he was an American on a normal day, with half the world hungry and the wars on the far continent, he did not feel the weight of the sky. The tonnage of the present. He can’t support it now. He hears the clatter of the bones slamming against metal. He sees the instruments of emergency and procedure; he looks at the whitened faces of the others and sees blood on the little finger of the boy’s small dark left hand, and then the door closes. He sees it and he sees it and he sees it and he sees it.\n\nThere’s nothing more to say, is there?\n\nWilliam P. Howell. My God.\n\nDo you want some time?\n\nIn the Museum of the Americas, there are stories of slaughter fixed and gone in time. The country was taken inch by inch in blood. It’s all there, the guilty centuries.\n\nDo you want me to leave you alone?\n\nPlease. He’ll make his own way out, head down, into the chaos and terror of the street.\n\n"
    },
    {
        "post_title": "Trigger Warnings",
        "comment": "Contains vulgarly expressed suspicions of adultery by two major characters: protagonist Thomas Briley’s wife, Constance, with protagonist’s nephew Kirk, younger by seven years.\n\nOccurring after wife indicates with lascivious insinuations believing might be pregnant by someone else, and then names Kirk. Purported adultery described by her in lurid detail, as she claims, also in crude terms, her intention to go move in with Kirk, whose roommate, Ellen (living together out of wedlock), has moved back into her mother’s mansion. Trivializing references to Catholicism and blood of Spanish Inquisition by protagonist in relation to wife’s hypocrisy about religion as against her attitude about Kirk, a lapsed former priest. One scene encompasses general disrespect of priests, with remark by protagonist recalling Chaucer’s poem about man in hell asking where priests are and seeing suddenly thousands of priests flying like moths out of important nether part of devil’s digestive anatomy. Also includes upsetting scene of wife Constance donning tights for ride on recently purchased Most Space exercise bike as protagonist asks, in rawest language, if she and nephew Kirk are involved. Description of her gaze at protagonist contains allusion to her supposed infidelity as she turns away, pulling down tights to show indecent part of lower body, and says, “Take a guess,” adding offensive epithet naming him as cavity of aforesaid part of human digestive anatomy. Followed by protagonist’s abusive reaction, suggesting she depart to perform sexual act on herself, adding stream of antifemale tropes, also violent removal of Most Space exercise bike through apartment picture window. Depiction of exercise bike and shattered glass hitting passerby on street. Graphic image of injury involving blood, result of Most Space exercise bike. Injured party berated by protagonist regarding weight and size, too heavy and slow to evade falling exercise bike. Several crude terms for obesity. Fantasies of physical violence between protagonist and others, between Constance and Ellen’s mother, Gladys, portrayed in coarse terms as a wealthy crone with filthy mouth, homosexual tendencies (several quotes from her containing scatological language and racial slurs), who chain-smokes and has an insane amount of money protagonist describes as exiting the now-thrice-mentioned part of digestive anatomy. Examples in Gladys’s sequences of lewd talk, and suggestions of homosexual behavior, from protagonist and Constance both. Many instances of prevarication and deception, including elaborate obscene fantastical lies told to protagonist by wife to hurt him. Several discussions about varieties of venery (all characters engage in such talk at party scene near close of story). In that scene, several inappropriate jokes, puns, asides, with smutty overtones. Detailed descriptions of alcohol abuse, use of marijuana and other substances. Smoking present in almost every scene. Nudity depicted in scene brimming with inappropriate remarks about other races and cultures between protagonist and wife, at exotic hotel in Morocco (two instances, smoking after depictions of sexual behavior), during depicted journey to rekindle romantic feelings, to make up for neglect by both parties of vows of marriage. Several instances lascivious and destructive imaginings in dream sequences that include setting fire to mansion after shooting and maiming of family member (the nephew, Kirk). References to and portrayals of hypocrisy, moral sloth, venery, even after protagonist and wife reconcile in explicit scene, following confession of lying about betrayal to get protagonist’s attention. Story suggests in obscene terms protagonist’s lack of awareness that troubles have arisen from intense self-absorption, materialism, greed. Alcoholic excess throughout. Many references to acrobatic sexual behavior, exotic methods of contraception, several alleged aphrodisiacs, same-sex normalization. Manipulation of daily outlooks, facts, history, finance. Disparaging statements about certain mental disorders, including paranoia (the protagonist), hypochondria (Gladys, Ellen, Kirk, Constance), and anxiety (all). Contains nakedly expressed conviction by protagonist that his suffering added up to nothing. During protagonist’s attempt at redemption—visiting injured party in hospital room day after Most Space exercise bike episode—illicit drugs, sexually explicit tropes present. Deplorable air of waste and excess throughout. Depicted failures overall regarding fidelity, responsibility, morality. Couple’s reunion has sour ruminations further disrespecting religion. Abortion mentioned four times.\n"
    }
]