[
    {
        "post_title": "Rumor of Blood",
        "comment": "With towels at their necks the boys came down out of the woods and crossed toward the dock in a ragged dark line. Below them the sea lay flat and black-green, the surface darkly dimpled by the breeze. Gulls rode gusts against the sky, wheeling, their wings arcing over striated sections of varying blue. In that vast and empty space the boys’ voices carried with strange clarity, like voices in the very next room.\n\nTogether they picked their way down the clanging metal ramp to the dock, the biggest boy out ahead of the two others. On the wide warm boards they shed their towels and leapt in and then came up bobbing like seals, hairslicked and shouting. After a while two of the boys swam out a ways. Cold as shit, the big boy said, paddling awkwardly. Ain’t that cold, said another, a smaller boy with a lumpy head fleeced with coarse hair. Maybe you’re just a pussy. The big boy rushed at him, but the smaller boy was a better swimmer and fled giggling, and soon the big boy pulled up, gasping. Fuckin Smalls, he said. Wait till we get back on land.\n\nThe third boy watched all this from the calmer shoreline water. His eyes flicked between the others as if courtside at a tennis match. He wore an old black wetsuit against the cold, and while the other boys swam and splashed, he stayed near the dock, riding the gentle current. His legs dangled under him amid company unseen, scuttling crabs and fish that arrowed between wavering stalks of seaweed with their cuff-link eyes glittering. Something breezed past his foot trailing a chill, and he yanked up his leg and paddled a few strokes back toward the dock. Out to sea the big boy turned to him, calling: Hey, why don’t you come out here? Stop being a fairy and come on out. For a moment the wetsuited boy gazed at his friend, bobbing gently, his wet brown head intermittently visible above the lazily rolling tongues of the waves. Then he swam out, doing a slow breaststroke with his chin held above the sea.\n\nFrom a high nearby window the painter watched this scene with a little smile. He remembered long-ago days of swimming off just such docks and fighting and shouting and snapping wet towels on the tanned narrow hips of just such boys. He dabbed his brush and with two wrist flicks slashed a seagull across the sky-blue top of his canvas and then another below it. He stood back and regarded the developing seascape, and then he dipped back his brush and brought it up again and added a swimming boy, the bent brown shape of his arm and his face not more than a tan splotch under a daub of brown hair. Then he turned back to the window and watched the boy in the wetsuit swim out to his friends.\n\nThe boy had nearly reached them when the water around him broke apart in an explosion of spray. To the others it was as if a locomotive had come surging up from the deep, blue-black and gleaming and big around as a tree. The boy’s small body was thrown up into the air and spun for a moment flopping and balletic before crashing back to the boiling sea. The others watched dumbstruck as the shark traced a slow curve and came again, its dorsal fin carving the surface as it drove the great barrel of its body at the boy. The fish lifted him and swung its huge head like a duck hound, flinging the boy back and forth in a pinwheeling fantail of bright-red blood. His soft child’s face was a rictus of fear, and his eyes shone like watch dials against the expanse of blue, though it was clear to the painter that life no longer lit them.\n\nThen, just as quickly as it had come, the shark vanished. It left behind a patch of churned sea that sucked back in on itself with a great gulping sound and then healed over as if nothing had happened at all. From his window the painter watched frozen as the other boys flailed toward shore, their path marked by little detonations of spray. From that distance their progress seemed comically slow and their small cries tinny and pointless in the thin blue-gold air. Though frantic, the painter found he couldn’t tear his gaze from the mauled boy, who floated now facedown in the sea, lifeless as a log with his own blood spreading around him like ink spilled in a pool. Without looking away, the man put his hands on his palette. He dabbed a brush along the edge where the red was kept and brought it to the canvas and slashed a thick line next to the figure of the swimming boy. For a long moment he stared down at what he’d done, and then he dropped his brush and ran into the kitchen for the phone.\n\n\nYears later, a finely dressed older woman came into a downtown gallery looking for a painting to hang in her dining room. She scanned the cool white walls and found herself drawn to a seascape that showed birds wheeling above a swimming boy. Coming closer, she noticed an odd red smudge in the water beside the boy, the mark faint but still visible, as if the artist had tried but been unable to cover up an earlier mistake.\n\nShe bought the painting and took it home, and each time she came into the dark, elegant room her gaze went as if of its own volition to that same red smudge. If asked, she couldn’t have said what it was about the picture that entranced her so. But of course it was the red spot—the whiff of pain there, the sweet hot lovely rumor of blood.\n\nWhen the woman died, at ninety, of a cerebral hemorrhage, the painting found its way to her son, who, heartbroken and oblivious of the sinister slash, now long faded, hung the picture lovingly in the den beside his hunting trophies—three beautiful bufflehead ducks, their iridescent heads shining, each one mounted as if still in graceful flight.\n\n"
    },
    {
        "post_title": "The Shortstop",
        "comment": "We were in Jimmy’s backyard playing Wiffle ball when the news broke that the shortstop had been traded.\n\nTraded? Jimmy said, turning to me. Him?\n\nWe ran up the little hill and slid open the screen door. On TV old clips played of the shortstop doing his trademark prepitch routine—an odd, twitchy ritual we knew by heart. We watched him go through the well-known steps: batting gloves first, fingers waggling, then the tugged wristband, the tapped chest, hip, back pocket, belt, palm to the shining blue helmet, bat rapped gently on his left shoulder, then the toe taps, one foot and then the other, four taps in all, one, two, three, four.\n\nA four-team deal, they were saying on the TV. Two players coming back, both journeymen, their names faintly known. A first baseman and—a shortstop.\n\nA shortstop, Jimmy said.\n\nI looked at the news anchor, watched his mouth shape the impossible words again and again: the shortstop, gone, and in return a shortstop who was not our shortstop, the only shortstop we’d ever known.\n\nAfter a while Jimmy said: You know what? Good riddance. You heard them—he’s a clubhouse cancer. He wanted out. We can win without him. We don’t need him anymore.\n\nI searched his face, looking for the joke, but his expression was hard and sealed off, closed to questioning. Studying him, all at once I understood that for us there would be no mourning the shortstop, no grief for a figure who, it must be said, had meant nearly everything to us for a very long time.\n\nHe was simply gone, and just as quickly the decree had come down: at fourteen, we were too grown up to care.\n\n\nYears later, during a winter break from college, Jimmy and I met for a long weekend at Disney World. Though too old for amusement parks, we’d come anyway in an unspoken attempt to recover some of the easy childhood camaraderie that for so long had sustained us, to sew together bits of a friendship that, since we were far from home and surrounded by new friends with new interests and new jokes, had become badly frayed.\n\nThe first morning at the park, we were crossing Main Street when we noticed a group of girls clustered in front of a stage, watching a man and woman give a soccer demonstration. The woman was familiar to us: we’d seen her many times on TV and on magazine covers. For a while we watched her kick and talk, kick and talk, her voice booming through the microphone clipped to her windbreaker. Most of her shots found their target, slipping past the outstretched arms of the goalie, who wore a golf shirt and a blue cap pulled low over his brow. Only when the demonstration ended and he lifted the cap did we realize it was the shortstop.\n\nWe stared as he stepped to the front of the stage. The gleaming black hair had gone slightly gray, and the gold chain we’d marveled at in the famous shirtless cover photo was now dull and mostly hidden beneath his collar. Even his legs looked thin and unextraordinary where they disappeared into a pair of dorky running sneakers.\n\nHe gave a little wave and grinned—that fabled grin!—and then disappeared back into the shade behind his wife, who bent to sign autographs for the squealing girls. Watching him there, stooped in shadow, hands clasped at his back, it was hard to believe he was the same man who’d nearly batted .400, who’d once hit two grand slams in a single game.\n\nThat night Jimmy and I sat in our cramped motel room with a case of beer, sitting on adjacent beds drinking and watching a spring training game on the room’s boxy TV. There’d been some girls out by the pool, but they hadn’t wanted to come back for a party, so we decided to just drink the beer ourselves.\n\nThere wasn’t much to say, I guess. But it was hard not to think about the shortstop, at least for me. I wished we hadn’t seen him like that, gray-haired and paunchy, scrambling after loose balls in front of a bunch of kids who didn’t even know who he was.\n\nAfter a while, feeling thoroughly buzzed, I stood and made my way unsteadily to the center of the room. From his spot on the bed Jimmy frowned up at me, cans gripped in both his hands.\n\nWhat are you doing? he said sharply. Seriously? Stop it.\n\nBut I’d already begun. As he glared at me I reached down and from the stiff soiled rug brought up an invisible bat, laying it across my right shoulder, surprised at how natural it felt, how familiar, as if we’d never left Jimmy’s backyard. The old ritual came back easily, ingrained as an overhand toss: the tugged batting gloves, the wristband straightened along one arm. The touches—forearm, hip, pocket, left shoulder, helmet, belt. Something consecrated about them, some bit of the sacrament in the solemn recurrent steps. And finally the toe taps, my bare feet digging into the tight weave of the rug: one, two, three, four, one, two, three, four. Again. Again. Jimmy staring now, now smiling a little, now laughing in spite of himself, little snorts that burst from him like static from an ancient PA system as he rose suddenly and took a spot atop an invisible mound, bending into his windup, peering behind me for the pretend sign, squinting, shaking his head no, no, then nodding and rising into the set and beginning then to deliver the bright imagined ball into the space between us as on a diamond after the game, fans departed in a string of cars moving off into the night, their receding lights a fading memory, a necklace of winking gold.\n"
    }
]