[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will analyze the Author Writing Sheet across the four categories. The author focuses on introspective journeys and internal conflicts, with resolutions that emphasize emotional realizations. Creativity involves blending the mundane with the surreal, integrating fantastical elements into everyday settings. Characters are introspective and emotionally complex, with settings reflecting their internal states. Language use is vivid, metaphorical, and lyrical, often employing a first-person narrative for intimacy.\n\nFor the Writing Prompt, the story will explore the protagonist's internal journey as they observe an old college friend, revealing emotional realizations about both the friend and themselves. The narrative will blend the mundane setting of a chance encounter with surreal elements that symbolize the friend's facade. Characters will be introspective, with the setting mirroring the protagonist's emotional state. Language will be vivid and metaphorical, using a first-person perspective to create intimacy.\n\nI will now create detailed Story Rules for each category, incorporating examples inspired by the Author Writing Sheet and tailored to the Writing Prompt.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:  \n  - Structure the narrative around the protagonist's introspective journey as they observe their old college friend. Focus on the internal conflict of reconciling past perceptions with present observations. For example, the protagonist might reflect on their admiration for the friend's confidence, now noticing subtle signs of insecurity.\n  - Conclude with an emotional or psychological realization rather than a concrete outcome. The protagonist might realize that their friend's perceived perfection was a projection of their own insecurities, leading to a deeper understanding of themselves.\n\n- **Creativity**:  \n  - Blend the mundane setting of a casual meeting place, like a café or park, with surreal elements that symbolize the friend's facade. For instance, the friend might be surrounded by an aura that flickers like a faulty neon sign, representing the cracks in their facade.\n  - Integrate fantastical elements into the everyday setting to offer a fresh reinterpretation of the theme of perception versus reality. The protagonist might see the friend's reflection in a window as a distorted, shifting image, symbolizing the change in their perception.\n\n- **Development (Character and Setting)**:  \n  - Develop the protagonist as introspective and emotionally complex, using their observations of the friend to reveal their own insecurities and past admiration. The protagonist might internally debate whether their friend's flaws were always present or if they have changed over time.\n  - Use the setting to reflect the protagonist's internal state and influence their emotional journey. If the meeting occurs in a bustling café, the noise and movement might mirror the protagonist's inner turmoil and confusion.\n\n- **Language Use**:  \n  - Employ vivid imagery and metaphorical language to enhance emotional depth. Describe the friend's smile as \"a mask that slips at the edges,\" or their laughter as \"a melody with a discordant note.\"\n  - Use a lyrical prose style to create a contemplative tone. The narrative might include reflective passages about the nature of change and perception, such as \"Time, like a gentle sculptor, had carved away the marble of perfection, revealing the clay beneath.\"\n  - Write in the first-person narrative to provide an intimate glimpse into the protagonist's psyche. This perspective allows readers to experience the protagonist's evolving thoughts and emotions as they observe their friend.  \n</story_rules>",
    "<thinking>  \nTo generate Story Rules that align with the Author Writing Sheet and the Writing Prompt, I will focus on the author's introspective and emotionally complex narrative style, blending mundane and surreal elements, and using vivid, metaphorical language. The Writing Prompt involves a mysterious, wedge-shaped house, which provides an opportunity to explore internal conflicts and emotional realizations within a surreal setting. The rules will guide the language model to create a story that reflects the author's style while incorporating the unique elements of the Writing Prompt.  \n</thinking>  \n<story_rules>\n- **Plot**:\n  - Structure the narrative around the protagonist's introspective journey as they navigate the emotional and psychological impact of living in the wedge-shaped house. Focus on internal conflicts, such as the tension between the allure of the low rent and the unsettling atmosphere of the Triangle Zone. For example, explore the protagonist's growing unease as they hear the constant roar of trains, which mirrors their internal turmoil.\n  - Conclude the story with an emotional or psychological realization rather than a concrete resolution. For instance, the protagonist might come to understand their own fears and desires, realizing that the house's secrets are reflections of their own unresolved issues.\n\n- **Creativity**:\n  - Blend the mundane aspects of living in the wedge-shaped house with surreal elements to create a unique narrative atmosphere. Introduce fantastical occurrences, such as the house seeming to shift or whisper at night, which challenge the protagonist's perception of reality.\n  - Integrate fantastical elements into the everyday setting of the house, offering fresh reinterpretations of familiar themes. For example, the narrow corridors might feel like endless mazes, symbolizing the protagonist's feelings of entrapment and confusion.\n\n- **Development (Character and Setting)**:\n  - Develop characters as introspective and emotionally complex, focusing on their internal struggles and reflections. The protagonist should frequently ponder their relationship with their partner and the impact of the house on their mental state.\n  - Use the setting of the wedge-shaped house to reflect the characters' internal states and influence their emotional journeys. Describe how the cramped, angular spaces mirror the protagonist's feelings of being trapped or cornered by their own thoughts and fears.\n\n- **Language Use**:\n  - Employ vivid imagery and metaphorical language to enhance the emotional depth of the story. Use metaphors to describe the house and its surroundings, such as comparing the train lines to \"rivers of steel\" that isolate the house from the outside world.\n  - Maintain a lyrical prose style to create a contemplative tone. Use reflective and poetic language to convey the protagonist's introspection, such as describing the house as \"a prism of secrets, refracting the light of their lives into unexpected colors.\"\n  - Utilize a first-person narrative to provide an intimate glimpse into the protagonist's psyche. Allow readers to experience the protagonist's thoughts and emotions directly, enhancing the story's emotional impact.\n</story_rules>"
]