[
    "<thinking>  \nTo generate Story Rules that align with the Writing Prompt and mimic the author's style, I will focus on the following elements from the Author Writing Sheet:  \n- **Plot**: The author uses a repetitive routine that escalates to a dramatic climax and introduces conflict through mundane issues leading to tragedy. For the Writing Prompt, this could involve a routine in a hospice setting that builds to an emotional climax, perhaps involving a misunderstanding or a poignant realization.  \n- **Creativity**: The author explores common issues with dark twists and uses repetition to emphasize themes. In the context of the Writing Prompt, this could involve exploring the theme of hope and despair in a hospice setting, using repetitive dialogue or actions to highlight emotional states.  \n- **Development (Character and Setting)**: Characters are developed through interactions within a confined domestic space, enhancing themes of isolation. For the Writing Prompt, characters could be developed through their interactions in the hospice, with the setting emphasizing themes of finality and hope.  \n- **Language Use**: The author employs repetitive narrative styles, descriptive language, and a third-person perspective. For the Writing Prompt, this could involve using repetition to convey the monotony of hospice routines, descriptive language to portray emotional states, and a third-person perspective to provide an objective view of the characters' experiences.  \n</thinking>  \n\n<story_rules>  \n- **Plot**:  \n  - Structure the story around a repetitive routine in the hospice setting, such as daily visits or medication rounds, that escalates to an emotional climax. For example, a nurse repeatedly checks on a patient, each time asking, \"How are we feeling today?\" until one day, the patient responds with a profound statement about life and death, leading to a moment of shared understanding.  \n  - Introduce conflict through a mundane issue in the hospice, such as a misunderstanding about a patient's wishes, that leads to a poignant resolution. For instance, a family member misinterprets a patient's silence as acceptance, only to discover a hidden letter expressing their true feelings, leading to a heartfelt reconciliation.  \n\n- **Creativity**:  \n  - Explore the theme of hope and despair in the hospice setting with a dark and unexpected twist. For example, a patient who seems resigned to their fate suddenly reveals a secret plan to fulfill a lifelong dream, bringing unexpected light to their final days.  \n  - Use repetition to emphasize the theme of hope's persistence despite despair. For instance, a patient repeatedly asks, \"Is there any news?\" each day, highlighting their longing for a miracle, until a small act of kindness from a stranger rekindles their hope.  \n\n- **Development (Character and Setting)**:  \n  - Develop characters through their interactions and responses to the hospice routine. For example, a nurse's growing attachment to a patient is revealed through their increasingly personal conversations during daily check-ins, reflecting the nurse's struggle with professional boundaries and personal empathy.  \n  - Establish an immersive setting within the hospice, using specific locations like \"the common room,\" \"the garden,\" and \"the quiet room\" to underscore themes of finality and hope. Describe how these spaces influence the characters' emotional journeys, such as a patient finding solace in the garden's tranquility.  \n\n- **Language Use**:  \n  - Employ a repetitive narrative style to convey the monotony and emotional weight of the hospice routine. Use phrases like \"Another day, another round,\" to capture the cyclical nature of life in the hospice.  \n  - Use descriptive language to vividly portray the characters' emotional states. For example, describe a patient's eyes as \"clouded with resignation yet flickering with a stubborn spark of hope,\" to illustrate their complex emotions.  \n  - Utilize a third-person perspective to provide an objective view of the characters' experiences, allowing readers to observe the unfolding events and emotional dynamics without bias, enhancing the story's impact.  \n</story_rules>"
]